neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define AIPS_OPACR_WP0_MASK                      0x20000000u
#define AIPS_OPACR_WP0_SHIFT                     29u
#define AIPS_OPACR_WP0_WIDTH                     1u
#define AIPS_OPACR_WP0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_OPACR_WP0_SHIFT))&AIPS_OPACR_WP0_MASK)
#define AIPS_OPACR_SP0_MASK                      0x40000000u
#define AIPS_OPACR_SP0_SHIFT                     30u
#define AIPS_OPACR_SP0_WIDTH                     1u
#define AIPS_OPACR_SP0(x)                        (((uint32_t)(((uint32_t)(x))<<AIPS_OPACR_SP0_SHIFT))&AIPS_OPACR_SP0_MASK)

/*!
 * @}
 */ /* end of group AIPS_Register_Masks */


/*!
 * @}
 */ /* end of group AIPS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- C55FMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup C55FMC_Peripheral_Access_Layer C55FMC Peripheral Access Layer
 * @{
 */


/** C55FMC - Size of Registers Arrays */
#define C55FMC_UM_COUNT                          9u

/** C55FMC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __I  uint32_t MCRE;                              /**< Extended Module Configuration Register, offset: 0x8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t LOCK0;                             /**< Lock 0 register, offset: 0x10 */
  __IO uint32_t LOCK1;                             /**< Lock 1 register, offset: 0x14 */
  __IO uint32_t LOCK2;                             /**< Lock 2 register, offset: 0x18 */
  __IO uint32_t LOCK3;                             /**< Lock 3 register, offset: 0x1C */
       uint8_t RESERVED_2[24];
  __IO uint32_t SEL0;                              /**< Select 0 register, offset: 0x38 */
  __IO uint32_t SEL1;                              /**< Select 1 register, offset: 0x3C */
  __IO uint32_t SEL2;                              /**< Select 2 register, offset: 0x40 */
  __IO uint32_t SEL3;                              /**< Select 3 register, offset: 0x44 */
       uint8_t RESERVED_3[8];
  __I  uint32_t ADR;                               /**< Address register, offset: 0x50 */
  __IO uint32_t UT0;                               /**< UTest 0 register, offset: 0x54 */
  __IO uint32_t UM[C55FMC_UM_COUNT];               /**< UMISR register, array offset: 0x58, array step: 0x4 */
  __IO uint32_t UM9;                               /**< UMISR register, offset: 0x7C */
  __I  uint32_t OPP0;                              /**< Over-Program Protection 0 register, offset: 0x80 */
  __I  uint32_t OPP1;                              /**< Over-Program Protection 1 register, offset: 0x84 */
  __I  uint32_t OPP2;                              /**< Over-Program Protection 2 register, offset: 0x88 */
  __I  uint32_t OPP3;                              /**< Over-Program Protection 3 register, offset: 0x8C */
  __IO uint32_t TMD;                               /**< Test Mode Disable Password Check register, offset: 0x90 */
} C55FMC_Type, *C55FMC_MemMapPtr;

 /** Number of instances of the C55FMC module. */
#define C55FMC_INSTANCE_COUNT                    (1u)


/* C55FMC - Peripheral instance base addresses */
/** Peripheral C55FMC base address */
#define C55FMC_BASE                              (0xFFFE8000u)
/** Peripheral C55FMC base pointer */
#define C55FMC                                   ((C55FMC_Type *)C55FMC_BASE)
/** Array initializer of C55FMC peripheral base addresses */
#define C55FMC_BASE_ADDRS                        { C55FMC_BASE }
/** Array initializer of C55FMC peripheral base pointers */
#define C55FMC_BASE_PTRS                         { C55FMC }

/* ----------------------------------------------------------------------------
   -- C55FMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup C55FMC_Register_Masks C55FMC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define C55FMC_MCR_EHV_MASK                      0x1u
#define C55FMC_MCR_EHV_SHIFT                     0u
#define C55FMC_MCR_EHV_WIDTH                     1u
#define C55FMC_MCR_EHV(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_EHV_SHIFT))&C55FMC_MCR_EHV_MASK)
#define C55FMC_MCR_ESUS_MASK                     0x2u
#define C55FMC_MCR_ESUS_SHIFT                    1u
#define C55FMC_MCR_ESUS_WIDTH                    1u
#define C55FMC_MCR_ESUS(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_ESUS_SHIFT))&C55FMC_MCR_ESUS_MASK)
#define C55FMC_MCR_ERS_MASK                      0x4u
#define C55FMC_MCR_ERS_SHIFT                     2u
#define C55FMC_MCR_ERS_WIDTH                     1u
#define C55FMC_MCR_ERS(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_ERS_SHIFT))&C55FMC_MCR_ERS_MASK)
#define C55FMC_MCR_PSUS_MASK                     0x8u
#define C55FMC_MCR_PSUS_SHIFT                    3u
#define C55FMC_MCR_PSUS_WIDTH                    1u
#define C55FMC_MCR_PSUS(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_PSUS_SHIFT))&C55FMC_MCR_PSUS_MASK)
#define C55FMC_MCR_PGM_MASK                      0x10u
#define C55FMC_MCR_PGM_SHIFT                     4u
#define C55FMC_MCR_PGM_WIDTH                     1u
#define C55FMC_MCR_PGM(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_PGM_SHIFT))&C55FMC_MCR_PGM_MASK)
#define C55FMC_MCR_PECIE_MASK                    0x100u
#define C55FMC_MCR_PECIE_SHIFT                   8u
#define C55FMC_MCR_PECIE_WIDTH                   1u
#define C55FMC_MCR_PECIE(x)                      (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_PECIE_SHIFT))&C55FMC_MCR_PECIE_MASK)
#define C55FMC_MCR_PEG_MASK                      0x200u
#define C55FMC_MCR_PEG_SHIFT                     9u
#define C55FMC_MCR_PEG_WIDTH                     1u
#define C55FMC_MCR_PEG(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_PEG_SHIFT))&C55FMC_MCR_PEG_MASK)
#define C55FMC_MCR_DONE_MASK                     0x400u
#define C55FMC_MCR_DONE_SHIFT                    10u
#define C55FMC_MCR_DONE_WIDTH                    1u
#define C55FMC_MCR_DONE(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_DONE_SHIFT))&C55FMC_MCR_DONE_MASK)
#define C55FMC_MCR_PEAS_MASK                     0x800u
#define C55FMC_MCR_PEAS_SHIFT                    11u
#define C55FMC_MCR_PEAS_WIDTH                    1u
#define C55FMC_MCR_PEAS(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_PEAS_SHIFT))&C55FMC_MCR_PEAS_MASK)
#define C55FMC_MCR_SBC_MASK                      0x2000u
#define C55FMC_MCR_SBC_SHIFT                     13u
#define C55FMC_MCR_SBC_WIDTH                     1u
#define C55FMC_MCR_SBC(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_SBC_SHIFT))&C55FMC_MCR_SBC_MASK)
#define C55FMC_MCR_RWE_MASK                      0x4000u
#define C55FMC_MCR_RWE_SHIFT                     14u
#define C55FMC_MCR_RWE_WIDTH                     1u
#define C55FMC_MCR_RWE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_RWE_SHIFT))&C55FMC_MCR_RWE_MASK)
#define C55FMC_MCR_EER_MASK                      0x8000u
#define C55FMC_MCR_EER_SHIFT                     15u
#define C55FMC_MCR_EER_WIDTH                     1u
#define C55FMC_MCR_EER(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_EER_SHIFT))&C55FMC_MCR_EER_MASK)
#define C55FMC_MCR_EEE_MASK                      0x10000000u
#define C55FMC_MCR_EEE_SHIFT                     28u
#define C55FMC_MCR_EEE_WIDTH                     1u
#define C55FMC_MCR_EEE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_EEE_SHIFT))&C55FMC_MCR_EEE_MASK)
#define C55FMC_MCR_AEE_MASK                      0x20000000u
#define C55FMC_MCR_AEE_SHIFT                     29u
#define C55FMC_MCR_AEE_WIDTH                     1u
#define C55FMC_MCR_AEE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_AEE_SHIFT))&C55FMC_MCR_AEE_MASK)
#define C55FMC_MCR_RRE_MASK                      0x40000000u
#define C55FMC_MCR_RRE_SHIFT                     30u
#define C55FMC_MCR_RRE_WIDTH                     1u
#define C55FMC_MCR_RRE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_RRE_SHIFT))&C55FMC_MCR_RRE_MASK)
#define C55FMC_MCR_RVE_MASK                      0x80000000u
#define C55FMC_MCR_RVE_SHIFT                     31u
#define C55FMC_MCR_RVE_WIDTH                     1u
#define C55FMC_MCR_RVE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCR_RVE_SHIFT))&C55FMC_MCR_RVE_MASK)
/* MCRE Bit Fields */
#define C55FMC_MCRE_n16Kl_MASK                   0x7u
#define C55FMC_MCRE_n16Kl_SHIFT                  0u
#define C55FMC_MCRE_n16Kl_WIDTH                  3u
#define C55FMC_MCRE_n16Kl(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n16Kl_SHIFT))&C55FMC_MCRE_n16Kl_MASK)
#define C55FMC_MCRE_n32Kl_MASK                   0x18u
#define C55FMC_MCRE_n32Kl_SHIFT                  3u
#define C55FMC_MCRE_n32Kl_WIDTH                  2u
#define C55FMC_MCRE_n32Kl(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n32Kl_SHIFT))&C55FMC_MCRE_n32Kl_MASK)
#define C55FMC_MCRE_n64Kl_MASK                   0xE0u
#define C55FMC_MCRE_n64Kl_SHIFT                  5u
#define C55FMC_MCRE_n64Kl_WIDTH                  3u
#define C55FMC_MCRE_n64Kl(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n64Kl_SHIFT))&C55FMC_MCRE_n64Kl_MASK)
#define C55FMC_MCRE_n16Km_MASK                   0x700u
#define C55FMC_MCRE_n16Km_SHIFT                  8u
#define C55FMC_MCRE_n16Km_WIDTH                  3u
#define C55FMC_MCRE_n16Km(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n16Km_SHIFT))&C55FMC_MCRE_n16Km_MASK)
#define C55FMC_MCRE_n32Km_MASK                   0x1800u
#define C55FMC_MCRE_n32Km_SHIFT                  11u
#define C55FMC_MCRE_n32Km_WIDTH                  2u
#define C55FMC_MCRE_n32Km(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n32Km_SHIFT))&C55FMC_MCRE_n32Km_MASK)
#define C55FMC_MCRE_n64Km_MASK                   0xE000u
#define C55FMC_MCRE_n64Km_SHIFT                  13u
#define C55FMC_MCRE_n64Km_WIDTH                  3u
#define C55FMC_MCRE_n64Km(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n64Km_SHIFT))&C55FMC_MCRE_n64Km_MASK)
#define C55FMC_MCRE_n16Kh_MASK                   0x70000u
#define C55FMC_MCRE_n16Kh_SHIFT                  16u
#define C55FMC_MCRE_n16Kh_WIDTH                  3u
#define C55FMC_MCRE_n16Kh(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n16Kh_SHIFT))&C55FMC_MCRE_n16Kh_MASK)
#define C55FMC_MCRE_n32Kh_MASK                   0x180000u
#define C55FMC_MCRE_n32Kh_SHIFT                  19u
#define C55FMC_MCRE_n32Kh_WIDTH                  2u
#define C55FMC_MCRE_n32Kh(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n32Kh_SHIFT))&C55FMC_MCRE_n32Kh_MASK)
#define C55FMC_MCRE_n64Kh_MASK                   0xE00000u
#define C55FMC_MCRE_n64Kh_SHIFT                  21u
#define C55FMC_MCRE_n64Kh_WIDTH                  3u
#define C55FMC_MCRE_n64Kh(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n64Kh_SHIFT))&C55FMC_MCRE_n64Kh_MASK)
#define C55FMC_MCRE_n256K_MASK                   0x1F000000u
#define C55FMC_MCRE_n256K_SHIFT                  24u
#define C55FMC_MCRE_n256K_WIDTH                  5u
#define C55FMC_MCRE_n256K(x)                     (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_n256K_SHIFT))&C55FMC_MCRE_n256K_MASK)
#define C55FMC_MCRE_HT_MASK                      0x80000000u
#define C55FMC_MCRE_HT_SHIFT                     31u
#define C55FMC_MCRE_HT_WIDTH                     1u
#define C55FMC_MCRE_HT(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_MCRE_HT_SHIFT))&C55FMC_MCRE_HT_MASK)
/* LOCK0 Bit Fields */
#define C55FMC_LOCK0_MIDLOCK_MASK                0xFFFFu
#define C55FMC_LOCK0_MIDLOCK_SHIFT               0u
#define C55FMC_LOCK0_MIDLOCK_WIDTH               16u
#define C55FMC_LOCK0_MIDLOCK(x)                  (((uint32_t)(((uint32_t)(x))<<C55FMC_LOCK0_MIDLOCK_SHIFT))&C55FMC_LOCK0_MIDLOCK_MASK)
#define C55FMC_LOCK0_LOWLOCK_MASK                0x3FFF0000u
#define C55FMC_LOCK0_LOWLOCK_SHIFT               16u
#define C55FMC_LOCK0_LOWLOCK_WIDTH               14u
#define C55FMC_LOCK0_LOWLOCK(x)                  (((uint32_t)(((uint32_t)(x))<<C55FMC_LOCK0_LOWLOCK_SHIFT))&C55FMC_LOCK0_LOWLOCK_MASK)
#define C55FMC_LOCK0_TSLOCK_MASK                 0x80000000u
#define C55FMC_LOCK0_TSLOCK_SHIFT                31u
#define C55FMC_LOCK0_TSLOCK_WIDTH                1u
#define C55FMC_LOCK0_TSLOCK(x)                   (((uint32_t)(((uint32_t)(x))<<C55FMC_LOCK0_TSLOCK_SHIFT))&C55FMC_LOCK0_TSLOCK_MASK)
/* LOCK1 Bit Fields */
#define C55FMC_LOCK1_HIGHLOCK_MASK               0xFFFFu
#define C55FMC_LOCK1_HIGHLOCK_SHIFT              0u
#define C55FMC_LOCK1_HIGHLOCK_WIDTH              16u
#define C55FMC_LOCK1_HIGHLOCK(x)                 (((uint32_t)(((uint32_t)(x))<<C55FMC_LOCK1_HIGHLOCK_SHIFT))&C55FMC_LOCK1_HIGHLOCK_MASK)
/* LOCK2 Bit Fields */
#define C55FMC_LOCK2_A256KLOCK_MASK              0xFFFFFFFFu
#define C55FMC_LOCK2_A256KLOCK_SHIFT             0u
#define C55FMC_LOCK2_A256KLOCK_WIDTH             32u
#define C55FMC_LOCK2_A256KLOCK(x)                (((uint32_t)(((uint32_t)(x))<<C55FMC_LOCK2_A256KLOCK_SHIFT))&C55FMC_LOCK2_A256KLOCK_MASK)
/* LOCK3 Bit Fields */
#define C55FMC_LOCK3_A256KLOCK_MASK              0xFFFFu
#define C55FMC_LOCK3_A256KLOCK_SHIFT             0u
#define C55FMC_LOCK3_A256KLOCK_WIDTH             16u
#define C55FMC_LOCK3_A256KLOCK(x)                (((uint32_t)(((uint32_t)(x))<<C55FMC_LOCK3_A256KLOCK_SHIFT))&C55FMC_LOCK3_A256KLOCK_MASK)
/* SEL0 Bit Fields */
#define C55FMC_SEL0_MIDSEL_MASK                  0xFFFFu
#define C55FMC_SEL0_MIDSEL_SHIFT                 0u
#define C55FMC_SEL0_MIDSEL_WIDTH                 16u
#define C55FMC_SEL0_MIDSEL(x)                    (((uint32_t)(((uint32_t)(x))<<C55FMC_SEL0_MIDSEL_SHIFT))&C55FMC_SEL0_MIDSEL_MASK)
#define C55FMC_SEL0_LOWSEL_MASK                  0x3FFF0000u
#define C55FMC_SEL0_LOWSEL_SHIFT                 16u
#define C55FMC_SEL0_LOWSEL_WIDTH                 14u
#define C55FMC_SEL0_LOWSEL(x)                    (((uint32_t)(((uint32_t)(x))<<C55FMC_SEL0_LOWSEL_SHIFT))&C55FMC_SEL0_LOWSEL_MASK)
/* SEL1 Bit Fields */
#define C55FMC_SEL1_HIGHSEL_MASK                 0xFFFFu
#define C55FMC_SEL1_HIGHSEL_SHIFT                0u
#define C55FMC_SEL1_HIGHSEL_WIDTH                16u
#define C55FMC_SEL1_HIGHSEL(x)                   (((uint32_t)(((uint32_t)(x))<<C55FMC_SEL1_HIGHSEL_SHIFT))&C55FMC_SEL1_HIGHSEL_MASK)
/* SEL2 Bit Fields */
#define C55FMC_SEL2_A256KSEL_MASK                0xFFFFFFFFu
#define C55FMC_SEL2_A256KSEL_SHIFT               0u
#define C55FMC_SEL2_A256KSEL_WIDTH               32u
#define C55FMC_SEL2_A256KSEL(x)                  (((uint32_t)(((uint32_t)(x))<<C55FMC_SEL2_A256KSEL_SHIFT))&C55FMC_SEL2_A256KSEL_MASK)
/* SEL3 Bit Fields */
#define C55FMC_SEL3_A256KSEL_MASK                0xFFFFu
#define C55FMC_SEL3_A256KSEL_SHIFT               0u
#define C55FMC_SEL3_A256KSEL_WIDTH               16u
#define C55FMC_SEL3_A256KSEL(x)                  (((uint32_t)(((uint32_t)(x))<<C55FMC_SEL3_A256KSEL_SHIFT))&C55FMC_SEL3_A256KSEL_MASK)
/* ADR Bit Fields */
#define C55FMC_ADR_ADDR_MASK                     0xFFFFF8u
#define C55FMC_ADR_ADDR_SHIFT                    3u
#define C55FMC_ADR_ADDR_WIDTH                    21u
#define C55FMC_ADR_ADDR(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_ADDR_SHIFT))&C55FMC_ADR_ADDR_MASK)
#define C55FMC_ADR_a16k_MASK                     0x1000000u
#define C55FMC_ADR_a16k_SHIFT                    24u
#define C55FMC_ADR_a16k_WIDTH                    1u
#define C55FMC_ADR_a16k(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_a16k_SHIFT))&C55FMC_ADR_a16k_MASK)
#define C55FMC_ADR_a32k_MASK                     0x2000000u
#define C55FMC_ADR_a32k_SHIFT                    25u
#define C55FMC_ADR_a32k_WIDTH                    1u
#define C55FMC_ADR_a32k(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_a32k_SHIFT))&C55FMC_ADR_a32k_MASK)
#define C55FMC_ADR_a64k_MASK                     0x4000000u
#define C55FMC_ADR_a64k_SHIFT                    26u
#define C55FMC_ADR_a64k_WIDTH                    1u
#define C55FMC_ADR_a64k(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_a64k_SHIFT))&C55FMC_ADR_a64k_MASK)
#define C55FMC_ADR_a256k_MASK                    0x8000000u
#define C55FMC_ADR_a256k_SHIFT                   27u
#define C55FMC_ADR_a256k_WIDTH                   1u
#define C55FMC_ADR_a256k(x)                      (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_a256k_SHIFT))&C55FMC_ADR_a256k_MASK)
#define C55FMC_ADR_aL_MASK                       0x10000000u
#define C55FMC_ADR_aL_SHIFT                      28u
#define C55FMC_ADR_aL_WIDTH                      1u
#define C55FMC_ADR_aL(x)                         (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_aL_SHIFT))&C55FMC_ADR_aL_MASK)
#define C55FMC_ADR_aM_MASK                       0x20000000u
#define C55FMC_ADR_aM_SHIFT                      29u
#define C55FMC_ADR_aM_WIDTH                      1u
#define C55FMC_ADR_aM(x)                         (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_aM_SHIFT))&C55FMC_ADR_aM_MASK)
#define C55FMC_ADR_aH_MASK                       0x40000000u
#define C55FMC_ADR_aH_SHIFT                      30u
#define C55FMC_ADR_aH_WIDTH                      1u
#define C55FMC_ADR_aH(x)                         (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_aH_SHIFT))&C55FMC_ADR_aH_MASK)
#define C55FMC_ADR_SAD_MASK                      0x80000000u
#define C55FMC_ADR_SAD_SHIFT                     31u
#define C55FMC_ADR_SAD_WIDTH                     1u
#define C55FMC_ADR_SAD(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_ADR_SAD_SHIFT))&C55FMC_ADR_SAD_MASK)
/* UT0 Bit Fields */
#define C55FMC_UT0_AID_MASK                      0x1u
#define C55FMC_UT0_AID_SHIFT                     0u
#define C55FMC_UT0_AID_WIDTH                     1u
#define C55FMC_UT0_AID(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_AID_SHIFT))&C55FMC_UT0_AID_MASK)
#define C55FMC_UT0_AIE_MASK                      0x2u
#define C55FMC_UT0_AIE_SHIFT                     1u
#define C55FMC_UT0_AIE_WIDTH                     1u
#define C55FMC_UT0_AIE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_AIE_SHIFT))&C55FMC_UT0_AIE_MASK)
#define C55FMC_UT0_AIS_MASK                      0x4u
#define C55FMC_UT0_AIS_SHIFT                     2u
#define C55FMC_UT0_AIS_WIDTH                     1u
#define C55FMC_UT0_AIS(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_AIS_SHIFT))&C55FMC_UT0_AIS_MASK)
#define C55FMC_UT0_MRV_MASK                      0x10u
#define C55FMC_UT0_MRV_SHIFT                     4u
#define C55FMC_UT0_MRV_WIDTH                     1u
#define C55FMC_UT0_MRV(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_MRV_SHIFT))&C55FMC_UT0_MRV_MASK)
#define C55FMC_UT0_MRE_MASK                      0x20u
#define C55FMC_UT0_MRE_SHIFT                     5u
#define C55FMC_UT0_MRE_WIDTH                     1u
#define C55FMC_UT0_MRE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_MRE_SHIFT))&C55FMC_UT0_MRE_MASK)
#define C55FMC_UT0_AISUS_MASK                    0x40u
#define C55FMC_UT0_AISUS_SHIFT                   6u
#define C55FMC_UT0_AISUS_WIDTH                   1u
#define C55FMC_UT0_AISUS(x)                      (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_AISUS_SHIFT))&C55FMC_UT0_AISUS_MASK)
#define C55FMC_UT0_AIBPE_MASK                    0x100u
#define C55FMC_UT0_AIBPE_SHIFT                   8u
#define C55FMC_UT0_AIBPE_WIDTH                   1u
#define C55FMC_UT0_AIBPE(x)                      (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_AIBPE_SHIFT))&C55FMC_UT0_AIBPE_MASK)
#define C55FMC_UT0_NAIBP_MASK                    0x200u
#define C55FMC_UT0_NAIBP_SHIFT                   9u
#define C55FMC_UT0_NAIBP_WIDTH                   1u
#define C55FMC_UT0_NAIBP(x)                      (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_NAIBP_SHIFT))&C55FMC_UT0_NAIBP_MASK)
#define C55FMC_UT0_CPE_MASK                      0x10000u
#define C55FMC_UT0_CPE_SHIFT                     16u
#define C55FMC_UT0_CPE_WIDTH                     1u
#define C55FMC_UT0_CPE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_CPE_SHIFT))&C55FMC_UT0_CPE_MASK)
#define C55FMC_UT0_CPA_MASK                      0x20000u
#define C55FMC_UT0_CPA_SHIFT                     17u
#define C55FMC_UT0_CPA_WIDTH                     1u
#define C55FMC_UT0_CPA(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_CPA_SHIFT))&C55FMC_UT0_CPA_MASK)
#define C55FMC_UT0_CPR_MASK                      0x40000u
#define C55FMC_UT0_CPR_SHIFT                     18u
#define C55FMC_UT0_CPR_WIDTH                     1u
#define C55FMC_UT0_CPR(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_CPR_SHIFT))&C55FMC_UT0_CPR_MASK)
#define C55FMC_UT0_SBCE_MASK                     0x40000000u
#define C55FMC_UT0_SBCE_SHIFT                    30u
#define C55FMC_UT0_SBCE_WIDTH                    1u
#define C55FMC_UT0_SBCE(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_SBCE_SHIFT))&C55FMC_UT0_SBCE_MASK)
#define C55FMC_UT0_UTE_MASK                      0x80000000u
#define C55FMC_UT0_UTE_SHIFT                     31u
#define C55FMC_UT0_UTE_WIDTH                     1u
#define C55FMC_UT0_UTE(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UT0_UTE_SHIFT))&C55FMC_UT0_UTE_MASK)
/* UM Bit Fields */
#define C55FMC_UM_MISR_MASK                      0xFFFFFFFFu
#define C55FMC_UM_MISR_SHIFT                     0u
#define C55FMC_UM_MISR_WIDTH                     32u
#define C55FMC_UM_MISR(x)                        (((uint32_t)(((uint32_t)(x))<<C55FMC_UM_MISR_SHIFT))&C55FMC_UM_MISR_MASK)
/* UM9 Bit Fields */
#define C55FMC_UM9_MISR_MASK                     0x1u
#define C55FMC_UM9_MISR_SHIFT                    0u
#define C55FMC_UM9_MISR_WIDTH                    1u
#define C55FMC_UM9_MISR(x)                       (((uint32_t)(((uint32_t)(x))<<C55FMC_UM9_MISR_SHIFT))&C55FMC_UM9_MISR_MASK)
/* OPP0 Bit Fields */
#define C55FMC_OPP0_MIDOPP_MASK                  0xFFFFu
#define C55FMC_OPP0_MIDOPP_SHIFT                 0u
#define C55FMC_OPP0_MIDOPP_WIDTH                 16u
#define C55FMC_OPP0_MIDOPP(x)                    (((uint32_t)(((uint32_t)(x))<<C55FMC_OPP0_MIDOPP_SHIFT))&C55FMC_OPP0_MIDOPP_MASK)
#define C55FMC_OPP0_LOWOPP_MASK                  0x3FFF0000u
#define C55FMC_OPP0_LOWOPP_SHIFT                 16u
#define C55FMC_OPP0_LOWOPP_WIDTH                 14u
#define C55FMC_OPP0_LOWOPP(x)                    (((uint32_t)(((uint32_t)(x))<<C55FMC_OPP0_LOWOPP_SHIFT))&C55FMC_OPP0_LOWOPP_MASK)
/* OPP1 Bit Fields */
#define C55FMC_OPP1_HIGHOPP_MASK                 0xFFFFu
#define C55FMC_OPP1_HIGHOPP_SHIFT                0u
#define C55FMC_OPP1_HIGHOPP_WIDTH                16u
#define C55FMC_OPP1_HIGHOPP(x)                   (((uint32_t)(((uint32_t)(x))<<C55FMC_OPP1_HIGHOPP_SHIFT))&C55FMC_OPP1_HIGHOPP_MASK)
/* OPP2 Bit Fields */
#define C55FMC_OPP2_A256KOPP_MASK                0xFFFFFFFFu
#define C55FMC_OPP2_A256KOPP_SHIFT               0u
#define C55FMC_OPP2_A256KOPP_WIDTH               32u
#define C55FMC_OPP2_A256KOPP(x)                  (((uint32_t)(((uint32_t)(x))<<C55FMC_OPP2_A256KOPP_SHIFT))&C55FMC_OPP2_A256KOPP_MASK)
/* OPP3 Bit Fields */
#define C55FMC_OPP3_A256KOPP_MASK                0xFFFFu
#define C55FMC_OPP3_A256KOPP_SHIFT               0u
#define C55FMC_OPP3_A256KOPP_WIDTH               16u
#define C55FMC_OPP3_A256KOPP(x)                  (((uint32_t)(((uint32_t)(x))<<C55FMC_OPP3_A256KOPP_SHIFT))&C55FMC_OPP3_A256KOPP_MASK)
/* TMD Bit Fields */
#define C55FMC_TMD_PWD_MASK                      0xFFFFFFFFu
#define C55FMC_TMD_PWD_SHIFT                     0u
