neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the CMU module. */
#define CMU_INSTANCE_COUNT                       (9u)


/* CMU - Peripheral instance base addresses */
/** Peripheral CMU_0 base address */
#define CMU_0_BASE                               (0xC3E6C200u)
/** Peripheral CMU_0 base pointer */
#define CMU_0                                    ((CMU_Type *)CMU_0_BASE)
/** Peripheral CMU_1 base address */
#define CMU_1_BASE                               (0xC3E6C240u)
/** Peripheral CMU_1 base pointer */
#define CMU_1                                    ((CMU_Type *)CMU_1_BASE)
/** Peripheral CMU_2 base address */
#define CMU_2_BASE                               (0xC3E6C280u)
/** Peripheral CMU_2 base pointer */
#define CMU_2                                    ((CMU_Type *)CMU_2_BASE)
/** Peripheral CMU_3 base address */
#define CMU_3_BASE                               (0xC3E6C2C0u)
/** Peripheral CMU_3 base pointer */
#define CMU_3                                    ((CMU_Type *)CMU_3_BASE)
/** Peripheral CMU_4 base address */
#define CMU_4_BASE                               (0xC3E6C300u)
/** Peripheral CMU_4 base pointer */
#define CMU_4                                    ((CMU_Type *)CMU_4_BASE)
/** Peripheral CMU_5 base address */
#define CMU_5_BASE                               (0xC3E6C340u)
/** Peripheral CMU_5 base pointer */
#define CMU_5                                    ((CMU_Type *)CMU_5_BASE)
/** Peripheral CMU_6 base address */
#define CMU_6_BASE                               (0xC3E6C380u)
/** Peripheral CMU_6 base pointer */
#define CMU_6                                    ((CMU_Type *)CMU_6_BASE)
/** Peripheral CMU_7 base address */
#define CMU_7_BASE                               (0xC3E6C3C0u)
/** Peripheral CMU_7 base pointer */
#define CMU_7                                    ((CMU_Type *)CMU_7_BASE)
/** Peripheral CMU_8 base address */
#define CMU_8_BASE                               (0xC3E6C400u)
/** Peripheral CMU_8 base pointer */
#define CMU_8                                    ((CMU_Type *)CMU_8_BASE)
/** Array initializer of CMU peripheral base addresses */
#define CMU_BASE_ADDRS                           { CMU_0_BASE, CMU_1_BASE, CMU_2_BASE, CMU_3_BASE, CMU_4_BASE, CMU_5_BASE, CMU_6_BASE, CMU_7_BASE, CMU_8_BASE }
/** Array initializer of CMU peripheral base pointers */
#define CMU_BASE_PTRS                            { CMU_0, CMU_1, CMU_2, CMU_3, CMU_4, CMU_5, CMU_6, CMU_7, CMU_8 }

/* ----------------------------------------------------------------------------
   -- CMU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CMU_Register_Masks CMU Register Masks
 * @{
 */

/* CSR Bit Fields */
#define CMU_CSR_CME_MASK                         0x1u
#define CMU_CSR_CME_SHIFT                        0u
#define CMU_CSR_CME_WIDTH                        1u
#define CMU_CSR_CME(x)                           (((uint32_t)(((uint32_t)(x))<<CMU_CSR_CME_SHIFT))&CMU_CSR_CME_MASK)
#define CMU_CSR_RCDIV_MASK                       0x6u
#define CMU_CSR_RCDIV_SHIFT                      1u
#define CMU_CSR_RCDIV_WIDTH                      2u
#define CMU_CSR_RCDIV(x)                         (((uint32_t)(((uint32_t)(x))<<CMU_CSR_RCDIV_SHIFT))&CMU_CSR_RCDIV_MASK)
#define CMU_CSR_CKSEL1_MASK                      0x300u
#define CMU_CSR_CKSEL1_SHIFT                     8u
#define CMU_CSR_CKSEL1_WIDTH                     2u
#define CMU_CSR_CKSEL1(x)                        (((uint32_t)(((uint32_t)(x))<<CMU_CSR_CKSEL1_SHIFT))&CMU_CSR_CKSEL1_MASK)
#define CMU_CSR_SFM_MASK                         0x800000u
#define CMU_CSR_SFM_SHIFT                        23u
#define CMU_CSR_SFM_WIDTH                        1u
#define CMU_CSR_SFM(x)                           (((uint32_t)(((uint32_t)(x))<<CMU_CSR_SFM_SHIFT))&CMU_CSR_SFM_MASK)
/* FDR Bit Fields */
#define CMU_FDR_FD_MASK                          0xFFFFFu
#define CMU_FDR_FD_SHIFT                         0u
#define CMU_FDR_FD_WIDTH                         20u
#define CMU_FDR_FD(x)                            (((uint32_t)(((uint32_t)(x))<<CMU_FDR_FD_SHIFT))&CMU_FDR_FD_MASK)
/* HFREFR Bit Fields */
#define CMU_HFREFR_HFREF_MASK                    0xFFFu
#define CMU_HFREFR_HFREF_SHIFT                   0u
#define CMU_HFREFR_HFREF_WIDTH                   12u
#define CMU_HFREFR_HFREF(x)                      (((uint32_t)(((uint32_t)(x))<<CMU_HFREFR_HFREF_SHIFT))&CMU_HFREFR_HFREF_MASK)
/* LFREFR Bit Fields */
#define CMU_LFREFR_LFREF_MASK                    0xFFFu
#define CMU_LFREFR_LFREF_SHIFT                   0u
#define CMU_LFREFR_LFREF_WIDTH                   12u
#define CMU_LFREFR_LFREF(x)                      (((uint32_t)(((uint32_t)(x))<<CMU_LFREFR_LFREF_SHIFT))&CMU_LFREFR_LFREF_MASK)
/* ISR Bit Fields */
#define CMU_ISR_OLRI_MASK                        0x1u
#define CMU_ISR_OLRI_SHIFT                       0u
#define CMU_ISR_OLRI_WIDTH                       1u
#define CMU_ISR_OLRI(x)                          (((uint32_t)(((uint32_t)(x))<<CMU_ISR_OLRI_SHIFT))&CMU_ISR_OLRI_MASK)
#define CMU_ISR_FLLI_MASK                        0x2u
#define CMU_ISR_FLLI_SHIFT                       1u
#define CMU_ISR_FLLI_WIDTH                       1u
#define CMU_ISR_FLLI(x)                          (((uint32_t)(((uint32_t)(x))<<CMU_ISR_FLLI_SHIFT))&CMU_ISR_FLLI_MASK)
#define CMU_ISR_FHHI_MASK                        0x4u
#define CMU_ISR_FHHI_SHIFT                       2u
#define CMU_ISR_FHHI_WIDTH                       1u
#define CMU_ISR_FHHI(x)                          (((uint32_t)(((uint32_t)(x))<<CMU_ISR_FHHI_SHIFT))&CMU_ISR_FHHI_MASK)
#define CMU_ISR_FLCI_MASK                        0x8u
#define CMU_ISR_FLCI_SHIFT                       3u
#define CMU_ISR_FLCI_WIDTH                       1u
#define CMU_ISR_FLCI(x)                          (((uint32_t)(((uint32_t)(x))<<CMU_ISR_FLCI_SHIFT))&CMU_ISR_FLCI_MASK)
/* MDR Bit Fields */
#define CMU_MDR_MD_MASK                          0xFFFFFu
#define CMU_MDR_MD_SHIFT                         0u
#define CMU_MDR_MD_WIDTH                         20u
#define CMU_MDR_MD(x)                            (((uint32_t)(((uint32_t)(x))<<CMU_MDR_MD_SHIFT))&CMU_MDR_MD_MASK)

/*!
 * @}
 */ /* end of group CMU_Register_Masks */


/*!
 * @}
 */ /* end of group CMU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CRC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CRC_Peripheral_Access_Layer CRC Peripheral Access Layer
 * @{
 */


/** CRC - Size of Registers Arrays */

