neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** CRC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CFG;                               /**< Configuration Register, offset: 0x0 */
  __IO uint32_t INP;                               /**< Input Register, offset: 0x4 */
  __IO uint32_t CSTAT;                             /**< Current Status Register, offset: 0x8 */
  __I  uint32_t OUTP;                              /**< Output Register, offset: 0xC */
} CRC_Type, *CRC_MemMapPtr;

 /** Number of instances of the CRC module. */
#define CRC_INSTANCE_COUNT                       (3u)


/* CRC - Peripheral instance base addresses */
/** Peripheral CRC_0 base address */
#define CRC_0_BASE                               (0xFFE68000u)
/** Peripheral CRC_0 base pointer */
#define CRC_0                                    ((CRC_Type *)CRC_0_BASE)
/** Peripheral CRC_1 base address */
#define CRC_1_BASE                               (0xFFE68010u)
/** Peripheral CRC_1 base pointer */
#define CRC_1                                    ((CRC_Type *)CRC_1_BASE)
/** Peripheral CRC_2 base address */
#define CRC_2_BASE                               (0xFFE68020u)
/** Peripheral CRC_2 base pointer */
#define CRC_2                                    ((CRC_Type *)CRC_2_BASE)
/** Array initializer of CRC peripheral base addresses */
#define CRC_BASE_ADDRS                           { CRC_0_BASE, CRC_1_BASE, CRC_2_BASE }
/** Array initializer of CRC peripheral base pointers */
#define CRC_BASE_PTRS                            { CRC_0, CRC_1, CRC_2 }

/* ----------------------------------------------------------------------------
   -- CRC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CRC_Register_Masks CRC Register Masks
 * @{
 */

/* CFG Bit Fields */
#define CRC_CFG_INV_MASK                         0x1u
#define CRC_CFG_INV_SHIFT                        0u
#define CRC_CFG_INV_WIDTH                        1u
#define CRC_CFG_INV(x)                           (((uint32_t)(((uint32_t)(x))<<CRC_CFG_INV_SHIFT))&CRC_CFG_INV_MASK)
#define CRC_CFG_SWAP_MASK                        0x2u
#define CRC_CFG_SWAP_SHIFT                       1u
#define CRC_CFG_SWAP_WIDTH                       1u
#define CRC_CFG_SWAP(x)                          (((uint32_t)(((uint32_t)(x))<<CRC_CFG_SWAP_SHIFT))&CRC_CFG_SWAP_MASK)
#define CRC_CFG_POLYG_MASK                       0xCu
#define CRC_CFG_POLYG_SHIFT                      2u
#define CRC_CFG_POLYG_WIDTH                      2u
#define CRC_CFG_POLYG(x)                         (((uint32_t)(((uint32_t)(x))<<CRC_CFG_POLYG_SHIFT))&CRC_CFG_POLYG_MASK)
#define CRC_CFG_SWAP_BITWISE_MASK                0x10u
#define CRC_CFG_SWAP_BITWISE_SHIFT               4u
#define CRC_CFG_SWAP_BITWISE_WIDTH               1u
#define CRC_CFG_SWAP_BITWISE(x)                  (((uint32_t)(((uint32_t)(x))<<CRC_CFG_SWAP_BITWISE_SHIFT))&CRC_CFG_SWAP_BITWISE_MASK)
#define CRC_CFG_SWAP_BYTEWISE_MASK               0x20u
#define CRC_CFG_SWAP_BYTEWISE_SHIFT              5u
#define CRC_CFG_SWAP_BYTEWISE_WIDTH              1u
#define CRC_CFG_SWAP_BYTEWISE(x)                 (((uint32_t)(((uint32_t)(x))<<CRC_CFG_SWAP_BYTEWISE_SHIFT))&CRC_CFG_SWAP_BYTEWISE_MASK)
/* INP Bit Fields */
#define CRC_INP_INP_MASK                         0xFFFFFFFFu
#define CRC_INP_INP_SHIFT                        0u
#define CRC_INP_INP_WIDTH                        32u
#define CRC_INP_INP(x)                           (((uint32_t)(((uint32_t)(x))<<CRC_INP_INP_SHIFT))&CRC_INP_INP_MASK)
/* CSTAT Bit Fields */
#define CRC_CSTAT_CSTAT_MASK                     0xFFFFFFFFu
#define CRC_CSTAT_CSTAT_SHIFT                    0u
#define CRC_CSTAT_CSTAT_WIDTH                    32u
#define CRC_CSTAT_CSTAT(x)                       (((uint32_t)(((uint32_t)(x))<<CRC_CSTAT_CSTAT_SHIFT))&CRC_CSTAT_CSTAT_MASK)
/* OUTP Bit Fields */
#define CRC_OUTP_OUTP_MASK                       0xFFFFFFFFu
#define CRC_OUTP_OUTP_SHIFT                      0u
#define CRC_OUTP_OUTP_WIDTH                      32u
#define CRC_OUTP_OUTP(x)                         (((uint32_t)(((uint32_t)(x))<<CRC_OUTP_OUTP_SHIFT))&CRC_OUTP_OUTP_MASK)

/*!
 * @}
 */ /* end of group CRC_Register_Masks */


/*!
 * @}
 */ /* end of group CRC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- CSE Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSE_Peripheral_Access_Layer CSE Peripheral Access Layer
 * @{
 */


/** CSE - Size of Registers Arrays */
#define CSE_P_COUNT                              5u

/** CSE - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< CSE Control Register, offset: 0x0 */
  __I  uint32_t SR;                                /**< CSE Status Register, offset: 0x4 */
  __IO uint32_t IR;                                /**< CSE Interrupt Register, offset: 0x8 */
  __I  uint32_t ECR;                               /**< CSE Error Code Register, offset: 0xC */
       uint8_t RESERVED_0[16];
  __IO uint32_t CMD;                               /**< CSE Command Register, offset: 0x20 */
  __IO uint32_t P[CSE_P_COUNT];                    /**< CSE Parameter Register, array offset: 0x24, array step: 0x4 */
} CSE_Type, *CSE_MemMapPtr;

 /** Number of instances of the CSE module. */
#define CSE_INSTANCE_COUNT                       (1u)


/* CSE - Peripheral instance base addresses */
/** Peripheral CSE base address */
#define CSE_BASE                                 (0xFFF14000u)
/** Peripheral CSE base pointer */
#define CSE                                      ((CSE_Type *)CSE_BASE)
/** Array initializer of CSE peripheral base addresses */
#define CSE_BASE_ADDRS                           { CSE_BASE }
/** Array initializer of CSE peripheral base pointers */
#define CSE_BASE_PTRS                            { CSE }

/* ----------------------------------------------------------------------------
   -- CSE Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CSE_Register_Masks CSE Register Masks
 * @{
 */

/* CR Bit Fields */
#define CSE_CR_CIE_MASK                          0x1u
#define CSE_CR_CIE_SHIFT                         0u
#define CSE_CR_CIE_WIDTH                         1u
#define CSE_CR_CIE(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_CR_CIE_SHIFT))&CSE_CR_CIE_MASK)
#define CSE_CR_DRE_MASK                          0x2u
#define CSE_CR_DRE_SHIFT                         1u
#define CSE_CR_DRE_WIDTH                         1u
#define CSE_CR_DRE(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_CR_DRE_SHIFT))&CSE_CR_DRE_MASK)
#define CSE_CR_SUS_MASK                          0x4u
#define CSE_CR_SUS_SHIFT                         2u
#define CSE_CR_SUS_WIDTH                         1u
#define CSE_CR_SUS(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_CR_SUS_SHIFT))&CSE_CR_SUS_MASK)
#define CSE_CR_MDIS_MASK                         0x8u
#define CSE_CR_MDIS_SHIFT                        3u
#define CSE_CR_MDIS_WIDTH                        1u
#define CSE_CR_MDIS(x)                           (((uint32_t)(((uint32_t)(x))<<CSE_CR_MDIS_SHIFT))&CSE_CR_MDIS_MASK)
#define CSE_CR_SFE_MASK                          0x10u
#define CSE_CR_SFE_SHIFT                         4u
#define CSE_CR_SFE_WIDTH                         1u
#define CSE_CR_SFE(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_CR_SFE_SHIFT))&CSE_CR_SFE_MASK)
#define CSE_CR_KBS_MASK                          0x20u
#define CSE_CR_KBS_SHIFT                         5u
#define CSE_CR_KBS_WIDTH                         1u
#define CSE_CR_KBS(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_CR_KBS_SHIFT))&CSE_CR_KBS_MASK)
#define CSE_CR_DIV_MASK                          0xFF00u
#define CSE_CR_DIV_SHIFT                         8u
#define CSE_CR_DIV_WIDTH                         8u
#define CSE_CR_DIV(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_CR_DIV_SHIFT))&CSE_CR_DIV_MASK)
/* SR Bit Fields */
#define CSE_SR_BSY_MASK                          0x1u
#define CSE_SR_BSY_SHIFT                         0u
#define CSE_SR_BSY_WIDTH                         1u
#define CSE_SR_BSY(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_BSY_SHIFT))&CSE_SR_BSY_MASK)
#define CSE_SR_SB_MASK                           0x2u
#define CSE_SR_SB_SHIFT                          1u
#define CSE_SR_SB_WIDTH                          1u
#define CSE_SR_SB(x)                             (((uint32_t)(((uint32_t)(x))<<CSE_SR_SB_SHIFT))&CSE_SR_SB_MASK)
#define CSE_SR_BIN_MASK                          0x4u
#define CSE_SR_BIN_SHIFT                         2u
#define CSE_SR_BIN_WIDTH                         1u
#define CSE_SR_BIN(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_BIN_SHIFT))&CSE_SR_BIN_MASK)
#define CSE_SR_BFN_MASK                          0x8u
#define CSE_SR_BFN_SHIFT                         3u
#define CSE_SR_BFN_WIDTH                         1u
#define CSE_SR_BFN(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_BFN_SHIFT))&CSE_SR_BFN_MASK)
#define CSE_SR_BOK_MASK                          0x10u
#define CSE_SR_BOK_SHIFT                         4u
#define CSE_SR_BOK_WIDTH                         1u
#define CSE_SR_BOK(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_BOK_SHIFT))&CSE_SR_BOK_MASK)
#define CSE_SR_RIN_MASK                          0x20u
#define CSE_SR_RIN_SHIFT                         5u
#define CSE_SR_RIN_WIDTH                         1u
#define CSE_SR_RIN(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_RIN_SHIFT))&CSE_SR_RIN_MASK)
#define CSE_SR_EDB_MASK                          0x40u
#define CSE_SR_EDB_SHIFT                         6u
#define CSE_SR_EDB_WIDTH                         1u
#define CSE_SR_EDB(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_EDB_SHIFT))&CSE_SR_EDB_MASK)
#define CSE_SR_IDB_MASK                          0x80u
#define CSE_SR_IDB_SHIFT                         7u
#define CSE_SR_IDB_WIDTH                         1u
#define CSE_SR_IDB(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_SR_IDB_SHIFT))&CSE_SR_IDB_MASK)
#define CSE_SR_EX_MASK                           0x100u
#define CSE_SR_EX_SHIFT                          8u
#define CSE_SR_EX_WIDTH                          1u
#define CSE_SR_EX(x)                             (((uint32_t)(((uint32_t)(x))<<CSE_SR_EX_SHIFT))&CSE_SR_EX_MASK)
/* IR Bit Fields */
#define CSE_IR_CIF_MASK                          0x1u
#define CSE_IR_CIF_SHIFT                         0u
#define CSE_IR_CIF_WIDTH                         1u
#define CSE_IR_CIF(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_IR_CIF_SHIFT))&CSE_IR_CIF_MASK)
/* ECR Bit Fields */
#define CSE_ECR_EC_MASK                          0x1Fu
#define CSE_ECR_EC_SHIFT                         0u
#define CSE_ECR_EC_WIDTH                         5u
#define CSE_ECR_EC(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_ECR_EC_SHIFT))&CSE_ECR_EC_MASK)
/* CMD Bit Fields */
#define CSE_CMD_CMD_MASK                         0x1Fu
#define CSE_CMD_CMD_SHIFT                        0u
#define CSE_CMD_CMD_WIDTH                        5u
#define CSE_CMD_CMD(x)                           (((uint32_t)(((uint32_t)(x))<<CSE_CMD_CMD_SHIFT))&CSE_CMD_CMD_MASK)
/* P Bit Fields */
#define CSE_P_PARM_MASK                          0xFFFFFFFFu
#define CSE_P_PARM_SHIFT                         0u
#define CSE_P_PARM_WIDTH                         32u
#define CSE_P_PARM(x)                            (((uint32_t)(((uint32_t)(x))<<CSE_P_PARM_SHIFT))&CSE_P_PARM_MASK)

/*!
 * @}
 */ /* end of group CSE_Register_Masks */


/*!
 * @}
 */ /* end of group CSE_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DECFILTER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DECFILTER_Peripheral_Access_Layer DECFILTER Peripheral Access Layer
 * @{
 */


