neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** DECFILTER - Size of Registers Arrays */
#define DECFILTER_COEF_COUNT                     9u
#define DECFILTER_TAP_COUNT                      8u

/** DECFILTER - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t MSR;                               /**< Module Status Register, offset: 0x4 */
  __IO uint32_t MXCR;                              /**< Module Extended Config Register, offset: 0x8 */
  __IO uint32_t MXSR;                              /**< Module Extended Status Register, offset: 0xC */
  __IO uint32_t IB;                                /**< Interface Input Buffer, offset: 0x10 */
  __I  uint32_t OB;                                /**< Interface Output Buffer, offset: 0x14 */
       uint8_t RESERVED_0[8];
  __IO uint32_t COEF[DECFILTER_COEF_COUNT];        /**< Filter Coefficient, array offset: 0x20, array step: 0x4 */
       uint8_t RESERVED_1[52];
  __I  uint32_t TAP[DECFILTER_TAP_COUNT];          /**< Filter TAP, array offset: 0x78, array step: 0x4 */
       uint8_t RESERVED_2[56];
  __I  uint32_t EDID;                              /**< Enhanced Debug Input Data, offset: 0xD0 */
       uint8_t RESERVED_3[12];
  __I  uint32_t FINTVAL;                           /**< Final Integer Value Register, offset: 0xE0 */
  __I  uint32_t FINTCNT;                           /**< Final Integer Count Register, offset: 0xE4 */
  __I  uint32_t CINTVAL;                           /**< Current Integer Value Register, offset: 0xE8 */
  __I  uint32_t CINTCNT;                           /**< Current Integer Count Register, offset: 0xEC */
} DECFILTER_Type, *DECFILTER_MemMapPtr;

 /** Number of instances of the DECFILTER module. */
#define DECFILTER_INSTANCE_COUNT                 (12u)


/* DECFILTER - Peripheral instance base addresses */
/** Peripheral DECFILTER_0 base address */
#define DECFILTER_0_BASE                         (0xFFF88000u)
/** Peripheral DECFILTER_0 base pointer */
#define DECFILTER_0                              ((DECFILTER_Type *)DECFILTER_0_BASE)
/** Peripheral DECFILTER_1 base address */
#define DECFILTER_1_BASE                         (0xFFF88800u)
/** Peripheral DECFILTER_1 base pointer */
#define DECFILTER_1                              ((DECFILTER_Type *)DECFILTER_1_BASE)
/** Peripheral DECFILTER_10 base address */
#define DECFILTER_10_BASE                        (0xFFF8D000u)
/** Peripheral DECFILTER_10 base pointer */
#define DECFILTER_10                             ((DECFILTER_Type *)DECFILTER_10_BASE)
/** Peripheral DECFILTER_11 base address */
#define DECFILTER_11_BASE                        (0xFFF8D800u)
/** Peripheral DECFILTER_11 base pointer */
#define DECFILTER_11                             ((DECFILTER_Type *)DECFILTER_11_BASE)
/** Peripheral DECFILTER_2 base address */
#define DECFILTER_2_BASE                         (0xFFF89000u)
/** Peripheral DECFILTER_2 base pointer */
#define DECFILTER_2                              ((DECFILTER_Type *)DECFILTER_2_BASE)
/** Peripheral DECFILTER_3 base address */
#define DECFILTER_3_BASE                         (0xFFF89800u)
/** Peripheral DECFILTER_3 base pointer */
#define DECFILTER_3                              ((DECFILTER_Type *)DECFILTER_3_BASE)
/** Peripheral DECFILTER_4 base address */
#define DECFILTER_4_BASE                         (0xFFF8A000u)
/** Peripheral DECFILTER_4 base pointer */
#define DECFILTER_4                              ((DECFILTER_Type *)DECFILTER_4_BASE)
/** Peripheral DECFILTER_5 base address */
#define DECFILTER_5_BASE                         (0xFFF8A800u)
/** Peripheral DECFILTER_5 base pointer */
#define DECFILTER_5                              ((DECFILTER_Type *)DECFILTER_5_BASE)
/** Peripheral DECFILTER_6 base address */
#define DECFILTER_6_BASE                         (0xFFF8B000u)
/** Peripheral DECFILTER_6 base pointer */
#define DECFILTER_6                              ((DECFILTER_Type *)DECFILTER_6_BASE)
/** Peripheral DECFILTER_7 base address */
#define DECFILTER_7_BASE                         (0xFFF8B800u)
/** Peripheral DECFILTER_7 base pointer */
#define DECFILTER_7                              ((DECFILTER_Type *)DECFILTER_7_BASE)
/** Peripheral DECFILTER_8 base address */
#define DECFILTER_8_BASE                         (0xFFF8C000u)
/** Peripheral DECFILTER_8 base pointer */
#define DECFILTER_8                              ((DECFILTER_Type *)DECFILTER_8_BASE)
/** Peripheral DECFILTER_9 base address */
#define DECFILTER_9_BASE                         (0xFFF8C800u)
/** Peripheral DECFILTER_9 base pointer */
#define DECFILTER_9                              ((DECFILTER_Type *)DECFILTER_9_BASE)
/** Array initializer of DECFILTER peripheral base addresses */
#define DECFILTER_BASE_ADDRS                     { DECFILTER_0_BASE, DECFILTER_1_BASE, DECFILTER_2_BASE, DECFILTER_3_BASE, DECFILTER_4_BASE, DECFILTER_5_BASE, DECFILTER_6_BASE, DECFILTER_7_BASE, DECFILTER_8_BASE, DECFILTER_9_BASE, DECFILTER_10_BASE, DECFILTER_11_BASE }
/** Array initializer of DECFILTER peripheral base pointers */
#define DECFILTER_BASE_PTRS                      { DECFILTER_0, DECFILTER_1, DECFILTER_2, DECFILTER_3, DECFILTER_4, DECFILTER_5, DECFILTER_6, DECFILTER_7, DECFILTER_8, DECFILTER_9, DECFILTER_10, DECFILTER_11 }

/* ----------------------------------------------------------------------------
   -- DECFILTER Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DECFILTER_Register_Masks DECFILTER Register Masks
 * @{
 */

/* MCR Bit Fields */
#define DECFILTER_MCR_TMODE_MASK                 0x3u
#define DECFILTER_MCR_TMODE_SHIFT                0u
#define DECFILTER_MCR_TMODE_WIDTH                2u
#define DECFILTER_MCR_TMODE(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_TMODE_SHIFT))&DECFILTER_MCR_TMODE_MASK)
#define DECFILTER_MCR_TORE_MASK                  0x4u
#define DECFILTER_MCR_TORE_SHIFT                 2u
#define DECFILTER_MCR_TORE_WIDTH                 1u
#define DECFILTER_MCR_TORE(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_TORE_SHIFT))&DECFILTER_MCR_TORE_MASK)
#define DECFILTER_MCR_EDME_MASK                  0x8u
#define DECFILTER_MCR_EDME_SHIFT                 3u
#define DECFILTER_MCR_EDME_WIDTH                 1u
#define DECFILTER_MCR_EDME(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_EDME_SHIFT))&DECFILTER_MCR_EDME_MASK)
#define DECFILTER_MCR_OBIE_MASK                  0x10u
#define DECFILTER_MCR_OBIE_SHIFT                 4u
#define DECFILTER_MCR_OBIE_WIDTH                 1u
#define DECFILTER_MCR_OBIE(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_OBIE_SHIFT))&DECFILTER_MCR_OBIE_MASK)
#define DECFILTER_MCR_IBIE_MASK                  0x20u
#define DECFILTER_MCR_IBIE_SHIFT                 5u
#define DECFILTER_MCR_IBIE_WIDTH                 1u
#define DECFILTER_MCR_IBIE(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_IBIE_SHIFT))&DECFILTER_MCR_IBIE_MASK)
#define DECFILTER_MCR_DSEL_MASK                  0x40u
#define DECFILTER_MCR_DSEL_SHIFT                 6u
#define DECFILTER_MCR_DSEL_WIDTH                 1u
#define DECFILTER_MCR_DSEL(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_DSEL_SHIFT))&DECFILTER_MCR_DSEL_MASK)
#define DECFILTER_MCR_SDIE_MASK                  0x80u
#define DECFILTER_MCR_SDIE_SHIFT                 7u
#define DECFILTER_MCR_SDIE_WIDTH                 1u
#define DECFILTER_MCR_SDIE(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_SDIE_SHIFT))&DECFILTER_MCR_SDIE_MASK)
#define DECFILTER_MCR_DEC_RATE_MASK              0xF00u
#define DECFILTER_MCR_DEC_RATE_SHIFT             8u
#define DECFILTER_MCR_DEC_RATE_WIDTH             4u
#define DECFILTER_MCR_DEC_RATE(x)                (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_DEC_RATE_SHIFT))&DECFILTER_MCR_DEC_RATE_MASK)
#define DECFILTER_MCR_MIXM_MASK                  0x1000u
#define DECFILTER_MCR_MIXM_SHIFT                 12u
#define DECFILTER_MCR_MIXM_WIDTH                 1u
#define DECFILTER_MCR_MIXM(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_MIXM_SHIFT))&DECFILTER_MCR_MIXM_MASK)
#define DECFILTER_MCR_ISEL_MASK                  0x2000u
#define DECFILTER_MCR_ISEL_SHIFT                 13u
#define DECFILTER_MCR_ISEL_WIDTH                 1u
#define DECFILTER_MCR_ISEL(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_ISEL_SHIFT))&DECFILTER_MCR_ISEL_MASK)
#define DECFILTER_MCR_SAT_MASK                   0x4000u
#define DECFILTER_MCR_SAT_SHIFT                  14u
#define DECFILTER_MCR_SAT_WIDTH                  1u
#define DECFILTER_MCR_SAT(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_SAT_SHIFT))&DECFILTER_MCR_SAT_MASK)
#define DECFILTER_MCR_IDIS_MASK                  0x8000u
#define DECFILTER_MCR_IDIS_SHIFT                 15u
#define DECFILTER_MCR_IDIS_WIDTH                 1u
#define DECFILTER_MCR_IDIS(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_IDIS_SHIFT))&DECFILTER_MCR_IDIS_MASK)
#define DECFILTER_MCR_SCAL_MASK                  0x30000u
#define DECFILTER_MCR_SCAL_SHIFT                 16u
#define DECFILTER_MCR_SCAL_WIDTH                 2u
#define DECFILTER_MCR_SCAL(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_SCAL_SHIFT))&DECFILTER_MCR_SCAL_MASK)
#define DECFILTER_MCR_FTYPE_MASK                 0x180000u
#define DECFILTER_MCR_FTYPE_SHIFT                19u
#define DECFILTER_MCR_FTYPE_WIDTH                2u
#define DECFILTER_MCR_FTYPE(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_FTYPE_SHIFT))&DECFILTER_MCR_FTYPE_MASK)
#define DECFILTER_MCR_ERREN_MASK                 0x400000u
#define DECFILTER_MCR_ERREN_SHIFT                22u
#define DECFILTER_MCR_ERREN_WIDTH                1u
#define DECFILTER_MCR_ERREN(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_ERREN_SHIFT))&DECFILTER_MCR_ERREN_MASK)
#define DECFILTER_MCR_ODEN_MASK                  0x800000u
#define DECFILTER_MCR_ODEN_SHIFT                 23u
#define DECFILTER_MCR_ODEN_WIDTH                 1u
#define DECFILTER_MCR_ODEN(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_ODEN_SHIFT))&DECFILTER_MCR_ODEN_MASK)
#define DECFILTER_MCR_IDEN_MASK                  0x1000000u
#define DECFILTER_MCR_IDEN_SHIFT                 24u
#define DECFILTER_MCR_IDEN_WIDTH                 1u
#define DECFILTER_MCR_IDEN(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_IDEN_SHIFT))&DECFILTER_MCR_IDEN_MASK)
#define DECFILTER_MCR_CASCD_MASK                 0x6000000u
#define DECFILTER_MCR_CASCD_SHIFT                25u
#define DECFILTER_MCR_CASCD_WIDTH                2u
#define DECFILTER_MCR_CASCD(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_CASCD_SHIFT))&DECFILTER_MCR_CASCD_MASK)
#define DECFILTER_MCR_SRES_MASK                  0x8000000u
#define DECFILTER_MCR_SRES_SHIFT                 27u
#define DECFILTER_MCR_SRES_WIDTH                 1u
#define DECFILTER_MCR_SRES(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_SRES_SHIFT))&DECFILTER_MCR_SRES_MASK)
#define DECFILTER_MCR_FRZ_MASK                   0x10000000u
#define DECFILTER_MCR_FRZ_SHIFT                  28u
#define DECFILTER_MCR_FRZ_WIDTH                  1u
#define DECFILTER_MCR_FRZ(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_FRZ_SHIFT))&DECFILTER_MCR_FRZ_MASK)
#define DECFILTER_MCR_FREN_MASK                  0x40000000u
#define DECFILTER_MCR_FREN_SHIFT                 30u
#define DECFILTER_MCR_FREN_WIDTH                 1u
#define DECFILTER_MCR_FREN(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_FREN_SHIFT))&DECFILTER_MCR_FREN_MASK)
#define DECFILTER_MCR_MDIS_MASK                  0x80000000u
#define DECFILTER_MCR_MDIS_SHIFT                 31u
#define DECFILTER_MCR_MDIS_WIDTH                 1u
#define DECFILTER_MCR_MDIS(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MCR_MDIS_SHIFT))&DECFILTER_MCR_MDIS_MASK)
/* MSR Bit Fields */
#define DECFILTER_MSR_IVR_MASK                   0x1u
#define DECFILTER_MSR_IVR_SHIFT                  0u
#define DECFILTER_MSR_IVR_WIDTH                  1u
#define DECFILTER_MSR_IVR(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_IVR_SHIFT))&DECFILTER_MSR_IVR_MASK)
#define DECFILTER_MSR_OVR_MASK                   0x2u
#define DECFILTER_MSR_OVR_SHIFT                  1u
#define DECFILTER_MSR_OVR_WIDTH                  1u
#define DECFILTER_MSR_OVR(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_OVR_SHIFT))&DECFILTER_MSR_OVR_MASK)
#define DECFILTER_MSR_OVF_MASK                   0x4u
#define DECFILTER_MSR_OVF_SHIFT                  2u
#define DECFILTER_MSR_OVF_WIDTH                  1u
#define DECFILTER_MSR_OVF(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_OVF_SHIFT))&DECFILTER_MSR_OVF_MASK)
#define DECFILTER_MSR_DIVR_MASK                  0x8u
#define DECFILTER_MSR_DIVR_SHIFT                 3u
#define DECFILTER_MSR_DIVR_WIDTH                 1u
#define DECFILTER_MSR_DIVR(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_DIVR_SHIFT))&DECFILTER_MSR_DIVR_MASK)
#define DECFILTER_MSR_OBIF_MASK                  0x20u
#define DECFILTER_MSR_OBIF_SHIFT                 5u
#define DECFILTER_MSR_OBIF_WIDTH                 1u
#define DECFILTER_MSR_OBIF(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_OBIF_SHIFT))&DECFILTER_MSR_OBIF_MASK)
#define DECFILTER_MSR_IBIF_MASK                  0x40u
#define DECFILTER_MSR_IBIF_SHIFT                 6u
#define DECFILTER_MSR_IBIF_WIDTH                 1u
#define DECFILTER_MSR_IBIF(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_IBIF_SHIFT))&DECFILTER_MSR_IBIF_MASK)
#define DECFILTER_MSR_ODF_MASK                   0x100u
#define DECFILTER_MSR_ODF_SHIFT                  8u
#define DECFILTER_MSR_ODF_WIDTH                  1u
#define DECFILTER_MSR_ODF(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_ODF_SHIFT))&DECFILTER_MSR_ODF_MASK)
#define DECFILTER_MSR_IDF_MASK                   0x200u
#define DECFILTER_MSR_IDF_SHIFT                  9u
#define DECFILTER_MSR_IDF_WIDTH                  1u
#define DECFILTER_MSR_IDF(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_IDF_SHIFT))&DECFILTER_MSR_IDF_MASK)
#define DECFILTER_MSR_IVRC_MASK                  0x10000u
#define DECFILTER_MSR_IVRC_SHIFT                 16u
#define DECFILTER_MSR_IVRC_WIDTH                 1u
#define DECFILTER_MSR_IVRC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_IVRC_SHIFT))&DECFILTER_MSR_IVRC_MASK)
#define DECFILTER_MSR_OVRC_MASK                  0x20000u
#define DECFILTER_MSR_OVRC_SHIFT                 17u
#define DECFILTER_MSR_OVRC_WIDTH                 1u
#define DECFILTER_MSR_OVRC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_OVRC_SHIFT))&DECFILTER_MSR_OVRC_MASK)
#define DECFILTER_MSR_OVFC_MASK                  0x40000u
#define DECFILTER_MSR_OVFC_SHIFT                 18u
#define DECFILTER_MSR_OVFC_WIDTH                 1u
#define DECFILTER_MSR_OVFC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_OVFC_SHIFT))&DECFILTER_MSR_OVFC_MASK)
#define DECFILTER_MSR_DIVRC_MASK                 0x80000u
#define DECFILTER_MSR_DIVRC_SHIFT                19u
#define DECFILTER_MSR_DIVRC_WIDTH                1u
#define DECFILTER_MSR_DIVRC(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_DIVRC_SHIFT))&DECFILTER_MSR_DIVRC_MASK)
#define DECFILTER_MSR_OBIC_MASK                  0x200000u
#define DECFILTER_MSR_OBIC_SHIFT                 21u
#define DECFILTER_MSR_OBIC_WIDTH                 1u
#define DECFILTER_MSR_OBIC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_OBIC_SHIFT))&DECFILTER_MSR_OBIC_MASK)
#define DECFILTER_MSR_IBIC_MASK                  0x400000u
#define DECFILTER_MSR_IBIC_SHIFT                 22u
#define DECFILTER_MSR_IBIC_WIDTH                 1u
#define DECFILTER_MSR_IBIC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_IBIC_SHIFT))&DECFILTER_MSR_IBIC_MASK)
#define DECFILTER_MSR_ODFC_MASK                  0x1000000u
#define DECFILTER_MSR_ODFC_SHIFT                 24u
#define DECFILTER_MSR_ODFC_WIDTH                 1u
#define DECFILTER_MSR_ODFC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_ODFC_SHIFT))&DECFILTER_MSR_ODFC_MASK)
#define DECFILTER_MSR_IDFC_MASK                  0x2000000u
#define DECFILTER_MSR_IDFC_SHIFT                 25u
#define DECFILTER_MSR_IDFC_WIDTH                 1u
#define DECFILTER_MSR_IDFC(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_IDFC_SHIFT))&DECFILTER_MSR_IDFC_MASK)
#define DECFILTER_MSR_DEC_COUNTER_MASK           0x3C000000u
#define DECFILTER_MSR_DEC_COUNTER_SHIFT          26u
#define DECFILTER_MSR_DEC_COUNTER_WIDTH          4u
#define DECFILTER_MSR_DEC_COUNTER(x)             (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_DEC_COUNTER_SHIFT))&DECFILTER_MSR_DEC_COUNTER_MASK)
#define DECFILTER_MSR_BSY_MASK                   0x80000000u
#define DECFILTER_MSR_BSY_SHIFT                  31u
#define DECFILTER_MSR_BSY_WIDTH                  1u
#define DECFILTER_MSR_BSY(x)                     (((uint32_t)(((uint32_t)(x))<<DECFILTER_MSR_BSY_SHIFT))&DECFILTER_MSR_BSY_MASK)
/* MXCR Bit Fields */
#define DECFILTER_MXCR_SENSEL_MASK               0x3u
#define DECFILTER_MXCR_SENSEL_SHIFT              0u
#define DECFILTER_MXCR_SENSEL_WIDTH              2u
#define DECFILTER_MXCR_SENSEL(x)                 (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SENSEL_SHIFT))&DECFILTER_MXCR_SENSEL_MASK)
#define DECFILTER_MXCR_SRQSEL_MASK               0x70u
#define DECFILTER_MXCR_SRQSEL_SHIFT              4u
#define DECFILTER_MXCR_SRQSEL_WIDTH              3u
#define DECFILTER_MXCR_SRQSEL(x)                 (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SRQSEL_SHIFT))&DECFILTER_MXCR_SRQSEL_MASK)
#define DECFILTER_MXCR_SHLTSEL_MASK              0x300u
#define DECFILTER_MXCR_SHLTSEL_SHIFT             8u
#define DECFILTER_MXCR_SHLTSEL_WIDTH             2u
#define DECFILTER_MXCR_SHLTSEL(x)                (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SHLTSEL_SHIFT))&DECFILTER_MXCR_SHLTSEL_MASK)
#define DECFILTER_MXCR_SZROSEL_MASK              0x3000u
#define DECFILTER_MXCR_SZROSEL_SHIFT             12u
#define DECFILTER_MXCR_SZROSEL_WIDTH             2u
#define DECFILTER_MXCR_SZROSEL(x)                (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SZROSEL_SHIFT))&DECFILTER_MXCR_SZROSEL_MASK)
#define DECFILTER_MXCR_SISEL_MASK                0x8000u
#define DECFILTER_MXCR_SISEL_SHIFT               15u
#define DECFILTER_MXCR_SISEL_WIDTH               1u
#define DECFILTER_MXCR_SISEL(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SISEL_SHIFT))&DECFILTER_MXCR_SISEL_MASK)
#define DECFILTER_MXCR_SZRO_MASK                 0x10000u
#define DECFILTER_MXCR_SZRO_SHIFT                16u
#define DECFILTER_MXCR_SZRO_WIDTH                1u
#define DECFILTER_MXCR_SZRO(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SZRO_SHIFT))&DECFILTER_MXCR_SZRO_MASK)
#define DECFILTER_MXCR_SRQ_MASK                  0x20000u
#define DECFILTER_MXCR_SRQ_SHIFT                 17u
#define DECFILTER_MXCR_SRQ_WIDTH                 1u
#define DECFILTER_MXCR_SRQ(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SRQ_SHIFT))&DECFILTER_MXCR_SRQ_MASK)
#define DECFILTER_MXCR_SCSAT_MASK                0x10000000u
#define DECFILTER_MXCR_SCSAT_SHIFT               28u
#define DECFILTER_MXCR_SCSAT_WIDTH               1u
#define DECFILTER_MXCR_SCSAT(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SCSAT_SHIFT))&DECFILTER_MXCR_SCSAT_MASK)
#define DECFILTER_MXCR_SSAT_MASK                 0x20000000u
#define DECFILTER_MXCR_SSAT_SHIFT                29u
#define DECFILTER_MXCR_SSAT_WIDTH                1u
#define DECFILTER_MXCR_SSAT(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SSAT_SHIFT))&DECFILTER_MXCR_SSAT_MASK)
#define DECFILTER_MXCR_SSIG_MASK                 0x40000000u
#define DECFILTER_MXCR_SSIG_SHIFT                30u
#define DECFILTER_MXCR_SSIG_WIDTH                1u
#define DECFILTER_MXCR_SSIG(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SSIG_SHIFT))&DECFILTER_MXCR_SSIG_MASK)
#define DECFILTER_MXCR_SDMAE_MASK                0x80000000u
#define DECFILTER_MXCR_SDMAE_SHIFT               31u
#define DECFILTER_MXCR_SDMAE_WIDTH               1u
#define DECFILTER_MXCR_SDMAE(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXCR_SDMAE_SHIFT))&DECFILTER_MXCR_SDMAE_MASK)
/* MXSR Bit Fields */
#define DECFILTER_MXSR_SVR_MASK                  0x1u
#define DECFILTER_MXSR_SVR_SHIFT                 0u
#define DECFILTER_MXSR_SVR_WIDTH                 1u
#define DECFILTER_MXSR_SVR(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SVR_SHIFT))&DECFILTER_MXSR_SVR_MASK)
#define DECFILTER_MXSR_SCOVF_MASK                0x2u
#define DECFILTER_MXSR_SCOVF_SHIFT               1u
#define DECFILTER_MXSR_SCOVF_WIDTH               1u
#define DECFILTER_MXSR_SCOVF(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SCOVF_SHIFT))&DECFILTER_MXSR_SCOVF_MASK)
#define DECFILTER_MXSR_SSOVF_MASK                0x4u
#define DECFILTER_MXSR_SSOVF_SHIFT               2u
#define DECFILTER_MXSR_SSOVF_WIDTH               1u
#define DECFILTER_MXSR_SSOVF(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SSOVF_SHIFT))&DECFILTER_MXSR_SSOVF_MASK)
#define DECFILTER_MXSR_SCE_MASK                  0x10u
#define DECFILTER_MXSR_SCE_SHIFT                 4u
#define DECFILTER_MXSR_SCE_WIDTH                 1u
#define DECFILTER_MXSR_SCE(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SCE_SHIFT))&DECFILTER_MXSR_SCE_MASK)
#define DECFILTER_MXSR_SSE_MASK                  0x20u
#define DECFILTER_MXSR_SSE_SHIFT                 5u
#define DECFILTER_MXSR_SSE_WIDTH                 1u
#define DECFILTER_MXSR_SSE(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SSE_SHIFT))&DECFILTER_MXSR_SSE_MASK)
#define DECFILTER_MXSR_SDF_MASK                  0x100u
#define DECFILTER_MXSR_SDF_SHIFT                 8u
#define DECFILTER_MXSR_SDF_WIDTH                 1u
#define DECFILTER_MXSR_SDF(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SDF_SHIFT))&DECFILTER_MXSR_SDF_MASK)
#define DECFILTER_MXSR_SVRC_MASK                 0x10000u
#define DECFILTER_MXSR_SVRC_SHIFT                16u
#define DECFILTER_MXSR_SVRC_WIDTH                1u
#define DECFILTER_MXSR_SVRC(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SVRC_SHIFT))&DECFILTER_MXSR_SVRC_MASK)
#define DECFILTER_MXSR_SCOVFC_MASK               0x20000u
#define DECFILTER_MXSR_SCOVFC_SHIFT              17u
#define DECFILTER_MXSR_SCOVFC_WIDTH              1u
#define DECFILTER_MXSR_SCOVFC(x)                 (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SCOVFC_SHIFT))&DECFILTER_MXSR_SCOVFC_MASK)
#define DECFILTER_MXSR_SSOVFC_MASK               0x40000u
#define DECFILTER_MXSR_SSOVFC_SHIFT              18u
#define DECFILTER_MXSR_SSOVFC_WIDTH              1u
#define DECFILTER_MXSR_SSOVFC(x)                 (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SSOVFC_SHIFT))&DECFILTER_MXSR_SSOVFC_MASK)
#define DECFILTER_MXSR_SCEC_MASK                 0x100000u
#define DECFILTER_MXSR_SCEC_SHIFT                20u
#define DECFILTER_MXSR_SCEC_WIDTH                1u
#define DECFILTER_MXSR_SCEC(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SCEC_SHIFT))&DECFILTER_MXSR_SCEC_MASK)
#define DECFILTER_MXSR_SSEC_MASK                 0x200000u
#define DECFILTER_MXSR_SSEC_SHIFT                21u
#define DECFILTER_MXSR_SSEC_WIDTH                1u
#define DECFILTER_MXSR_SSEC(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SSEC_SHIFT))&DECFILTER_MXSR_SSEC_MASK)
#define DECFILTER_MXSR_SDFC_MASK                 0x1000000u
