neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define DECFILTER_MXSR_SDFC_SHIFT                24u
#define DECFILTER_MXSR_SDFC_WIDTH                1u
#define DECFILTER_MXSR_SDFC(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_MXSR_SDFC_SHIFT))&DECFILTER_MXSR_SDFC_MASK)
/* IB Bit Fields */
#define DECFILTER_IB_INPBUF_MASK                 0xFFFFu
#define DECFILTER_IB_INPBUF_SHIFT                0u
#define DECFILTER_IB_INPBUF_WIDTH                16u
#define DECFILTER_IB_INPBUF(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_IB_INPBUF_SHIFT))&DECFILTER_IB_INPBUF_MASK)
#define DECFILTER_IB_FLUSH_MASK                  0x10000u
#define DECFILTER_IB_FLUSH_SHIFT                 16u
#define DECFILTER_IB_FLUSH_WIDTH                 1u
#define DECFILTER_IB_FLUSH(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_IB_FLUSH_SHIFT))&DECFILTER_IB_FLUSH_MASK)
#define DECFILTER_IB_PREFILL_MASK                0x20000u
#define DECFILTER_IB_PREFILL_SHIFT               17u
#define DECFILTER_IB_PREFILL_WIDTH               1u
#define DECFILTER_IB_PREFILL(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_IB_PREFILL_SHIFT))&DECFILTER_IB_PREFILL_MASK)
#define DECFILTER_IB_INTAG_MASK                  0xF000000u
#define DECFILTER_IB_INTAG_SHIFT                 24u
#define DECFILTER_IB_INTAG_WIDTH                 4u
#define DECFILTER_IB_INTAG(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_IB_INTAG_SHIFT))&DECFILTER_IB_INTAG_MASK)
#define DECFILTER_IB_PSIOSEL_MASK                0x10000000u
#define DECFILTER_IB_PSIOSEL_SHIFT               28u
#define DECFILTER_IB_PSIOSEL_WIDTH               1u
#define DECFILTER_IB_PSIOSEL(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_IB_PSIOSEL_SHIFT))&DECFILTER_IB_PSIOSEL_MASK)
/* OB Bit Fields */
#define DECFILTER_OB_OUTBUF_MASK                 0xFFFFu
#define DECFILTER_OB_OUTBUF_SHIFT                0u
#define DECFILTER_OB_OUTBUF_WIDTH                16u
#define DECFILTER_OB_OUTBUF(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_OB_OUTBUF_SHIFT))&DECFILTER_OB_OUTBUF_MASK)
#define DECFILTER_OB_OUTTAG_MASK                 0xF0000u
#define DECFILTER_OB_OUTTAG_SHIFT                16u
#define DECFILTER_OB_OUTTAG_WIDTH                4u
#define DECFILTER_OB_OUTTAG(x)                   (((uint32_t)(((uint32_t)(x))<<DECFILTER_OB_OUTTAG_SHIFT))&DECFILTER_OB_OUTTAG_MASK)
#define DECFILTER_OB_PSIOSEL_MASK                0x100000u
#define DECFILTER_OB_PSIOSEL_SHIFT               20u
#define DECFILTER_OB_PSIOSEL_WIDTH               1u
#define DECFILTER_OB_PSIOSEL(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_OB_PSIOSEL_SHIFT))&DECFILTER_OB_PSIOSEL_MASK)
/* COEF Bit Fields */
#define DECFILTER_COEF_COEFn_MASK                0xFFFFFFu
#define DECFILTER_COEF_COEFn_SHIFT               0u
#define DECFILTER_COEF_COEFn_WIDTH               24u
#define DECFILTER_COEF_COEFn(x)                  (((uint32_t)(((uint32_t)(x))<<DECFILTER_COEF_COEFn_SHIFT))&DECFILTER_COEF_COEFn_MASK)
#define DECFILTER_COEF_COEFnSIGNR_MASK           0xFF000000u
#define DECFILTER_COEF_COEFnSIGNR_SHIFT          24u
#define DECFILTER_COEF_COEFnSIGNR_WIDTH          8u
#define DECFILTER_COEF_COEFnSIGNR(x)             (((uint32_t)(((uint32_t)(x))<<DECFILTER_COEF_COEFnSIGNR_SHIFT))&DECFILTER_COEF_COEFnSIGNR_MASK)
/* TAP Bit Fields */
#define DECFILTER_TAP_TAPn_MASK                  0xFFFFFFu
#define DECFILTER_TAP_TAPn_SHIFT                 0u
#define DECFILTER_TAP_TAPn_WIDTH                 24u
#define DECFILTER_TAP_TAPn(x)                    (((uint32_t)(((uint32_t)(x))<<DECFILTER_TAP_TAPn_SHIFT))&DECFILTER_TAP_TAPn_MASK)
#define DECFILTER_TAP_TAPnSIGNR_MASK             0xFF000000u
#define DECFILTER_TAP_TAPnSIGNR_SHIFT            24u
#define DECFILTER_TAP_TAPnSIGNR_WIDTH            8u
#define DECFILTER_TAP_TAPnSIGNR(x)               (((uint32_t)(((uint32_t)(x))<<DECFILTER_TAP_TAPnSIGNR_SHIFT))&DECFILTER_TAP_TAPnSIGNR_MASK)
/* EDID Bit Fields */
#define DECFILTER_EDID_SAMP_DATA_MASK            0xFFFFu
#define DECFILTER_EDID_SAMP_DATA_SHIFT           0u
#define DECFILTER_EDID_SAMP_DATA_WIDTH           16u
#define DECFILTER_EDID_SAMP_DATA(x)              (((uint32_t)(((uint32_t)(x))<<DECFILTER_EDID_SAMP_DATA_SHIFT))&DECFILTER_EDID_SAMP_DATA_MASK)
/* FINTVAL Bit Fields */
#define DECFILTER_FINTVAL_SUM_VALUE_MASK         0xFFFFFFFFu
#define DECFILTER_FINTVAL_SUM_VALUE_SHIFT        0u
#define DECFILTER_FINTVAL_SUM_VALUE_WIDTH        32u
#define DECFILTER_FINTVAL_SUM_VALUE(x)           (((uint32_t)(((uint32_t)(x))<<DECFILTER_FINTVAL_SUM_VALUE_SHIFT))&DECFILTER_FINTVAL_SUM_VALUE_MASK)
/* FINTCNT Bit Fields */
#define DECFILTER_FINTCNT_COUNT_MASK             0xFFFFFFFFu
#define DECFILTER_FINTCNT_COUNT_SHIFT            0u
#define DECFILTER_FINTCNT_COUNT_WIDTH            32u
#define DECFILTER_FINTCNT_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<DECFILTER_FINTCNT_COUNT_SHIFT))&DECFILTER_FINTCNT_COUNT_MASK)
/* CINTVAL Bit Fields */
#define DECFILTER_CINTVAL_SUM_VALUE_MASK         0xFFFFFFFFu
#define DECFILTER_CINTVAL_SUM_VALUE_SHIFT        0u
#define DECFILTER_CINTVAL_SUM_VALUE_WIDTH        32u
#define DECFILTER_CINTVAL_SUM_VALUE(x)           (((uint32_t)(((uint32_t)(x))<<DECFILTER_CINTVAL_SUM_VALUE_SHIFT))&DECFILTER_CINTVAL_SUM_VALUE_MASK)
/* CINTCNT Bit Fields */
#define DECFILTER_CINTCNT_COUNT_MASK             0xFFFFFFFFu
#define DECFILTER_CINTCNT_COUNT_SHIFT            0u
#define DECFILTER_CINTCNT_COUNT_WIDTH            32u
#define DECFILTER_CINTCNT_COUNT(x)               (((uint32_t)(((uint32_t)(x))<<DECFILTER_CINTCNT_COUNT_SHIFT))&DECFILTER_CINTCNT_COUNT_MASK)

/*!
 * @}
 */ /* end of group DECFILTER_Register_Masks */


/*!
 * @}
 */ /* end of group DECFILTER_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DMA Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Peripheral_Access_Layer DMA Peripheral Access Layer
 * @{
 */


/** DMA - Size of Registers Arrays */
#define DMA_GPOR_COUNT                           2u
#define DMA_DCHPRI_COUNT                         64u
#define DMA_TCD_COUNT                            64u

/** DMA - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< Control Register, offset: 0x0 */
  __I  uint32_t ES;                                /**< Error Status Register, offset: 0x4 */
  __IO uint32_t ERQH;                              /**< Enable Request Register High, offset: 0x8 */
  __IO uint32_t ERQL;                              /**< Enable Request Register Low, offset: 0xC */
  __IO uint32_t EEIH;                              /**< Enable Error Interrupt Register High, offset: 0x10 */
  __IO uint32_t EEIL;                              /**< Enable Error Interrupt Register Low, offset: 0x14 */
  __O  uint8_t SERQ;                               /**< Set Enable Request Register, offset: 0x18 */
  __O  uint8_t CERQ;                               /**< Clear Enable Request Register, offset: 0x19 */
  __O  uint8_t SEEI;                               /**< Set Enable Error Interrupt Register, offset: 0x1A */
  __O  uint8_t CEEI;                               /**< Clear Enable Error Interrupt Register, offset: 0x1B */
  __O  uint8_t CINT;                               /**< Clear Interrupt Request Register, offset: 0x1C */
  __O  uint8_t CERR;                               /**< Clear Error Register, offset: 0x1D */
  __O  uint8_t SSRT;                               /**< Set START Bit Register, offset: 0x1E */
  __O  uint8_t CDNE;                               /**< Clear DONE Status Bit Register, offset: 0x1F */
  __IO uint32_t INTH;                              /**< Interrupt Request Register High, offset: 0x20 */
  __IO uint32_t INTL;                              /**< Interrupt Request Register Low, offset: 0x24 */
  __IO uint32_t ERRH;                              /**< Error Register High, offset: 0x28 */
  __IO uint32_t ERRL;                              /**< Error Register Low, offset: 0x2C */
  __I  uint32_t HRSH;                              /**< Hardware Request Status Register High, offset: 0x30 */
  __I  uint32_t HRSL;                              /**< Hardware Request Status Register Low, offset: 0x34 */
  __IO uint32_t GPOR[DMA_GPOR_COUNT];              /**< Global PCU Output Register, array offset: 0x38, array step: 0x4 */
       uint8_t RESERVED_0[192];
  __IO uint8_t DCHPRI[DMA_DCHPRI_COUNT];           /**< Channel n Priority Register, array offset: 0x100, array step: 0x1 */
       uint8_t RESERVED_1[3776];
  struct {                                         /* offset: 0x1000, array step: 0x20 */
    __IO uint32_t SADDR;                             /**< TCD Source Address, array offset: 0x1000, array step: 0x20 */
    __IO uint16_t ATTR;                              /**< TCD Transfer Attributes, array offset: 0x1004, array step: 0x20 */
    __IO uint16_t SOFF;                              /**< TCD Signed Source Address Offset, array offset: 0x1006, array step: 0x20 */
    union {                                          /* offset: 0x1008, array step: 0x20 */
      __IO uint32_t MLNO;                              /**< TCD Minor Byte Count (Minor Loop Mapping Disabled), array offset: 0x1008, array step: 0x20 */
      __IO uint32_t MLOFFNO;                           /**< TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled), array offset: 0x1008, array step: 0x20 */
      __IO uint32_t MLOFFYES;                          /**< TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled), array offset: 0x1008, array step: 0x20 */
    } NBYTES;
    __IO uint32_t SLAST;                             /**< TCD Last Source Address Adjustment, array offset: 0x100C, array step: 0x20 */
    __IO uint32_t DADDR;                             /**< TCD Destination Address, array offset: 0x1010, array step: 0x20 */
    union {                                          /* offset: 0x1014, array step: 0x20 */
      __IO uint16_t ELINKNO;                           /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x1014, array step: 0x20 */
      __IO uint16_t ELINKYES;                          /**< TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x1014, array step: 0x20 */
    } CITER;
    __IO uint16_t DOFF;                              /**< TCD Signed Destination Address Offset, array offset: 0x1016, array step: 0x20 */
    __IO uint32_t DLASTSGA;                          /**< TCD Last Destination Address Adjustment/Scatter Gather Address, array offset: 0x1018, array step: 0x20 */
    union {                                          /* offset: 0x101C, array step: 0x20 */
      __IO uint16_t ELINKNO;                           /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled), array offset: 0x101C, array step: 0x20 */
      __IO uint16_t ELINKYES;                          /**< TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled), array offset: 0x101C, array step: 0x20 */
    } BITER;
    __IO uint16_t CSR;                               /**< TCD Control and Status, array offset: 0x101E, array step: 0x20 */
  } TCD[DMA_TCD_COUNT];
} DMA_Type, *DMA_MemMapPtr;

 /** Number of instances of the DMA module. */
#define DMA_INSTANCE_COUNT                       (2u)


/* DMA - Peripheral instance base addresses */
/** Peripheral DMA_0 base address */
#define DMA_0_BASE                               (0xFFF44000u)
/** Peripheral DMA_0 base pointer */
#define DMA_0                                    ((DMA_Type *)DMA_0_BASE)
/** Peripheral DMA_1 base address */
#define DMA_1_BASE                               (0xFFF54000u)
/** Peripheral DMA_1 base pointer */
#define DMA_1                                    ((DMA_Type *)DMA_1_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { DMA_0_BASE, DMA_1_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { DMA_0, DMA_1 }
/** Interrupt vectors for the DMA peripheral type */
#define DMA_CHN_IRQS                             { DMA0_0_IRQn,  DMA0_1_IRQn,  DMA0_2_IRQn,  DMA0_3_IRQn,  DMA0_4_IRQn,  DMA0_5_IRQn,  DMA0_6_IRQn,  DMA0_7_IRQn,  \
                                                   DMA0_8_IRQn,  DMA0_9_IRQn,  DMA0_10_IRQn, DMA0_11_IRQn, DMA0_12_IRQn, DMA0_13_IRQn, DMA0_14_IRQn, DMA0_15_IRQn, \
												   DMA0_16_IRQn, DMA0_17_IRQn, DMA0_18_IRQn, DMA0_19_IRQn, DMA0_20_IRQn, DMA0_21_IRQn, DMA0_22_IRQn, DMA0_23_IRQn, \
												   DMA0_24_IRQn, DMA0_25_IRQn, DMA0_26_IRQn, DMA0_27_IRQn, DMA0_28_IRQn, DMA0_29_IRQn, DMA0_30_IRQn, DMA0_31_IRQn, \
                                                   DMA0_32_IRQn, DMA0_33_IRQn, DMA0_34_IRQn, DMA0_35_IRQn, DMA0_36_IRQn, DMA0_37_IRQn, DMA0_38_IRQn, DMA0_39_IRQn, \
                                                   DMA0_40_IRQn, DMA0_41_IRQn, DMA0_42_IRQn, DMA0_43_IRQn, DMA0_44_IRQn, DMA0_45_IRQn, DMA0_46_IRQn, DMA0_47_IRQn, \
                                                   DMA0_48_IRQn, DMA0_49_IRQn, DMA0_50_IRQn, DMA0_51_IRQn, DMA0_52_IRQn, DMA0_53_IRQn, DMA0_54_IRQn, DMA0_55_IRQn, \
                                                   DMA0_56_IRQn, DMA0_57_IRQn, DMA0_58_IRQn, DMA0_59_IRQn, DMA0_60_IRQn, DMA0_61_IRQn, DMA0_62_IRQn, DMA0_63_IRQn, \
												   DMA1_0_IRQn,  DMA1_1_IRQn,  DMA1_2_IRQn,  DMA1_3_IRQn,  DMA1_4_IRQn,  DMA1_5_IRQn,  DMA1_6_IRQn,  DMA1_7_IRQn,  \
                                                   DMA1_8_IRQn,  DMA1_9_IRQn,  DMA1_10_IRQn, DMA1_11_IRQn, DMA1_12_IRQn, DMA1_13_IRQn, DMA1_14_IRQn, DMA1_15_IRQn, \
												   DMA1_16_IRQn, DMA1_17_IRQn, DMA1_18_IRQn, DMA1_19_IRQn, DMA1_20_IRQn, DMA1_21_IRQn, DMA1_22_IRQn, DMA1_23_IRQn, \
												   DMA1_24_IRQn, DMA1_25_IRQn, DMA1_26_IRQn, DMA1_27_IRQn, DMA1_28_IRQn, DMA1_29_IRQn, DMA1_30_IRQn, DMA1_31_IRQn, \
                                                   DMA1_32_39_IRQn, DMA1_40_47_IRQn, DMA1_48_55_IRQn, DMA1_56_63_IRQn}
#define DMA_ERROR_IRQS                           { DMA0_ERR0_31_IRQn, DMA0_ERR32_63_IRQn, DMA1_ERR0_31_IRQn, DMA1_ERR32_63_IRQn }

/* ----------------------------------------------------------------------------
   -- DMA Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DMA_Register_Masks DMA Register Masks
 * @{
 */

