neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* CR Bit Fields */
#define DMA_CR_EDBG_MASK                         0x2u
#define DMA_CR_EDBG_SHIFT                        1u
#define DMA_CR_EDBG_WIDTH                        1u
#define DMA_CR_EDBG(x)                           (((uint32_t)(((uint32_t)(x))<<DMA_CR_EDBG_SHIFT))&DMA_CR_EDBG_MASK)
#define DMA_CR_ERCA_MASK                         0x4u
#define DMA_CR_ERCA_SHIFT                        2u
#define DMA_CR_ERCA_WIDTH                        1u
#define DMA_CR_ERCA(x)                           (((uint32_t)(((uint32_t)(x))<<DMA_CR_ERCA_SHIFT))&DMA_CR_ERCA_MASK)
#define DMA_CR_ERGA_MASK                         0x8u
#define DMA_CR_ERGA_SHIFT                        3u
#define DMA_CR_ERGA_WIDTH                        1u
#define DMA_CR_ERGA(x)                           (((uint32_t)(((uint32_t)(x))<<DMA_CR_ERGA_SHIFT))&DMA_CR_ERGA_MASK)
#define DMA_CR_HOE_MASK                          0x10u
#define DMA_CR_HOE_SHIFT                         4u
#define DMA_CR_HOE_WIDTH                         1u
#define DMA_CR_HOE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_CR_HOE_SHIFT))&DMA_CR_HOE_MASK)
#define DMA_CR_HALT_MASK                         0x20u
#define DMA_CR_HALT_SHIFT                        5u
#define DMA_CR_HALT_WIDTH                        1u
#define DMA_CR_HALT(x)                           (((uint32_t)(((uint32_t)(x))<<DMA_CR_HALT_SHIFT))&DMA_CR_HALT_MASK)
#define DMA_CR_CLM_MASK                          0x40u
#define DMA_CR_CLM_SHIFT                         6u
#define DMA_CR_CLM_WIDTH                         1u
#define DMA_CR_CLM(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_CR_CLM_SHIFT))&DMA_CR_CLM_MASK)
#define DMA_CR_EMLM_MASK                         0x80u
#define DMA_CR_EMLM_SHIFT                        7u
#define DMA_CR_EMLM_WIDTH                        1u
#define DMA_CR_EMLM(x)                           (((uint32_t)(((uint32_t)(x))<<DMA_CR_EMLM_SHIFT))&DMA_CR_EMLM_MASK)
#define DMA_CR_GRP0PRI_MASK                      0x300u
#define DMA_CR_GRP0PRI_SHIFT                     8u
#define DMA_CR_GRP0PRI_WIDTH                     2u
#define DMA_CR_GRP0PRI(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_CR_GRP0PRI_SHIFT))&DMA_CR_GRP0PRI_MASK)
#define DMA_CR_GRP1PRI_MASK                      0xC00u
#define DMA_CR_GRP1PRI_SHIFT                     10u
#define DMA_CR_GRP1PRI_WIDTH                     2u
#define DMA_CR_GRP1PRI(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_CR_GRP1PRI_SHIFT))&DMA_CR_GRP1PRI_MASK)
#define DMA_CR_GRP2PRI_MASK                      0x3000u
#define DMA_CR_GRP2PRI_SHIFT                     12u
#define DMA_CR_GRP2PRI_WIDTH                     2u
#define DMA_CR_GRP2PRI(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_CR_GRP2PRI_SHIFT))&DMA_CR_GRP2PRI_MASK)
#define DMA_CR_GRP3PRI_MASK                      0xC000u
#define DMA_CR_GRP3PRI_SHIFT                     14u
#define DMA_CR_GRP3PRI_WIDTH                     2u
#define DMA_CR_GRP3PRI(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_CR_GRP3PRI_SHIFT))&DMA_CR_GRP3PRI_MASK)
#define DMA_CR_ECX_MASK                          0x10000u
#define DMA_CR_ECX_SHIFT                         16u
#define DMA_CR_ECX_WIDTH                         1u
#define DMA_CR_ECX(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_CR_ECX_SHIFT))&DMA_CR_ECX_MASK)
#define DMA_CR_CX_MASK                           0x20000u
#define DMA_CR_CX_SHIFT                          17u
#define DMA_CR_CX_WIDTH                          1u
#define DMA_CR_CX(x)                             (((uint32_t)(((uint32_t)(x))<<DMA_CR_CX_SHIFT))&DMA_CR_CX_MASK)
/* ES Bit Fields */
#define DMA_ES_DBE_MASK                          0x1u
#define DMA_ES_DBE_SHIFT                         0u
#define DMA_ES_DBE_WIDTH                         1u
#define DMA_ES_DBE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_DBE_SHIFT))&DMA_ES_DBE_MASK)
#define DMA_ES_SBE_MASK                          0x2u
#define DMA_ES_SBE_SHIFT                         1u
#define DMA_ES_SBE_WIDTH                         1u
#define DMA_ES_SBE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_SBE_SHIFT))&DMA_ES_SBE_MASK)
#define DMA_ES_SGE_MASK                          0x4u
#define DMA_ES_SGE_SHIFT                         2u
#define DMA_ES_SGE_WIDTH                         1u
#define DMA_ES_SGE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_SGE_SHIFT))&DMA_ES_SGE_MASK)
#define DMA_ES_NCE_MASK                          0x8u
#define DMA_ES_NCE_SHIFT                         3u
#define DMA_ES_NCE_WIDTH                         1u
#define DMA_ES_NCE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_NCE_SHIFT))&DMA_ES_NCE_MASK)
#define DMA_ES_DOE_MASK                          0x10u
#define DMA_ES_DOE_SHIFT                         4u
#define DMA_ES_DOE_WIDTH                         1u
#define DMA_ES_DOE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_DOE_SHIFT))&DMA_ES_DOE_MASK)
#define DMA_ES_DAE_MASK                          0x20u
#define DMA_ES_DAE_SHIFT                         5u
#define DMA_ES_DAE_WIDTH                         1u
#define DMA_ES_DAE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_DAE_SHIFT))&DMA_ES_DAE_MASK)
#define DMA_ES_SOE_MASK                          0x40u
#define DMA_ES_SOE_SHIFT                         6u
#define DMA_ES_SOE_WIDTH                         1u
#define DMA_ES_SOE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_SOE_SHIFT))&DMA_ES_SOE_MASK)
#define DMA_ES_SAE_MASK                          0x80u
#define DMA_ES_SAE_SHIFT                         7u
#define DMA_ES_SAE_WIDTH                         1u
#define DMA_ES_SAE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_SAE_SHIFT))&DMA_ES_SAE_MASK)
#define DMA_ES_ERRCHN_MASK                       0x3F00u
#define DMA_ES_ERRCHN_SHIFT                      8u
#define DMA_ES_ERRCHN_WIDTH                      6u
#define DMA_ES_ERRCHN(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ES_ERRCHN_SHIFT))&DMA_ES_ERRCHN_MASK)
#define DMA_ES_CPE_MASK                          0x4000u
#define DMA_ES_CPE_SHIFT                         14u
#define DMA_ES_CPE_WIDTH                         1u
#define DMA_ES_CPE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_CPE_SHIFT))&DMA_ES_CPE_MASK)
#define DMA_ES_GPE_MASK                          0x8000u
#define DMA_ES_GPE_SHIFT                         15u
#define DMA_ES_GPE_WIDTH                         1u
#define DMA_ES_GPE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_GPE_SHIFT))&DMA_ES_GPE_MASK)
#define DMA_ES_ECX_MASK                          0x10000u
#define DMA_ES_ECX_SHIFT                         16u
#define DMA_ES_ECX_WIDTH                         1u
#define DMA_ES_ECX(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_ECX_SHIFT))&DMA_ES_ECX_MASK)
#define DMA_ES_UCE_MASK                          0x20000u
#define DMA_ES_UCE_SHIFT                         17u
#define DMA_ES_UCE_WIDTH                         1u
#define DMA_ES_UCE(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_UCE_SHIFT))&DMA_ES_UCE_MASK)
#define DMA_ES_VLD_MASK                          0x80000000u
#define DMA_ES_VLD_SHIFT                         31u
#define DMA_ES_VLD_WIDTH                         1u
#define DMA_ES_VLD(x)                            (((uint32_t)(((uint32_t)(x))<<DMA_ES_VLD_SHIFT))&DMA_ES_VLD_MASK)
/* ERQH Bit Fields */
#define DMA_ERQH_ERQ32_MASK                      0x1u
#define DMA_ERQH_ERQ32_SHIFT                     0u
#define DMA_ERQH_ERQ32_WIDTH                     1u
#define DMA_ERQH_ERQ32(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ32_SHIFT))&DMA_ERQH_ERQ32_MASK)
#define DMA_ERQH_ERQ33_MASK                      0x2u
#define DMA_ERQH_ERQ33_SHIFT                     1u
#define DMA_ERQH_ERQ33_WIDTH                     1u
#define DMA_ERQH_ERQ33(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ33_SHIFT))&DMA_ERQH_ERQ33_MASK)
#define DMA_ERQH_ERQ34_MASK                      0x4u
#define DMA_ERQH_ERQ34_SHIFT                     2u
#define DMA_ERQH_ERQ34_WIDTH                     1u
#define DMA_ERQH_ERQ34(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ34_SHIFT))&DMA_ERQH_ERQ34_MASK)
#define DMA_ERQH_ERQ35_MASK                      0x8u
#define DMA_ERQH_ERQ35_SHIFT                     3u
#define DMA_ERQH_ERQ35_WIDTH                     1u
#define DMA_ERQH_ERQ35(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ35_SHIFT))&DMA_ERQH_ERQ35_MASK)
#define DMA_ERQH_ERQ36_MASK                      0x10u
#define DMA_ERQH_ERQ36_SHIFT                     4u
#define DMA_ERQH_ERQ36_WIDTH                     1u
#define DMA_ERQH_ERQ36(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ36_SHIFT))&DMA_ERQH_ERQ36_MASK)
#define DMA_ERQH_ERQ37_MASK                      0x20u
#define DMA_ERQH_ERQ37_SHIFT                     5u
#define DMA_ERQH_ERQ37_WIDTH                     1u
#define DMA_ERQH_ERQ37(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ37_SHIFT))&DMA_ERQH_ERQ37_MASK)
#define DMA_ERQH_ERQ38_MASK                      0x40u
#define DMA_ERQH_ERQ38_SHIFT                     6u
#define DMA_ERQH_ERQ38_WIDTH                     1u
#define DMA_ERQH_ERQ38(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ38_SHIFT))&DMA_ERQH_ERQ38_MASK)
#define DMA_ERQH_ERQ39_MASK                      0x80u
#define DMA_ERQH_ERQ39_SHIFT                     7u
#define DMA_ERQH_ERQ39_WIDTH                     1u
#define DMA_ERQH_ERQ39(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ39_SHIFT))&DMA_ERQH_ERQ39_MASK)
#define DMA_ERQH_ERQ40_MASK                      0x100u
#define DMA_ERQH_ERQ40_SHIFT                     8u
#define DMA_ERQH_ERQ40_WIDTH                     1u
#define DMA_ERQH_ERQ40(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ40_SHIFT))&DMA_ERQH_ERQ40_MASK)
#define DMA_ERQH_ERQ41_MASK                      0x200u
#define DMA_ERQH_ERQ41_SHIFT                     9u
#define DMA_ERQH_ERQ41_WIDTH                     1u
#define DMA_ERQH_ERQ41(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ41_SHIFT))&DMA_ERQH_ERQ41_MASK)
#define DMA_ERQH_ERQ42_MASK                      0x400u
#define DMA_ERQH_ERQ42_SHIFT                     10u
#define DMA_ERQH_ERQ42_WIDTH                     1u
#define DMA_ERQH_ERQ42(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ42_SHIFT))&DMA_ERQH_ERQ42_MASK)
#define DMA_ERQH_ERQ43_MASK                      0x800u
#define DMA_ERQH_ERQ43_SHIFT                     11u
#define DMA_ERQH_ERQ43_WIDTH                     1u
#define DMA_ERQH_ERQ43(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ43_SHIFT))&DMA_ERQH_ERQ43_MASK)
#define DMA_ERQH_ERQ44_MASK                      0x1000u
#define DMA_ERQH_ERQ44_SHIFT                     12u
#define DMA_ERQH_ERQ44_WIDTH                     1u
#define DMA_ERQH_ERQ44(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ44_SHIFT))&DMA_ERQH_ERQ44_MASK)
#define DMA_ERQH_ERQ45_MASK                      0x2000u
#define DMA_ERQH_ERQ45_SHIFT                     13u
#define DMA_ERQH_ERQ45_WIDTH                     1u
#define DMA_ERQH_ERQ45(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ45_SHIFT))&DMA_ERQH_ERQ45_MASK)
#define DMA_ERQH_ERQ46_MASK                      0x4000u
#define DMA_ERQH_ERQ46_SHIFT                     14u
#define DMA_ERQH_ERQ46_WIDTH                     1u
#define DMA_ERQH_ERQ46(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ46_SHIFT))&DMA_ERQH_ERQ46_MASK)
#define DMA_ERQH_ERQ47_MASK                      0x8000u
#define DMA_ERQH_ERQ47_SHIFT                     15u
#define DMA_ERQH_ERQ47_WIDTH                     1u
#define DMA_ERQH_ERQ47(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ47_SHIFT))&DMA_ERQH_ERQ47_MASK)
#define DMA_ERQH_ERQ48_MASK                      0x10000u
#define DMA_ERQH_ERQ48_SHIFT                     16u
#define DMA_ERQH_ERQ48_WIDTH                     1u
#define DMA_ERQH_ERQ48(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ48_SHIFT))&DMA_ERQH_ERQ48_MASK)
#define DMA_ERQH_ERQ49_MASK                      0x20000u
#define DMA_ERQH_ERQ49_SHIFT                     17u
#define DMA_ERQH_ERQ49_WIDTH                     1u
#define DMA_ERQH_ERQ49(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ49_SHIFT))&DMA_ERQH_ERQ49_MASK)
#define DMA_ERQH_ERQ50_MASK                      0x40000u
#define DMA_ERQH_ERQ50_SHIFT                     18u
#define DMA_ERQH_ERQ50_WIDTH                     1u
#define DMA_ERQH_ERQ50(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ50_SHIFT))&DMA_ERQH_ERQ50_MASK)
#define DMA_ERQH_ERQ51_MASK                      0x80000u
#define DMA_ERQH_ERQ51_SHIFT                     19u
#define DMA_ERQH_ERQ51_WIDTH                     1u
#define DMA_ERQH_ERQ51(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ51_SHIFT))&DMA_ERQH_ERQ51_MASK)
#define DMA_ERQH_ERQ52_MASK                      0x100000u
#define DMA_ERQH_ERQ52_SHIFT                     20u
#define DMA_ERQH_ERQ52_WIDTH                     1u
#define DMA_ERQH_ERQ52(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ52_SHIFT))&DMA_ERQH_ERQ52_MASK)
#define DMA_ERQH_ERQ53_MASK                      0x200000u
#define DMA_ERQH_ERQ53_SHIFT                     21u
#define DMA_ERQH_ERQ53_WIDTH                     1u
#define DMA_ERQH_ERQ53(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ53_SHIFT))&DMA_ERQH_ERQ53_MASK)
#define DMA_ERQH_ERQ54_MASK                      0x400000u
#define DMA_ERQH_ERQ54_SHIFT                     22u
#define DMA_ERQH_ERQ54_WIDTH                     1u
#define DMA_ERQH_ERQ54(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ54_SHIFT))&DMA_ERQH_ERQ54_MASK)
#define DMA_ERQH_ERQ55_MASK                      0x800000u
#define DMA_ERQH_ERQ55_SHIFT                     23u
#define DMA_ERQH_ERQ55_WIDTH                     1u
#define DMA_ERQH_ERQ55(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ55_SHIFT))&DMA_ERQH_ERQ55_MASK)
#define DMA_ERQH_ERQ56_MASK                      0x1000000u
#define DMA_ERQH_ERQ56_SHIFT                     24u
#define DMA_ERQH_ERQ56_WIDTH                     1u
#define DMA_ERQH_ERQ56(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ56_SHIFT))&DMA_ERQH_ERQ56_MASK)
#define DMA_ERQH_ERQ57_MASK                      0x2000000u
#define DMA_ERQH_ERQ57_SHIFT                     25u
#define DMA_ERQH_ERQ57_WIDTH                     1u
#define DMA_ERQH_ERQ57(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ57_SHIFT))&DMA_ERQH_ERQ57_MASK)
#define DMA_ERQH_ERQ58_MASK                      0x4000000u
#define DMA_ERQH_ERQ58_SHIFT                     26u
#define DMA_ERQH_ERQ58_WIDTH                     1u
#define DMA_ERQH_ERQ58(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ58_SHIFT))&DMA_ERQH_ERQ58_MASK)
#define DMA_ERQH_ERQ59_MASK                      0x8000000u
#define DMA_ERQH_ERQ59_SHIFT                     27u
#define DMA_ERQH_ERQ59_WIDTH                     1u
#define DMA_ERQH_ERQ59(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ59_SHIFT))&DMA_ERQH_ERQ59_MASK)
#define DMA_ERQH_ERQ60_MASK                      0x10000000u
#define DMA_ERQH_ERQ60_SHIFT                     28u
#define DMA_ERQH_ERQ60_WIDTH                     1u
#define DMA_ERQH_ERQ60(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ60_SHIFT))&DMA_ERQH_ERQ60_MASK)
#define DMA_ERQH_ERQ61_MASK                      0x20000000u
#define DMA_ERQH_ERQ61_SHIFT                     29u
#define DMA_ERQH_ERQ61_WIDTH                     1u
#define DMA_ERQH_ERQ61(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ61_SHIFT))&DMA_ERQH_ERQ61_MASK)
#define DMA_ERQH_ERQ62_MASK                      0x40000000u
#define DMA_ERQH_ERQ62_SHIFT                     30u
#define DMA_ERQH_ERQ62_WIDTH                     1u
#define DMA_ERQH_ERQ62(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ62_SHIFT))&DMA_ERQH_ERQ62_MASK)
#define DMA_ERQH_ERQ63_MASK                      0x80000000u
#define DMA_ERQH_ERQ63_SHIFT                     31u
#define DMA_ERQH_ERQ63_WIDTH                     1u
#define DMA_ERQH_ERQ63(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQH_ERQ63_SHIFT))&DMA_ERQH_ERQ63_MASK)
/* ERQL Bit Fields */
#define DMA_ERQL_ERQ0_MASK                       0x1u
#define DMA_ERQL_ERQ0_SHIFT                      0u
#define DMA_ERQL_ERQ0_WIDTH                      1u
#define DMA_ERQL_ERQ0(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ0_SHIFT))&DMA_ERQL_ERQ0_MASK)
#define DMA_ERQL_ERQ1_MASK                       0x2u
#define DMA_ERQL_ERQ1_SHIFT                      1u
#define DMA_ERQL_ERQ1_WIDTH                      1u
#define DMA_ERQL_ERQ1(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ1_SHIFT))&DMA_ERQL_ERQ1_MASK)
#define DMA_ERQL_ERQ2_MASK                       0x4u
#define DMA_ERQL_ERQ2_SHIFT                      2u
#define DMA_ERQL_ERQ2_WIDTH                      1u
#define DMA_ERQL_ERQ2(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ2_SHIFT))&DMA_ERQL_ERQ2_MASK)
#define DMA_ERQL_ERQ3_MASK                       0x8u
#define DMA_ERQL_ERQ3_SHIFT                      3u
#define DMA_ERQL_ERQ3_WIDTH                      1u
#define DMA_ERQL_ERQ3(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ3_SHIFT))&DMA_ERQL_ERQ3_MASK)
#define DMA_ERQL_ERQ4_MASK                       0x10u
#define DMA_ERQL_ERQ4_SHIFT                      4u
#define DMA_ERQL_ERQ4_WIDTH                      1u
#define DMA_ERQL_ERQ4(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ4_SHIFT))&DMA_ERQL_ERQ4_MASK)
#define DMA_ERQL_ERQ5_MASK                       0x20u
#define DMA_ERQL_ERQ5_SHIFT                      5u
#define DMA_ERQL_ERQ5_WIDTH                      1u
#define DMA_ERQL_ERQ5(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ5_SHIFT))&DMA_ERQL_ERQ5_MASK)
#define DMA_ERQL_ERQ6_MASK                       0x40u
#define DMA_ERQL_ERQ6_SHIFT                      6u
#define DMA_ERQL_ERQ6_WIDTH                      1u
#define DMA_ERQL_ERQ6(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ6_SHIFT))&DMA_ERQL_ERQ6_MASK)
#define DMA_ERQL_ERQ7_MASK                       0x80u
#define DMA_ERQL_ERQ7_SHIFT                      7u
#define DMA_ERQL_ERQ7_WIDTH                      1u
#define DMA_ERQL_ERQ7(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ7_SHIFT))&DMA_ERQL_ERQ7_MASK)
#define DMA_ERQL_ERQ8_MASK                       0x100u
#define DMA_ERQL_ERQ8_SHIFT                      8u
#define DMA_ERQL_ERQ8_WIDTH                      1u
#define DMA_ERQL_ERQ8(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ8_SHIFT))&DMA_ERQL_ERQ8_MASK)
#define DMA_ERQL_ERQ9_MASK                       0x200u
#define DMA_ERQL_ERQ9_SHIFT                      9u
#define DMA_ERQL_ERQ9_WIDTH                      1u
#define DMA_ERQL_ERQ9(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ9_SHIFT))&DMA_ERQL_ERQ9_MASK)
#define DMA_ERQL_ERQ10_MASK                      0x400u
#define DMA_ERQL_ERQ10_SHIFT                     10u
#define DMA_ERQL_ERQ10_WIDTH                     1u
#define DMA_ERQL_ERQ10(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ10_SHIFT))&DMA_ERQL_ERQ10_MASK)
#define DMA_ERQL_ERQ11_MASK                      0x800u
#define DMA_ERQL_ERQ11_SHIFT                     11u
#define DMA_ERQL_ERQ11_WIDTH                     1u
#define DMA_ERQL_ERQ11(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ11_SHIFT))&DMA_ERQL_ERQ11_MASK)
#define DMA_ERQL_ERQ12_MASK                      0x1000u
#define DMA_ERQL_ERQ12_SHIFT                     12u
#define DMA_ERQL_ERQ12_WIDTH                     1u
#define DMA_ERQL_ERQ12(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ12_SHIFT))&DMA_ERQL_ERQ12_MASK)
#define DMA_ERQL_ERQ13_MASK                      0x2000u
#define DMA_ERQL_ERQ13_SHIFT                     13u
#define DMA_ERQL_ERQ13_WIDTH                     1u
#define DMA_ERQL_ERQ13(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ13_SHIFT))&DMA_ERQL_ERQ13_MASK)
#define DMA_ERQL_ERQ14_MASK                      0x4000u
#define DMA_ERQL_ERQ14_SHIFT                     14u
#define DMA_ERQL_ERQ14_WIDTH                     1u
#define DMA_ERQL_ERQ14(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ14_SHIFT))&DMA_ERQL_ERQ14_MASK)
#define DMA_ERQL_ERQ15_MASK                      0x8000u
#define DMA_ERQL_ERQ15_SHIFT                     15u
#define DMA_ERQL_ERQ15_WIDTH                     1u
#define DMA_ERQL_ERQ15(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ15_SHIFT))&DMA_ERQL_ERQ15_MASK)
#define DMA_ERQL_ERQ16_MASK                      0x10000u
#define DMA_ERQL_ERQ16_SHIFT                     16u
#define DMA_ERQL_ERQ16_WIDTH                     1u
#define DMA_ERQL_ERQ16(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ16_SHIFT))&DMA_ERQL_ERQ16_MASK)
#define DMA_ERQL_ERQ17_MASK                      0x20000u
#define DMA_ERQL_ERQ17_SHIFT                     17u
#define DMA_ERQL_ERQ17_WIDTH                     1u
#define DMA_ERQL_ERQ17(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ17_SHIFT))&DMA_ERQL_ERQ17_MASK)
#define DMA_ERQL_ERQ18_MASK                      0x40000u
#define DMA_ERQL_ERQ18_SHIFT                     18u
#define DMA_ERQL_ERQ18_WIDTH                     1u
#define DMA_ERQL_ERQ18(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ18_SHIFT))&DMA_ERQL_ERQ18_MASK)
#define DMA_ERQL_ERQ19_MASK                      0x80000u
#define DMA_ERQL_ERQ19_SHIFT                     19u
#define DMA_ERQL_ERQ19_WIDTH                     1u
#define DMA_ERQL_ERQ19(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ19_SHIFT))&DMA_ERQL_ERQ19_MASK)
#define DMA_ERQL_ERQ20_MASK                      0x100000u
#define DMA_ERQL_ERQ20_SHIFT                     20u
#define DMA_ERQL_ERQ20_WIDTH                     1u
#define DMA_ERQL_ERQ20(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ20_SHIFT))&DMA_ERQL_ERQ20_MASK)
#define DMA_ERQL_ERQ21_MASK                      0x200000u
#define DMA_ERQL_ERQ21_SHIFT                     21u
#define DMA_ERQL_ERQ21_WIDTH                     1u
#define DMA_ERQL_ERQ21(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ21_SHIFT))&DMA_ERQL_ERQ21_MASK)
#define DMA_ERQL_ERQ22_MASK                      0x400000u
#define DMA_ERQL_ERQ22_SHIFT                     22u
#define DMA_ERQL_ERQ22_WIDTH                     1u
#define DMA_ERQL_ERQ22(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ22_SHIFT))&DMA_ERQL_ERQ22_MASK)
#define DMA_ERQL_ERQ23_MASK                      0x800000u
#define DMA_ERQL_ERQ23_SHIFT                     23u
#define DMA_ERQL_ERQ23_WIDTH                     1u
#define DMA_ERQL_ERQ23(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ23_SHIFT))&DMA_ERQL_ERQ23_MASK)
#define DMA_ERQL_ERQ24_MASK                      0x1000000u
#define DMA_ERQL_ERQ24_SHIFT                     24u
#define DMA_ERQL_ERQ24_WIDTH                     1u
#define DMA_ERQL_ERQ24(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ24_SHIFT))&DMA_ERQL_ERQ24_MASK)
#define DMA_ERQL_ERQ25_MASK                      0x2000000u
#define DMA_ERQL_ERQ25_SHIFT                     25u
#define DMA_ERQL_ERQ25_WIDTH                     1u
