neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define DMA_ERQL_ERQ25(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ25_SHIFT))&DMA_ERQL_ERQ25_MASK)
#define DMA_ERQL_ERQ26_MASK                      0x4000000u
#define DMA_ERQL_ERQ26_SHIFT                     26u
#define DMA_ERQL_ERQ26_WIDTH                     1u
#define DMA_ERQL_ERQ26(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ26_SHIFT))&DMA_ERQL_ERQ26_MASK)
#define DMA_ERQL_ERQ27_MASK                      0x8000000u
#define DMA_ERQL_ERQ27_SHIFT                     27u
#define DMA_ERQL_ERQ27_WIDTH                     1u
#define DMA_ERQL_ERQ27(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ27_SHIFT))&DMA_ERQL_ERQ27_MASK)
#define DMA_ERQL_ERQ28_MASK                      0x10000000u
#define DMA_ERQL_ERQ28_SHIFT                     28u
#define DMA_ERQL_ERQ28_WIDTH                     1u
#define DMA_ERQL_ERQ28(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ28_SHIFT))&DMA_ERQL_ERQ28_MASK)
#define DMA_ERQL_ERQ29_MASK                      0x20000000u
#define DMA_ERQL_ERQ29_SHIFT                     29u
#define DMA_ERQL_ERQ29_WIDTH                     1u
#define DMA_ERQL_ERQ29(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ29_SHIFT))&DMA_ERQL_ERQ29_MASK)
#define DMA_ERQL_ERQ30_MASK                      0x40000000u
#define DMA_ERQL_ERQ30_SHIFT                     30u
#define DMA_ERQL_ERQ30_WIDTH                     1u
#define DMA_ERQL_ERQ30(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ30_SHIFT))&DMA_ERQL_ERQ30_MASK)
#define DMA_ERQL_ERQ31_MASK                      0x80000000u
#define DMA_ERQL_ERQ31_SHIFT                     31u
#define DMA_ERQL_ERQ31_WIDTH                     1u
#define DMA_ERQL_ERQ31(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERQL_ERQ31_SHIFT))&DMA_ERQL_ERQ31_MASK)
/* EEIH Bit Fields */
#define DMA_EEIH_EEI32_MASK                      0x1u
#define DMA_EEIH_EEI32_SHIFT                     0u
#define DMA_EEIH_EEI32_WIDTH                     1u
#define DMA_EEIH_EEI32(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI32_SHIFT))&DMA_EEIH_EEI32_MASK)
#define DMA_EEIH_EEI33_MASK                      0x2u
#define DMA_EEIH_EEI33_SHIFT                     1u
#define DMA_EEIH_EEI33_WIDTH                     1u
#define DMA_EEIH_EEI33(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI33_SHIFT))&DMA_EEIH_EEI33_MASK)
#define DMA_EEIH_EEI34_MASK                      0x4u
#define DMA_EEIH_EEI34_SHIFT                     2u
#define DMA_EEIH_EEI34_WIDTH                     1u
#define DMA_EEIH_EEI34(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI34_SHIFT))&DMA_EEIH_EEI34_MASK)
#define DMA_EEIH_EEI35_MASK                      0x8u
#define DMA_EEIH_EEI35_SHIFT                     3u
#define DMA_EEIH_EEI35_WIDTH                     1u
#define DMA_EEIH_EEI35(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI35_SHIFT))&DMA_EEIH_EEI35_MASK)
#define DMA_EEIH_EEI36_MASK                      0x10u
#define DMA_EEIH_EEI36_SHIFT                     4u
#define DMA_EEIH_EEI36_WIDTH                     1u
#define DMA_EEIH_EEI36(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI36_SHIFT))&DMA_EEIH_EEI36_MASK)
#define DMA_EEIH_EEI37_MASK                      0x20u
#define DMA_EEIH_EEI37_SHIFT                     5u
#define DMA_EEIH_EEI37_WIDTH                     1u
#define DMA_EEIH_EEI37(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI37_SHIFT))&DMA_EEIH_EEI37_MASK)
#define DMA_EEIH_EEI38_MASK                      0x40u
#define DMA_EEIH_EEI38_SHIFT                     6u
#define DMA_EEIH_EEI38_WIDTH                     1u
#define DMA_EEIH_EEI38(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI38_SHIFT))&DMA_EEIH_EEI38_MASK)
#define DMA_EEIH_EEI39_MASK                      0x80u
#define DMA_EEIH_EEI39_SHIFT                     7u
#define DMA_EEIH_EEI39_WIDTH                     1u
#define DMA_EEIH_EEI39(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI39_SHIFT))&DMA_EEIH_EEI39_MASK)
#define DMA_EEIH_EEI40_MASK                      0x100u
#define DMA_EEIH_EEI40_SHIFT                     8u
#define DMA_EEIH_EEI40_WIDTH                     1u
#define DMA_EEIH_EEI40(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI40_SHIFT))&DMA_EEIH_EEI40_MASK)
#define DMA_EEIH_EEI41_MASK                      0x200u
#define DMA_EEIH_EEI41_SHIFT                     9u
#define DMA_EEIH_EEI41_WIDTH                     1u
#define DMA_EEIH_EEI41(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI41_SHIFT))&DMA_EEIH_EEI41_MASK)
#define DMA_EEIH_EEI42_MASK                      0x400u
#define DMA_EEIH_EEI42_SHIFT                     10u
#define DMA_EEIH_EEI42_WIDTH                     1u
#define DMA_EEIH_EEI42(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI42_SHIFT))&DMA_EEIH_EEI42_MASK)
#define DMA_EEIH_EEI43_MASK                      0x800u
#define DMA_EEIH_EEI43_SHIFT                     11u
#define DMA_EEIH_EEI43_WIDTH                     1u
#define DMA_EEIH_EEI43(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI43_SHIFT))&DMA_EEIH_EEI43_MASK)
#define DMA_EEIH_EEI44_MASK                      0x1000u
#define DMA_EEIH_EEI44_SHIFT                     12u
#define DMA_EEIH_EEI44_WIDTH                     1u
#define DMA_EEIH_EEI44(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI44_SHIFT))&DMA_EEIH_EEI44_MASK)
#define DMA_EEIH_EEI45_MASK                      0x2000u
#define DMA_EEIH_EEI45_SHIFT                     13u
#define DMA_EEIH_EEI45_WIDTH                     1u
#define DMA_EEIH_EEI45(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI45_SHIFT))&DMA_EEIH_EEI45_MASK)
#define DMA_EEIH_EEI46_MASK                      0x4000u
#define DMA_EEIH_EEI46_SHIFT                     14u
#define DMA_EEIH_EEI46_WIDTH                     1u
#define DMA_EEIH_EEI46(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI46_SHIFT))&DMA_EEIH_EEI46_MASK)
#define DMA_EEIH_EEI47_MASK                      0x8000u
#define DMA_EEIH_EEI47_SHIFT                     15u
#define DMA_EEIH_EEI47_WIDTH                     1u
#define DMA_EEIH_EEI47(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI47_SHIFT))&DMA_EEIH_EEI47_MASK)
#define DMA_EEIH_EEI48_MASK                      0x10000u
#define DMA_EEIH_EEI48_SHIFT                     16u
#define DMA_EEIH_EEI48_WIDTH                     1u
#define DMA_EEIH_EEI48(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI48_SHIFT))&DMA_EEIH_EEI48_MASK)
#define DMA_EEIH_EEI49_MASK                      0x20000u
#define DMA_EEIH_EEI49_SHIFT                     17u
#define DMA_EEIH_EEI49_WIDTH                     1u
#define DMA_EEIH_EEI49(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI49_SHIFT))&DMA_EEIH_EEI49_MASK)
#define DMA_EEIH_EEI50_MASK                      0x40000u
#define DMA_EEIH_EEI50_SHIFT                     18u
#define DMA_EEIH_EEI50_WIDTH                     1u
#define DMA_EEIH_EEI50(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI50_SHIFT))&DMA_EEIH_EEI50_MASK)
#define DMA_EEIH_EEI51_MASK                      0x80000u
#define DMA_EEIH_EEI51_SHIFT                     19u
#define DMA_EEIH_EEI51_WIDTH                     1u
#define DMA_EEIH_EEI51(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI51_SHIFT))&DMA_EEIH_EEI51_MASK)
#define DMA_EEIH_EEI52_MASK                      0x100000u
#define DMA_EEIH_EEI52_SHIFT                     20u
#define DMA_EEIH_EEI52_WIDTH                     1u
#define DMA_EEIH_EEI52(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI52_SHIFT))&DMA_EEIH_EEI52_MASK)
#define DMA_EEIH_EEI53_MASK                      0x200000u
#define DMA_EEIH_EEI53_SHIFT                     21u
#define DMA_EEIH_EEI53_WIDTH                     1u
#define DMA_EEIH_EEI53(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI53_SHIFT))&DMA_EEIH_EEI53_MASK)
#define DMA_EEIH_EEI54_MASK                      0x400000u
#define DMA_EEIH_EEI54_SHIFT                     22u
#define DMA_EEIH_EEI54_WIDTH                     1u
#define DMA_EEIH_EEI54(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI54_SHIFT))&DMA_EEIH_EEI54_MASK)
#define DMA_EEIH_EEI55_MASK                      0x800000u
#define DMA_EEIH_EEI55_SHIFT                     23u
#define DMA_EEIH_EEI55_WIDTH                     1u
#define DMA_EEIH_EEI55(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI55_SHIFT))&DMA_EEIH_EEI55_MASK)
#define DMA_EEIH_EEI56_MASK                      0x1000000u
#define DMA_EEIH_EEI56_SHIFT                     24u
#define DMA_EEIH_EEI56_WIDTH                     1u
#define DMA_EEIH_EEI56(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI56_SHIFT))&DMA_EEIH_EEI56_MASK)
#define DMA_EEIH_EEI57_MASK                      0x2000000u
#define DMA_EEIH_EEI57_SHIFT                     25u
#define DMA_EEIH_EEI57_WIDTH                     1u
#define DMA_EEIH_EEI57(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI57_SHIFT))&DMA_EEIH_EEI57_MASK)
#define DMA_EEIH_EEI58_MASK                      0x4000000u
#define DMA_EEIH_EEI58_SHIFT                     26u
#define DMA_EEIH_EEI58_WIDTH                     1u
#define DMA_EEIH_EEI58(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI58_SHIFT))&DMA_EEIH_EEI58_MASK)
#define DMA_EEIH_EEI59_MASK                      0x8000000u
#define DMA_EEIH_EEI59_SHIFT                     27u
#define DMA_EEIH_EEI59_WIDTH                     1u
#define DMA_EEIH_EEI59(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI59_SHIFT))&DMA_EEIH_EEI59_MASK)
#define DMA_EEIH_EEI60_MASK                      0x10000000u
#define DMA_EEIH_EEI60_SHIFT                     28u
#define DMA_EEIH_EEI60_WIDTH                     1u
#define DMA_EEIH_EEI60(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI60_SHIFT))&DMA_EEIH_EEI60_MASK)
#define DMA_EEIH_EEI61_MASK                      0x20000000u
#define DMA_EEIH_EEI61_SHIFT                     29u
#define DMA_EEIH_EEI61_WIDTH                     1u
#define DMA_EEIH_EEI61(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI61_SHIFT))&DMA_EEIH_EEI61_MASK)
#define DMA_EEIH_EEI62_MASK                      0x40000000u
#define DMA_EEIH_EEI62_SHIFT                     30u
#define DMA_EEIH_EEI62_WIDTH                     1u
#define DMA_EEIH_EEI62(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI62_SHIFT))&DMA_EEIH_EEI62_MASK)
#define DMA_EEIH_EEI63_MASK                      0x80000000u
#define DMA_EEIH_EEI63_SHIFT                     31u
#define DMA_EEIH_EEI63_WIDTH                     1u
#define DMA_EEIH_EEI63(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIH_EEI63_SHIFT))&DMA_EEIH_EEI63_MASK)
/* EEIL Bit Fields */
#define DMA_EEIL_EEI0_MASK                       0x1u
#define DMA_EEIL_EEI0_SHIFT                      0u
#define DMA_EEIL_EEI0_WIDTH                      1u
#define DMA_EEIL_EEI0(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI0_SHIFT))&DMA_EEIL_EEI0_MASK)
#define DMA_EEIL_EEI1_MASK                       0x2u
#define DMA_EEIL_EEI1_SHIFT                      1u
#define DMA_EEIL_EEI1_WIDTH                      1u
#define DMA_EEIL_EEI1(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI1_SHIFT))&DMA_EEIL_EEI1_MASK)
#define DMA_EEIL_EEI2_MASK                       0x4u
#define DMA_EEIL_EEI2_SHIFT                      2u
#define DMA_EEIL_EEI2_WIDTH                      1u
#define DMA_EEIL_EEI2(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI2_SHIFT))&DMA_EEIL_EEI2_MASK)
#define DMA_EEIL_EEI3_MASK                       0x8u
#define DMA_EEIL_EEI3_SHIFT                      3u
#define DMA_EEIL_EEI3_WIDTH                      1u
#define DMA_EEIL_EEI3(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI3_SHIFT))&DMA_EEIL_EEI3_MASK)
#define DMA_EEIL_EEI4_MASK                       0x10u
#define DMA_EEIL_EEI4_SHIFT                      4u
#define DMA_EEIL_EEI4_WIDTH                      1u
#define DMA_EEIL_EEI4(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI4_SHIFT))&DMA_EEIL_EEI4_MASK)
#define DMA_EEIL_EEI5_MASK                       0x20u
#define DMA_EEIL_EEI5_SHIFT                      5u
#define DMA_EEIL_EEI5_WIDTH                      1u
#define DMA_EEIL_EEI5(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI5_SHIFT))&DMA_EEIL_EEI5_MASK)
#define DMA_EEIL_EEI6_MASK                       0x40u
#define DMA_EEIL_EEI6_SHIFT                      6u
#define DMA_EEIL_EEI6_WIDTH                      1u
#define DMA_EEIL_EEI6(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI6_SHIFT))&DMA_EEIL_EEI6_MASK)
#define DMA_EEIL_EEI7_MASK                       0x80u
#define DMA_EEIL_EEI7_SHIFT                      7u
#define DMA_EEIL_EEI7_WIDTH                      1u
#define DMA_EEIL_EEI7(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI7_SHIFT))&DMA_EEIL_EEI7_MASK)
#define DMA_EEIL_EEI8_MASK                       0x100u
#define DMA_EEIL_EEI8_SHIFT                      8u
#define DMA_EEIL_EEI8_WIDTH                      1u
#define DMA_EEIL_EEI8(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI8_SHIFT))&DMA_EEIL_EEI8_MASK)
#define DMA_EEIL_EEI9_MASK                       0x200u
#define DMA_EEIL_EEI9_SHIFT                      9u
#define DMA_EEIL_EEI9_WIDTH                      1u
#define DMA_EEIL_EEI9(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI9_SHIFT))&DMA_EEIL_EEI9_MASK)
#define DMA_EEIL_EEI10_MASK                      0x400u
#define DMA_EEIL_EEI10_SHIFT                     10u
#define DMA_EEIL_EEI10_WIDTH                     1u
#define DMA_EEIL_EEI10(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI10_SHIFT))&DMA_EEIL_EEI10_MASK)
#define DMA_EEIL_EEI11_MASK                      0x800u
#define DMA_EEIL_EEI11_SHIFT                     11u
#define DMA_EEIL_EEI11_WIDTH                     1u
#define DMA_EEIL_EEI11(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI11_SHIFT))&DMA_EEIL_EEI11_MASK)
#define DMA_EEIL_EEI12_MASK                      0x1000u
#define DMA_EEIL_EEI12_SHIFT                     12u
#define DMA_EEIL_EEI12_WIDTH                     1u
#define DMA_EEIL_EEI12(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI12_SHIFT))&DMA_EEIL_EEI12_MASK)
#define DMA_EEIL_EEI13_MASK                      0x2000u
#define DMA_EEIL_EEI13_SHIFT                     13u
#define DMA_EEIL_EEI13_WIDTH                     1u
#define DMA_EEIL_EEI13(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI13_SHIFT))&DMA_EEIL_EEI13_MASK)
#define DMA_EEIL_EEI14_MASK                      0x4000u
#define DMA_EEIL_EEI14_SHIFT                     14u
#define DMA_EEIL_EEI14_WIDTH                     1u
#define DMA_EEIL_EEI14(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI14_SHIFT))&DMA_EEIL_EEI14_MASK)
#define DMA_EEIL_EEI15_MASK                      0x8000u
#define DMA_EEIL_EEI15_SHIFT                     15u
#define DMA_EEIL_EEI15_WIDTH                     1u
#define DMA_EEIL_EEI15(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI15_SHIFT))&DMA_EEIL_EEI15_MASK)
#define DMA_EEIL_EEI16_MASK                      0x10000u
#define DMA_EEIL_EEI16_SHIFT                     16u
#define DMA_EEIL_EEI16_WIDTH                     1u
#define DMA_EEIL_EEI16(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI16_SHIFT))&DMA_EEIL_EEI16_MASK)
#define DMA_EEIL_EEI17_MASK                      0x20000u
#define DMA_EEIL_EEI17_SHIFT                     17u
#define DMA_EEIL_EEI17_WIDTH                     1u
#define DMA_EEIL_EEI17(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI17_SHIFT))&DMA_EEIL_EEI17_MASK)
#define DMA_EEIL_EEI18_MASK                      0x40000u
#define DMA_EEIL_EEI18_SHIFT                     18u
#define DMA_EEIL_EEI18_WIDTH                     1u
#define DMA_EEIL_EEI18(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI18_SHIFT))&DMA_EEIL_EEI18_MASK)
#define DMA_EEIL_EEI19_MASK                      0x80000u
#define DMA_EEIL_EEI19_SHIFT                     19u
#define DMA_EEIL_EEI19_WIDTH                     1u
#define DMA_EEIL_EEI19(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI19_SHIFT))&DMA_EEIL_EEI19_MASK)
#define DMA_EEIL_EEI20_MASK                      0x100000u
#define DMA_EEIL_EEI20_SHIFT                     20u
#define DMA_EEIL_EEI20_WIDTH                     1u
#define DMA_EEIL_EEI20(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI20_SHIFT))&DMA_EEIL_EEI20_MASK)
#define DMA_EEIL_EEI21_MASK                      0x200000u
#define DMA_EEIL_EEI21_SHIFT                     21u
#define DMA_EEIL_EEI21_WIDTH                     1u
#define DMA_EEIL_EEI21(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI21_SHIFT))&DMA_EEIL_EEI21_MASK)
#define DMA_EEIL_EEI22_MASK                      0x400000u
#define DMA_EEIL_EEI22_SHIFT                     22u
#define DMA_EEIL_EEI22_WIDTH                     1u
#define DMA_EEIL_EEI22(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI22_SHIFT))&DMA_EEIL_EEI22_MASK)
#define DMA_EEIL_EEI23_MASK                      0x800000u
#define DMA_EEIL_EEI23_SHIFT                     23u
#define DMA_EEIL_EEI23_WIDTH                     1u
#define DMA_EEIL_EEI23(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI23_SHIFT))&DMA_EEIL_EEI23_MASK)
#define DMA_EEIL_EEI24_MASK                      0x1000000u
#define DMA_EEIL_EEI24_SHIFT                     24u
#define DMA_EEIL_EEI24_WIDTH                     1u
#define DMA_EEIL_EEI24(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI24_SHIFT))&DMA_EEIL_EEI24_MASK)
#define DMA_EEIL_EEI25_MASK                      0x2000000u
#define DMA_EEIL_EEI25_SHIFT                     25u
#define DMA_EEIL_EEI25_WIDTH                     1u
#define DMA_EEIL_EEI25(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI25_SHIFT))&DMA_EEIL_EEI25_MASK)
#define DMA_EEIL_EEI26_MASK                      0x4000000u
#define DMA_EEIL_EEI26_SHIFT                     26u
#define DMA_EEIL_EEI26_WIDTH                     1u
#define DMA_EEIL_EEI26(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI26_SHIFT))&DMA_EEIL_EEI26_MASK)
#define DMA_EEIL_EEI27_MASK                      0x8000000u
#define DMA_EEIL_EEI27_SHIFT                     27u
#define DMA_EEIL_EEI27_WIDTH                     1u
#define DMA_EEIL_EEI27(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI27_SHIFT))&DMA_EEIL_EEI27_MASK)
#define DMA_EEIL_EEI28_MASK                      0x10000000u
#define DMA_EEIL_EEI28_SHIFT                     28u
#define DMA_EEIL_EEI28_WIDTH                     1u
#define DMA_EEIL_EEI28(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI28_SHIFT))&DMA_EEIL_EEI28_MASK)
#define DMA_EEIL_EEI29_MASK                      0x20000000u
#define DMA_EEIL_EEI29_SHIFT                     29u
#define DMA_EEIL_EEI29_WIDTH                     1u
#define DMA_EEIL_EEI29(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI29_SHIFT))&DMA_EEIL_EEI29_MASK)
#define DMA_EEIL_EEI30_MASK                      0x40000000u
#define DMA_EEIL_EEI30_SHIFT                     30u
#define DMA_EEIL_EEI30_WIDTH                     1u
#define DMA_EEIL_EEI30(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI30_SHIFT))&DMA_EEIL_EEI30_MASK)
#define DMA_EEIL_EEI31_MASK                      0x80000000u
#define DMA_EEIL_EEI31_SHIFT                     31u
#define DMA_EEIL_EEI31_WIDTH                     1u
#define DMA_EEIL_EEI31(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_EEIL_EEI31_SHIFT))&DMA_EEIL_EEI31_MASK)
/* SERQ Bit Fields */
#define DMA_SERQ_SERQ_MASK                       0x3Fu
#define DMA_SERQ_SERQ_SHIFT                      0u
#define DMA_SERQ_SERQ_WIDTH                      6u
#define DMA_SERQ_SERQ(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SERQ_SERQ_SHIFT))&DMA_SERQ_SERQ_MASK)
#define DMA_SERQ_SAER_MASK                       0x40u
#define DMA_SERQ_SAER_SHIFT                      6u
#define DMA_SERQ_SAER_WIDTH                      1u
#define DMA_SERQ_SAER(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SERQ_SAER_SHIFT))&DMA_SERQ_SAER_MASK)
#define DMA_SERQ_NOP_MASK                        0x80u
#define DMA_SERQ_NOP_SHIFT                       7u
#define DMA_SERQ_NOP_WIDTH                       1u
#define DMA_SERQ_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_SERQ_NOP_SHIFT))&DMA_SERQ_NOP_MASK)
/* CERQ Bit Fields */
#define DMA_CERQ_CERQ_MASK                       0x3Fu
#define DMA_CERQ_CERQ_SHIFT                      0u
#define DMA_CERQ_CERQ_WIDTH                      6u
#define DMA_CERQ_CERQ(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CERQ_CERQ_SHIFT))&DMA_CERQ_CERQ_MASK)
#define DMA_CERQ_CAER_MASK                       0x40u
#define DMA_CERQ_CAER_SHIFT                      6u
#define DMA_CERQ_CAER_WIDTH                      1u
#define DMA_CERQ_CAER(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CERQ_CAER_SHIFT))&DMA_CERQ_CAER_MASK)
#define DMA_CERQ_NOP_MASK                        0x80u
#define DMA_CERQ_NOP_SHIFT                       7u
#define DMA_CERQ_NOP_WIDTH                       1u
#define DMA_CERQ_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_CERQ_NOP_SHIFT))&DMA_CERQ_NOP_MASK)
/* SEEI Bit Fields */
#define DMA_SEEI_SEEI_MASK                       0x3Fu
#define DMA_SEEI_SEEI_SHIFT                      0u
#define DMA_SEEI_SEEI_WIDTH                      6u
#define DMA_SEEI_SEEI(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SEEI_SEEI_SHIFT))&DMA_SEEI_SEEI_MASK)
#define DMA_SEEI_SAEE_MASK                       0x40u
#define DMA_SEEI_SAEE_SHIFT                      6u
#define DMA_SEEI_SAEE_WIDTH                      1u
#define DMA_SEEI_SAEE(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SEEI_SAEE_SHIFT))&DMA_SEEI_SAEE_MASK)
#define DMA_SEEI_NOP_MASK                        0x80u
#define DMA_SEEI_NOP_SHIFT                       7u
#define DMA_SEEI_NOP_WIDTH                       1u
#define DMA_SEEI_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_SEEI_NOP_SHIFT))&DMA_SEEI_NOP_MASK)
/* CEEI Bit Fields */
#define DMA_CEEI_CEEI_MASK                       0x3Fu
#define DMA_CEEI_CEEI_SHIFT                      0u
#define DMA_CEEI_CEEI_WIDTH                      6u
#define DMA_CEEI_CEEI(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CEEI_CEEI_SHIFT))&DMA_CEEI_CEEI_MASK)
#define DMA_CEEI_CAEE_MASK                       0x40u
#define DMA_CEEI_CAEE_SHIFT                      6u
#define DMA_CEEI_CAEE_WIDTH                      1u
#define DMA_CEEI_CAEE(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CEEI_CAEE_SHIFT))&DMA_CEEI_CAEE_MASK)
#define DMA_CEEI_NOP_MASK                        0x80u
#define DMA_CEEI_NOP_SHIFT                       7u
#define DMA_CEEI_NOP_WIDTH                       1u
#define DMA_CEEI_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_CEEI_NOP_SHIFT))&DMA_CEEI_NOP_MASK)
/* CINT Bit Fields */
#define DMA_CINT_CINT_MASK                       0x3Fu
#define DMA_CINT_CINT_SHIFT                      0u
#define DMA_CINT_CINT_WIDTH                      6u
#define DMA_CINT_CINT(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CINT_CINT_SHIFT))&DMA_CINT_CINT_MASK)
#define DMA_CINT_CAIR_MASK                       0x40u
#define DMA_CINT_CAIR_SHIFT                      6u
