neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define DMA_CINT_CAIR_WIDTH                      1u
#define DMA_CINT_CAIR(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CINT_CAIR_SHIFT))&DMA_CINT_CAIR_MASK)
#define DMA_CINT_NOP_MASK                        0x80u
#define DMA_CINT_NOP_SHIFT                       7u
#define DMA_CINT_NOP_WIDTH                       1u
#define DMA_CINT_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_CINT_NOP_SHIFT))&DMA_CINT_NOP_MASK)
/* CERR Bit Fields */
#define DMA_CERR_CERR_MASK                       0x3Fu
#define DMA_CERR_CERR_SHIFT                      0u
#define DMA_CERR_CERR_WIDTH                      6u
#define DMA_CERR_CERR(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CERR_CERR_SHIFT))&DMA_CERR_CERR_MASK)
#define DMA_CERR_CAEI_MASK                       0x40u
#define DMA_CERR_CAEI_SHIFT                      6u
#define DMA_CERR_CAEI_WIDTH                      1u
#define DMA_CERR_CAEI(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CERR_CAEI_SHIFT))&DMA_CERR_CAEI_MASK)
#define DMA_CERR_NOP_MASK                        0x80u
#define DMA_CERR_NOP_SHIFT                       7u
#define DMA_CERR_NOP_WIDTH                       1u
#define DMA_CERR_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_CERR_NOP_SHIFT))&DMA_CERR_NOP_MASK)
/* SSRT Bit Fields */
#define DMA_SSRT_SSRT_MASK                       0x3Fu
#define DMA_SSRT_SSRT_SHIFT                      0u
#define DMA_SSRT_SSRT_WIDTH                      6u
#define DMA_SSRT_SSRT(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SSRT_SSRT_SHIFT))&DMA_SSRT_SSRT_MASK)
#define DMA_SSRT_SAST_MASK                       0x40u
#define DMA_SSRT_SAST_SHIFT                      6u
#define DMA_SSRT_SAST_WIDTH                      1u
#define DMA_SSRT_SAST(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_SSRT_SAST_SHIFT))&DMA_SSRT_SAST_MASK)
#define DMA_SSRT_NOP_MASK                        0x80u
#define DMA_SSRT_NOP_SHIFT                       7u
#define DMA_SSRT_NOP_WIDTH                       1u
#define DMA_SSRT_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_SSRT_NOP_SHIFT))&DMA_SSRT_NOP_MASK)
/* CDNE Bit Fields */
#define DMA_CDNE_CDNE_MASK                       0x3Fu
#define DMA_CDNE_CDNE_SHIFT                      0u
#define DMA_CDNE_CDNE_WIDTH                      6u
#define DMA_CDNE_CDNE(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CDNE_CDNE_SHIFT))&DMA_CDNE_CDNE_MASK)
#define DMA_CDNE_CADN_MASK                       0x40u
#define DMA_CDNE_CADN_SHIFT                      6u
#define DMA_CDNE_CADN_WIDTH                      1u
#define DMA_CDNE_CADN(x)                         (((uint8_t)(((uint8_t)(x))<<DMA_CDNE_CADN_SHIFT))&DMA_CDNE_CADN_MASK)
#define DMA_CDNE_NOP_MASK                        0x80u
#define DMA_CDNE_NOP_SHIFT                       7u
#define DMA_CDNE_NOP_WIDTH                       1u
#define DMA_CDNE_NOP(x)                          (((uint8_t)(((uint8_t)(x))<<DMA_CDNE_NOP_SHIFT))&DMA_CDNE_NOP_MASK)
/* INTH Bit Fields */
#define DMA_INTH_INT32_MASK                      0x1u
#define DMA_INTH_INT32_SHIFT                     0u
#define DMA_INTH_INT32_WIDTH                     1u
#define DMA_INTH_INT32(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT32_SHIFT))&DMA_INTH_INT32_MASK)
#define DMA_INTH_INT33_MASK                      0x2u
#define DMA_INTH_INT33_SHIFT                     1u
#define DMA_INTH_INT33_WIDTH                     1u
#define DMA_INTH_INT33(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT33_SHIFT))&DMA_INTH_INT33_MASK)
#define DMA_INTH_INT34_MASK                      0x4u
#define DMA_INTH_INT34_SHIFT                     2u
#define DMA_INTH_INT34_WIDTH                     1u
#define DMA_INTH_INT34(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT34_SHIFT))&DMA_INTH_INT34_MASK)
#define DMA_INTH_INT35_MASK                      0x8u
#define DMA_INTH_INT35_SHIFT                     3u
#define DMA_INTH_INT35_WIDTH                     1u
#define DMA_INTH_INT35(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT35_SHIFT))&DMA_INTH_INT35_MASK)
#define DMA_INTH_INT36_MASK                      0x10u
#define DMA_INTH_INT36_SHIFT                     4u
#define DMA_INTH_INT36_WIDTH                     1u
#define DMA_INTH_INT36(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT36_SHIFT))&DMA_INTH_INT36_MASK)
#define DMA_INTH_INT37_MASK                      0x20u
#define DMA_INTH_INT37_SHIFT                     5u
#define DMA_INTH_INT37_WIDTH                     1u
#define DMA_INTH_INT37(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT37_SHIFT))&DMA_INTH_INT37_MASK)
#define DMA_INTH_INT38_MASK                      0x40u
#define DMA_INTH_INT38_SHIFT                     6u
#define DMA_INTH_INT38_WIDTH                     1u
#define DMA_INTH_INT38(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT38_SHIFT))&DMA_INTH_INT38_MASK)
#define DMA_INTH_INT39_MASK                      0x80u
#define DMA_INTH_INT39_SHIFT                     7u
#define DMA_INTH_INT39_WIDTH                     1u
#define DMA_INTH_INT39(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT39_SHIFT))&DMA_INTH_INT39_MASK)
#define DMA_INTH_INT40_MASK                      0x100u
#define DMA_INTH_INT40_SHIFT                     8u
#define DMA_INTH_INT40_WIDTH                     1u
#define DMA_INTH_INT40(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT40_SHIFT))&DMA_INTH_INT40_MASK)
#define DMA_INTH_INT41_MASK                      0x200u
#define DMA_INTH_INT41_SHIFT                     9u
#define DMA_INTH_INT41_WIDTH                     1u
#define DMA_INTH_INT41(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT41_SHIFT))&DMA_INTH_INT41_MASK)
#define DMA_INTH_INT42_MASK                      0x400u
#define DMA_INTH_INT42_SHIFT                     10u
#define DMA_INTH_INT42_WIDTH                     1u
#define DMA_INTH_INT42(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT42_SHIFT))&DMA_INTH_INT42_MASK)
#define DMA_INTH_INT43_MASK                      0x800u
#define DMA_INTH_INT43_SHIFT                     11u
#define DMA_INTH_INT43_WIDTH                     1u
#define DMA_INTH_INT43(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT43_SHIFT))&DMA_INTH_INT43_MASK)
#define DMA_INTH_INT44_MASK                      0x1000u
#define DMA_INTH_INT44_SHIFT                     12u
#define DMA_INTH_INT44_WIDTH                     1u
#define DMA_INTH_INT44(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT44_SHIFT))&DMA_INTH_INT44_MASK)
#define DMA_INTH_INT45_MASK                      0x2000u
#define DMA_INTH_INT45_SHIFT                     13u
#define DMA_INTH_INT45_WIDTH                     1u
#define DMA_INTH_INT45(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT45_SHIFT))&DMA_INTH_INT45_MASK)
#define DMA_INTH_INT46_MASK                      0x4000u
#define DMA_INTH_INT46_SHIFT                     14u
#define DMA_INTH_INT46_WIDTH                     1u
#define DMA_INTH_INT46(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT46_SHIFT))&DMA_INTH_INT46_MASK)
#define DMA_INTH_INT47_MASK                      0x8000u
#define DMA_INTH_INT47_SHIFT                     15u
#define DMA_INTH_INT47_WIDTH                     1u
#define DMA_INTH_INT47(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT47_SHIFT))&DMA_INTH_INT47_MASK)
#define DMA_INTH_INT48_MASK                      0x10000u
#define DMA_INTH_INT48_SHIFT                     16u
#define DMA_INTH_INT48_WIDTH                     1u
#define DMA_INTH_INT48(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT48_SHIFT))&DMA_INTH_INT48_MASK)
#define DMA_INTH_INT49_MASK                      0x20000u
#define DMA_INTH_INT49_SHIFT                     17u
#define DMA_INTH_INT49_WIDTH                     1u
#define DMA_INTH_INT49(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT49_SHIFT))&DMA_INTH_INT49_MASK)
#define DMA_INTH_INT50_MASK                      0x40000u
#define DMA_INTH_INT50_SHIFT                     18u
#define DMA_INTH_INT50_WIDTH                     1u
#define DMA_INTH_INT50(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT50_SHIFT))&DMA_INTH_INT50_MASK)
#define DMA_INTH_INT51_MASK                      0x80000u
#define DMA_INTH_INT51_SHIFT                     19u
#define DMA_INTH_INT51_WIDTH                     1u
#define DMA_INTH_INT51(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT51_SHIFT))&DMA_INTH_INT51_MASK)
#define DMA_INTH_INT52_MASK                      0x100000u
#define DMA_INTH_INT52_SHIFT                     20u
#define DMA_INTH_INT52_WIDTH                     1u
#define DMA_INTH_INT52(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT52_SHIFT))&DMA_INTH_INT52_MASK)
#define DMA_INTH_INT53_MASK                      0x200000u
#define DMA_INTH_INT53_SHIFT                     21u
#define DMA_INTH_INT53_WIDTH                     1u
#define DMA_INTH_INT53(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT53_SHIFT))&DMA_INTH_INT53_MASK)
#define DMA_INTH_INT54_MASK                      0x400000u
#define DMA_INTH_INT54_SHIFT                     22u
#define DMA_INTH_INT54_WIDTH                     1u
#define DMA_INTH_INT54(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT54_SHIFT))&DMA_INTH_INT54_MASK)
#define DMA_INTH_INT55_MASK                      0x800000u
#define DMA_INTH_INT55_SHIFT                     23u
#define DMA_INTH_INT55_WIDTH                     1u
#define DMA_INTH_INT55(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT55_SHIFT))&DMA_INTH_INT55_MASK)
#define DMA_INTH_INT56_MASK                      0x1000000u
#define DMA_INTH_INT56_SHIFT                     24u
#define DMA_INTH_INT56_WIDTH                     1u
#define DMA_INTH_INT56(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT56_SHIFT))&DMA_INTH_INT56_MASK)
#define DMA_INTH_INT57_MASK                      0x2000000u
#define DMA_INTH_INT57_SHIFT                     25u
#define DMA_INTH_INT57_WIDTH                     1u
#define DMA_INTH_INT57(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT57_SHIFT))&DMA_INTH_INT57_MASK)
#define DMA_INTH_INT58_MASK                      0x4000000u
#define DMA_INTH_INT58_SHIFT                     26u
#define DMA_INTH_INT58_WIDTH                     1u
#define DMA_INTH_INT58(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT58_SHIFT))&DMA_INTH_INT58_MASK)
#define DMA_INTH_INT59_MASK                      0x8000000u
#define DMA_INTH_INT59_SHIFT                     27u
#define DMA_INTH_INT59_WIDTH                     1u
#define DMA_INTH_INT59(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT59_SHIFT))&DMA_INTH_INT59_MASK)
#define DMA_INTH_INT60_MASK                      0x10000000u
#define DMA_INTH_INT60_SHIFT                     28u
#define DMA_INTH_INT60_WIDTH                     1u
#define DMA_INTH_INT60(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT60_SHIFT))&DMA_INTH_INT60_MASK)
#define DMA_INTH_INT61_MASK                      0x20000000u
#define DMA_INTH_INT61_SHIFT                     29u
#define DMA_INTH_INT61_WIDTH                     1u
#define DMA_INTH_INT61(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT61_SHIFT))&DMA_INTH_INT61_MASK)
#define DMA_INTH_INT62_MASK                      0x40000000u
#define DMA_INTH_INT62_SHIFT                     30u
#define DMA_INTH_INT62_WIDTH                     1u
#define DMA_INTH_INT62(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT62_SHIFT))&DMA_INTH_INT62_MASK)
#define DMA_INTH_INT63_MASK                      0x80000000u
#define DMA_INTH_INT63_SHIFT                     31u
#define DMA_INTH_INT63_WIDTH                     1u
#define DMA_INTH_INT63(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTH_INT63_SHIFT))&DMA_INTH_INT63_MASK)
/* INTL Bit Fields */
#define DMA_INTL_INT0_MASK                       0x1u
#define DMA_INTL_INT0_SHIFT                      0u
#define DMA_INTL_INT0_WIDTH                      1u
#define DMA_INTL_INT0(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT0_SHIFT))&DMA_INTL_INT0_MASK)
#define DMA_INTL_INT1_MASK                       0x2u
#define DMA_INTL_INT1_SHIFT                      1u
#define DMA_INTL_INT1_WIDTH                      1u
#define DMA_INTL_INT1(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT1_SHIFT))&DMA_INTL_INT1_MASK)
#define DMA_INTL_INT2_MASK                       0x4u
#define DMA_INTL_INT2_SHIFT                      2u
#define DMA_INTL_INT2_WIDTH                      1u
#define DMA_INTL_INT2(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT2_SHIFT))&DMA_INTL_INT2_MASK)
#define DMA_INTL_INT3_MASK                       0x8u
#define DMA_INTL_INT3_SHIFT                      3u
#define DMA_INTL_INT3_WIDTH                      1u
#define DMA_INTL_INT3(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT3_SHIFT))&DMA_INTL_INT3_MASK)
#define DMA_INTL_INT4_MASK                       0x10u
#define DMA_INTL_INT4_SHIFT                      4u
#define DMA_INTL_INT4_WIDTH                      1u
#define DMA_INTL_INT4(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT4_SHIFT))&DMA_INTL_INT4_MASK)
#define DMA_INTL_INT5_MASK                       0x20u
#define DMA_INTL_INT5_SHIFT                      5u
#define DMA_INTL_INT5_WIDTH                      1u
#define DMA_INTL_INT5(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT5_SHIFT))&DMA_INTL_INT5_MASK)
#define DMA_INTL_INT6_MASK                       0x40u
#define DMA_INTL_INT6_SHIFT                      6u
#define DMA_INTL_INT6_WIDTH                      1u
#define DMA_INTL_INT6(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT6_SHIFT))&DMA_INTL_INT6_MASK)
#define DMA_INTL_INT7_MASK                       0x80u
#define DMA_INTL_INT7_SHIFT                      7u
#define DMA_INTL_INT7_WIDTH                      1u
#define DMA_INTL_INT7(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT7_SHIFT))&DMA_INTL_INT7_MASK)
#define DMA_INTL_INT8_MASK                       0x100u
#define DMA_INTL_INT8_SHIFT                      8u
#define DMA_INTL_INT8_WIDTH                      1u
#define DMA_INTL_INT8(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT8_SHIFT))&DMA_INTL_INT8_MASK)
#define DMA_INTL_INT9_MASK                       0x200u
#define DMA_INTL_INT9_SHIFT                      9u
#define DMA_INTL_INT9_WIDTH                      1u
#define DMA_INTL_INT9(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT9_SHIFT))&DMA_INTL_INT9_MASK)
#define DMA_INTL_INT10_MASK                      0x400u
#define DMA_INTL_INT10_SHIFT                     10u
#define DMA_INTL_INT10_WIDTH                     1u
#define DMA_INTL_INT10(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT10_SHIFT))&DMA_INTL_INT10_MASK)
#define DMA_INTL_INT11_MASK                      0x800u
#define DMA_INTL_INT11_SHIFT                     11u
#define DMA_INTL_INT11_WIDTH                     1u
#define DMA_INTL_INT11(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT11_SHIFT))&DMA_INTL_INT11_MASK)
#define DMA_INTL_INT12_MASK                      0x1000u
#define DMA_INTL_INT12_SHIFT                     12u
#define DMA_INTL_INT12_WIDTH                     1u
#define DMA_INTL_INT12(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT12_SHIFT))&DMA_INTL_INT12_MASK)
#define DMA_INTL_INT13_MASK                      0x2000u
#define DMA_INTL_INT13_SHIFT                     13u
#define DMA_INTL_INT13_WIDTH                     1u
#define DMA_INTL_INT13(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT13_SHIFT))&DMA_INTL_INT13_MASK)
#define DMA_INTL_INT14_MASK                      0x4000u
#define DMA_INTL_INT14_SHIFT                     14u
#define DMA_INTL_INT14_WIDTH                     1u
#define DMA_INTL_INT14(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT14_SHIFT))&DMA_INTL_INT14_MASK)
#define DMA_INTL_INT15_MASK                      0x8000u
#define DMA_INTL_INT15_SHIFT                     15u
#define DMA_INTL_INT15_WIDTH                     1u
#define DMA_INTL_INT15(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT15_SHIFT))&DMA_INTL_INT15_MASK)
#define DMA_INTL_INT16_MASK                      0x10000u
#define DMA_INTL_INT16_SHIFT                     16u
#define DMA_INTL_INT16_WIDTH                     1u
#define DMA_INTL_INT16(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT16_SHIFT))&DMA_INTL_INT16_MASK)
#define DMA_INTL_INT17_MASK                      0x20000u
#define DMA_INTL_INT17_SHIFT                     17u
#define DMA_INTL_INT17_WIDTH                     1u
#define DMA_INTL_INT17(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT17_SHIFT))&DMA_INTL_INT17_MASK)
#define DMA_INTL_INT18_MASK                      0x40000u
#define DMA_INTL_INT18_SHIFT                     18u
#define DMA_INTL_INT18_WIDTH                     1u
#define DMA_INTL_INT18(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT18_SHIFT))&DMA_INTL_INT18_MASK)
#define DMA_INTL_INT19_MASK                      0x80000u
#define DMA_INTL_INT19_SHIFT                     19u
#define DMA_INTL_INT19_WIDTH                     1u
#define DMA_INTL_INT19(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT19_SHIFT))&DMA_INTL_INT19_MASK)
#define DMA_INTL_INT20_MASK                      0x100000u
#define DMA_INTL_INT20_SHIFT                     20u
#define DMA_INTL_INT20_WIDTH                     1u
#define DMA_INTL_INT20(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT20_SHIFT))&DMA_INTL_INT20_MASK)
#define DMA_INTL_INT21_MASK                      0x200000u
#define DMA_INTL_INT21_SHIFT                     21u
#define DMA_INTL_INT21_WIDTH                     1u
#define DMA_INTL_INT21(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT21_SHIFT))&DMA_INTL_INT21_MASK)
#define DMA_INTL_INT22_MASK                      0x400000u
#define DMA_INTL_INT22_SHIFT                     22u
#define DMA_INTL_INT22_WIDTH                     1u
#define DMA_INTL_INT22(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT22_SHIFT))&DMA_INTL_INT22_MASK)
#define DMA_INTL_INT23_MASK                      0x800000u
#define DMA_INTL_INT23_SHIFT                     23u
#define DMA_INTL_INT23_WIDTH                     1u
#define DMA_INTL_INT23(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT23_SHIFT))&DMA_INTL_INT23_MASK)
#define DMA_INTL_INT24_MASK                      0x1000000u
#define DMA_INTL_INT24_SHIFT                     24u
#define DMA_INTL_INT24_WIDTH                     1u
#define DMA_INTL_INT24(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT24_SHIFT))&DMA_INTL_INT24_MASK)
#define DMA_INTL_INT25_MASK                      0x2000000u
#define DMA_INTL_INT25_SHIFT                     25u
#define DMA_INTL_INT25_WIDTH                     1u
#define DMA_INTL_INT25(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT25_SHIFT))&DMA_INTL_INT25_MASK)
#define DMA_INTL_INT26_MASK                      0x4000000u
#define DMA_INTL_INT26_SHIFT                     26u
#define DMA_INTL_INT26_WIDTH                     1u
#define DMA_INTL_INT26(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT26_SHIFT))&DMA_INTL_INT26_MASK)
#define DMA_INTL_INT27_MASK                      0x8000000u
#define DMA_INTL_INT27_SHIFT                     27u
#define DMA_INTL_INT27_WIDTH                     1u
#define DMA_INTL_INT27(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT27_SHIFT))&DMA_INTL_INT27_MASK)
#define DMA_INTL_INT28_MASK                      0x10000000u
#define DMA_INTL_INT28_SHIFT                     28u
#define DMA_INTL_INT28_WIDTH                     1u
#define DMA_INTL_INT28(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT28_SHIFT))&DMA_INTL_INT28_MASK)
#define DMA_INTL_INT29_MASK                      0x20000000u
#define DMA_INTL_INT29_SHIFT                     29u
#define DMA_INTL_INT29_WIDTH                     1u
#define DMA_INTL_INT29(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT29_SHIFT))&DMA_INTL_INT29_MASK)
#define DMA_INTL_INT30_MASK                      0x40000000u
#define DMA_INTL_INT30_SHIFT                     30u
#define DMA_INTL_INT30_WIDTH                     1u
#define DMA_INTL_INT30(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT30_SHIFT))&DMA_INTL_INT30_MASK)
#define DMA_INTL_INT31_MASK                      0x80000000u
#define DMA_INTL_INT31_SHIFT                     31u
#define DMA_INTL_INT31_WIDTH                     1u
#define DMA_INTL_INT31(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_INTL_INT31_SHIFT))&DMA_INTL_INT31_MASK)
/* ERRH Bit Fields */
#define DMA_ERRH_ERR32_MASK                      0x1u
#define DMA_ERRH_ERR32_SHIFT                     0u
#define DMA_ERRH_ERR32_WIDTH                     1u
#define DMA_ERRH_ERR32(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR32_SHIFT))&DMA_ERRH_ERR32_MASK)
#define DMA_ERRH_ERR33_MASK                      0x2u
#define DMA_ERRH_ERR33_SHIFT                     1u
#define DMA_ERRH_ERR33_WIDTH                     1u
#define DMA_ERRH_ERR33(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR33_SHIFT))&DMA_ERRH_ERR33_MASK)
#define DMA_ERRH_ERR34_MASK                      0x4u
#define DMA_ERRH_ERR34_SHIFT                     2u
#define DMA_ERRH_ERR34_WIDTH                     1u
#define DMA_ERRH_ERR34(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR34_SHIFT))&DMA_ERRH_ERR34_MASK)
#define DMA_ERRH_ERR35_MASK                      0x8u
#define DMA_ERRH_ERR35_SHIFT                     3u
#define DMA_ERRH_ERR35_WIDTH                     1u
#define DMA_ERRH_ERR35(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR35_SHIFT))&DMA_ERRH_ERR35_MASK)
#define DMA_ERRH_ERR36_MASK                      0x10u
#define DMA_ERRH_ERR36_SHIFT                     4u
#define DMA_ERRH_ERR36_WIDTH                     1u
#define DMA_ERRH_ERR36(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR36_SHIFT))&DMA_ERRH_ERR36_MASK)
#define DMA_ERRH_ERR37_MASK                      0x20u
#define DMA_ERRH_ERR37_SHIFT                     5u
#define DMA_ERRH_ERR37_WIDTH                     1u
#define DMA_ERRH_ERR37(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR37_SHIFT))&DMA_ERRH_ERR37_MASK)
#define DMA_ERRH_ERR38_MASK                      0x40u
#define DMA_ERRH_ERR38_SHIFT                     6u
#define DMA_ERRH_ERR38_WIDTH                     1u
#define DMA_ERRH_ERR38(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR38_SHIFT))&DMA_ERRH_ERR38_MASK)
#define DMA_ERRH_ERR39_MASK                      0x80u
#define DMA_ERRH_ERR39_SHIFT                     7u
#define DMA_ERRH_ERR39_WIDTH                     1u
#define DMA_ERRH_ERR39(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR39_SHIFT))&DMA_ERRH_ERR39_MASK)
#define DMA_ERRH_ERR40_MASK                      0x100u
#define DMA_ERRH_ERR40_SHIFT                     8u
#define DMA_ERRH_ERR40_WIDTH                     1u
#define DMA_ERRH_ERR40(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR40_SHIFT))&DMA_ERRH_ERR40_MASK)
#define DMA_ERRH_ERR41_MASK                      0x200u
#define DMA_ERRH_ERR41_SHIFT                     9u
