neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define DMA_ERRH_ERR41_WIDTH                     1u
#define DMA_ERRH_ERR41(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR41_SHIFT))&DMA_ERRH_ERR41_MASK)
#define DMA_ERRH_ERR42_MASK                      0x400u
#define DMA_ERRH_ERR42_SHIFT                     10u
#define DMA_ERRH_ERR42_WIDTH                     1u
#define DMA_ERRH_ERR42(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR42_SHIFT))&DMA_ERRH_ERR42_MASK)
#define DMA_ERRH_ERR43_MASK                      0x800u
#define DMA_ERRH_ERR43_SHIFT                     11u
#define DMA_ERRH_ERR43_WIDTH                     1u
#define DMA_ERRH_ERR43(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR43_SHIFT))&DMA_ERRH_ERR43_MASK)
#define DMA_ERRH_ERR44_MASK                      0x1000u
#define DMA_ERRH_ERR44_SHIFT                     12u
#define DMA_ERRH_ERR44_WIDTH                     1u
#define DMA_ERRH_ERR44(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR44_SHIFT))&DMA_ERRH_ERR44_MASK)
#define DMA_ERRH_ERR45_MASK                      0x2000u
#define DMA_ERRH_ERR45_SHIFT                     13u
#define DMA_ERRH_ERR45_WIDTH                     1u
#define DMA_ERRH_ERR45(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR45_SHIFT))&DMA_ERRH_ERR45_MASK)
#define DMA_ERRH_ERR46_MASK                      0x4000u
#define DMA_ERRH_ERR46_SHIFT                     14u
#define DMA_ERRH_ERR46_WIDTH                     1u
#define DMA_ERRH_ERR46(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR46_SHIFT))&DMA_ERRH_ERR46_MASK)
#define DMA_ERRH_ERR47_MASK                      0x8000u
#define DMA_ERRH_ERR47_SHIFT                     15u
#define DMA_ERRH_ERR47_WIDTH                     1u
#define DMA_ERRH_ERR47(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR47_SHIFT))&DMA_ERRH_ERR47_MASK)
#define DMA_ERRH_ERR48_MASK                      0x10000u
#define DMA_ERRH_ERR48_SHIFT                     16u
#define DMA_ERRH_ERR48_WIDTH                     1u
#define DMA_ERRH_ERR48(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR48_SHIFT))&DMA_ERRH_ERR48_MASK)
#define DMA_ERRH_ERR49_MASK                      0x20000u
#define DMA_ERRH_ERR49_SHIFT                     17u
#define DMA_ERRH_ERR49_WIDTH                     1u
#define DMA_ERRH_ERR49(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR49_SHIFT))&DMA_ERRH_ERR49_MASK)
#define DMA_ERRH_ERR50_MASK                      0x40000u
#define DMA_ERRH_ERR50_SHIFT                     18u
#define DMA_ERRH_ERR50_WIDTH                     1u
#define DMA_ERRH_ERR50(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR50_SHIFT))&DMA_ERRH_ERR50_MASK)
#define DMA_ERRH_ERR51_MASK                      0x80000u
#define DMA_ERRH_ERR51_SHIFT                     19u
#define DMA_ERRH_ERR51_WIDTH                     1u
#define DMA_ERRH_ERR51(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR51_SHIFT))&DMA_ERRH_ERR51_MASK)
#define DMA_ERRH_ERR52_MASK                      0x100000u
#define DMA_ERRH_ERR52_SHIFT                     20u
#define DMA_ERRH_ERR52_WIDTH                     1u
#define DMA_ERRH_ERR52(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR52_SHIFT))&DMA_ERRH_ERR52_MASK)
#define DMA_ERRH_ERR53_MASK                      0x200000u
#define DMA_ERRH_ERR53_SHIFT                     21u
#define DMA_ERRH_ERR53_WIDTH                     1u
#define DMA_ERRH_ERR53(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR53_SHIFT))&DMA_ERRH_ERR53_MASK)
#define DMA_ERRH_ERR54_MASK                      0x400000u
#define DMA_ERRH_ERR54_SHIFT                     22u
#define DMA_ERRH_ERR54_WIDTH                     1u
#define DMA_ERRH_ERR54(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR54_SHIFT))&DMA_ERRH_ERR54_MASK)
#define DMA_ERRH_ERR55_MASK                      0x800000u
#define DMA_ERRH_ERR55_SHIFT                     23u
#define DMA_ERRH_ERR55_WIDTH                     1u
#define DMA_ERRH_ERR55(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR55_SHIFT))&DMA_ERRH_ERR55_MASK)
#define DMA_ERRH_ERR56_MASK                      0x1000000u
#define DMA_ERRH_ERR56_SHIFT                     24u
#define DMA_ERRH_ERR56_WIDTH                     1u
#define DMA_ERRH_ERR56(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR56_SHIFT))&DMA_ERRH_ERR56_MASK)
#define DMA_ERRH_ERR57_MASK                      0x2000000u
#define DMA_ERRH_ERR57_SHIFT                     25u
#define DMA_ERRH_ERR57_WIDTH                     1u
#define DMA_ERRH_ERR57(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR57_SHIFT))&DMA_ERRH_ERR57_MASK)
#define DMA_ERRH_ERR58_MASK                      0x4000000u
#define DMA_ERRH_ERR58_SHIFT                     26u
#define DMA_ERRH_ERR58_WIDTH                     1u
#define DMA_ERRH_ERR58(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR58_SHIFT))&DMA_ERRH_ERR58_MASK)
#define DMA_ERRH_ERR59_MASK                      0x8000000u
#define DMA_ERRH_ERR59_SHIFT                     27u
#define DMA_ERRH_ERR59_WIDTH                     1u
#define DMA_ERRH_ERR59(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR59_SHIFT))&DMA_ERRH_ERR59_MASK)
#define DMA_ERRH_ERR60_MASK                      0x10000000u
#define DMA_ERRH_ERR60_SHIFT                     28u
#define DMA_ERRH_ERR60_WIDTH                     1u
#define DMA_ERRH_ERR60(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR60_SHIFT))&DMA_ERRH_ERR60_MASK)
#define DMA_ERRH_ERR61_MASK                      0x20000000u
#define DMA_ERRH_ERR61_SHIFT                     29u
#define DMA_ERRH_ERR61_WIDTH                     1u
#define DMA_ERRH_ERR61(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR61_SHIFT))&DMA_ERRH_ERR61_MASK)
#define DMA_ERRH_ERR62_MASK                      0x40000000u
#define DMA_ERRH_ERR62_SHIFT                     30u
#define DMA_ERRH_ERR62_WIDTH                     1u
#define DMA_ERRH_ERR62(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR62_SHIFT))&DMA_ERRH_ERR62_MASK)
#define DMA_ERRH_ERR63_MASK                      0x80000000u
#define DMA_ERRH_ERR63_SHIFT                     31u
#define DMA_ERRH_ERR63_WIDTH                     1u
#define DMA_ERRH_ERR63(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRH_ERR63_SHIFT))&DMA_ERRH_ERR63_MASK)
/* ERRL Bit Fields */
#define DMA_ERRL_ERR0_MASK                       0x1u
#define DMA_ERRL_ERR0_SHIFT                      0u
#define DMA_ERRL_ERR0_WIDTH                      1u
#define DMA_ERRL_ERR0(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR0_SHIFT))&DMA_ERRL_ERR0_MASK)
#define DMA_ERRL_ERR1_MASK                       0x2u
#define DMA_ERRL_ERR1_SHIFT                      1u
#define DMA_ERRL_ERR1_WIDTH                      1u
#define DMA_ERRL_ERR1(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR1_SHIFT))&DMA_ERRL_ERR1_MASK)
#define DMA_ERRL_ERR2_MASK                       0x4u
#define DMA_ERRL_ERR2_SHIFT                      2u
#define DMA_ERRL_ERR2_WIDTH                      1u
#define DMA_ERRL_ERR2(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR2_SHIFT))&DMA_ERRL_ERR2_MASK)
#define DMA_ERRL_ERR3_MASK                       0x8u
#define DMA_ERRL_ERR3_SHIFT                      3u
#define DMA_ERRL_ERR3_WIDTH                      1u
#define DMA_ERRL_ERR3(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR3_SHIFT))&DMA_ERRL_ERR3_MASK)
#define DMA_ERRL_ERR4_MASK                       0x10u
#define DMA_ERRL_ERR4_SHIFT                      4u
#define DMA_ERRL_ERR4_WIDTH                      1u
#define DMA_ERRL_ERR4(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR4_SHIFT))&DMA_ERRL_ERR4_MASK)
#define DMA_ERRL_ERR5_MASK                       0x20u
#define DMA_ERRL_ERR5_SHIFT                      5u
#define DMA_ERRL_ERR5_WIDTH                      1u
#define DMA_ERRL_ERR5(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR5_SHIFT))&DMA_ERRL_ERR5_MASK)
#define DMA_ERRL_ERR6_MASK                       0x40u
#define DMA_ERRL_ERR6_SHIFT                      6u
#define DMA_ERRL_ERR6_WIDTH                      1u
#define DMA_ERRL_ERR6(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR6_SHIFT))&DMA_ERRL_ERR6_MASK)
#define DMA_ERRL_ERR7_MASK                       0x80u
#define DMA_ERRL_ERR7_SHIFT                      7u
#define DMA_ERRL_ERR7_WIDTH                      1u
#define DMA_ERRL_ERR7(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR7_SHIFT))&DMA_ERRL_ERR7_MASK)
#define DMA_ERRL_ERR8_MASK                       0x100u
#define DMA_ERRL_ERR8_SHIFT                      8u
#define DMA_ERRL_ERR8_WIDTH                      1u
#define DMA_ERRL_ERR8(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR8_SHIFT))&DMA_ERRL_ERR8_MASK)
#define DMA_ERRL_ERR9_MASK                       0x200u
#define DMA_ERRL_ERR9_SHIFT                      9u
#define DMA_ERRL_ERR9_WIDTH                      1u
#define DMA_ERRL_ERR9(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR9_SHIFT))&DMA_ERRL_ERR9_MASK)
#define DMA_ERRL_ERR10_MASK                      0x400u
#define DMA_ERRL_ERR10_SHIFT                     10u
#define DMA_ERRL_ERR10_WIDTH                     1u
#define DMA_ERRL_ERR10(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR10_SHIFT))&DMA_ERRL_ERR10_MASK)
#define DMA_ERRL_ERR11_MASK                      0x800u
#define DMA_ERRL_ERR11_SHIFT                     11u
#define DMA_ERRL_ERR11_WIDTH                     1u
#define DMA_ERRL_ERR11(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR11_SHIFT))&DMA_ERRL_ERR11_MASK)
#define DMA_ERRL_ERR12_MASK                      0x1000u
#define DMA_ERRL_ERR12_SHIFT                     12u
#define DMA_ERRL_ERR12_WIDTH                     1u
#define DMA_ERRL_ERR12(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR12_SHIFT))&DMA_ERRL_ERR12_MASK)
#define DMA_ERRL_ERR13_MASK                      0x2000u
#define DMA_ERRL_ERR13_SHIFT                     13u
#define DMA_ERRL_ERR13_WIDTH                     1u
#define DMA_ERRL_ERR13(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR13_SHIFT))&DMA_ERRL_ERR13_MASK)
#define DMA_ERRL_ERR14_MASK                      0x4000u
#define DMA_ERRL_ERR14_SHIFT                     14u
#define DMA_ERRL_ERR14_WIDTH                     1u
#define DMA_ERRL_ERR14(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR14_SHIFT))&DMA_ERRL_ERR14_MASK)
#define DMA_ERRL_ERR15_MASK                      0x8000u
#define DMA_ERRL_ERR15_SHIFT                     15u
#define DMA_ERRL_ERR15_WIDTH                     1u
#define DMA_ERRL_ERR15(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR15_SHIFT))&DMA_ERRL_ERR15_MASK)
#define DMA_ERRL_ERR16_MASK                      0x10000u
#define DMA_ERRL_ERR16_SHIFT                     16u
#define DMA_ERRL_ERR16_WIDTH                     1u
#define DMA_ERRL_ERR16(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR16_SHIFT))&DMA_ERRL_ERR16_MASK)
#define DMA_ERRL_ERR17_MASK                      0x20000u
#define DMA_ERRL_ERR17_SHIFT                     17u
#define DMA_ERRL_ERR17_WIDTH                     1u
#define DMA_ERRL_ERR17(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR17_SHIFT))&DMA_ERRL_ERR17_MASK)
#define DMA_ERRL_ERR18_MASK                      0x40000u
#define DMA_ERRL_ERR18_SHIFT                     18u
#define DMA_ERRL_ERR18_WIDTH                     1u
#define DMA_ERRL_ERR18(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR18_SHIFT))&DMA_ERRL_ERR18_MASK)
#define DMA_ERRL_ERR19_MASK                      0x80000u
#define DMA_ERRL_ERR19_SHIFT                     19u
#define DMA_ERRL_ERR19_WIDTH                     1u
#define DMA_ERRL_ERR19(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR19_SHIFT))&DMA_ERRL_ERR19_MASK)
#define DMA_ERRL_ERR20_MASK                      0x100000u
#define DMA_ERRL_ERR20_SHIFT                     20u
#define DMA_ERRL_ERR20_WIDTH                     1u
#define DMA_ERRL_ERR20(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR20_SHIFT))&DMA_ERRL_ERR20_MASK)
#define DMA_ERRL_ERR21_MASK                      0x200000u
#define DMA_ERRL_ERR21_SHIFT                     21u
#define DMA_ERRL_ERR21_WIDTH                     1u
#define DMA_ERRL_ERR21(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR21_SHIFT))&DMA_ERRL_ERR21_MASK)
#define DMA_ERRL_ERR22_MASK                      0x400000u
#define DMA_ERRL_ERR22_SHIFT                     22u
#define DMA_ERRL_ERR22_WIDTH                     1u
#define DMA_ERRL_ERR22(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR22_SHIFT))&DMA_ERRL_ERR22_MASK)
#define DMA_ERRL_ERR23_MASK                      0x800000u
#define DMA_ERRL_ERR23_SHIFT                     23u
#define DMA_ERRL_ERR23_WIDTH                     1u
#define DMA_ERRL_ERR23(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR23_SHIFT))&DMA_ERRL_ERR23_MASK)
#define DMA_ERRL_ERR24_MASK                      0x1000000u
#define DMA_ERRL_ERR24_SHIFT                     24u
#define DMA_ERRL_ERR24_WIDTH                     1u
#define DMA_ERRL_ERR24(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR24_SHIFT))&DMA_ERRL_ERR24_MASK)
#define DMA_ERRL_ERR25_MASK                      0x2000000u
#define DMA_ERRL_ERR25_SHIFT                     25u
#define DMA_ERRL_ERR25_WIDTH                     1u
#define DMA_ERRL_ERR25(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR25_SHIFT))&DMA_ERRL_ERR25_MASK)
#define DMA_ERRL_ERR26_MASK                      0x4000000u
#define DMA_ERRL_ERR26_SHIFT                     26u
#define DMA_ERRL_ERR26_WIDTH                     1u
#define DMA_ERRL_ERR26(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR26_SHIFT))&DMA_ERRL_ERR26_MASK)
#define DMA_ERRL_ERR27_MASK                      0x8000000u
#define DMA_ERRL_ERR27_SHIFT                     27u
#define DMA_ERRL_ERR27_WIDTH                     1u
#define DMA_ERRL_ERR27(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR27_SHIFT))&DMA_ERRL_ERR27_MASK)
#define DMA_ERRL_ERR28_MASK                      0x10000000u
#define DMA_ERRL_ERR28_SHIFT                     28u
#define DMA_ERRL_ERR28_WIDTH                     1u
#define DMA_ERRL_ERR28(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR28_SHIFT))&DMA_ERRL_ERR28_MASK)
#define DMA_ERRL_ERR29_MASK                      0x20000000u
#define DMA_ERRL_ERR29_SHIFT                     29u
#define DMA_ERRL_ERR29_WIDTH                     1u
#define DMA_ERRL_ERR29(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR29_SHIFT))&DMA_ERRL_ERR29_MASK)
#define DMA_ERRL_ERR30_MASK                      0x40000000u
#define DMA_ERRL_ERR30_SHIFT                     30u
#define DMA_ERRL_ERR30_WIDTH                     1u
#define DMA_ERRL_ERR30(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR30_SHIFT))&DMA_ERRL_ERR30_MASK)
#define DMA_ERRL_ERR31_MASK                      0x80000000u
#define DMA_ERRL_ERR31_SHIFT                     31u
#define DMA_ERRL_ERR31_WIDTH                     1u
#define DMA_ERRL_ERR31(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_ERRL_ERR31_SHIFT))&DMA_ERRL_ERR31_MASK)
/* HRSH Bit Fields */
#define DMA_HRSH_HRS32_MASK                      0x1u
#define DMA_HRSH_HRS32_SHIFT                     0u
#define DMA_HRSH_HRS32_WIDTH                     1u
#define DMA_HRSH_HRS32(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS32_SHIFT))&DMA_HRSH_HRS32_MASK)
#define DMA_HRSH_HRS33_MASK                      0x2u
#define DMA_HRSH_HRS33_SHIFT                     1u
#define DMA_HRSH_HRS33_WIDTH                     1u
#define DMA_HRSH_HRS33(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS33_SHIFT))&DMA_HRSH_HRS33_MASK)
#define DMA_HRSH_HRS34_MASK                      0x4u
#define DMA_HRSH_HRS34_SHIFT                     2u
#define DMA_HRSH_HRS34_WIDTH                     1u
#define DMA_HRSH_HRS34(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS34_SHIFT))&DMA_HRSH_HRS34_MASK)
#define DMA_HRSH_HRS35_MASK                      0x8u
#define DMA_HRSH_HRS35_SHIFT                     3u
#define DMA_HRSH_HRS35_WIDTH                     1u
#define DMA_HRSH_HRS35(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS35_SHIFT))&DMA_HRSH_HRS35_MASK)
#define DMA_HRSH_HRS36_MASK                      0x10u
#define DMA_HRSH_HRS36_SHIFT                     4u
#define DMA_HRSH_HRS36_WIDTH                     1u
#define DMA_HRSH_HRS36(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS36_SHIFT))&DMA_HRSH_HRS36_MASK)
#define DMA_HRSH_HRS37_MASK                      0x20u
#define DMA_HRSH_HRS37_SHIFT                     5u
#define DMA_HRSH_HRS37_WIDTH                     1u
#define DMA_HRSH_HRS37(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS37_SHIFT))&DMA_HRSH_HRS37_MASK)
#define DMA_HRSH_HRS38_MASK                      0x40u
#define DMA_HRSH_HRS38_SHIFT                     6u
#define DMA_HRSH_HRS38_WIDTH                     1u
#define DMA_HRSH_HRS38(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS38_SHIFT))&DMA_HRSH_HRS38_MASK)
#define DMA_HRSH_HRS39_MASK                      0x80u
#define DMA_HRSH_HRS39_SHIFT                     7u
#define DMA_HRSH_HRS39_WIDTH                     1u
#define DMA_HRSH_HRS39(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS39_SHIFT))&DMA_HRSH_HRS39_MASK)
#define DMA_HRSH_HRS40_MASK                      0x100u
#define DMA_HRSH_HRS40_SHIFT                     8u
#define DMA_HRSH_HRS40_WIDTH                     1u
#define DMA_HRSH_HRS40(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS40_SHIFT))&DMA_HRSH_HRS40_MASK)
#define DMA_HRSH_HRS41_MASK                      0x200u
#define DMA_HRSH_HRS41_SHIFT                     9u
#define DMA_HRSH_HRS41_WIDTH                     1u
#define DMA_HRSH_HRS41(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS41_SHIFT))&DMA_HRSH_HRS41_MASK)
#define DMA_HRSH_HRS42_MASK                      0x400u
#define DMA_HRSH_HRS42_SHIFT                     10u
#define DMA_HRSH_HRS42_WIDTH                     1u
#define DMA_HRSH_HRS42(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS42_SHIFT))&DMA_HRSH_HRS42_MASK)
#define DMA_HRSH_HRS43_MASK                      0x800u
#define DMA_HRSH_HRS43_SHIFT                     11u
#define DMA_HRSH_HRS43_WIDTH                     1u
#define DMA_HRSH_HRS43(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS43_SHIFT))&DMA_HRSH_HRS43_MASK)
#define DMA_HRSH_HRS44_MASK                      0x1000u
#define DMA_HRSH_HRS44_SHIFT                     12u
#define DMA_HRSH_HRS44_WIDTH                     1u
#define DMA_HRSH_HRS44(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS44_SHIFT))&DMA_HRSH_HRS44_MASK)
#define DMA_HRSH_HRS45_MASK                      0x2000u
#define DMA_HRSH_HRS45_SHIFT                     13u
#define DMA_HRSH_HRS45_WIDTH                     1u
#define DMA_HRSH_HRS45(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS45_SHIFT))&DMA_HRSH_HRS45_MASK)
#define DMA_HRSH_HRS46_MASK                      0x4000u
#define DMA_HRSH_HRS46_SHIFT                     14u
#define DMA_HRSH_HRS46_WIDTH                     1u
#define DMA_HRSH_HRS46(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS46_SHIFT))&DMA_HRSH_HRS46_MASK)
#define DMA_HRSH_HRS47_MASK                      0x8000u
#define DMA_HRSH_HRS47_SHIFT                     15u
#define DMA_HRSH_HRS47_WIDTH                     1u
#define DMA_HRSH_HRS47(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS47_SHIFT))&DMA_HRSH_HRS47_MASK)
#define DMA_HRSH_HRS48_MASK                      0x10000u
#define DMA_HRSH_HRS48_SHIFT                     16u
#define DMA_HRSH_HRS48_WIDTH                     1u
#define DMA_HRSH_HRS48(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS48_SHIFT))&DMA_HRSH_HRS48_MASK)
#define DMA_HRSH_HRS49_MASK                      0x20000u
#define DMA_HRSH_HRS49_SHIFT                     17u
#define DMA_HRSH_HRS49_WIDTH                     1u
#define DMA_HRSH_HRS49(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS49_SHIFT))&DMA_HRSH_HRS49_MASK)
#define DMA_HRSH_HRS50_MASK                      0x40000u
#define DMA_HRSH_HRS50_SHIFT                     18u
#define DMA_HRSH_HRS50_WIDTH                     1u
#define DMA_HRSH_HRS50(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS50_SHIFT))&DMA_HRSH_HRS50_MASK)
#define DMA_HRSH_HRS51_MASK                      0x80000u
#define DMA_HRSH_HRS51_SHIFT                     19u
#define DMA_HRSH_HRS51_WIDTH                     1u
#define DMA_HRSH_HRS51(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS51_SHIFT))&DMA_HRSH_HRS51_MASK)
#define DMA_HRSH_HRS52_MASK                      0x100000u
#define DMA_HRSH_HRS52_SHIFT                     20u
#define DMA_HRSH_HRS52_WIDTH                     1u
#define DMA_HRSH_HRS52(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS52_SHIFT))&DMA_HRSH_HRS52_MASK)
#define DMA_HRSH_HRS53_MASK                      0x200000u
#define DMA_HRSH_HRS53_SHIFT                     21u
#define DMA_HRSH_HRS53_WIDTH                     1u
#define DMA_HRSH_HRS53(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS53_SHIFT))&DMA_HRSH_HRS53_MASK)
#define DMA_HRSH_HRS54_MASK                      0x400000u
#define DMA_HRSH_HRS54_SHIFT                     22u
#define DMA_HRSH_HRS54_WIDTH                     1u
#define DMA_HRSH_HRS54(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS54_SHIFT))&DMA_HRSH_HRS54_MASK)
#define DMA_HRSH_HRS55_MASK                      0x800000u
#define DMA_HRSH_HRS55_SHIFT                     23u
#define DMA_HRSH_HRS55_WIDTH                     1u
#define DMA_HRSH_HRS55(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS55_SHIFT))&DMA_HRSH_HRS55_MASK)
#define DMA_HRSH_HRS56_MASK                      0x1000000u
#define DMA_HRSH_HRS56_SHIFT                     24u
#define DMA_HRSH_HRS56_WIDTH                     1u
#define DMA_HRSH_HRS56(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS56_SHIFT))&DMA_HRSH_HRS56_MASK)
#define DMA_HRSH_HRS57_MASK                      0x2000000u
#define DMA_HRSH_HRS57_SHIFT                     25u
#define DMA_HRSH_HRS57_WIDTH                     1u
#define DMA_HRSH_HRS57(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS57_SHIFT))&DMA_HRSH_HRS57_MASK)
#define DMA_HRSH_HRS58_MASK                      0x4000000u
#define DMA_HRSH_HRS58_SHIFT                     26u
#define DMA_HRSH_HRS58_WIDTH                     1u
#define DMA_HRSH_HRS58(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS58_SHIFT))&DMA_HRSH_HRS58_MASK)
#define DMA_HRSH_HRS59_MASK                      0x8000000u
#define DMA_HRSH_HRS59_SHIFT                     27u
#define DMA_HRSH_HRS59_WIDTH                     1u
#define DMA_HRSH_HRS59(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS59_SHIFT))&DMA_HRSH_HRS59_MASK)
#define DMA_HRSH_HRS60_MASK                      0x10000000u
#define DMA_HRSH_HRS60_SHIFT                     28u
#define DMA_HRSH_HRS60_WIDTH                     1u
#define DMA_HRSH_HRS60(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS60_SHIFT))&DMA_HRSH_HRS60_MASK)
#define DMA_HRSH_HRS61_MASK                      0x20000000u
