neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define DMA_HRSH_HRS61_SHIFT                     29u
#define DMA_HRSH_HRS61_WIDTH                     1u
#define DMA_HRSH_HRS61(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS61_SHIFT))&DMA_HRSH_HRS61_MASK)
#define DMA_HRSH_HRS62_MASK                      0x40000000u
#define DMA_HRSH_HRS62_SHIFT                     30u
#define DMA_HRSH_HRS62_WIDTH                     1u
#define DMA_HRSH_HRS62(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS62_SHIFT))&DMA_HRSH_HRS62_MASK)
#define DMA_HRSH_HRS63_MASK                      0x80000000u
#define DMA_HRSH_HRS63_SHIFT                     31u
#define DMA_HRSH_HRS63_WIDTH                     1u
#define DMA_HRSH_HRS63(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSH_HRS63_SHIFT))&DMA_HRSH_HRS63_MASK)
/* HRSL Bit Fields */
#define DMA_HRSL_HRS0_MASK                       0x1u
#define DMA_HRSL_HRS0_SHIFT                      0u
#define DMA_HRSL_HRS0_WIDTH                      1u
#define DMA_HRSL_HRS0(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS0_SHIFT))&DMA_HRSL_HRS0_MASK)
#define DMA_HRSL_HRS1_MASK                       0x2u
#define DMA_HRSL_HRS1_SHIFT                      1u
#define DMA_HRSL_HRS1_WIDTH                      1u
#define DMA_HRSL_HRS1(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS1_SHIFT))&DMA_HRSL_HRS1_MASK)
#define DMA_HRSL_HRS2_MASK                       0x4u
#define DMA_HRSL_HRS2_SHIFT                      2u
#define DMA_HRSL_HRS2_WIDTH                      1u
#define DMA_HRSL_HRS2(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS2_SHIFT))&DMA_HRSL_HRS2_MASK)
#define DMA_HRSL_HRS3_MASK                       0x8u
#define DMA_HRSL_HRS3_SHIFT                      3u
#define DMA_HRSL_HRS3_WIDTH                      1u
#define DMA_HRSL_HRS3(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS3_SHIFT))&DMA_HRSL_HRS3_MASK)
#define DMA_HRSL_HRS4_MASK                       0x10u
#define DMA_HRSL_HRS4_SHIFT                      4u
#define DMA_HRSL_HRS4_WIDTH                      1u
#define DMA_HRSL_HRS4(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS4_SHIFT))&DMA_HRSL_HRS4_MASK)
#define DMA_HRSL_HRS5_MASK                       0x20u
#define DMA_HRSL_HRS5_SHIFT                      5u
#define DMA_HRSL_HRS5_WIDTH                      1u
#define DMA_HRSL_HRS5(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS5_SHIFT))&DMA_HRSL_HRS5_MASK)
#define DMA_HRSL_HRS6_MASK                       0x40u
#define DMA_HRSL_HRS6_SHIFT                      6u
#define DMA_HRSL_HRS6_WIDTH                      1u
#define DMA_HRSL_HRS6(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS6_SHIFT))&DMA_HRSL_HRS6_MASK)
#define DMA_HRSL_HRS7_MASK                       0x80u
#define DMA_HRSL_HRS7_SHIFT                      7u
#define DMA_HRSL_HRS7_WIDTH                      1u
#define DMA_HRSL_HRS7(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS7_SHIFT))&DMA_HRSL_HRS7_MASK)
#define DMA_HRSL_HRS8_MASK                       0x100u
#define DMA_HRSL_HRS8_SHIFT                      8u
#define DMA_HRSL_HRS8_WIDTH                      1u
#define DMA_HRSL_HRS8(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS8_SHIFT))&DMA_HRSL_HRS8_MASK)
#define DMA_HRSL_HRS9_MASK                       0x200u
#define DMA_HRSL_HRS9_SHIFT                      9u
#define DMA_HRSL_HRS9_WIDTH                      1u
#define DMA_HRSL_HRS9(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS9_SHIFT))&DMA_HRSL_HRS9_MASK)
#define DMA_HRSL_HRS10_MASK                      0x400u
#define DMA_HRSL_HRS10_SHIFT                     10u
#define DMA_HRSL_HRS10_WIDTH                     1u
#define DMA_HRSL_HRS10(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS10_SHIFT))&DMA_HRSL_HRS10_MASK)
#define DMA_HRSL_HRS11_MASK                      0x800u
#define DMA_HRSL_HRS11_SHIFT                     11u
#define DMA_HRSL_HRS11_WIDTH                     1u
#define DMA_HRSL_HRS11(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS11_SHIFT))&DMA_HRSL_HRS11_MASK)
#define DMA_HRSL_HRS12_MASK                      0x1000u
#define DMA_HRSL_HRS12_SHIFT                     12u
#define DMA_HRSL_HRS12_WIDTH                     1u
#define DMA_HRSL_HRS12(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS12_SHIFT))&DMA_HRSL_HRS12_MASK)
#define DMA_HRSL_HRS13_MASK                      0x2000u
#define DMA_HRSL_HRS13_SHIFT                     13u
#define DMA_HRSL_HRS13_WIDTH                     1u
#define DMA_HRSL_HRS13(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS13_SHIFT))&DMA_HRSL_HRS13_MASK)
#define DMA_HRSL_HRS14_MASK                      0x4000u
#define DMA_HRSL_HRS14_SHIFT                     14u
#define DMA_HRSL_HRS14_WIDTH                     1u
#define DMA_HRSL_HRS14(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS14_SHIFT))&DMA_HRSL_HRS14_MASK)
#define DMA_HRSL_HRS15_MASK                      0x8000u
#define DMA_HRSL_HRS15_SHIFT                     15u
#define DMA_HRSL_HRS15_WIDTH                     1u
#define DMA_HRSL_HRS15(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS15_SHIFT))&DMA_HRSL_HRS15_MASK)
#define DMA_HRSL_HRS16_MASK                      0x10000u
#define DMA_HRSL_HRS16_SHIFT                     16u
#define DMA_HRSL_HRS16_WIDTH                     1u
#define DMA_HRSL_HRS16(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS16_SHIFT))&DMA_HRSL_HRS16_MASK)
#define DMA_HRSL_HRS17_MASK                      0x20000u
#define DMA_HRSL_HRS17_SHIFT                     17u
#define DMA_HRSL_HRS17_WIDTH                     1u
#define DMA_HRSL_HRS17(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS17_SHIFT))&DMA_HRSL_HRS17_MASK)
#define DMA_HRSL_HRS18_MASK                      0x40000u
#define DMA_HRSL_HRS18_SHIFT                     18u
#define DMA_HRSL_HRS18_WIDTH                     1u
#define DMA_HRSL_HRS18(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS18_SHIFT))&DMA_HRSL_HRS18_MASK)
#define DMA_HRSL_HRS19_MASK                      0x80000u
#define DMA_HRSL_HRS19_SHIFT                     19u
#define DMA_HRSL_HRS19_WIDTH                     1u
#define DMA_HRSL_HRS19(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS19_SHIFT))&DMA_HRSL_HRS19_MASK)
#define DMA_HRSL_HRS20_MASK                      0x100000u
#define DMA_HRSL_HRS20_SHIFT                     20u
#define DMA_HRSL_HRS20_WIDTH                     1u
#define DMA_HRSL_HRS20(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS20_SHIFT))&DMA_HRSL_HRS20_MASK)
#define DMA_HRSL_HRS21_MASK                      0x200000u
#define DMA_HRSL_HRS21_SHIFT                     21u
#define DMA_HRSL_HRS21_WIDTH                     1u
#define DMA_HRSL_HRS21(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS21_SHIFT))&DMA_HRSL_HRS21_MASK)
#define DMA_HRSL_HRS22_MASK                      0x400000u
#define DMA_HRSL_HRS22_SHIFT                     22u
#define DMA_HRSL_HRS22_WIDTH                     1u
#define DMA_HRSL_HRS22(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS22_SHIFT))&DMA_HRSL_HRS22_MASK)
#define DMA_HRSL_HRS23_MASK                      0x800000u
#define DMA_HRSL_HRS23_SHIFT                     23u
#define DMA_HRSL_HRS23_WIDTH                     1u
#define DMA_HRSL_HRS23(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS23_SHIFT))&DMA_HRSL_HRS23_MASK)
#define DMA_HRSL_HRS24_MASK                      0x1000000u
#define DMA_HRSL_HRS24_SHIFT                     24u
#define DMA_HRSL_HRS24_WIDTH                     1u
#define DMA_HRSL_HRS24(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS24_SHIFT))&DMA_HRSL_HRS24_MASK)
#define DMA_HRSL_HRS25_MASK                      0x2000000u
#define DMA_HRSL_HRS25_SHIFT                     25u
#define DMA_HRSL_HRS25_WIDTH                     1u
#define DMA_HRSL_HRS25(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS25_SHIFT))&DMA_HRSL_HRS25_MASK)
#define DMA_HRSL_HRS26_MASK                      0x4000000u
#define DMA_HRSL_HRS26_SHIFT                     26u
#define DMA_HRSL_HRS26_WIDTH                     1u
#define DMA_HRSL_HRS26(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS26_SHIFT))&DMA_HRSL_HRS26_MASK)
#define DMA_HRSL_HRS27_MASK                      0x8000000u
#define DMA_HRSL_HRS27_SHIFT                     27u
#define DMA_HRSL_HRS27_WIDTH                     1u
#define DMA_HRSL_HRS27(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS27_SHIFT))&DMA_HRSL_HRS27_MASK)
#define DMA_HRSL_HRS28_MASK                      0x10000000u
#define DMA_HRSL_HRS28_SHIFT                     28u
#define DMA_HRSL_HRS28_WIDTH                     1u
#define DMA_HRSL_HRS28(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS28_SHIFT))&DMA_HRSL_HRS28_MASK)
#define DMA_HRSL_HRS29_MASK                      0x20000000u
#define DMA_HRSL_HRS29_SHIFT                     29u
#define DMA_HRSL_HRS29_WIDTH                     1u
#define DMA_HRSL_HRS29(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS29_SHIFT))&DMA_HRSL_HRS29_MASK)
#define DMA_HRSL_HRS30_MASK                      0x40000000u
#define DMA_HRSL_HRS30_SHIFT                     30u
#define DMA_HRSL_HRS30_WIDTH                     1u
#define DMA_HRSL_HRS30(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS30_SHIFT))&DMA_HRSL_HRS30_MASK)
#define DMA_HRSL_HRS31_MASK                      0x80000000u
#define DMA_HRSL_HRS31_SHIFT                     31u
#define DMA_HRSL_HRS31_WIDTH                     1u
#define DMA_HRSL_HRS31(x)                        (((uint32_t)(((uint32_t)(x))<<DMA_HRSL_HRS31_SHIFT))&DMA_HRSL_HRS31_MASK)
/* GPOR Bit Fields */
#define DMA_GPOR_GPOR_MASK                       0xFFFFFFFFu
#define DMA_GPOR_GPOR_SHIFT                      0u
#define DMA_GPOR_GPOR_WIDTH                      32u
#define DMA_GPOR_GPOR(x)                         (((uint32_t)(((uint32_t)(x))<<DMA_GPOR_GPOR_SHIFT))&DMA_GPOR_GPOR_MASK)
/* DCHPRI Bit Fields */
#define DMA_DCHPRI_CHPRI_MASK                    0xFu
#define DMA_DCHPRI_CHPRI_SHIFT                   0u
#define DMA_DCHPRI_CHPRI_WIDTH                   4u
#define DMA_DCHPRI_CHPRI(x)                      (((uint8_t)(((uint8_t)(x))<<DMA_DCHPRI_CHPRI_SHIFT))&DMA_DCHPRI_CHPRI_MASK)
#define DMA_DCHPRI_GRPPRI_MASK                   0x30u
#define DMA_DCHPRI_GRPPRI_SHIFT                  4u
#define DMA_DCHPRI_GRPPRI_WIDTH                  2u
#define DMA_DCHPRI_GRPPRI(x)                     (((uint8_t)(((uint8_t)(x))<<DMA_DCHPRI_GRPPRI_SHIFT))&DMA_DCHPRI_GRPPRI_MASK)
#define DMA_DCHPRI_DPA_MASK                      0x40u
#define DMA_DCHPRI_DPA_SHIFT                     6u
#define DMA_DCHPRI_DPA_WIDTH                     1u
#define DMA_DCHPRI_DPA(x)                        (((uint8_t)(((uint8_t)(x))<<DMA_DCHPRI_DPA_SHIFT))&DMA_DCHPRI_DPA_MASK)
#define DMA_DCHPRI_ECP_MASK                      0x80u
#define DMA_DCHPRI_ECP_SHIFT                     7u
#define DMA_DCHPRI_ECP_WIDTH                     1u
#define DMA_DCHPRI_ECP(x)                        (((uint8_t)(((uint8_t)(x))<<DMA_DCHPRI_ECP_SHIFT))&DMA_DCHPRI_ECP_MASK)
/* TCD_SADDR Bit Fields */
#define DMA_TCD_SADDR_SADDR_MASK                 0xFFFFFFFFu
#define DMA_TCD_SADDR_SADDR_SHIFT                0u
#define DMA_TCD_SADDR_SADDR_WIDTH                32u
#define DMA_TCD_SADDR_SADDR(x)                   (((uint32_t)(((uint32_t)(x))<<DMA_TCD_SADDR_SADDR_SHIFT))&DMA_TCD_SADDR_SADDR_MASK)
/* TCD_ATTR Bit Fields */
#define DMA_TCD_ATTR_DSIZE_MASK                  0x7u
#define DMA_TCD_ATTR_DSIZE_SHIFT                 0u
#define DMA_TCD_ATTR_DSIZE_WIDTH                 3u
#define DMA_TCD_ATTR_DSIZE(x)                    (((uint16_t)(((uint16_t)(x))<<DMA_TCD_ATTR_DSIZE_SHIFT))&DMA_TCD_ATTR_DSIZE_MASK)
#define DMA_TCD_ATTR_DMOD_MASK                   0xF8u
#define DMA_TCD_ATTR_DMOD_SHIFT                  3u
#define DMA_TCD_ATTR_DMOD_WIDTH                  5u
#define DMA_TCD_ATTR_DMOD(x)                     (((uint16_t)(((uint16_t)(x))<<DMA_TCD_ATTR_DMOD_SHIFT))&DMA_TCD_ATTR_DMOD_MASK)
#define DMA_TCD_ATTR_SSIZE_MASK                  0x700u
#define DMA_TCD_ATTR_SSIZE_SHIFT                 8u
#define DMA_TCD_ATTR_SSIZE_WIDTH                 3u
#define DMA_TCD_ATTR_SSIZE(x)                    (((uint16_t)(((uint16_t)(x))<<DMA_TCD_ATTR_SSIZE_SHIFT))&DMA_TCD_ATTR_SSIZE_MASK)
#define DMA_TCD_ATTR_SMOD_MASK                   0xF800u
#define DMA_TCD_ATTR_SMOD_SHIFT                  11u
#define DMA_TCD_ATTR_SMOD_WIDTH                  5u
#define DMA_TCD_ATTR_SMOD(x)                     (((uint16_t)(((uint16_t)(x))<<DMA_TCD_ATTR_SMOD_SHIFT))&DMA_TCD_ATTR_SMOD_MASK)
/* TCD_SOFF Bit Fields */
#define DMA_TCD_SOFF_SOFF_MASK                   0xFFFFu
#define DMA_TCD_SOFF_SOFF_SHIFT                  0u
#define DMA_TCD_SOFF_SOFF_WIDTH                  16u
#define DMA_TCD_SOFF_SOFF(x)                     (((uint16_t)(((uint16_t)(x))<<DMA_TCD_SOFF_SOFF_SHIFT))&DMA_TCD_SOFF_SOFF_MASK)
/* TCD_NBYTES_MLNO Bit Fields */
#define DMA_TCD_NBYTES_MLNO_NBYTES_MASK          0xFFFFFFFFu
#define DMA_TCD_NBYTES_MLNO_NBYTES_SHIFT         0u
#define DMA_TCD_NBYTES_MLNO_NBYTES_WIDTH         32u
#define DMA_TCD_NBYTES_MLNO_NBYTES(x)            (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLNO_NBYTES_SHIFT))&DMA_TCD_NBYTES_MLNO_NBYTES_MASK)
/* TCD_NBYTES_MLOFFNO Bit Fields */
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK       0x3FFFFFFFu
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT      0u
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES_WIDTH      30u
#define DMA_TCD_NBYTES_MLOFFNO_NBYTES(x)         (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFNO_NBYTES_SHIFT))&DMA_TCD_NBYTES_MLOFFNO_NBYTES_MASK)
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK        0x40000000u
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT       30u
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE_WIDTH       1u
#define DMA_TCD_NBYTES_MLOFFNO_DMLOE(x)          (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFNO_DMLOE_SHIFT))&DMA_TCD_NBYTES_MLOFFNO_DMLOE_MASK)
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK        0x80000000u
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT       31u
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE_WIDTH       1u
#define DMA_TCD_NBYTES_MLOFFNO_SMLOE(x)          (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFNO_SMLOE_SHIFT))&DMA_TCD_NBYTES_MLOFFNO_SMLOE_MASK)
/* TCD_NBYTES_MLOFFYES Bit Fields */
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK      0x3FFu
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT     0u
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES_WIDTH     10u
#define DMA_TCD_NBYTES_MLOFFYES_NBYTES(x)        (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFYES_NBYTES_SHIFT))&DMA_TCD_NBYTES_MLOFFYES_NBYTES_MASK)
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK       0x3FFFFC00u
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT      10u
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF_WIDTH      20u
#define DMA_TCD_NBYTES_MLOFFYES_MLOFF(x)         (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFYES_MLOFF_SHIFT))&DMA_TCD_NBYTES_MLOFFYES_MLOFF_MASK)
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK       0x40000000u
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT      30u
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE_WIDTH      1u
#define DMA_TCD_NBYTES_MLOFFYES_DMLOE(x)         (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFYES_DMLOE_SHIFT))&DMA_TCD_NBYTES_MLOFFYES_DMLOE_MASK)
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK       0x80000000u
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT      31u
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE_WIDTH      1u
#define DMA_TCD_NBYTES_MLOFFYES_SMLOE(x)         (((uint32_t)(((uint32_t)(x))<<DMA_TCD_NBYTES_MLOFFYES_SMLOE_SHIFT))&DMA_TCD_NBYTES_MLOFFYES_SMLOE_MASK)
/* TCD_SLAST Bit Fields */
#define DMA_TCD_SLAST_SLAST_MASK                 0xFFFFFFFFu
#define DMA_TCD_SLAST_SLAST_SHIFT                0u
#define DMA_TCD_SLAST_SLAST_WIDTH                32u
#define DMA_TCD_SLAST_SLAST(x)                   (((uint32_t)(((uint32_t)(x))<<DMA_TCD_SLAST_SLAST_SHIFT))&DMA_TCD_SLAST_SLAST_MASK)
/* TCD_DADDR Bit Fields */
#define DMA_TCD_DADDR_DADDR_MASK                 0xFFFFFFFFu
#define DMA_TCD_DADDR_DADDR_SHIFT                0u
#define DMA_TCD_DADDR_DADDR_WIDTH                32u
#define DMA_TCD_DADDR_DADDR(x)                   (((uint32_t)(((uint32_t)(x))<<DMA_TCD_DADDR_DADDR_SHIFT))&DMA_TCD_DADDR_DADDR_MASK)
/* TCD_CITER_ELINKNO Bit Fields */
#define DMA_TCD_CITER_ELINKNO_CITER_MASK         0x7FFFu
#define DMA_TCD_CITER_ELINKNO_CITER_SHIFT        0u
#define DMA_TCD_CITER_ELINKNO_CITER_WIDTH        15u
#define DMA_TCD_CITER_ELINKNO_CITER(x)           (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CITER_ELINKNO_CITER_SHIFT))&DMA_TCD_CITER_ELINKNO_CITER_MASK)
#define DMA_TCD_CITER_ELINKNO_ELINK_MASK         0x8000u
#define DMA_TCD_CITER_ELINKNO_ELINK_SHIFT        15u
#define DMA_TCD_CITER_ELINKNO_ELINK_WIDTH        1u
#define DMA_TCD_CITER_ELINKNO_ELINK(x)           (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CITER_ELINKNO_ELINK_SHIFT))&DMA_TCD_CITER_ELINKNO_ELINK_MASK)
/* TCD_CITER_ELINKYES Bit Fields */
#define DMA_TCD_CITER_ELINKYES_CITER_MASK        0x1FFu
#define DMA_TCD_CITER_ELINKYES_CITER_SHIFT       0u
#define DMA_TCD_CITER_ELINKYES_CITER_WIDTH       9u
#define DMA_TCD_CITER_ELINKYES_CITER(x)          (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CITER_ELINKYES_CITER_SHIFT))&DMA_TCD_CITER_ELINKYES_CITER_MASK)
#define DMA_TCD_CITER_ELINKYES_LINKCH_MASK       0x7E00u
#define DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT      9u
#define DMA_TCD_CITER_ELINKYES_LINKCH_WIDTH      6u
#define DMA_TCD_CITER_ELINKYES_LINKCH(x)         (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CITER_ELINKYES_LINKCH_SHIFT))&DMA_TCD_CITER_ELINKYES_LINKCH_MASK)
#define DMA_TCD_CITER_ELINKYES_ELINK_MASK        0x8000u
#define DMA_TCD_CITER_ELINKYES_ELINK_SHIFT       15u
#define DMA_TCD_CITER_ELINKYES_ELINK_WIDTH       1u
#define DMA_TCD_CITER_ELINKYES_ELINK(x)          (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CITER_ELINKYES_ELINK_SHIFT))&DMA_TCD_CITER_ELINKYES_ELINK_MASK)
/* TCD_DOFF Bit Fields */
#define DMA_TCD_DOFF_DOFF_MASK                   0xFFFFu
#define DMA_TCD_DOFF_DOFF_SHIFT                  0u
#define DMA_TCD_DOFF_DOFF_WIDTH                  16u
#define DMA_TCD_DOFF_DOFF(x)                     (((uint16_t)(((uint16_t)(x))<<DMA_TCD_DOFF_DOFF_SHIFT))&DMA_TCD_DOFF_DOFF_MASK)
/* TCD_DLASTSGA Bit Fields */
#define DMA_TCD_DLASTSGA_DLASTSGA_MASK           0xFFFFFFFFu
#define DMA_TCD_DLASTSGA_DLASTSGA_SHIFT          0u
#define DMA_TCD_DLASTSGA_DLASTSGA_WIDTH          32u
#define DMA_TCD_DLASTSGA_DLASTSGA(x)             (((uint32_t)(((uint32_t)(x))<<DMA_TCD_DLASTSGA_DLASTSGA_SHIFT))&DMA_TCD_DLASTSGA_DLASTSGA_MASK)
/* TCD_BITER_ELINKNO Bit Fields */
#define DMA_TCD_BITER_ELINKNO_BITER_MASK         0x7FFFu
#define DMA_TCD_BITER_ELINKNO_BITER_SHIFT        0u
#define DMA_TCD_BITER_ELINKNO_BITER_WIDTH        15u
#define DMA_TCD_BITER_ELINKNO_BITER(x)           (((uint16_t)(((uint16_t)(x))<<DMA_TCD_BITER_ELINKNO_BITER_SHIFT))&DMA_TCD_BITER_ELINKNO_BITER_MASK)
#define DMA_TCD_BITER_ELINKNO_ELINK_MASK         0x8000u
#define DMA_TCD_BITER_ELINKNO_ELINK_SHIFT        15u
#define DMA_TCD_BITER_ELINKNO_ELINK_WIDTH        1u
#define DMA_TCD_BITER_ELINKNO_ELINK(x)           (((uint16_t)(((uint16_t)(x))<<DMA_TCD_BITER_ELINKNO_ELINK_SHIFT))&DMA_TCD_BITER_ELINKNO_ELINK_MASK)
/* TCD_BITER_ELINKYES Bit Fields */
#define DMA_TCD_BITER_ELINKYES_BITER_MASK        0x1FFu
#define DMA_TCD_BITER_ELINKYES_BITER_SHIFT       0u
#define DMA_TCD_BITER_ELINKYES_BITER_WIDTH       9u
#define DMA_TCD_BITER_ELINKYES_BITER(x)          (((uint16_t)(((uint16_t)(x))<<DMA_TCD_BITER_ELINKYES_BITER_SHIFT))&DMA_TCD_BITER_ELINKYES_BITER_MASK)
#define DMA_TCD_BITER_ELINKYES_LINKCH_MASK       0x7E00u
#define DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT      9u
#define DMA_TCD_BITER_ELINKYES_LINKCH_WIDTH      6u
#define DMA_TCD_BITER_ELINKYES_LINKCH(x)         (((uint16_t)(((uint16_t)(x))<<DMA_TCD_BITER_ELINKYES_LINKCH_SHIFT))&DMA_TCD_BITER_ELINKYES_LINKCH_MASK)
#define DMA_TCD_BITER_ELINKYES_ELINK_MASK        0x8000u
#define DMA_TCD_BITER_ELINKYES_ELINK_SHIFT       15u
#define DMA_TCD_BITER_ELINKYES_ELINK_WIDTH       1u
#define DMA_TCD_BITER_ELINKYES_ELINK(x)          (((uint16_t)(((uint16_t)(x))<<DMA_TCD_BITER_ELINKYES_ELINK_SHIFT))&DMA_TCD_BITER_ELINKYES_ELINK_MASK)
/* TCD_CSR Bit Fields */
#define DMA_TCD_CSR_START_MASK                   0x1u
#define DMA_TCD_CSR_START_SHIFT                  0u
#define DMA_TCD_CSR_START_WIDTH                  1u
#define DMA_TCD_CSR_START(x)                     (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_START_SHIFT))&DMA_TCD_CSR_START_MASK)
#define DMA_TCD_CSR_INTMAJOR_MASK                0x2u
#define DMA_TCD_CSR_INTMAJOR_SHIFT               1u
#define DMA_TCD_CSR_INTMAJOR_WIDTH               1u
#define DMA_TCD_CSR_INTMAJOR(x)                  (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_INTMAJOR_SHIFT))&DMA_TCD_CSR_INTMAJOR_MASK)
#define DMA_TCD_CSR_INTHALF_MASK                 0x4u
#define DMA_TCD_CSR_INTHALF_SHIFT                2u
#define DMA_TCD_CSR_INTHALF_WIDTH                1u
#define DMA_TCD_CSR_INTHALF(x)                   (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_INTHALF_SHIFT))&DMA_TCD_CSR_INTHALF_MASK)
#define DMA_TCD_CSR_DREQ_MASK                    0x8u
#define DMA_TCD_CSR_DREQ_SHIFT                   3u
#define DMA_TCD_CSR_DREQ_WIDTH                   1u
#define DMA_TCD_CSR_DREQ(x)                      (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_DREQ_SHIFT))&DMA_TCD_CSR_DREQ_MASK)
#define DMA_TCD_CSR_ESG_MASK                     0x10u
#define DMA_TCD_CSR_ESG_SHIFT                    4u
#define DMA_TCD_CSR_ESG_WIDTH                    1u
#define DMA_TCD_CSR_ESG(x)                       (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_ESG_SHIFT))&DMA_TCD_CSR_ESG_MASK)
#define DMA_TCD_CSR_MAJORELINK_MASK              0x20u
#define DMA_TCD_CSR_MAJORELINK_SHIFT             5u
#define DMA_TCD_CSR_MAJORELINK_WIDTH             1u
#define DMA_TCD_CSR_MAJORELINK(x)                (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_MAJORELINK_SHIFT))&DMA_TCD_CSR_MAJORELINK_MASK)
#define DMA_TCD_CSR_ACTIVE_MASK                  0x40u
#define DMA_TCD_CSR_ACTIVE_SHIFT                 6u
#define DMA_TCD_CSR_ACTIVE_WIDTH                 1u
#define DMA_TCD_CSR_ACTIVE(x)                    (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_ACTIVE_SHIFT))&DMA_TCD_CSR_ACTIVE_MASK)
#define DMA_TCD_CSR_DONE_MASK                    0x80u
#define DMA_TCD_CSR_DONE_SHIFT                   7u
#define DMA_TCD_CSR_DONE_WIDTH                   1u
#define DMA_TCD_CSR_DONE(x)                      (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_DONE_SHIFT))&DMA_TCD_CSR_DONE_MASK)
#define DMA_TCD_CSR_MAJORLINKCH_MASK             0x3F00u
#define DMA_TCD_CSR_MAJORLINKCH_SHIFT            8u
#define DMA_TCD_CSR_MAJORLINKCH_WIDTH            6u
#define DMA_TCD_CSR_MAJORLINKCH(x)               (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_MAJORLINKCH_SHIFT))&DMA_TCD_CSR_MAJORLINKCH_MASK)
#define DMA_TCD_CSR_BWC_MASK                     0xC000u
#define DMA_TCD_CSR_BWC_SHIFT                    14u
#define DMA_TCD_CSR_BWC_WIDTH                    2u
#define DMA_TCD_CSR_BWC(x)                       (((uint16_t)(((uint16_t)(x))<<DMA_TCD_CSR_BWC_SHIFT))&DMA_TCD_CSR_BWC_MASK)

/*!
 * @}
 */ /* end of group DMA_Register_Masks */


/*!
 * @}
 */ /* end of group DMA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DSPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPI_Peripheral_Access_Layer DSPI Peripheral Access Layer
 * @{
 */


