neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** DSPI - Size of Registers Arrays */
#define DSPI_CTAR_COUNT                          8u
#define DSPI_CTAR_SLAVE_COUNT                    2u
#define DSPI_TXFR_COUNT                          4u
#define DSPI_RXFR_COUNT                          4u

/** DSPI - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t TCR;                               /**< Transfer Count Register, offset: 0x8 */
  union {                                          /* offset: 0xC */
    __IO uint32_t CTAR[DSPI_CTAR_COUNT];             /**< Clock and Transfer Attributes Register (In Master Mode), array offset: 0xC, array step: 0x4 */
    __IO uint32_t CTAR_SLAVE[DSPI_CTAR_SLAVE_COUNT]; /**< Clock and Transfer Attributes Register (In Slave Mode), array offset: 0xC, array step: 0x4 */
  } MODE;
  __IO uint32_t SR;                                /**< Status Register, offset: 0x2C */
  __IO uint32_t RSER;                              /**< DMA/Interrupt Request Select and Enable Register, offset: 0x30 */
  union {                                          /* offset: 0x34 */
    struct {                                         /* offset: 0x34 */
      __IO uint16_t CMD;                               /**< DSPI_1_PUSHR_FIFO_CMD register...DSPI_2_PUSHR_FIFO_CMD register., offset: 0x34 */
      __IO uint16_t TX;                                /**< DSPI_1_PUSHR_FIFO_TX register...DSPI_2_PUSHR_FIFO_TX register., offset: 0x36 */
    } FIFO;
    __IO uint32_t PUSHR;                             /**< PUSH TX FIFO Register In Master Mode, offset: 0x34 */
    __IO uint32_t SLAVE;                             /**< PUSH TX FIFO Register In Slave Mode, offset: 0x34 */
  } PUSHR;
  __I  uint32_t POPR;                              /**< POP RX FIFO Register, offset: 0x38 */
  __I  uint32_t TXFR[DSPI_TXFR_COUNT];             /**< Transmit FIFO Registers, array offset: 0x3C, array step: 0x4 */
       uint8_t RESERVED_1[48];
  __I  uint32_t RXFR[DSPI_RXFR_COUNT];             /**< Receive FIFO Registers, array offset: 0x7C, array step: 0x4 */
       uint8_t RESERVED_2[48];
  __IO uint32_t DSICR0;                            /**< DSI Configuration Register 0, offset: 0xBC */
  __I  uint32_t SDR0;                              /**< DSI Serialization Data Register 0, offset: 0xC0 */
  __IO uint32_t ASDR0;                             /**< DSI Alternate Serialization Data Register 0, offset: 0xC4 */
  __I  uint32_t COMPR0;                            /**< DSI Transmit Comparison Register 0, offset: 0xC8 */
  __I  uint32_t DDR0;                              /**< DSI Deserialization Data Register 0, offset: 0xCC */
  __IO uint32_t DSICR1;                            /**< DSI Configuration Register 1, offset: 0xD0 */
  __IO uint32_t SSR0;                              /**< DSI Serialization Source Select Register 0, offset: 0xD4 */
  __IO uint32_t PISR0;                             /**< DSI Parallel Input Select Register 0, offset: 0xD8 */
  __IO uint32_t PISR1;                             /**< DSI Parallel Input Select Register 1, offset: 0xDC */
  __IO uint32_t PISR2;                             /**< DSI Parallel Input Select Register 2, offset: 0xE0 */
  __IO uint32_t PISR3;                             /**< DSI Parallel Input Select Register 3, offset: 0xE4 */
  __IO uint32_t DIMR0;                             /**< DSI Deserialized Data Interrupt Mask Register 0, offset: 0xE8 */
  __IO uint32_t DPIR0;                             /**< DSI Deserialized Data Polarity Interrupt Register 0, offset: 0xEC */
} DSPI_Type, *DSPI_MemMapPtr;

 /** Number of instances of the DSPI module. */
#define DSPI_INSTANCE_COUNT                      (5u)


/* DSPI - Peripheral instance base addresses */
/** Peripheral DSPI_0 base address */
#define DSPI_0_BASE                              (0xFFF90000u)
/** Peripheral DSPI_0 base pointer */
#define DSPI_0                                   ((DSPI_Type *)DSPI_0_BASE)
/** Peripheral DSPI_1 base address */
#define DSPI_1_BASE                              (0xFFF94000u)
/** Peripheral DSPI_1 base pointer */
#define DSPI_1                                   ((DSPI_Type *)DSPI_1_BASE)
/** Peripheral DSPI_2 base address */
#define DSPI_2_BASE                              (0xFFF98000u)
/** Peripheral DSPI_2 base pointer */
#define DSPI_2                                   ((DSPI_Type *)DSPI_2_BASE)
/** Peripheral DSPI_3 base address */
#define DSPI_3_BASE                              (0xC3FDC000u)
/** Peripheral DSPI_3 base pointer */
#define DSPI_3                                   ((DSPI_Type *)DSPI_3_BASE)
/** Peripheral DSPI_4 base address */
#define DSPI_4_BASE                              (0xC3FE0000u)
/** Peripheral DSPI_4 base pointer */
#define DSPI_4                                   ((DSPI_Type *)DSPI_4_BASE)
/** Array initializer of DSPI peripheral base addresses */
#define DSPI_BASE_ADDRS                          { DSPI_0_BASE, DSPI_1_BASE, DSPI_2_BASE, DSPI_3_BASE, DSPI_4_BASE }
/** Array initializer of DSPI peripheral base pointers */
#define DSPI_BASE_PTRS                           { DSPI_0, DSPI_1, DSPI_2, DSPI_3, DSPI_4 }

/* ----------------------------------------------------------------------------
   -- DSPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPI_Register_Masks DSPI Register Masks
 * @{
 */

/* MCR Bit Fields */
#define DSPI_MCR_HALT_MASK                       0x1u
#define DSPI_MCR_HALT_SHIFT                      0u
#define DSPI_MCR_HALT_WIDTH                      1u
#define DSPI_MCR_HALT(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_HALT_SHIFT))&DSPI_MCR_HALT_MASK)
#define DSPI_MCR_PES_MASK                        0x2u
#define DSPI_MCR_PES_SHIFT                       1u
#define DSPI_MCR_PES_WIDTH                       1u
#define DSPI_MCR_PES(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_PES_SHIFT))&DSPI_MCR_PES_MASK)
#define DSPI_MCR_SMPL_PT_MASK                    0x300u
#define DSPI_MCR_SMPL_PT_SHIFT                   8u
#define DSPI_MCR_SMPL_PT_WIDTH                   2u
#define DSPI_MCR_SMPL_PT(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_SMPL_PT_SHIFT))&DSPI_MCR_SMPL_PT_MASK)
#define DSPI_MCR_CLR_RXF_MASK                    0x400u
#define DSPI_MCR_CLR_RXF_SHIFT                   10u
#define DSPI_MCR_CLR_RXF_WIDTH                   1u
#define DSPI_MCR_CLR_RXF(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_CLR_RXF_SHIFT))&DSPI_MCR_CLR_RXF_MASK)
#define DSPI_MCR_CLR_TXF_MASK                    0x800u
#define DSPI_MCR_CLR_TXF_SHIFT                   11u
#define DSPI_MCR_CLR_TXF_WIDTH                   1u
#define DSPI_MCR_CLR_TXF(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_CLR_TXF_SHIFT))&DSPI_MCR_CLR_TXF_MASK)
#define DSPI_MCR_DIS_RXF_MASK                    0x1000u
#define DSPI_MCR_DIS_RXF_SHIFT                   12u
#define DSPI_MCR_DIS_RXF_WIDTH                   1u
#define DSPI_MCR_DIS_RXF(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_DIS_RXF_SHIFT))&DSPI_MCR_DIS_RXF_MASK)
#define DSPI_MCR_DIS_TXF_MASK                    0x2000u
#define DSPI_MCR_DIS_TXF_SHIFT                   13u
#define DSPI_MCR_DIS_TXF_WIDTH                   1u
#define DSPI_MCR_DIS_TXF(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_DIS_TXF_SHIFT))&DSPI_MCR_DIS_TXF_MASK)
#define DSPI_MCR_MDIS_MASK                       0x4000u
#define DSPI_MCR_MDIS_SHIFT                      14u
#define DSPI_MCR_MDIS_WIDTH                      1u
#define DSPI_MCR_MDIS(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_MDIS_SHIFT))&DSPI_MCR_MDIS_MASK)
#define DSPI_MCR_PCSIS_MASK                      0x3F0000u
#define DSPI_MCR_PCSIS_SHIFT                     16u
#define DSPI_MCR_PCSIS_WIDTH                     6u
#define DSPI_MCR_PCSIS(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_PCSIS_SHIFT))&DSPI_MCR_PCSIS_MASK)
#define DSPI_MCR_ROOE_MASK                       0x1000000u
#define DSPI_MCR_ROOE_SHIFT                      24u
#define DSPI_MCR_ROOE_WIDTH                      1u
#define DSPI_MCR_ROOE(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_ROOE_SHIFT))&DSPI_MCR_ROOE_MASK)
#define DSPI_MCR_PCSSE_MASK                      0x2000000u
#define DSPI_MCR_PCSSE_SHIFT                     25u
#define DSPI_MCR_PCSSE_WIDTH                     1u
#define DSPI_MCR_PCSSE(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_PCSSE_SHIFT))&DSPI_MCR_PCSSE_MASK)
#define DSPI_MCR_MTFE_MASK                       0x4000000u
#define DSPI_MCR_MTFE_SHIFT                      26u
#define DSPI_MCR_MTFE_WIDTH                      1u
#define DSPI_MCR_MTFE(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_MTFE_SHIFT))&DSPI_MCR_MTFE_MASK)
#define DSPI_MCR_FRZ_MASK                        0x8000000u
#define DSPI_MCR_FRZ_SHIFT                       27u
#define DSPI_MCR_FRZ_WIDTH                       1u
#define DSPI_MCR_FRZ(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_FRZ_SHIFT))&DSPI_MCR_FRZ_MASK)
#define DSPI_MCR_DCONF_MASK                      0x30000000u
#define DSPI_MCR_DCONF_SHIFT                     28u
#define DSPI_MCR_DCONF_WIDTH                     2u
#define DSPI_MCR_DCONF(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_DCONF_SHIFT))&DSPI_MCR_DCONF_MASK)
#define DSPI_MCR_CONT_SCKE_MASK                  0x40000000u
#define DSPI_MCR_CONT_SCKE_SHIFT                 30u
#define DSPI_MCR_CONT_SCKE_WIDTH                 1u
#define DSPI_MCR_CONT_SCKE(x)                    (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_CONT_SCKE_SHIFT))&DSPI_MCR_CONT_SCKE_MASK)
#define DSPI_MCR_MSTR_MASK                       0x80000000u
#define DSPI_MCR_MSTR_SHIFT                      31u
#define DSPI_MCR_MSTR_WIDTH                      1u
#define DSPI_MCR_MSTR(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_MCR_MSTR_SHIFT))&DSPI_MCR_MSTR_MASK)
/* TCR Bit Fields */
#define DSPI_TCR_SPI_TCNT_MASK                   0xFFFF0000u
#define DSPI_TCR_SPI_TCNT_SHIFT                  16u
#define DSPI_TCR_SPI_TCNT_WIDTH                  16u
#define DSPI_TCR_SPI_TCNT(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_TCR_SPI_TCNT_SHIFT))&DSPI_TCR_SPI_TCNT_MASK)
/* CTAR Bit Fields */
#define DSPI_CTAR_BR_MASK                        0xFu
#define DSPI_CTAR_BR_SHIFT                       0u
#define DSPI_CTAR_BR_WIDTH                       4u
#define DSPI_CTAR_BR(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_BR_SHIFT))&DSPI_CTAR_BR_MASK)
#define DSPI_CTAR_DT_MASK                        0xF0u
#define DSPI_CTAR_DT_SHIFT                       4u
#define DSPI_CTAR_DT_WIDTH                       4u
#define DSPI_CTAR_DT(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_DT_SHIFT))&DSPI_CTAR_DT_MASK)
#define DSPI_CTAR_ASC_MASK                       0xF00u
#define DSPI_CTAR_ASC_SHIFT                      8u
#define DSPI_CTAR_ASC_WIDTH                      4u
#define DSPI_CTAR_ASC(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_ASC_SHIFT))&DSPI_CTAR_ASC_MASK)
#define DSPI_CTAR_CSSCK_MASK                     0xF000u
#define DSPI_CTAR_CSSCK_SHIFT                    12u
#define DSPI_CTAR_CSSCK_WIDTH                    4u
#define DSPI_CTAR_CSSCK(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_CSSCK_SHIFT))&DSPI_CTAR_CSSCK_MASK)
#define DSPI_CTAR_PBR_MASK                       0x30000u
#define DSPI_CTAR_PBR_SHIFT                      16u
#define DSPI_CTAR_PBR_WIDTH                      2u
#define DSPI_CTAR_PBR(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_PBR_SHIFT))&DSPI_CTAR_PBR_MASK)
#define DSPI_CTAR_PDT_MASK                       0xC0000u
#define DSPI_CTAR_PDT_SHIFT                      18u
#define DSPI_CTAR_PDT_WIDTH                      2u
#define DSPI_CTAR_PDT(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_PDT_SHIFT))&DSPI_CTAR_PDT_MASK)
#define DSPI_CTAR_PASC_MASK                      0x300000u
#define DSPI_CTAR_PASC_SHIFT                     20u
#define DSPI_CTAR_PASC_WIDTH                     2u
#define DSPI_CTAR_PASC(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_PASC_SHIFT))&DSPI_CTAR_PASC_MASK)
#define DSPI_CTAR_PCSSCK_MASK                    0xC00000u
#define DSPI_CTAR_PCSSCK_SHIFT                   22u
#define DSPI_CTAR_PCSSCK_WIDTH                   2u
#define DSPI_CTAR_PCSSCK(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_PCSSCK_SHIFT))&DSPI_CTAR_PCSSCK_MASK)
#define DSPI_CTAR_LSBFE_MASK                     0x1000000u
#define DSPI_CTAR_LSBFE_SHIFT                    24u
#define DSPI_CTAR_LSBFE_WIDTH                    1u
#define DSPI_CTAR_LSBFE(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_LSBFE_SHIFT))&DSPI_CTAR_LSBFE_MASK)
#define DSPI_CTAR_CPHA_MASK                      0x2000000u
#define DSPI_CTAR_CPHA_SHIFT                     25u
#define DSPI_CTAR_CPHA_WIDTH                     1u
#define DSPI_CTAR_CPHA(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_CPHA_SHIFT))&DSPI_CTAR_CPHA_MASK)
#define DSPI_CTAR_CPOL_MASK                      0x4000000u
#define DSPI_CTAR_CPOL_SHIFT                     26u
#define DSPI_CTAR_CPOL_WIDTH                     1u
#define DSPI_CTAR_CPOL(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_CPOL_SHIFT))&DSPI_CTAR_CPOL_MASK)
#define DSPI_CTAR_FMSZ_MASK                      0x78000000u
#define DSPI_CTAR_FMSZ_SHIFT                     27u
#define DSPI_CTAR_FMSZ_WIDTH                     4u
#define DSPI_CTAR_FMSZ(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_FMSZ_SHIFT))&DSPI_CTAR_FMSZ_MASK)
#define DSPI_CTAR_DBR_MASK                       0x80000000u
#define DSPI_CTAR_DBR_SHIFT                      31u
#define DSPI_CTAR_DBR_WIDTH                      1u
#define DSPI_CTAR_DBR(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_DBR_SHIFT))&DSPI_CTAR_DBR_MASK)
/* CTAR_SLAVE Bit Fields */
#define DSPI_CTAR_SLAVE_PP_MASK                  0x800000u
#define DSPI_CTAR_SLAVE_PP_SHIFT                 23u
#define DSPI_CTAR_SLAVE_PP_WIDTH                 1u
#define DSPI_CTAR_SLAVE_PP(x)                    (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_SLAVE_PP_SHIFT))&DSPI_CTAR_SLAVE_PP_MASK)
#define DSPI_CTAR_SLAVE_PE_MASK                  0x1000000u
#define DSPI_CTAR_SLAVE_PE_SHIFT                 24u
#define DSPI_CTAR_SLAVE_PE_WIDTH                 1u
#define DSPI_CTAR_SLAVE_PE(x)                    (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_SLAVE_PE_SHIFT))&DSPI_CTAR_SLAVE_PE_MASK)
#define DSPI_CTAR_SLAVE_CPHA_MASK                0x2000000u
#define DSPI_CTAR_SLAVE_CPHA_SHIFT               25u
#define DSPI_CTAR_SLAVE_CPHA_WIDTH               1u
#define DSPI_CTAR_SLAVE_CPHA(x)                  (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_SLAVE_CPHA_SHIFT))&DSPI_CTAR_SLAVE_CPHA_MASK)
#define DSPI_CTAR_SLAVE_CPOL_MASK                0x4000000u
#define DSPI_CTAR_SLAVE_CPOL_SHIFT               26u
#define DSPI_CTAR_SLAVE_CPOL_WIDTH               1u
#define DSPI_CTAR_SLAVE_CPOL(x)                  (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_SLAVE_CPOL_SHIFT))&DSPI_CTAR_SLAVE_CPOL_MASK)
#define DSPI_CTAR_SLAVE_FMSZ_MASK                0xF8000000u
#define DSPI_CTAR_SLAVE_FMSZ_SHIFT               27u
#define DSPI_CTAR_SLAVE_FMSZ_WIDTH               5u
#define DSPI_CTAR_SLAVE_FMSZ(x)                  (((uint32_t)(((uint32_t)(x))<<DSPI_CTAR_SLAVE_FMSZ_SHIFT))&DSPI_CTAR_SLAVE_FMSZ_MASK)
/* SR Bit Fields */
#define DSPI_SR_POPNXTPTR_MASK                   0xFu
#define DSPI_SR_POPNXTPTR_SHIFT                  0u
#define DSPI_SR_POPNXTPTR_WIDTH                  4u
#define DSPI_SR_POPNXTPTR(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_SR_POPNXTPTR_SHIFT))&DSPI_SR_POPNXTPTR_MASK)
#define DSPI_SR_RXCTR_MASK                       0xF0u
#define DSPI_SR_RXCTR_SHIFT                      4u
#define DSPI_SR_RXCTR_WIDTH                      4u
#define DSPI_SR_RXCTR(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_SR_RXCTR_SHIFT))&DSPI_SR_RXCTR_MASK)
#define DSPI_SR_TXNXTPTR_MASK                    0xF00u
#define DSPI_SR_TXNXTPTR_SHIFT                   8u
#define DSPI_SR_TXNXTPTR_WIDTH                   4u
#define DSPI_SR_TXNXTPTR(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_SR_TXNXTPTR_SHIFT))&DSPI_SR_TXNXTPTR_MASK)
#define DSPI_SR_TXCTR_MASK                       0xF000u
#define DSPI_SR_TXCTR_SHIFT                      12u
#define DSPI_SR_TXCTR_WIDTH                      4u
#define DSPI_SR_TXCTR(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_SR_TXCTR_SHIFT))&DSPI_SR_TXCTR_MASK)
#define DSPI_SR_RFDF_MASK                        0x20000u
#define DSPI_SR_RFDF_SHIFT                       17u
#define DSPI_SR_RFDF_WIDTH                       1u
#define DSPI_SR_RFDF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_RFDF_SHIFT))&DSPI_SR_RFDF_MASK)
#define DSPI_SR_RFOF_MASK                        0x80000u
#define DSPI_SR_RFOF_SHIFT                       19u
#define DSPI_SR_RFOF_WIDTH                       1u
#define DSPI_SR_RFOF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_RFOF_SHIFT))&DSPI_SR_RFOF_MASK)
#define DSPI_SR_DDIF_MASK                        0x100000u
#define DSPI_SR_DDIF_SHIFT                       20u
#define DSPI_SR_DDIF_WIDTH                       1u
#define DSPI_SR_DDIF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_DDIF_SHIFT))&DSPI_SR_DDIF_MASK)
#define DSPI_SR_SPEF_MASK                        0x200000u
#define DSPI_SR_SPEF_SHIFT                       21u
#define DSPI_SR_SPEF_WIDTH                       1u
#define DSPI_SR_SPEF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_SPEF_SHIFT))&DSPI_SR_SPEF_MASK)
#define DSPI_SR_DPEF_MASK                        0x400000u
#define DSPI_SR_DPEF_SHIFT                       22u
#define DSPI_SR_DPEF_WIDTH                       1u
#define DSPI_SR_DPEF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_DPEF_SHIFT))&DSPI_SR_DPEF_MASK)
#define DSPI_SR_TFFF_MASK                        0x2000000u
#define DSPI_SR_TFFF_SHIFT                       25u
#define DSPI_SR_TFFF_WIDTH                       1u
#define DSPI_SR_TFFF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_TFFF_SHIFT))&DSPI_SR_TFFF_MASK)
#define DSPI_SR_TFUF_MASK                        0x8000000u
#define DSPI_SR_TFUF_SHIFT                       27u
#define DSPI_SR_TFUF_WIDTH                       1u
#define DSPI_SR_TFUF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_TFUF_SHIFT))&DSPI_SR_TFUF_MASK)
#define DSPI_SR_EOQF_MASK                        0x10000000u
#define DSPI_SR_EOQF_SHIFT                       28u
#define DSPI_SR_EOQF_WIDTH                       1u
#define DSPI_SR_EOQF(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SR_EOQF_SHIFT))&DSPI_SR_EOQF_MASK)
#define DSPI_SR_TXRXS_MASK                       0x40000000u
#define DSPI_SR_TXRXS_SHIFT                      30u
#define DSPI_SR_TXRXS_WIDTH                      1u
#define DSPI_SR_TXRXS(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_SR_TXRXS_SHIFT))&DSPI_SR_TXRXS_MASK)
#define DSPI_SR_TCF_MASK                         0x80000000u
#define DSPI_SR_TCF_SHIFT                        31u
#define DSPI_SR_TCF_WIDTH                        1u
#define DSPI_SR_TCF(x)                           (((uint32_t)(((uint32_t)(x))<<DSPI_SR_TCF_SHIFT))&DSPI_SR_TCF_MASK)
/* RSER Bit Fields */
#define DSPI_RSER_RFDF_DIRS_MASK                 0x10000u
#define DSPI_RSER_RFDF_DIRS_SHIFT                16u
#define DSPI_RSER_RFDF_DIRS_WIDTH                1u
#define DSPI_RSER_RFDF_DIRS(x)                   (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_RFDF_DIRS_SHIFT))&DSPI_RSER_RFDF_DIRS_MASK)
#define DSPI_RSER_RFDF_RE_MASK                   0x20000u
#define DSPI_RSER_RFDF_RE_SHIFT                  17u
#define DSPI_RSER_RFDF_RE_WIDTH                  1u
#define DSPI_RSER_RFDF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_RFDF_RE_SHIFT))&DSPI_RSER_RFDF_RE_MASK)
#define DSPI_RSER_RFOF_RE_MASK                   0x80000u
#define DSPI_RSER_RFOF_RE_SHIFT                  19u
#define DSPI_RSER_RFOF_RE_WIDTH                  1u
#define DSPI_RSER_RFOF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_RFOF_RE_SHIFT))&DSPI_RSER_RFOF_RE_MASK)
#define DSPI_RSER_DDIF_RE_MASK                   0x100000u
#define DSPI_RSER_DDIF_RE_SHIFT                  20u
#define DSPI_RSER_DDIF_RE_WIDTH                  1u
#define DSPI_RSER_DDIF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_DDIF_RE_SHIFT))&DSPI_RSER_DDIF_RE_MASK)
#define DSPI_RSER_SPEF_RE_MASK                   0x200000u
#define DSPI_RSER_SPEF_RE_SHIFT                  21u
#define DSPI_RSER_SPEF_RE_WIDTH                  1u
#define DSPI_RSER_SPEF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_SPEF_RE_SHIFT))&DSPI_RSER_SPEF_RE_MASK)
#define DSPI_RSER_DPEF_RE_MASK                   0x400000u
#define DSPI_RSER_DPEF_RE_SHIFT                  22u
#define DSPI_RSER_DPEF_RE_WIDTH                  1u
#define DSPI_RSER_DPEF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_DPEF_RE_SHIFT))&DSPI_RSER_DPEF_RE_MASK)
#define DSPI_RSER_TFFF_DIRS_MASK                 0x1000000u
#define DSPI_RSER_TFFF_DIRS_SHIFT                24u
#define DSPI_RSER_TFFF_DIRS_WIDTH                1u
#define DSPI_RSER_TFFF_DIRS(x)                   (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_TFFF_DIRS_SHIFT))&DSPI_RSER_TFFF_DIRS_MASK)
#define DSPI_RSER_TFFF_RE_MASK                   0x2000000u
#define DSPI_RSER_TFFF_RE_SHIFT                  25u
#define DSPI_RSER_TFFF_RE_WIDTH                  1u
#define DSPI_RSER_TFFF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_TFFF_RE_SHIFT))&DSPI_RSER_TFFF_RE_MASK)
#define DSPI_RSER_TFUF_RE_MASK                   0x8000000u
#define DSPI_RSER_TFUF_RE_SHIFT                  27u
#define DSPI_RSER_TFUF_RE_WIDTH                  1u
#define DSPI_RSER_TFUF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_TFUF_RE_SHIFT))&DSPI_RSER_TFUF_RE_MASK)
#define DSPI_RSER_EOQF_RE_MASK                   0x10000000u
#define DSPI_RSER_EOQF_RE_SHIFT                  28u
#define DSPI_RSER_EOQF_RE_WIDTH                  1u
#define DSPI_RSER_EOQF_RE(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_EOQF_RE_SHIFT))&DSPI_RSER_EOQF_RE_MASK)
#define DSPI_RSER_TCF_RE_MASK                    0x80000000u
#define DSPI_RSER_TCF_RE_SHIFT                   31u
#define DSPI_RSER_TCF_RE_WIDTH                   1u
#define DSPI_RSER_TCF_RE(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_RSER_TCF_RE_SHIFT))&DSPI_RSER_TCF_RE_MASK)
/* PUSHR Bit Fields */
#define DSPI_PUSHR_TXDATA_MASK                   0xFFFFu
#define DSPI_PUSHR_TXDATA_SHIFT                  0u
#define DSPI_PUSHR_TXDATA_WIDTH                  16u
#define DSPI_PUSHR_TXDATA(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_TXDATA_SHIFT))&DSPI_PUSHR_TXDATA_MASK)
#define DSPI_PUSHR_PCS_MASK                      0x3F0000u
#define DSPI_PUSHR_PCS_SHIFT                     16u
#define DSPI_PUSHR_PCS_WIDTH                     6u
#define DSPI_PUSHR_PCS(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_PCS_SHIFT))&DSPI_PUSHR_PCS_MASK)
#define DSPI_PUSHR_PP_MASK                       0x1000000u
#define DSPI_PUSHR_PP_SHIFT                      24u
#define DSPI_PUSHR_PP_WIDTH                      1u
#define DSPI_PUSHR_PP(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_PP_SHIFT))&DSPI_PUSHR_PP_MASK)
#define DSPI_PUSHR_PE_MASK                       0x2000000u
#define DSPI_PUSHR_PE_SHIFT                      25u
#define DSPI_PUSHR_PE_WIDTH                      1u
