neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define DSPI_PUSHR_PE(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_PE_SHIFT))&DSPI_PUSHR_PE_MASK)
#define DSPI_PUSHR_CTCNT_MASK                    0x4000000u
#define DSPI_PUSHR_CTCNT_SHIFT                   26u
#define DSPI_PUSHR_CTCNT_WIDTH                   1u
#define DSPI_PUSHR_CTCNT(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_CTCNT_SHIFT))&DSPI_PUSHR_CTCNT_MASK)
#define DSPI_PUSHR_EOQ_MASK                      0x8000000u
#define DSPI_PUSHR_EOQ_SHIFT                     27u
#define DSPI_PUSHR_EOQ_WIDTH                     1u
#define DSPI_PUSHR_EOQ(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_EOQ_SHIFT))&DSPI_PUSHR_EOQ_MASK)
#define DSPI_PUSHR_CTAS_MASK                     0x70000000u
#define DSPI_PUSHR_CTAS_SHIFT                    28u
#define DSPI_PUSHR_CTAS_WIDTH                    3u
#define DSPI_PUSHR_CTAS(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_CTAS_SHIFT))&DSPI_PUSHR_CTAS_MASK)
#define DSPI_PUSHR_CONT_MASK                     0x80000000u
#define DSPI_PUSHR_CONT_SHIFT                    31u
#define DSPI_PUSHR_CONT_WIDTH                    1u
#define DSPI_PUSHR_CONT(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_CONT_SHIFT))&DSPI_PUSHR_CONT_MASK)
/* PUSHR_SLAVE Bit Fields */
#define DSPI_PUSHR_SLAVE_TXDATA_MASK             0xFFFFu
#define DSPI_PUSHR_SLAVE_TXDATA_SHIFT            0u
#define DSPI_PUSHR_SLAVE_TXDATA_WIDTH            16u
#define DSPI_PUSHR_SLAVE_TXDATA(x)               (((uint32_t)(((uint32_t)(x))<<DSPI_PUSHR_SLAVE_TXDATA_SHIFT))&DSPI_PUSHR_SLAVE_TXDATA_MASK)
/* POPR Bit Fields */
#define DSPI_POPR_RXDATA_MASK                    0xFFFFFFFFu
#define DSPI_POPR_RXDATA_SHIFT                   0u
#define DSPI_POPR_RXDATA_WIDTH                   32u
#define DSPI_POPR_RXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_POPR_RXDATA_SHIFT))&DSPI_POPR_RXDATA_MASK)
/* TXFR Bit Fields */
#define DSPI_TXFR_TXDATA_MASK                    0xFFFFu
#define DSPI_TXFR_TXDATA_SHIFT                   0u
#define DSPI_TXFR_TXDATA_WIDTH                   16u
#define DSPI_TXFR_TXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_TXFR_TXDATA_SHIFT))&DSPI_TXFR_TXDATA_MASK)
#define DSPI_TXFR_TXCMD_TXDATA_MASK              0xFFFF0000u
#define DSPI_TXFR_TXCMD_TXDATA_SHIFT             16u
#define DSPI_TXFR_TXCMD_TXDATA_WIDTH             16u
#define DSPI_TXFR_TXCMD_TXDATA(x)                (((uint32_t)(((uint32_t)(x))<<DSPI_TXFR_TXCMD_TXDATA_SHIFT))&DSPI_TXFR_TXCMD_TXDATA_MASK)
/* RXFR Bit Fields */
#define DSPI_RXFR_RXDATA_MASK                    0xFFFFFFFFu
#define DSPI_RXFR_RXDATA_SHIFT                   0u
#define DSPI_RXFR_RXDATA_WIDTH                   32u
#define DSPI_RXFR_RXDATA(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_RXFR_RXDATA_SHIFT))&DSPI_RXFR_RXDATA_MASK)
/* DSICR0 Bit Fields */
#define DSPI_DSICR0_DPCSx_MASK                   0xFFu
#define DSPI_DSICR0_DPCSx_SHIFT                  0u
#define DSPI_DSICR0_DPCSx_WIDTH                  8u
#define DSPI_DSICR0_DPCSx(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_DPCSx_SHIFT))&DSPI_DSICR0_DPCSx_MASK)
#define DSPI_DSICR0_PP_MASK                      0x100u
#define DSPI_DSICR0_PP_SHIFT                     8u
#define DSPI_DSICR0_PP_WIDTH                     1u
#define DSPI_DSICR0_PP(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_PP_SHIFT))&DSPI_DSICR0_PP_MASK)
#define DSPI_DSICR0_PE_MASK                      0x200u
#define DSPI_DSICR0_PE_SHIFT                     9u
#define DSPI_DSICR0_PE_WIDTH                     1u
#define DSPI_DSICR0_PE(x)                        (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_PE_SHIFT))&DSPI_DSICR0_PE_MASK)
#define DSPI_DSICR0_PES_MASK                     0x400u
#define DSPI_DSICR0_PES_SHIFT                    10u
#define DSPI_DSICR0_PES_WIDTH                    1u
#define DSPI_DSICR0_PES(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_PES_SHIFT))&DSPI_DSICR0_PES_MASK)
#define DSPI_DSICR0_DMS_MASK                     0x800u
#define DSPI_DSICR0_DMS_SHIFT                    11u
#define DSPI_DSICR0_DMS_WIDTH                    1u
#define DSPI_DSICR0_DMS(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_DMS_SHIFT))&DSPI_DSICR0_DMS_MASK)
#define DSPI_DSICR0_DSICTAS_MASK                 0x7000u
#define DSPI_DSICR0_DSICTAS_SHIFT                12u
#define DSPI_DSICR0_DSICTAS_WIDTH                3u
#define DSPI_DSICR0_DSICTAS(x)                   (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_DSICTAS_SHIFT))&DSPI_DSICR0_DSICTAS_MASK)
#define DSPI_DSICR0_DCONT_MASK                   0x8000u
#define DSPI_DSICR0_DCONT_SHIFT                  15u
#define DSPI_DSICR0_DCONT_WIDTH                  1u
#define DSPI_DSICR0_DCONT(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_DCONT_SHIFT))&DSPI_DSICR0_DCONT_MASK)
#define DSPI_DSICR0_CID_MASK                     0x10000u
#define DSPI_DSICR0_CID_SHIFT                    16u
#define DSPI_DSICR0_CID_WIDTH                    1u
#define DSPI_DSICR0_CID(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_CID_SHIFT))&DSPI_DSICR0_CID_MASK)
#define DSPI_DSICR0_TRRE_MASK                    0x20000u
#define DSPI_DSICR0_TRRE_SHIFT                   17u
#define DSPI_DSICR0_TRRE_WIDTH                   1u
#define DSPI_DSICR0_TRRE(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_TRRE_SHIFT))&DSPI_DSICR0_TRRE_MASK)
#define DSPI_DSICR0_TPOL_MASK                    0x40000u
#define DSPI_DSICR0_TPOL_SHIFT                   18u
#define DSPI_DSICR0_TPOL_WIDTH                   1u
#define DSPI_DSICR0_TPOL(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_TPOL_SHIFT))&DSPI_DSICR0_TPOL_MASK)
#define DSPI_DSICR0_TXSS_MASK                    0x80000u
#define DSPI_DSICR0_TXSS_SHIFT                   19u
#define DSPI_DSICR0_TXSS_WIDTH                   1u
#define DSPI_DSICR0_TXSS(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_TXSS_SHIFT))&DSPI_DSICR0_TXSS_MASK)
#define DSPI_DSICR0_TSBC_MASK                    0x100000u
#define DSPI_DSICR0_TSBC_SHIFT                   20u
#define DSPI_DSICR0_TSBC_WIDTH                   1u
#define DSPI_DSICR0_TSBC(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_TSBC_SHIFT))&DSPI_DSICR0_TSBC_MASK)
#define DSPI_DSICR0_FMSZ4_MASK                   0x40000000u
#define DSPI_DSICR0_FMSZ4_SHIFT                  30u
#define DSPI_DSICR0_FMSZ4_WIDTH                  1u
#define DSPI_DSICR0_FMSZ4(x)                     (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR0_FMSZ4_SHIFT))&DSPI_DSICR0_FMSZ4_MASK)
/* SDR0 Bit Fields */
#define DSPI_SDR0_SER_DATA_MASK                  0xFFFFFFFFu
#define DSPI_SDR0_SER_DATA_SHIFT                 0u
#define DSPI_SDR0_SER_DATA_WIDTH                 32u
#define DSPI_SDR0_SER_DATA(x)                    (((uint32_t)(((uint32_t)(x))<<DSPI_SDR0_SER_DATA_SHIFT))&DSPI_SDR0_SER_DATA_MASK)
/* ASDR0 Bit Fields */
#define DSPI_ASDR0_ASER_DATA_MASK                0xFFFFFFFFu
#define DSPI_ASDR0_ASER_DATA_SHIFT               0u
#define DSPI_ASDR0_ASER_DATA_WIDTH               32u
#define DSPI_ASDR0_ASER_DATA(x)                  (((uint32_t)(((uint32_t)(x))<<DSPI_ASDR0_ASER_DATA_SHIFT))&DSPI_ASDR0_ASER_DATA_MASK)
/* COMPR0 Bit Fields */
#define DSPI_COMPR0_COMP_DATA_MASK               0xFFFFFFFFu
#define DSPI_COMPR0_COMP_DATA_SHIFT              0u
#define DSPI_COMPR0_COMP_DATA_WIDTH              32u
#define DSPI_COMPR0_COMP_DATA(x)                 (((uint32_t)(((uint32_t)(x))<<DSPI_COMPR0_COMP_DATA_SHIFT))&DSPI_COMPR0_COMP_DATA_MASK)
/* DDR0 Bit Fields */
#define DSPI_DDR0_DESER_DATA_MASK                0xFFFFFFFFu
#define DSPI_DDR0_DESER_DATA_SHIFT               0u
#define DSPI_DDR0_DESER_DATA_WIDTH               32u
#define DSPI_DDR0_DESER_DATA(x)                  (((uint32_t)(((uint32_t)(x))<<DSPI_DDR0_DESER_DATA_SHIFT))&DSPI_DDR0_DESER_DATA_MASK)
/* DSICR1 Bit Fields */
#define DSPI_DSICR1_DPCS1_x_MASK                 0xFFu
#define DSPI_DSICR1_DPCS1_x_SHIFT                0u
#define DSPI_DSICR1_DPCS1_x_WIDTH                8u
#define DSPI_DSICR1_DPCS1_x(x)                   (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR1_DPCS1_x_SHIFT))&DSPI_DSICR1_DPCS1_x_MASK)
#define DSPI_DSICR1_DSE0_MASK                    0x10000u
#define DSPI_DSICR1_DSE0_SHIFT                   16u
#define DSPI_DSICR1_DSE0_WIDTH                   1u
#define DSPI_DSICR1_DSE0(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR1_DSE0_SHIFT))&DSPI_DSICR1_DSE0_MASK)
#define DSPI_DSICR1_DSE1_MASK                    0x20000u
#define DSPI_DSICR1_DSE1_SHIFT                   17u
#define DSPI_DSICR1_DSE1_WIDTH                   1u
#define DSPI_DSICR1_DSE1(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR1_DSE1_SHIFT))&DSPI_DSICR1_DSE1_MASK)
#define DSPI_DSICR1_TSBCNT_MASK                  0x1F000000u
#define DSPI_DSICR1_TSBCNT_SHIFT                 24u
#define DSPI_DSICR1_TSBCNT_WIDTH                 5u
#define DSPI_DSICR1_TSBCNT(x)                    (((uint32_t)(((uint32_t)(x))<<DSPI_DSICR1_TSBCNT_SHIFT))&DSPI_DSICR1_TSBCNT_MASK)
/* SSR0 Bit Fields */
#define DSPI_SSR0_SS_MASK                        0xFFFFFFFFu
#define DSPI_SSR0_SS_SHIFT                       0u
#define DSPI_SSR0_SS_WIDTH                       32u
#define DSPI_SSR0_SS(x)                          (((uint32_t)(((uint32_t)(x))<<DSPI_SSR0_SS_SHIFT))&DSPI_SSR0_SS_MASK)
/* PISR0 Bit Fields */
#define DSPI_PISR0_IPS0_MASK                     0xFu
#define DSPI_PISR0_IPS0_SHIFT                    0u
#define DSPI_PISR0_IPS0_WIDTH                    4u
#define DSPI_PISR0_IPS0(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS0_SHIFT))&DSPI_PISR0_IPS0_MASK)
#define DSPI_PISR0_IPS1_MASK                     0xF0u
#define DSPI_PISR0_IPS1_SHIFT                    4u
#define DSPI_PISR0_IPS1_WIDTH                    4u
#define DSPI_PISR0_IPS1(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS1_SHIFT))&DSPI_PISR0_IPS1_MASK)
#define DSPI_PISR0_IPS2_MASK                     0xF00u
#define DSPI_PISR0_IPS2_SHIFT                    8u
#define DSPI_PISR0_IPS2_WIDTH                    4u
#define DSPI_PISR0_IPS2(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS2_SHIFT))&DSPI_PISR0_IPS2_MASK)
#define DSPI_PISR0_IPS3_MASK                     0xF000u
#define DSPI_PISR0_IPS3_SHIFT                    12u
#define DSPI_PISR0_IPS3_WIDTH                    4u
#define DSPI_PISR0_IPS3(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS3_SHIFT))&DSPI_PISR0_IPS3_MASK)
#define DSPI_PISR0_IPS4_MASK                     0xF0000u
#define DSPI_PISR0_IPS4_SHIFT                    16u
#define DSPI_PISR0_IPS4_WIDTH                    4u
#define DSPI_PISR0_IPS4(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS4_SHIFT))&DSPI_PISR0_IPS4_MASK)
#define DSPI_PISR0_IPS5_MASK                     0xF00000u
#define DSPI_PISR0_IPS5_SHIFT                    20u
#define DSPI_PISR0_IPS5_WIDTH                    4u
#define DSPI_PISR0_IPS5(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS5_SHIFT))&DSPI_PISR0_IPS5_MASK)
#define DSPI_PISR0_IPS6_MASK                     0xF000000u
#define DSPI_PISR0_IPS6_SHIFT                    24u
#define DSPI_PISR0_IPS6_WIDTH                    4u
#define DSPI_PISR0_IPS6(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS6_SHIFT))&DSPI_PISR0_IPS6_MASK)
#define DSPI_PISR0_IPS7_MASK                     0xF0000000u
#define DSPI_PISR0_IPS7_SHIFT                    28u
#define DSPI_PISR0_IPS7_WIDTH                    4u
#define DSPI_PISR0_IPS7(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR0_IPS7_SHIFT))&DSPI_PISR0_IPS7_MASK)
/* PISR1 Bit Fields */
#define DSPI_PISR1_IPS8_MASK                     0xFu
#define DSPI_PISR1_IPS8_SHIFT                    0u
#define DSPI_PISR1_IPS8_WIDTH                    4u
#define DSPI_PISR1_IPS8(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS8_SHIFT))&DSPI_PISR1_IPS8_MASK)
#define DSPI_PISR1_IPS9_MASK                     0xF0u
#define DSPI_PISR1_IPS9_SHIFT                    4u
#define DSPI_PISR1_IPS9_WIDTH                    4u
#define DSPI_PISR1_IPS9(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS9_SHIFT))&DSPI_PISR1_IPS9_MASK)
#define DSPI_PISR1_IPS10_MASK                    0xF00u
#define DSPI_PISR1_IPS10_SHIFT                   8u
#define DSPI_PISR1_IPS10_WIDTH                   4u
#define DSPI_PISR1_IPS10(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS10_SHIFT))&DSPI_PISR1_IPS10_MASK)
#define DSPI_PISR1_IPS11_MASK                    0xF000u
#define DSPI_PISR1_IPS11_SHIFT                   12u
#define DSPI_PISR1_IPS11_WIDTH                   4u
#define DSPI_PISR1_IPS11(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS11_SHIFT))&DSPI_PISR1_IPS11_MASK)
#define DSPI_PISR1_IPS12_MASK                    0xF0000u
#define DSPI_PISR1_IPS12_SHIFT                   16u
#define DSPI_PISR1_IPS12_WIDTH                   4u
#define DSPI_PISR1_IPS12(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS12_SHIFT))&DSPI_PISR1_IPS12_MASK)
#define DSPI_PISR1_IPS13_MASK                    0xF00000u
#define DSPI_PISR1_IPS13_SHIFT                   20u
#define DSPI_PISR1_IPS13_WIDTH                   4u
#define DSPI_PISR1_IPS13(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS13_SHIFT))&DSPI_PISR1_IPS13_MASK)
#define DSPI_PISR1_IPS14_MASK                    0xF000000u
#define DSPI_PISR1_IPS14_SHIFT                   24u
#define DSPI_PISR1_IPS14_WIDTH                   4u
#define DSPI_PISR1_IPS14(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS14_SHIFT))&DSPI_PISR1_IPS14_MASK)
#define DSPI_PISR1_IPS15_MASK                    0xF0000000u
#define DSPI_PISR1_IPS15_SHIFT                   28u
#define DSPI_PISR1_IPS15_WIDTH                   4u
#define DSPI_PISR1_IPS15(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR1_IPS15_SHIFT))&DSPI_PISR1_IPS15_MASK)
/* PISR2 Bit Fields */
#define DSPI_PISR2_IPS16_MASK                    0xFu
#define DSPI_PISR2_IPS16_SHIFT                   0u
#define DSPI_PISR2_IPS16_WIDTH                   4u
#define DSPI_PISR2_IPS16(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS16_SHIFT))&DSPI_PISR2_IPS16_MASK)
#define DSPI_PISR2_IPS17_MASK                    0xF0u
#define DSPI_PISR2_IPS17_SHIFT                   4u
#define DSPI_PISR2_IPS17_WIDTH                   4u
#define DSPI_PISR2_IPS17(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS17_SHIFT))&DSPI_PISR2_IPS17_MASK)
#define DSPI_PISR2_IPS18_MASK                    0xF00u
#define DSPI_PISR2_IPS18_SHIFT                   8u
#define DSPI_PISR2_IPS18_WIDTH                   4u
#define DSPI_PISR2_IPS18(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS18_SHIFT))&DSPI_PISR2_IPS18_MASK)
#define DSPI_PISR2_IPS19_MASK                    0xF000u
#define DSPI_PISR2_IPS19_SHIFT                   12u
#define DSPI_PISR2_IPS19_WIDTH                   4u
#define DSPI_PISR2_IPS19(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS19_SHIFT))&DSPI_PISR2_IPS19_MASK)
#define DSPI_PISR2_IPS20_MASK                    0xF0000u
#define DSPI_PISR2_IPS20_SHIFT                   16u
#define DSPI_PISR2_IPS20_WIDTH                   4u
#define DSPI_PISR2_IPS20(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS20_SHIFT))&DSPI_PISR2_IPS20_MASK)
#define DSPI_PISR2_IPS21_MASK                    0xF00000u
#define DSPI_PISR2_IPS21_SHIFT                   20u
#define DSPI_PISR2_IPS21_WIDTH                   4u
#define DSPI_PISR2_IPS21(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS21_SHIFT))&DSPI_PISR2_IPS21_MASK)
#define DSPI_PISR2_IPS22_MASK                    0xF000000u
#define DSPI_PISR2_IPS22_SHIFT                   24u
#define DSPI_PISR2_IPS22_WIDTH                   4u
#define DSPI_PISR2_IPS22(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS22_SHIFT))&DSPI_PISR2_IPS22_MASK)
#define DSPI_PISR2_IPS23_MASK                    0xF0000000u
#define DSPI_PISR2_IPS23_SHIFT                   28u
#define DSPI_PISR2_IPS23_WIDTH                   4u
#define DSPI_PISR2_IPS23(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR2_IPS23_SHIFT))&DSPI_PISR2_IPS23_MASK)
/* PISR3 Bit Fields */
#define DSPI_PISR3_IPS24_MASK                    0xFu
#define DSPI_PISR3_IPS24_SHIFT                   0u
#define DSPI_PISR3_IPS24_WIDTH                   4u
#define DSPI_PISR3_IPS24(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS24_SHIFT))&DSPI_PISR3_IPS24_MASK)
#define DSPI_PISR3_IPS25_MASK                    0xF0u
#define DSPI_PISR3_IPS25_SHIFT                   4u
#define DSPI_PISR3_IPS25_WIDTH                   4u
#define DSPI_PISR3_IPS25(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS25_SHIFT))&DSPI_PISR3_IPS25_MASK)
#define DSPI_PISR3_IPS26_MASK                    0xF00u
#define DSPI_PISR3_IPS26_SHIFT                   8u
#define DSPI_PISR3_IPS26_WIDTH                   4u
#define DSPI_PISR3_IPS26(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS26_SHIFT))&DSPI_PISR3_IPS26_MASK)
#define DSPI_PISR3_IPS27_MASK                    0xF000u
#define DSPI_PISR3_IPS27_SHIFT                   12u
#define DSPI_PISR3_IPS27_WIDTH                   4u
#define DSPI_PISR3_IPS27(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS27_SHIFT))&DSPI_PISR3_IPS27_MASK)
#define DSPI_PISR3_IPS28_MASK                    0xF0000u
#define DSPI_PISR3_IPS28_SHIFT                   16u
#define DSPI_PISR3_IPS28_WIDTH                   4u
#define DSPI_PISR3_IPS28(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS28_SHIFT))&DSPI_PISR3_IPS28_MASK)
#define DSPI_PISR3_IPS29_MASK                    0xF00000u
#define DSPI_PISR3_IPS29_SHIFT                   20u
#define DSPI_PISR3_IPS29_WIDTH                   4u
#define DSPI_PISR3_IPS29(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS29_SHIFT))&DSPI_PISR3_IPS29_MASK)
#define DSPI_PISR3_IPS30_MASK                    0xF000000u
#define DSPI_PISR3_IPS30_SHIFT                   24u
#define DSPI_PISR3_IPS30_WIDTH                   4u
#define DSPI_PISR3_IPS30(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS30_SHIFT))&DSPI_PISR3_IPS30_MASK)
#define DSPI_PISR3_IPS31_MASK                    0xF0000000u
#define DSPI_PISR3_IPS31_SHIFT                   28u
#define DSPI_PISR3_IPS31_WIDTH                   4u
#define DSPI_PISR3_IPS31(x)                      (((uint32_t)(((uint32_t)(x))<<DSPI_PISR3_IPS31_SHIFT))&DSPI_PISR3_IPS31_MASK)
/* DIMR0 Bit Fields */
#define DSPI_DIMR0_MASK_MASK                     0xFFFFFFFFu
#define DSPI_DIMR0_MASK_SHIFT                    0u
#define DSPI_DIMR0_MASK_WIDTH                    32u
#define DSPI_DIMR0_MASK(x)                       (((uint32_t)(((uint32_t)(x))<<DSPI_DIMR0_MASK_SHIFT))&DSPI_DIMR0_MASK_MASK)
/* DPIR0 Bit Fields */
#define DSPI_DPIR0_DP_MASK                       0xFFFFFFFFu
#define DSPI_DPIR0_DP_SHIFT                      0u
#define DSPI_DPIR0_DP_WIDTH                      32u
#define DSPI_DPIR0_DP(x)                         (((uint32_t)(((uint32_t)(x))<<DSPI_DPIR0_DP_SHIFT))&DSPI_DPIR0_DP_MASK)

/*!
 * @}
 */ /* end of group DSPI_Register_Masks */


/*!
 * @}
 */ /* end of group DSPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- DTS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DTS_Peripheral_Access_Layer DTS Peripheral Access Layer
 * @{
 */


/** DTS - Size of Registers Arrays */

/** DTS - Register Layout Typedef */
typedef struct {
  __IO uint32_t ENABLE;                            /**< Output Enable Register, offset: 0x0 */
  __IO uint32_t STARTUP;                           /**< Startup Register, offset: 0x4 */
  __IO uint32_t SEMAPHORE;                         /**< Semaphore Register, offset: 0x8 */
  __IO uint32_t SEMAPHORE_B;                       /**< Semaphore Extension, offset: 0xC */
} DTS_Type, *DTS_MemMapPtr;

 /** Number of instances of the DTS module. */
#define DTS_INSTANCE_COUNT                       (1u)


/* DTS - Peripheral instance base addresses */
/** Peripheral DTS base address */
#define DTS_BASE                                 (0xFFE78000u)
/** Peripheral DTS base pointer */
#define DTS                                      ((DTS_Type *)DTS_BASE)
/** Array initializer of DTS peripheral base addresses */
#define DTS_BASE_ADDRS                           { DTS_BASE }
/** Array initializer of DTS peripheral base pointers */
#define DTS_BASE_PTRS                            { DTS }

/* ----------------------------------------------------------------------------
   -- DTS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DTS_Register_Masks DTS Register Masks
 * @{
 */

/* ENABLE Bit Fields */
#define DTS_ENABLE_DTS_EN_MASK                   0x1u
#define DTS_ENABLE_DTS_EN_SHIFT                  0u
#define DTS_ENABLE_DTS_EN_WIDTH                  1u
#define DTS_ENABLE_DTS_EN(x)                     (((uint32_t)(((uint32_t)(x))<<DTS_ENABLE_DTS_EN_SHIFT))&DTS_ENABLE_DTS_EN_MASK)
#define DTS_ENABLE_DTS_EN_B_MASK                 0x2u
#define DTS_ENABLE_DTS_EN_B_SHIFT                1u
#define DTS_ENABLE_DTS_EN_B_WIDTH                1u
#define DTS_ENABLE_DTS_EN_B(x)                   (((uint32_t)(((uint32_t)(x))<<DTS_ENABLE_DTS_EN_B_SHIFT))&DTS_ENABLE_DTS_EN_B_MASK)
/* STARTUP Bit Fields */
#define DTS_STARTUP_AD_MASK                      0xFFFFFFFFu
#define DTS_STARTUP_AD_SHIFT                     0u
#define DTS_STARTUP_AD_WIDTH                     32u
#define DTS_STARTUP_AD(x)                        (((uint32_t)(((uint32_t)(x))<<DTS_STARTUP_AD_SHIFT))&DTS_STARTUP_AD_MASK)
/* SEMAPHORE Bit Fields */
#define DTS_SEMAPHORE_ST_MASK                    0xFFFFFFFFu
#define DTS_SEMAPHORE_ST_SHIFT                   0u
#define DTS_SEMAPHORE_ST_WIDTH                   32u
#define DTS_SEMAPHORE_ST(x)                      (((uint32_t)(((uint32_t)(x))<<DTS_SEMAPHORE_ST_SHIFT))&DTS_SEMAPHORE_ST_MASK)
/* SEMAPHORE_B Bit Fields */
#define DTS_SEMAPHORE_B_ST_B_MASK                0xFFFFFFFFu
#define DTS_SEMAPHORE_B_ST_B_SHIFT               0u
#define DTS_SEMAPHORE_B_ST_B_WIDTH               32u
#define DTS_SEMAPHORE_B_ST_B(x)                  (((uint32_t)(((uint32_t)(x))<<DTS_SEMAPHORE_B_ST_B_SHIFT))&DTS_SEMAPHORE_B_ST_B_MASK)

/*!
 * @}
 */ /* end of group DTS_Register_Masks */


/*!
 * @}
 */ /* end of group DTS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- EBI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EBI_Peripheral_Access_Layer EBI Peripheral Access Layer
 * @{
 */


/** EBI - Size of Registers Arrays */
#define EBI_CAL_COUNT                            4u

