neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** EBI - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< EBI Module Configuration Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __I  uint32_t TESR;                              /**< EBI Transfer Error Status Register, offset: 0x8 */
  __IO uint32_t BMCR;                              /**< EBI Bus Monitor Control Register, offset: 0xC */
       uint8_t RESERVED_1[48];
  struct {                                         /* offset: 0x40, array step: 0x8 */
    __IO uint32_t BR;                                /**< EBI Calibration Base Register, array offset: 0x40, array step: 0x8 */
    __IO uint32_t OR;                                /**< EBI Calibration Option Register, array offset: 0x44, array step: 0x8 */
  } CAL[EBI_CAL_COUNT];
} EBI_Type, *EBI_MemMapPtr;

 /** Number of instances of the EBI module. */
#define EBI_INSTANCE_COUNT                       (1u)


/* EBI - Peripheral instance base addresses */
/** Peripheral EBI base address */
#define EBI_BASE                                 (0xC3F84000u)
/** Peripheral EBI base pointer */
#define EBI                                      ((EBI_Type *)EBI_BASE)
/** Array initializer of EBI peripheral base addresses */
#define EBI_BASE_ADDRS                           { EBI_BASE }
/** Array initializer of EBI peripheral base pointers */
#define EBI_BASE_PTRS                            { EBI }

/* ----------------------------------------------------------------------------
   -- EBI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EBI_Register_Masks EBI Register Masks
 * @{
 */

/* MCR Bit Fields */
#define EBI_MCR_DBM_MASK                         0x1u
#define EBI_MCR_DBM_SHIFT                        0u
#define EBI_MCR_DBM_WIDTH                        1u
#define EBI_MCR_DBM(x)                           (((uint32_t)(((uint32_t)(x))<<EBI_MCR_DBM_SHIFT))&EBI_MCR_DBM_MASK)
#define EBI_MCR_AD_MUX_MASK                      0x2u
#define EBI_MCR_AD_MUX_SHIFT                     1u
#define EBI_MCR_AD_MUX_WIDTH                     1u
#define EBI_MCR_AD_MUX(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_MCR_AD_MUX_SHIFT))&EBI_MCR_AD_MUX_MASK)
#define EBI_MCR_D16_31_MASK                      0x4u
#define EBI_MCR_D16_31_SHIFT                     2u
#define EBI_MCR_D16_31_WIDTH                     1u
#define EBI_MCR_D16_31(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_MCR_D16_31_SHIFT))&EBI_MCR_D16_31_MASK)
#define EBI_MCR_MDIS_MASK                        0x40u
#define EBI_MCR_MDIS_SHIFT                       6u
#define EBI_MCR_MDIS_WIDTH                       1u
#define EBI_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x))<<EBI_MCR_MDIS_SHIFT))&EBI_MCR_MDIS_MASK)
#define EBI_MCR_ACGE_MASK                        0x8000u
#define EBI_MCR_ACGE_SHIFT                       15u
#define EBI_MCR_ACGE_WIDTH                       1u
#define EBI_MCR_ACGE(x)                          (((uint32_t)(((uint32_t)(x))<<EBI_MCR_ACGE_SHIFT))&EBI_MCR_ACGE_MASK)
/* TESR Bit Fields */
#define EBI_TESR_BMTF_MASK                       0x1u
#define EBI_TESR_BMTF_SHIFT                      0u
#define EBI_TESR_BMTF_WIDTH                      1u
#define EBI_TESR_BMTF(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_TESR_BMTF_SHIFT))&EBI_TESR_BMTF_MASK)
#define EBI_TESR_TEAF_MASK                       0x2u
#define EBI_TESR_TEAF_SHIFT                      1u
#define EBI_TESR_TEAF_WIDTH                      1u
#define EBI_TESR_TEAF(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_TESR_TEAF_SHIFT))&EBI_TESR_TEAF_MASK)
/* BMCR Bit Fields */
#define EBI_BMCR_BME_MASK                        0x80u
#define EBI_BMCR_BME_SHIFT                       7u
#define EBI_BMCR_BME_WIDTH                       1u
#define EBI_BMCR_BME(x)                          (((uint32_t)(((uint32_t)(x))<<EBI_BMCR_BME_SHIFT))&EBI_BMCR_BME_MASK)
#define EBI_BMCR_BMT_MASK                        0xFF00u
#define EBI_BMCR_BMT_SHIFT                       8u
#define EBI_BMCR_BMT_WIDTH                       8u
#define EBI_BMCR_BMT(x)                          (((uint32_t)(((uint32_t)(x))<<EBI_BMCR_BMT_SHIFT))&EBI_BMCR_BMT_MASK)
/* CAL_BR Bit Fields */
#define EBI_CAL_BR_V_MASK                        0x1u
#define EBI_CAL_BR_V_SHIFT                       0u
#define EBI_CAL_BR_V_WIDTH                       1u
#define EBI_CAL_BR_V(x)                          (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_V_SHIFT))&EBI_CAL_BR_V_MASK)
#define EBI_CAL_BR_BI_MASK                       0x2u
#define EBI_CAL_BR_BI_SHIFT                      1u
#define EBI_CAL_BR_BI_WIDTH                      1u
#define EBI_CAL_BR_BI(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_BI_SHIFT))&EBI_CAL_BR_BI_MASK)
#define EBI_CAL_BR_SETA_MASK                     0x4u
#define EBI_CAL_BR_SETA_SHIFT                    2u
#define EBI_CAL_BR_SETA_WIDTH                    1u
#define EBI_CAL_BR_SETA(x)                       (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_SETA_SHIFT))&EBI_CAL_BR_SETA_MASK)
#define EBI_CAL_BR_GCSN_MASK                     0x8u
#define EBI_CAL_BR_GCSN_SHIFT                    3u
#define EBI_CAL_BR_GCSN_WIDTH                    1u
#define EBI_CAL_BR_GCSN(x)                       (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_GCSN_SHIFT))&EBI_CAL_BR_GCSN_MASK)
#define EBI_CAL_BR_TBDIP_MASK                    0x10u
#define EBI_CAL_BR_TBDIP_SHIFT                   4u
#define EBI_CAL_BR_TBDIP_WIDTH                   1u
#define EBI_CAL_BR_TBDIP(x)                      (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_TBDIP_SHIFT))&EBI_CAL_BR_TBDIP_MASK)
#define EBI_CAL_BR_WEBS_MASK                     0x20u
#define EBI_CAL_BR_WEBS_SHIFT                    5u
#define EBI_CAL_BR_WEBS_WIDTH                    1u
#define EBI_CAL_BR_WEBS(x)                       (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_WEBS_SHIFT))&EBI_CAL_BR_WEBS_MASK)
#define EBI_CAL_BR_BL_MASK                       0x40u
#define EBI_CAL_BR_BL_SHIFT                      6u
#define EBI_CAL_BR_BL_WIDTH                      1u
#define EBI_CAL_BR_BL(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_BL_SHIFT))&EBI_CAL_BR_BL_MASK)
#define EBI_CAL_BR_AD_MUX_MASK                   0x80u
#define EBI_CAL_BR_AD_MUX_SHIFT                  7u
#define EBI_CAL_BR_AD_MUX_WIDTH                  1u
#define EBI_CAL_BR_AD_MUX(x)                     (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_AD_MUX_SHIFT))&EBI_CAL_BR_AD_MUX_MASK)
#define EBI_CAL_BR_SBL_MASK                      0x100u
#define EBI_CAL_BR_SBL_SHIFT                     8u
#define EBI_CAL_BR_SBL_WIDTH                     1u
#define EBI_CAL_BR_SBL(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_SBL_SHIFT))&EBI_CAL_BR_SBL_MASK)
#define EBI_CAL_BR_EOE_MASK                      0x600u
#define EBI_CAL_BR_EOE_SHIFT                     9u
#define EBI_CAL_BR_EOE_WIDTH                     2u
#define EBI_CAL_BR_EOE(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_EOE_SHIFT))&EBI_CAL_BR_EOE_MASK)
#define EBI_CAL_BR_PS_MASK                       0x800u
#define EBI_CAL_BR_PS_SHIFT                      11u
#define EBI_CAL_BR_PS_WIDTH                      1u
#define EBI_CAL_BR_PS(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_PS_SHIFT))&EBI_CAL_BR_PS_MASK)
#define EBI_CAL_BR_LWRN_MASK                     0x1000u
#define EBI_CAL_BR_LWRN_SHIFT                    12u
#define EBI_CAL_BR_LWRN_WIDTH                    1u
#define EBI_CAL_BR_LWRN(x)                       (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_LWRN_SHIFT))&EBI_CAL_BR_LWRN_MASK)
#define EBI_CAL_BR_BA_MASK                       0xFFFF8000u
#define EBI_CAL_BR_BA_SHIFT                      15u
#define EBI_CAL_BR_BA_WIDTH                      17u
#define EBI_CAL_BR_BA(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_CAL_BR_BA_SHIFT))&EBI_CAL_BR_BA_MASK)
/* CAL_OR Bit Fields */
#define EBI_CAL_OR_BSCY_MASK                     0x6u
#define EBI_CAL_OR_BSCY_SHIFT                    1u
#define EBI_CAL_OR_BSCY_WIDTH                    2u
#define EBI_CAL_OR_BSCY(x)                       (((uint32_t)(((uint32_t)(x))<<EBI_CAL_OR_BSCY_SHIFT))&EBI_CAL_OR_BSCY_MASK)
#define EBI_CAL_OR_SCY_MASK                      0xF0u
#define EBI_CAL_OR_SCY_SHIFT                     4u
#define EBI_CAL_OR_SCY_WIDTH                     4u
#define EBI_CAL_OR_SCY(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_CAL_OR_SCY_SHIFT))&EBI_CAL_OR_SCY_MASK)
#define EBI_CAL_OR_AWE_MASK                      0x400u
#define EBI_CAL_OR_AWE_SHIFT                     10u
#define EBI_CAL_OR_AWE_WIDTH                     1u
#define EBI_CAL_OR_AWE(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_CAL_OR_AWE_SHIFT))&EBI_CAL_OR_AWE_MASK)
#define EBI_CAL_OR_APS_MASK                      0x1000u
#define EBI_CAL_OR_APS_SHIFT                     12u
#define EBI_CAL_OR_APS_WIDTH                     1u
#define EBI_CAL_OR_APS(x)                        (((uint32_t)(((uint32_t)(x))<<EBI_CAL_OR_APS_SHIFT))&EBI_CAL_OR_APS_MASK)
#define EBI_CAL_OR_AM_MASK                       0xFFFF8000u
#define EBI_CAL_OR_AM_SHIFT                      15u
#define EBI_CAL_OR_AM_WIDTH                      17u
#define EBI_CAL_OR_AM(x)                         (((uint32_t)(((uint32_t)(x))<<EBI_CAL_OR_AM_SHIFT))&EBI_CAL_OR_AM_MASK)

/*!
 * @}
 */ /* end of group EBI_Register_Masks */


/*!
 * @}
 */ /* end of group EBI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- EIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Peripheral_Access_Layer EIM Peripheral Access Layer
 * @{
 */


/** EIM - Size of Registers Arrays */
#define EIM_EICHDn_COUNT                         6u

/** EIM - Register Layout Typedef */
typedef struct {
  __IO uint32_t EIMCR;                             /**< Error Injection Module Configuration Register, offset: 0x0 */
  __IO uint32_t EICHEN;                            /**< Error Injection Channel Enable register, offset: 0x4 */
       uint8_t RESERVED_0[248];
  struct {                                         /* offset: 0x100, array step: 0x100 */
    __IO uint32_t WORD0;                             /**< Error Injection Channel Descriptor, Word0, array offset: 0x100, array step: 0x100 */
    __IO uint32_t WORD1;                             /**< Error Injection Channel Descriptor, Word1, array offset: 0x104, array step: 0x100 */
    __IO uint32_t WORD2;                             /**< Error Injection Channel Descriptor, Word2, array offset: 0x108, array step: 0x100 */
         uint8_t RESERVED_0[244];
  } EICHDn[EIM_EICHDn_COUNT];
} EIM_Type, *EIM_MemMapPtr;

 /** Number of instances of the EIM module. */
#define EIM_INSTANCE_COUNT                       (1u)


