neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* EIM - Peripheral instance base addresses */
/** Peripheral EIM base address */
#define EIM_BASE                                 (0xFFF64000u)
/** Peripheral EIM base pointer */
#define EIM                                      ((EIM_Type *)EIM_BASE)
/** Array initializer of EIM peripheral base addresses */
#define EIM_BASE_ADDRS                           { EIM_BASE }
/** Array initializer of EIM peripheral base pointers */
#define EIM_BASE_PTRS                            { EIM }

/* ----------------------------------------------------------------------------
   -- EIM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Register_Masks EIM Register Masks
 * @{
 */

/* EIMCR Bit Fields */
#define EIM_EIMCR_GEIEN_MASK                     0x1u
#define EIM_EIMCR_GEIEN_SHIFT                    0u
#define EIM_EIMCR_GEIEN_WIDTH                    1u
#define EIM_EIMCR_GEIEN(x)                       (((uint32_t)(((uint32_t)(x))<<EIM_EIMCR_GEIEN_SHIFT))&EIM_EIMCR_GEIEN_MASK)
/* EICHEN Bit Fields */
#define EIM_EICHEN_EICH5EN_MASK                  0x4000000u
#define EIM_EICHEN_EICH5EN_SHIFT                 26u
#define EIM_EICHEN_EICH5EN_WIDTH                 1u
#define EIM_EICHEN_EICH5EN(x)                    (((uint32_t)(((uint32_t)(x))<<EIM_EICHEN_EICH5EN_SHIFT))&EIM_EICHEN_EICH5EN_MASK)
#define EIM_EICHEN_EICH4EN_MASK                  0x8000000u
#define EIM_EICHEN_EICH4EN_SHIFT                 27u
#define EIM_EICHEN_EICH4EN_WIDTH                 1u
#define EIM_EICHEN_EICH4EN(x)                    (((uint32_t)(((uint32_t)(x))<<EIM_EICHEN_EICH4EN_SHIFT))&EIM_EICHEN_EICH4EN_MASK)
#define EIM_EICHEN_EICH3EN_MASK                  0x10000000u
#define EIM_EICHEN_EICH3EN_SHIFT                 28u
#define EIM_EICHEN_EICH3EN_WIDTH                 1u
#define EIM_EICHEN_EICH3EN(x)                    (((uint32_t)(((uint32_t)(x))<<EIM_EICHEN_EICH3EN_SHIFT))&EIM_EICHEN_EICH3EN_MASK)
#define EIM_EICHEN_EICH2EN_MASK                  0x20000000u
#define EIM_EICHEN_EICH2EN_SHIFT                 29u
#define EIM_EICHEN_EICH2EN_WIDTH                 1u
#define EIM_EICHEN_EICH2EN(x)                    (((uint32_t)(((uint32_t)(x))<<EIM_EICHEN_EICH2EN_SHIFT))&EIM_EICHEN_EICH2EN_MASK)
#define EIM_EICHEN_EICH1EN_MASK                  0x40000000u
#define EIM_EICHEN_EICH1EN_SHIFT                 30u
#define EIM_EICHEN_EICH1EN_WIDTH                 1u
#define EIM_EICHEN_EICH1EN(x)                    (((uint32_t)(((uint32_t)(x))<<EIM_EICHEN_EICH1EN_SHIFT))&EIM_EICHEN_EICH1EN_MASK)
#define EIM_EICHEN_EICH0EN_MASK                  0x80000000u
#define EIM_EICHEN_EICH0EN_SHIFT                 31u
#define EIM_EICHEN_EICH0EN_WIDTH                 1u
#define EIM_EICHEN_EICH0EN(x)                    (((uint32_t)(((uint32_t)(x))<<EIM_EICHEN_EICH0EN_SHIFT))&EIM_EICHEN_EICH0EN_MASK)
/* EICHDn_WORD0 Bit Fields */
#define EIM_EICHDn_WORD0_CHKBIT_MASK_MASK        0xFF000000u
#define EIM_EICHDn_WORD0_CHKBIT_MASK_SHIFT       24u
#define EIM_EICHDn_WORD0_CHKBIT_MASK_WIDTH       8u
#define EIM_EICHDn_WORD0_CHKBIT_MASK(x)          (((uint32_t)(((uint32_t)(x))<<EIM_EICHDn_WORD0_CHKBIT_MASK_SHIFT))&EIM_EICHDn_WORD0_CHKBIT_MASK_MASK)
/* EICHDn_WORD1 Bit Fields */
#define EIM_EICHDn_WORD1_B0_3DATA_MASK_MASK      0xFFFFFFFFu
#define EIM_EICHDn_WORD1_B0_3DATA_MASK_SHIFT     0u
#define EIM_EICHDn_WORD1_B0_3DATA_MASK_WIDTH     32u
#define EIM_EICHDn_WORD1_B0_3DATA_MASK(x)        (((uint32_t)(((uint32_t)(x))<<EIM_EICHDn_WORD1_B0_3DATA_MASK_SHIFT))&EIM_EICHDn_WORD1_B0_3DATA_MASK_MASK)
/* EICHDn_WORD2 Bit Fields */
#define EIM_EICHDn_WORD2_B4_7DATA_MASK_MASK      0xFFFFFFFFu
#define EIM_EICHDn_WORD2_B4_7DATA_MASK_SHIFT     0u
#define EIM_EICHDn_WORD2_B4_7DATA_MASK_WIDTH     32u
#define EIM_EICHDn_WORD2_B4_7DATA_MASK(x)        (((uint32_t)(((uint32_t)(x))<<EIM_EICHDn_WORD2_B4_7DATA_MASK_SHIFT))&EIM_EICHDn_WORD2_B4_7DATA_MASK_MASK)

/*!
 * @}
 */ /* end of group EIM_Register_Masks */


/*!
 * @}
 */ /* end of group EIM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- EQADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EQADC_Peripheral_Access_Layer EQADC Peripheral Access Layer
 * @{
 */


/** EQADC - Size of Registers Arrays */
#define EQADC_CFPR_COUNT                         6u
#define EQADC_RFPR_COUNT                         6u
#define EQADC_FISR_COUNT                         6u
#define EQADC_CF0R_COUNT                         4u
#define EQADC_CF0ER_COUNT                        4u
#define EQADC_CF1R_COUNT                         4u
#define EQADC_CF2R_COUNT                         4u
#define EQADC_CF3R_COUNT                         4u
#define EQADC_CF4R_COUNT                         4u
#define EQADC_CF5R_COUNT                         4u
#define EQADC_RF0R_COUNT                         4u
#define EQADC_RF1R_COUNT                         4u
#define EQADC_RF2R_COUNT                         4u
#define EQADC_RF3R_COUNT                         4u
#define EQADC_RF4R_COUNT                         4u
#define EQADC_RF5R_COUNT                         4u

/** EQADC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< EQADC Module Configuration Register, offset: 0x0 */
  __I  uint32_t TST;                               /**< EQADC Test Register, offset: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t ETDFR;                             /**< EQADC External Trigger Digital Filter Register, offset: 0xC */
  __O  uint32_t CFPR[EQADC_CFPR_COUNT];            /**< EQADC CFIFO Push Register, array offset: 0x10, array step: 0x4 */
       uint8_t RESERVED_1[8];
  __I  uint32_t RFPR[EQADC_RFPR_COUNT];            /**< EQADC Result FIFO Pop Register, array offset: 0x30, array step: 0x4 */
       uint8_t RESERVED_2[8];
  __IO uint32_t CFCR0;                             /**< EQADC CFIFO Control Register 0, offset: 0x50 */
  __IO uint32_t CFCR1;                             /**< EQADC CFIFO Control Register 1, offset: 0x54 */
  __IO uint32_t CFCR2;                             /**< EQADC CFIFO Control Register 2, offset: 0x58 */
       uint8_t RESERVED_3[4];
  __IO uint32_t IDCR0;                             /**< EQADC Interrupt and DMA Control Register 0, offset: 0x60 */
  __IO uint32_t IDCR1;                             /**< EQADC Interrupt and DMA Control Register 1, offset: 0x64 */
  __IO uint32_t IDCR2;                             /**< EQADC Interrupt and DMA Control Register 2, offset: 0x68 */
       uint8_t RESERVED_4[4];
  __IO uint32_t FISR[EQADC_FISR_COUNT];            /**< EQADC FIFO and Interrupt Status Register, array offset: 0x70, array step: 0x4 */
       uint8_t RESERVED_5[8];
  __IO uint32_t CFTCR0;                            /**< EQADC CFIFO Transfer Counter Register 0, offset: 0x90 */
  __IO uint32_t CFTCR1;                            /**< EQADC CFIFO Transfer Counter Register 1, offset: 0x94 */
  __IO uint32_t CFTCR2;                            /**< EQADC CFIFO Transfer Counter Register 2, offset: 0x98 */
       uint8_t RESERVED_6[4];
  __I  uint32_t CFSSR0;                            /**< EQADC CFIFO Status Snapshot Register 0, offset: 0xA0 */
  __I  uint32_t CFSSR1;                            /**< EQADC CFIFO Status Snapshot Register 1, offset: 0xA4 */
       uint8_t RESERVED_7[4];
  __I  uint32_t CFSR;                              /**< EQADC CFIFO Status Register, offset: 0xAC */
       uint8_t RESERVED_8[32];
  __IO uint32_t STACCCR;                           /**< EQADC STAC Bus Client Configuration Register, offset: 0xD0 */
       uint8_t RESERVED_9[44];
  __I  uint32_t CF0R[EQADC_CF0R_COUNT];            /**< EQADC CFIFO0 Register, array offset: 0x100, array step: 0x4 */
  __I  uint32_t CF0ER[EQADC_CF0ER_COUNT];          /**< EQADC CFIFO0 Extension Register, array offset: 0x110, array step: 0x4 */
       uint8_t RESERVED_10[32];
  __I  uint32_t CF1R[EQADC_CF1R_COUNT];            /**< EQADC CFIFO1 Register, array offset: 0x140, array step: 0x4 */
       uint8_t RESERVED_11[48];
  __I  uint32_t CF2R[EQADC_CF2R_COUNT];            /**< EQADC CFIFO2 Register, array offset: 0x180, array step: 0x4 */
       uint8_t RESERVED_12[48];
  __I  uint32_t CF3R[EQADC_CF3R_COUNT];            /**< EQADC CFIFO3 Register, array offset: 0x1C0, array step: 0x4 */
       uint8_t RESERVED_13[48];
  __I  uint32_t CF4R[EQADC_CF4R_COUNT];            /**< EQADC CFIFO4 Register, array offset: 0x200, array step: 0x4 */
       uint8_t RESERVED_14[48];
  __I  uint32_t CF5R[EQADC_CF5R_COUNT];            /**< EQADC CFIFO5 Register, array offset: 0x240, array step: 0x4 */
       uint8_t RESERVED_15[176];
  __I  uint32_t RF0R[EQADC_RF0R_COUNT];            /**< EQADC RFIFO0 Register, array offset: 0x300, array step: 0x4 */
       uint8_t RESERVED_16[48];
  __I  uint32_t RF1R[EQADC_RF1R_COUNT];            /**< EQADC RFIFO1 Register, array offset: 0x340, array step: 0x4 */
       uint8_t RESERVED_17[48];
  __I  uint32_t RF2R[EQADC_RF2R_COUNT];            /**< EQADC RFIFO2 Register, array offset: 0x380, array step: 0x4 */
       uint8_t RESERVED_18[48];
  __I  uint32_t RF3R[EQADC_RF3R_COUNT];            /**< EQADC RFIFO3 Register, array offset: 0x3C0, array step: 0x4 */
       uint8_t RESERVED_19[48];
  __I  uint32_t RF4R[EQADC_RF4R_COUNT];            /**< EQADC RFIFO4 Register, array offset: 0x400, array step: 0x4 */
       uint8_t RESERVED_20[48];
  __I  uint32_t RF5R[EQADC_RF5R_COUNT];            /**< EQADC RFIFO5 Register, array offset: 0x440, array step: 0x4 */
} EQADC_Type, *EQADC_MemMapPtr;

 /** Number of instances of the EQADC module. */
#define EQADC_INSTANCE_COUNT                     (2u)


