neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* EQADC - Peripheral instance base addresses */
/** Peripheral EQADC_0 base address */
#define EQADC_0_BASE                             (0xFFF80000u)
/** Peripheral EQADC_0 base pointer */
#define EQADC_0                                  ((EQADC_Type *)EQADC_0_BASE)
/** Peripheral EQADC_1 base address */
#define EQADC_1_BASE                             (0xC3E54000u)
/** Peripheral EQADC_1 base pointer */
#define EQADC_1                                  ((EQADC_Type *)EQADC_1_BASE)
/** Array initializer of EQADC peripheral base addresses */
#define EQADC_BASE_ADDRS                         { EQADC_0_BASE, EQADC_1_BASE }
/** Array initializer of EQADC peripheral base pointers */
#define EQADC_BASE_PTRS                          { EQADC_0, EQADC_1 }

/* ----------------------------------------------------------------------------
   -- EQADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EQADC_Register_Masks EQADC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define EQADC_MCR_DBG_MASK                       0x3u
#define EQADC_MCR_DBG_SHIFT                      0u
#define EQADC_MCR_DBG_WIDTH                      2u
#define EQADC_MCR_DBG(x)                         (((uint32_t)(((uint32_t)(x))<<EQADC_MCR_DBG_SHIFT))&EQADC_MCR_DBG_MASK)
#define EQADC_MCR_DAM_MASK                       0x20u
#define EQADC_MCR_DAM_SHIFT                      5u
#define EQADC_MCR_DAM_WIDTH                      1u
#define EQADC_MCR_DAM(x)                         (((uint32_t)(((uint32_t)(x))<<EQADC_MCR_DAM_SHIFT))&EQADC_MCR_DAM_MASK)
#define EQADC_MCR_ICEA1_MASK                     0x40u
#define EQADC_MCR_ICEA1_SHIFT                    6u
#define EQADC_MCR_ICEA1_WIDTH                    1u
#define EQADC_MCR_ICEA1(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_MCR_ICEA1_SHIFT))&EQADC_MCR_ICEA1_MASK)
#define EQADC_MCR_ICEA0_MASK                     0x80u
#define EQADC_MCR_ICEA0_SHIFT                    7u
#define EQADC_MCR_ICEA0_WIDTH                    1u
#define EQADC_MCR_ICEA0(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_MCR_ICEA0_SHIFT))&EQADC_MCR_ICEA0_MASK)
/* ETDFR Bit Fields */
#define EQADC_ETDFR_DFL_MASK                     0xFu
#define EQADC_ETDFR_DFL_SHIFT                    0u
#define EQADC_ETDFR_DFL_WIDTH                    4u
#define EQADC_ETDFR_DFL(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_ETDFR_DFL_SHIFT))&EQADC_ETDFR_DFL_MASK)
/* CFPR Bit Fields */
#define EQADC_CFPR_CF_PUSHX_MASK                 0xFFFFFFFFu
#define EQADC_CFPR_CF_PUSHX_SHIFT                0u
#define EQADC_CFPR_CF_PUSHX_WIDTH                32u
#define EQADC_CFPR_CF_PUSHX(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFPR_CF_PUSHX_SHIFT))&EQADC_CFPR_CF_PUSHX_MASK)
/* RFPR Bit Fields */
#define EQADC_RFPR_RF_POPX_MASK                  0xFFFFu
#define EQADC_RFPR_RF_POPX_SHIFT                 0u
#define EQADC_RFPR_RF_POPX_WIDTH                 16u
#define EQADC_RFPR_RF_POPX(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_RFPR_RF_POPX_SHIFT))&EQADC_RFPR_RF_POPX_MASK)
/* CFCR0 Bit Fields */
#define EQADC_CFCR0_MODE1_MASK                   0xF0u
#define EQADC_CFCR0_MODE1_SHIFT                  4u
#define EQADC_CFCR0_MODE1_WIDTH                  4u
#define EQADC_CFCR0_MODE1(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_MODE1_SHIFT))&EQADC_CFCR0_MODE1_MASK)
#define EQADC_CFCR0_CFINV1_MASK                  0x200u
#define EQADC_CFCR0_CFINV1_SHIFT                 9u
#define EQADC_CFCR0_CFINV1_WIDTH                 1u
#define EQADC_CFCR0_CFINV1(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_CFINV1_SHIFT))&EQADC_CFCR0_CFINV1_MASK)
#define EQADC_CFCR0_SSE1_MASK                    0x400u
#define EQADC_CFCR0_SSE1_SHIFT                   10u
#define EQADC_CFCR0_SSE1_WIDTH                   1u
#define EQADC_CFCR0_SSE1(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_SSE1_SHIFT))&EQADC_CFCR0_SSE1_MASK)
#define EQADC_CFCR0_AMODE0_MASK                  0xF0000u
#define EQADC_CFCR0_AMODE0_SHIFT                 16u
#define EQADC_CFCR0_AMODE0_WIDTH                 4u
#define EQADC_CFCR0_AMODE0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_AMODE0_SHIFT))&EQADC_CFCR0_AMODE0_MASK)
#define EQADC_CFCR0_MODE0_MASK                   0xF00000u
#define EQADC_CFCR0_MODE0_SHIFT                  20u
#define EQADC_CFCR0_MODE0_WIDTH                  4u
#define EQADC_CFCR0_MODE0(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_MODE0_SHIFT))&EQADC_CFCR0_MODE0_MASK)
#define EQADC_CFCR0_CFINV0_MASK                  0x2000000u
#define EQADC_CFCR0_CFINV0_SHIFT                 25u
#define EQADC_CFCR0_CFINV0_WIDTH                 1u
#define EQADC_CFCR0_CFINV0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_CFINV0_SHIFT))&EQADC_CFCR0_CFINV0_MASK)
#define EQADC_CFCR0_SSE0_MASK                    0x4000000u
#define EQADC_CFCR0_SSE0_SHIFT                   26u
#define EQADC_CFCR0_SSE0_WIDTH                   1u
#define EQADC_CFCR0_SSE0(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_SSE0_SHIFT))&EQADC_CFCR0_SSE0_MASK)
#define EQADC_CFCR0_STRME0_MASK                  0x8000000u
#define EQADC_CFCR0_STRME0_SHIFT                 27u
#define EQADC_CFCR0_STRME0_WIDTH                 1u
#define EQADC_CFCR0_STRME0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_STRME0_SHIFT))&EQADC_CFCR0_STRME0_MASK)
#define EQADC_CFCR0_CFEEE0_MASK                  0x10000000u
#define EQADC_CFCR0_CFEEE0_SHIFT                 28u
#define EQADC_CFCR0_CFEEE0_WIDTH                 1u
#define EQADC_CFCR0_CFEEE0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR0_CFEEE0_SHIFT))&EQADC_CFCR0_CFEEE0_MASK)
/* CFCR1 Bit Fields */
#define EQADC_CFCR1_MODE3_MASK                   0xF0u
#define EQADC_CFCR1_MODE3_SHIFT                  4u
#define EQADC_CFCR1_MODE3_WIDTH                  4u
#define EQADC_CFCR1_MODE3(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR1_MODE3_SHIFT))&EQADC_CFCR1_MODE3_MASK)
#define EQADC_CFCR1_CFINV3_MASK                  0x200u
#define EQADC_CFCR1_CFINV3_SHIFT                 9u
#define EQADC_CFCR1_CFINV3_WIDTH                 1u
#define EQADC_CFCR1_CFINV3(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR1_CFINV3_SHIFT))&EQADC_CFCR1_CFINV3_MASK)
#define EQADC_CFCR1_SSE3_MASK                    0x400u
#define EQADC_CFCR1_SSE3_SHIFT                   10u
#define EQADC_CFCR1_SSE3_WIDTH                   1u
#define EQADC_CFCR1_SSE3(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR1_SSE3_SHIFT))&EQADC_CFCR1_SSE3_MASK)
#define EQADC_CFCR1_MODE2_MASK                   0xF00000u
#define EQADC_CFCR1_MODE2_SHIFT                  20u
#define EQADC_CFCR1_MODE2_WIDTH                  4u
#define EQADC_CFCR1_MODE2(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR1_MODE2_SHIFT))&EQADC_CFCR1_MODE2_MASK)
#define EQADC_CFCR1_CFINV2_MASK                  0x2000000u
#define EQADC_CFCR1_CFINV2_SHIFT                 25u
#define EQADC_CFCR1_CFINV2_WIDTH                 1u
#define EQADC_CFCR1_CFINV2(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR1_CFINV2_SHIFT))&EQADC_CFCR1_CFINV2_MASK)
#define EQADC_CFCR1_SSE2_MASK                    0x4000000u
#define EQADC_CFCR1_SSE2_SHIFT                   26u
#define EQADC_CFCR1_SSE2_WIDTH                   1u
#define EQADC_CFCR1_SSE2(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR1_SSE2_SHIFT))&EQADC_CFCR1_SSE2_MASK)
/* CFCR2 Bit Fields */
#define EQADC_CFCR2_MODE5_MASK                   0xF0u
#define EQADC_CFCR2_MODE5_SHIFT                  4u
#define EQADC_CFCR2_MODE5_WIDTH                  4u
#define EQADC_CFCR2_MODE5(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR2_MODE5_SHIFT))&EQADC_CFCR2_MODE5_MASK)
#define EQADC_CFCR2_CFINV5_MASK                  0x200u
#define EQADC_CFCR2_CFINV5_SHIFT                 9u
#define EQADC_CFCR2_CFINV5_WIDTH                 1u
#define EQADC_CFCR2_CFINV5(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR2_CFINV5_SHIFT))&EQADC_CFCR2_CFINV5_MASK)
#define EQADC_CFCR2_SSE5_MASK                    0x400u
#define EQADC_CFCR2_SSE5_SHIFT                   10u
#define EQADC_CFCR2_SSE5_WIDTH                   1u
#define EQADC_CFCR2_SSE5(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR2_SSE5_SHIFT))&EQADC_CFCR2_SSE5_MASK)
#define EQADC_CFCR2_MODE4_MASK                   0xF00000u
#define EQADC_CFCR2_MODE4_SHIFT                  20u
#define EQADC_CFCR2_MODE4_WIDTH                  4u
#define EQADC_CFCR2_MODE4(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR2_MODE4_SHIFT))&EQADC_CFCR2_MODE4_MASK)
#define EQADC_CFCR2_CFINV4_MASK                  0x2000000u
#define EQADC_CFCR2_CFINV4_SHIFT                 25u
#define EQADC_CFCR2_CFINV4_WIDTH                 1u
#define EQADC_CFCR2_CFINV4(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR2_CFINV4_SHIFT))&EQADC_CFCR2_CFINV4_MASK)
#define EQADC_CFCR2_SSE4_MASK                    0x4000000u
#define EQADC_CFCR2_SSE4_SHIFT                   26u
#define EQADC_CFCR2_SSE4_WIDTH                   1u
#define EQADC_CFCR2_SSE4(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_CFCR2_SSE4_SHIFT))&EQADC_CFCR2_SSE4_MASK)
/* IDCR0 Bit Fields */
#define EQADC_IDCR0_RFDS1_MASK                   0x1u
#define EQADC_IDCR0_RFDS1_SHIFT                  0u
#define EQADC_IDCR0_RFDS1_WIDTH                  1u
#define EQADC_IDCR0_RFDS1(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_RFDS1_SHIFT))&EQADC_IDCR0_RFDS1_MASK)
#define EQADC_IDCR0_RFDE1_MASK                   0x2u
#define EQADC_IDCR0_RFDE1_SHIFT                  1u
#define EQADC_IDCR0_RFDE1_WIDTH                  1u
#define EQADC_IDCR0_RFDE1(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_RFDE1_SHIFT))&EQADC_IDCR0_RFDE1_MASK)
#define EQADC_IDCR0_RFOIE1_MASK                  0x8u
#define EQADC_IDCR0_RFOIE1_SHIFT                 3u
#define EQADC_IDCR0_RFOIE1_WIDTH                 1u
#define EQADC_IDCR0_RFOIE1(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_RFOIE1_SHIFT))&EQADC_IDCR0_RFOIE1_MASK)
#define EQADC_IDCR0_CFFS1_MASK                   0x100u
#define EQADC_IDCR0_CFFS1_SHIFT                  8u
#define EQADC_IDCR0_CFFS1_WIDTH                  1u
#define EQADC_IDCR0_CFFS1(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_CFFS1_SHIFT))&EQADC_IDCR0_CFFS1_MASK)
#define EQADC_IDCR0_CFFE1_MASK                   0x200u
#define EQADC_IDCR0_CFFE1_SHIFT                  9u
#define EQADC_IDCR0_CFFE1_WIDTH                  1u
#define EQADC_IDCR0_CFFE1(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_CFFE1_SHIFT))&EQADC_IDCR0_CFFE1_MASK)
#define EQADC_IDCR0_CFUIE1_MASK                  0x800u
#define EQADC_IDCR0_CFUIE1_SHIFT                 11u
#define EQADC_IDCR0_CFUIE1_WIDTH                 1u
#define EQADC_IDCR0_CFUIE1(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_CFUIE1_SHIFT))&EQADC_IDCR0_CFUIE1_MASK)
#define EQADC_IDCR0_EOQIE1_MASK                  0x1000u
#define EQADC_IDCR0_EOQIE1_SHIFT                 12u
#define EQADC_IDCR0_EOQIE1_WIDTH                 1u
#define EQADC_IDCR0_EOQIE1(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_EOQIE1_SHIFT))&EQADC_IDCR0_EOQIE1_MASK)
#define EQADC_IDCR0_PIE1_MASK                    0x2000u
#define EQADC_IDCR0_PIE1_SHIFT                   13u
#define EQADC_IDCR0_PIE1_WIDTH                   1u
#define EQADC_IDCR0_PIE1(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_PIE1_SHIFT))&EQADC_IDCR0_PIE1_MASK)
#define EQADC_IDCR0_TORIE1_MASK                  0x4000u
#define EQADC_IDCR0_TORIE1_SHIFT                 14u
#define EQADC_IDCR0_TORIE1_WIDTH                 1u
#define EQADC_IDCR0_TORIE1(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_TORIE1_SHIFT))&EQADC_IDCR0_TORIE1_MASK)
#define EQADC_IDCR0_NCIE1_MASK                   0x8000u
#define EQADC_IDCR0_NCIE1_SHIFT                  15u
#define EQADC_IDCR0_NCIE1_WIDTH                  1u
#define EQADC_IDCR0_NCIE1(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_NCIE1_SHIFT))&EQADC_IDCR0_NCIE1_MASK)
#define EQADC_IDCR0_RFDS0_MASK                   0x10000u
#define EQADC_IDCR0_RFDS0_SHIFT                  16u
#define EQADC_IDCR0_RFDS0_WIDTH                  1u
#define EQADC_IDCR0_RFDS0(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_RFDS0_SHIFT))&EQADC_IDCR0_RFDS0_MASK)
#define EQADC_IDCR0_RFDE0_MASK                   0x20000u
#define EQADC_IDCR0_RFDE0_SHIFT                  17u
#define EQADC_IDCR0_RFDE0_WIDTH                  1u
#define EQADC_IDCR0_RFDE0(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_RFDE0_SHIFT))&EQADC_IDCR0_RFDE0_MASK)
#define EQADC_IDCR0_RFOIE0_MASK                  0x80000u
#define EQADC_IDCR0_RFOIE0_SHIFT                 19u
#define EQADC_IDCR0_RFOIE0_WIDTH                 1u
#define EQADC_IDCR0_RFOIE0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_RFOIE0_SHIFT))&EQADC_IDCR0_RFOIE0_MASK)
#define EQADC_IDCR0_CFFS0_MASK                   0x1000000u
#define EQADC_IDCR0_CFFS0_SHIFT                  24u
#define EQADC_IDCR0_CFFS0_WIDTH                  1u
#define EQADC_IDCR0_CFFS0(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_CFFS0_SHIFT))&EQADC_IDCR0_CFFS0_MASK)
#define EQADC_IDCR0_CFFE0_MASK                   0x2000000u
#define EQADC_IDCR0_CFFE0_SHIFT                  25u
#define EQADC_IDCR0_CFFE0_WIDTH                  1u
#define EQADC_IDCR0_CFFE0(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_CFFE0_SHIFT))&EQADC_IDCR0_CFFE0_MASK)
#define EQADC_IDCR0_CFUIE0_MASK                  0x8000000u
#define EQADC_IDCR0_CFUIE0_SHIFT                 27u
#define EQADC_IDCR0_CFUIE0_WIDTH                 1u
#define EQADC_IDCR0_CFUIE0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_CFUIE0_SHIFT))&EQADC_IDCR0_CFUIE0_MASK)
#define EQADC_IDCR0_EOQIE0_MASK                  0x10000000u
#define EQADC_IDCR0_EOQIE0_SHIFT                 28u
#define EQADC_IDCR0_EOQIE0_WIDTH                 1u
#define EQADC_IDCR0_EOQIE0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_EOQIE0_SHIFT))&EQADC_IDCR0_EOQIE0_MASK)
#define EQADC_IDCR0_PIE0_MASK                    0x20000000u
#define EQADC_IDCR0_PIE0_SHIFT                   29u
#define EQADC_IDCR0_PIE0_WIDTH                   1u
#define EQADC_IDCR0_PIE0(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_PIE0_SHIFT))&EQADC_IDCR0_PIE0_MASK)
#define EQADC_IDCR0_TORIE0_MASK                  0x40000000u
#define EQADC_IDCR0_TORIE0_SHIFT                 30u
#define EQADC_IDCR0_TORIE0_WIDTH                 1u
#define EQADC_IDCR0_TORIE0(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_TORIE0_SHIFT))&EQADC_IDCR0_TORIE0_MASK)
#define EQADC_IDCR0_NCIE0_MASK                   0x80000000u
#define EQADC_IDCR0_NCIE0_SHIFT                  31u
#define EQADC_IDCR0_NCIE0_WIDTH                  1u
#define EQADC_IDCR0_NCIE0(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR0_NCIE0_SHIFT))&EQADC_IDCR0_NCIE0_MASK)
/* IDCR1 Bit Fields */
#define EQADC_IDCR1_RFDS3_MASK                   0x1u
#define EQADC_IDCR1_RFDS3_SHIFT                  0u
#define EQADC_IDCR1_RFDS3_WIDTH                  1u
#define EQADC_IDCR1_RFDS3(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_RFDS3_SHIFT))&EQADC_IDCR1_RFDS3_MASK)
#define EQADC_IDCR1_RFDE3_MASK                   0x2u
#define EQADC_IDCR1_RFDE3_SHIFT                  1u
#define EQADC_IDCR1_RFDE3_WIDTH                  1u
#define EQADC_IDCR1_RFDE3(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_RFDE3_SHIFT))&EQADC_IDCR1_RFDE3_MASK)
#define EQADC_IDCR1_RFOIE3_MASK                  0x8u
#define EQADC_IDCR1_RFOIE3_SHIFT                 3u
#define EQADC_IDCR1_RFOIE3_WIDTH                 1u
#define EQADC_IDCR1_RFOIE3(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_RFOIE3_SHIFT))&EQADC_IDCR1_RFOIE3_MASK)
#define EQADC_IDCR1_CFFS3_MASK                   0x100u
#define EQADC_IDCR1_CFFS3_SHIFT                  8u
#define EQADC_IDCR1_CFFS3_WIDTH                  1u
#define EQADC_IDCR1_CFFS3(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_CFFS3_SHIFT))&EQADC_IDCR1_CFFS3_MASK)
#define EQADC_IDCR1_CFFE3_MASK                   0x200u
#define EQADC_IDCR1_CFFE3_SHIFT                  9u
#define EQADC_IDCR1_CFFE3_WIDTH                  1u
#define EQADC_IDCR1_CFFE3(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_CFFE3_SHIFT))&EQADC_IDCR1_CFFE3_MASK)
#define EQADC_IDCR1_CFUIE3_MASK                  0x800u
#define EQADC_IDCR1_CFUIE3_SHIFT                 11u
#define EQADC_IDCR1_CFUIE3_WIDTH                 1u
#define EQADC_IDCR1_CFUIE3(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_CFUIE3_SHIFT))&EQADC_IDCR1_CFUIE3_MASK)
#define EQADC_IDCR1_EOQIE3_MASK                  0x1000u
#define EQADC_IDCR1_EOQIE3_SHIFT                 12u
#define EQADC_IDCR1_EOQIE3_WIDTH                 1u
#define EQADC_IDCR1_EOQIE3(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_EOQIE3_SHIFT))&EQADC_IDCR1_EOQIE3_MASK)
#define EQADC_IDCR1_PIE3_MASK                    0x2000u
#define EQADC_IDCR1_PIE3_SHIFT                   13u
#define EQADC_IDCR1_PIE3_WIDTH                   1u
#define EQADC_IDCR1_PIE3(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_PIE3_SHIFT))&EQADC_IDCR1_PIE3_MASK)
#define EQADC_IDCR1_TORIE3_MASK                  0x4000u
#define EQADC_IDCR1_TORIE3_SHIFT                 14u
#define EQADC_IDCR1_TORIE3_WIDTH                 1u
#define EQADC_IDCR1_TORIE3(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_TORIE3_SHIFT))&EQADC_IDCR1_TORIE3_MASK)
#define EQADC_IDCR1_NCIE3_MASK                   0x8000u
#define EQADC_IDCR1_NCIE3_SHIFT                  15u
#define EQADC_IDCR1_NCIE3_WIDTH                  1u
#define EQADC_IDCR1_NCIE3(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_NCIE3_SHIFT))&EQADC_IDCR1_NCIE3_MASK)
#define EQADC_IDCR1_RFDS2_MASK                   0x10000u
#define EQADC_IDCR1_RFDS2_SHIFT                  16u
#define EQADC_IDCR1_RFDS2_WIDTH                  1u
#define EQADC_IDCR1_RFDS2(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_RFDS2_SHIFT))&EQADC_IDCR1_RFDS2_MASK)
#define EQADC_IDCR1_RFDE2_MASK                   0x20000u
#define EQADC_IDCR1_RFDE2_SHIFT                  17u
#define EQADC_IDCR1_RFDE2_WIDTH                  1u
#define EQADC_IDCR1_RFDE2(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_RFDE2_SHIFT))&EQADC_IDCR1_RFDE2_MASK)
#define EQADC_IDCR1_RFOIE2_MASK                  0x80000u
#define EQADC_IDCR1_RFOIE2_SHIFT                 19u
#define EQADC_IDCR1_RFOIE2_WIDTH                 1u
#define EQADC_IDCR1_RFOIE2(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_RFOIE2_SHIFT))&EQADC_IDCR1_RFOIE2_MASK)
#define EQADC_IDCR1_CFFS2_MASK                   0x1000000u
#define EQADC_IDCR1_CFFS2_SHIFT                  24u
#define EQADC_IDCR1_CFFS2_WIDTH                  1u
#define EQADC_IDCR1_CFFS2(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_CFFS2_SHIFT))&EQADC_IDCR1_CFFS2_MASK)
#define EQADC_IDCR1_CFFE2_MASK                   0x2000000u
#define EQADC_IDCR1_CFFE2_SHIFT                  25u
#define EQADC_IDCR1_CFFE2_WIDTH                  1u
#define EQADC_IDCR1_CFFE2(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_CFFE2_SHIFT))&EQADC_IDCR1_CFFE2_MASK)
#define EQADC_IDCR1_CFUIE2_MASK                  0x8000000u
#define EQADC_IDCR1_CFUIE2_SHIFT                 27u
#define EQADC_IDCR1_CFUIE2_WIDTH                 1u
#define EQADC_IDCR1_CFUIE2(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_CFUIE2_SHIFT))&EQADC_IDCR1_CFUIE2_MASK)
#define EQADC_IDCR1_EOQIE2_MASK                  0x10000000u
#define EQADC_IDCR1_EOQIE2_SHIFT                 28u
#define EQADC_IDCR1_EOQIE2_WIDTH                 1u
#define EQADC_IDCR1_EOQIE2(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_EOQIE2_SHIFT))&EQADC_IDCR1_EOQIE2_MASK)
#define EQADC_IDCR1_PIE2_MASK                    0x20000000u
#define EQADC_IDCR1_PIE2_SHIFT                   29u
#define EQADC_IDCR1_PIE2_WIDTH                   1u
#define EQADC_IDCR1_PIE2(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_PIE2_SHIFT))&EQADC_IDCR1_PIE2_MASK)
#define EQADC_IDCR1_TORIE2_MASK                  0x40000000u
#define EQADC_IDCR1_TORIE2_SHIFT                 30u
#define EQADC_IDCR1_TORIE2_WIDTH                 1u
#define EQADC_IDCR1_TORIE2(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_TORIE2_SHIFT))&EQADC_IDCR1_TORIE2_MASK)
#define EQADC_IDCR1_NCIE2_MASK                   0x80000000u
#define EQADC_IDCR1_NCIE2_SHIFT                  31u
#define EQADC_IDCR1_NCIE2_WIDTH                  1u
#define EQADC_IDCR1_NCIE2(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR1_NCIE2_SHIFT))&EQADC_IDCR1_NCIE2_MASK)
/* IDCR2 Bit Fields */
#define EQADC_IDCR2_RFDS5_MASK                   0x1u
#define EQADC_IDCR2_RFDS5_SHIFT                  0u
#define EQADC_IDCR2_RFDS5_WIDTH                  1u
#define EQADC_IDCR2_RFDS5(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_RFDS5_SHIFT))&EQADC_IDCR2_RFDS5_MASK)
#define EQADC_IDCR2_RFDE5_MASK                   0x2u
#define EQADC_IDCR2_RFDE5_SHIFT                  1u
#define EQADC_IDCR2_RFDE5_WIDTH                  1u
#define EQADC_IDCR2_RFDE5(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_RFDE5_SHIFT))&EQADC_IDCR2_RFDE5_MASK)
#define EQADC_IDCR2_RFOIE5_MASK                  0x8u
#define EQADC_IDCR2_RFOIE5_SHIFT                 3u
#define EQADC_IDCR2_RFOIE5_WIDTH                 1u
#define EQADC_IDCR2_RFOIE5(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_RFOIE5_SHIFT))&EQADC_IDCR2_RFOIE5_MASK)
#define EQADC_IDCR2_CFFS5_MASK                   0x100u
#define EQADC_IDCR2_CFFS5_SHIFT                  8u
#define EQADC_IDCR2_CFFS5_WIDTH                  1u
#define EQADC_IDCR2_CFFS5(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_CFFS5_SHIFT))&EQADC_IDCR2_CFFS5_MASK)
#define EQADC_IDCR2_CFFE5_MASK                   0x200u
#define EQADC_IDCR2_CFFE5_SHIFT                  9u
#define EQADC_IDCR2_CFFE5_WIDTH                  1u
#define EQADC_IDCR2_CFFE5(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_CFFE5_SHIFT))&EQADC_IDCR2_CFFE5_MASK)
#define EQADC_IDCR2_CFUIE5_MASK                  0x800u
#define EQADC_IDCR2_CFUIE5_SHIFT                 11u
#define EQADC_IDCR2_CFUIE5_WIDTH                 1u
#define EQADC_IDCR2_CFUIE5(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_CFUIE5_SHIFT))&EQADC_IDCR2_CFUIE5_MASK)
#define EQADC_IDCR2_EOQIE5_MASK                  0x1000u
#define EQADC_IDCR2_EOQIE5_SHIFT                 12u
#define EQADC_IDCR2_EOQIE5_WIDTH                 1u
#define EQADC_IDCR2_EOQIE5(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_EOQIE5_SHIFT))&EQADC_IDCR2_EOQIE5_MASK)
#define EQADC_IDCR2_PIE5_MASK                    0x2000u
#define EQADC_IDCR2_PIE5_SHIFT                   13u
#define EQADC_IDCR2_PIE5_WIDTH                   1u
#define EQADC_IDCR2_PIE5(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_PIE5_SHIFT))&EQADC_IDCR2_PIE5_MASK)
#define EQADC_IDCR2_TORIE5_MASK                  0x4000u
#define EQADC_IDCR2_TORIE5_SHIFT                 14u
#define EQADC_IDCR2_TORIE5_WIDTH                 1u
#define EQADC_IDCR2_TORIE5(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_TORIE5_SHIFT))&EQADC_IDCR2_TORIE5_MASK)
#define EQADC_IDCR2_NCIE5_MASK                   0x8000u
#define EQADC_IDCR2_NCIE5_SHIFT                  15u
#define EQADC_IDCR2_NCIE5_WIDTH                  1u
#define EQADC_IDCR2_NCIE5(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_NCIE5_SHIFT))&EQADC_IDCR2_NCIE5_MASK)
