neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define EQADC_IDCR2_RFDS4_MASK                   0x10000u
#define EQADC_IDCR2_RFDS4_SHIFT                  16u
#define EQADC_IDCR2_RFDS4_WIDTH                  1u
#define EQADC_IDCR2_RFDS4(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_RFDS4_SHIFT))&EQADC_IDCR2_RFDS4_MASK)
#define EQADC_IDCR2_RFDE4_MASK                   0x20000u
#define EQADC_IDCR2_RFDE4_SHIFT                  17u
#define EQADC_IDCR2_RFDE4_WIDTH                  1u
#define EQADC_IDCR2_RFDE4(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_RFDE4_SHIFT))&EQADC_IDCR2_RFDE4_MASK)
#define EQADC_IDCR2_RFOIE4_MASK                  0x80000u
#define EQADC_IDCR2_RFOIE4_SHIFT                 19u
#define EQADC_IDCR2_RFOIE4_WIDTH                 1u
#define EQADC_IDCR2_RFOIE4(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_RFOIE4_SHIFT))&EQADC_IDCR2_RFOIE4_MASK)
#define EQADC_IDCR2_CFFS4_MASK                   0x1000000u
#define EQADC_IDCR2_CFFS4_SHIFT                  24u
#define EQADC_IDCR2_CFFS4_WIDTH                  1u
#define EQADC_IDCR2_CFFS4(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_CFFS4_SHIFT))&EQADC_IDCR2_CFFS4_MASK)
#define EQADC_IDCR2_CFFE4_MASK                   0x2000000u
#define EQADC_IDCR2_CFFE4_SHIFT                  25u
#define EQADC_IDCR2_CFFE4_WIDTH                  1u
#define EQADC_IDCR2_CFFE4(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_CFFE4_SHIFT))&EQADC_IDCR2_CFFE4_MASK)
#define EQADC_IDCR2_CFUIE4_MASK                  0x8000000u
#define EQADC_IDCR2_CFUIE4_SHIFT                 27u
#define EQADC_IDCR2_CFUIE4_WIDTH                 1u
#define EQADC_IDCR2_CFUIE4(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_CFUIE4_SHIFT))&EQADC_IDCR2_CFUIE4_MASK)
#define EQADC_IDCR2_EOQIE4_MASK                  0x10000000u
#define EQADC_IDCR2_EOQIE4_SHIFT                 28u
#define EQADC_IDCR2_EOQIE4_WIDTH                 1u
#define EQADC_IDCR2_EOQIE4(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_EOQIE4_SHIFT))&EQADC_IDCR2_EOQIE4_MASK)
#define EQADC_IDCR2_PIE4_MASK                    0x20000000u
#define EQADC_IDCR2_PIE4_SHIFT                   29u
#define EQADC_IDCR2_PIE4_WIDTH                   1u
#define EQADC_IDCR2_PIE4(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_PIE4_SHIFT))&EQADC_IDCR2_PIE4_MASK)
#define EQADC_IDCR2_TORIE4_MASK                  0x40000000u
#define EQADC_IDCR2_TORIE4_SHIFT                 30u
#define EQADC_IDCR2_TORIE4_WIDTH                 1u
#define EQADC_IDCR2_TORIE4(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_TORIE4_SHIFT))&EQADC_IDCR2_TORIE4_MASK)
#define EQADC_IDCR2_NCIE4_MASK                   0x80000000u
#define EQADC_IDCR2_NCIE4_SHIFT                  31u
#define EQADC_IDCR2_NCIE4_WIDTH                  1u
#define EQADC_IDCR2_NCIE4(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_IDCR2_NCIE4_SHIFT))&EQADC_IDCR2_NCIE4_MASK)
/* FISR Bit Fields */
#define EQADC_FISR_POPNXTPTRX_MASK               0xFu
#define EQADC_FISR_POPNXTPTRX_SHIFT              0u
#define EQADC_FISR_POPNXTPTRX_WIDTH              4u
#define EQADC_FISR_POPNXTPTRX(x)                 (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_POPNXTPTRX_SHIFT))&EQADC_FISR_POPNXTPTRX_MASK)
#define EQADC_FISR_RFCTRX_MASK                   0xF0u
#define EQADC_FISR_RFCTRX_SHIFT                  4u
#define EQADC_FISR_RFCTRX_WIDTH                  4u
#define EQADC_FISR_RFCTRX(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_RFCTRX_SHIFT))&EQADC_FISR_RFCTRX_MASK)
#define EQADC_FISR_TNXTPTRX_MASK                 0xF00u
#define EQADC_FISR_TNXTPTRX_SHIFT                8u
#define EQADC_FISR_TNXTPTRX_WIDTH                4u
#define EQADC_FISR_TNXTPTRX(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_TNXTPTRX_SHIFT))&EQADC_FISR_TNXTPTRX_MASK)
#define EQADC_FISR_CFCTRX_MASK                   0xF000u
#define EQADC_FISR_CFCTRX_SHIFT                  12u
#define EQADC_FISR_CFCTRX_WIDTH                  4u
#define EQADC_FISR_CFCTRX(x)                     (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_CFCTRX_SHIFT))&EQADC_FISR_CFCTRX_MASK)
#define EQADC_FISR_RFDFX_MASK                    0x20000u
#define EQADC_FISR_RFDFX_SHIFT                   17u
#define EQADC_FISR_RFDFX_WIDTH                   1u
#define EQADC_FISR_RFDFX(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_RFDFX_SHIFT))&EQADC_FISR_RFDFX_MASK)
#define EQADC_FISR_RFOFX_MASK                    0x80000u
#define EQADC_FISR_RFOFX_SHIFT                   19u
#define EQADC_FISR_RFOFX_WIDTH                   1u
#define EQADC_FISR_RFOFX(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_RFOFX_SHIFT))&EQADC_FISR_RFOFX_MASK)
#define EQADC_FISR_CFFFX_MASK                    0x2000000u
#define EQADC_FISR_CFFFX_SHIFT                   25u
#define EQADC_FISR_CFFFX_WIDTH                   1u
#define EQADC_FISR_CFFFX(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_CFFFX_SHIFT))&EQADC_FISR_CFFFX_MASK)
#define EQADC_FISR_SSSX_MASK                     0x4000000u
#define EQADC_FISR_SSSX_SHIFT                    26u
#define EQADC_FISR_SSSX_WIDTH                    1u
#define EQADC_FISR_SSSX(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_SSSX_SHIFT))&EQADC_FISR_SSSX_MASK)
#define EQADC_FISR_CFUFX_MASK                    0x8000000u
#define EQADC_FISR_CFUFX_SHIFT                   27u
#define EQADC_FISR_CFUFX_WIDTH                   1u
#define EQADC_FISR_CFUFX(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_CFUFX_SHIFT))&EQADC_FISR_CFUFX_MASK)
#define EQADC_FISR_EOQFX_MASK                    0x10000000u
#define EQADC_FISR_EOQFX_SHIFT                   28u
#define EQADC_FISR_EOQFX_WIDTH                   1u
#define EQADC_FISR_EOQFX(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_EOQFX_SHIFT))&EQADC_FISR_EOQFX_MASK)
#define EQADC_FISR_PFX_MASK                      0x20000000u
#define EQADC_FISR_PFX_SHIFT                     29u
#define EQADC_FISR_PFX_WIDTH                     1u
#define EQADC_FISR_PFX(x)                        (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_PFX_SHIFT))&EQADC_FISR_PFX_MASK)
#define EQADC_FISR_TORFX_MASK                    0x40000000u
#define EQADC_FISR_TORFX_SHIFT                   30u
#define EQADC_FISR_TORFX_WIDTH                   1u
#define EQADC_FISR_TORFX(x)                      (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_TORFX_SHIFT))&EQADC_FISR_TORFX_MASK)
#define EQADC_FISR_NCFX_MASK                     0x80000000u
#define EQADC_FISR_NCFX_SHIFT                    31u
#define EQADC_FISR_NCFX_WIDTH                    1u
#define EQADC_FISR_NCFX(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_FISR_NCFX_SHIFT))&EQADC_FISR_NCFX_MASK)
/* CFTCR0 Bit Fields */
#define EQADC_CFTCR0_TC_CF1_MASK                 0x7FFu
#define EQADC_CFTCR0_TC_CF1_SHIFT                0u
#define EQADC_CFTCR0_TC_CF1_WIDTH                11u
#define EQADC_CFTCR0_TC_CF1(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFTCR0_TC_CF1_SHIFT))&EQADC_CFTCR0_TC_CF1_MASK)
#define EQADC_CFTCR0_TC_CF0_MASK                 0x7FF0000u
#define EQADC_CFTCR0_TC_CF0_SHIFT                16u
#define EQADC_CFTCR0_TC_CF0_WIDTH                11u
#define EQADC_CFTCR0_TC_CF0(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFTCR0_TC_CF0_SHIFT))&EQADC_CFTCR0_TC_CF0_MASK)
/* CFTCR1 Bit Fields */
#define EQADC_CFTCR1_TC_CF3_MASK                 0x7FFu
#define EQADC_CFTCR1_TC_CF3_SHIFT                0u
#define EQADC_CFTCR1_TC_CF3_WIDTH                11u
#define EQADC_CFTCR1_TC_CF3(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFTCR1_TC_CF3_SHIFT))&EQADC_CFTCR1_TC_CF3_MASK)
#define EQADC_CFTCR1_TC_CF2_MASK                 0x7FF0000u
#define EQADC_CFTCR1_TC_CF2_SHIFT                16u
#define EQADC_CFTCR1_TC_CF2_WIDTH                11u
#define EQADC_CFTCR1_TC_CF2(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFTCR1_TC_CF2_SHIFT))&EQADC_CFTCR1_TC_CF2_MASK)
/* CFTCR2 Bit Fields */
#define EQADC_CFTCR2_TC_CF5_MASK                 0x7FFu
#define EQADC_CFTCR2_TC_CF5_SHIFT                0u
#define EQADC_CFTCR2_TC_CF5_WIDTH                11u
#define EQADC_CFTCR2_TC_CF5(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFTCR2_TC_CF5_SHIFT))&EQADC_CFTCR2_TC_CF5_MASK)
#define EQADC_CFTCR2_TC_CF4_MASK                 0x7FF0000u
#define EQADC_CFTCR2_TC_CF4_SHIFT                16u
#define EQADC_CFTCR2_TC_CF4_WIDTH                11u
#define EQADC_CFTCR2_TC_CF4(x)                   (((uint32_t)(((uint32_t)(x))<<EQADC_CFTCR2_TC_CF4_SHIFT))&EQADC_CFTCR2_TC_CF4_MASK)
/* CFSSR0 Bit Fields */
#define EQADC_CFSSR0_TC_LCFTCB0_MASK             0x7FFu
#define EQADC_CFSSR0_TC_LCFTCB0_SHIFT            0u
#define EQADC_CFSSR0_TC_LCFTCB0_WIDTH            11u
#define EQADC_CFSSR0_TC_LCFTCB0(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_TC_LCFTCB0_SHIFT))&EQADC_CFSSR0_TC_LCFTCB0_MASK)
#define EQADC_CFSSR0_LCFTCB0_MASK                0x7800u
#define EQADC_CFSSR0_LCFTCB0_SHIFT               11u
#define EQADC_CFSSR0_LCFTCB0_WIDTH               4u
#define EQADC_CFSSR0_LCFTCB0(x)                  (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_LCFTCB0_SHIFT))&EQADC_CFSSR0_LCFTCB0_MASK)
#define EQADC_CFSSR0_CFS5_TCB0_MASK              0x300000u
#define EQADC_CFSSR0_CFS5_TCB0_SHIFT             20u
#define EQADC_CFSSR0_CFS5_TCB0_WIDTH             2u
#define EQADC_CFSSR0_CFS5_TCB0(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_CFS5_TCB0_SHIFT))&EQADC_CFSSR0_CFS5_TCB0_MASK)
#define EQADC_CFSSR0_CFS4_TCB0_MASK              0xC00000u
#define EQADC_CFSSR0_CFS4_TCB0_SHIFT             22u
#define EQADC_CFSSR0_CFS4_TCB0_WIDTH             2u
#define EQADC_CFSSR0_CFS4_TCB0(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_CFS4_TCB0_SHIFT))&EQADC_CFSSR0_CFS4_TCB0_MASK)
#define EQADC_CFSSR0_CFS3_TCB0_MASK              0x3000000u
#define EQADC_CFSSR0_CFS3_TCB0_SHIFT             24u
#define EQADC_CFSSR0_CFS3_TCB0_WIDTH             2u
#define EQADC_CFSSR0_CFS3_TCB0(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_CFS3_TCB0_SHIFT))&EQADC_CFSSR0_CFS3_TCB0_MASK)
#define EQADC_CFSSR0_CFS2_TCB0_MASK              0xC000000u
#define EQADC_CFSSR0_CFS2_TCB0_SHIFT             26u
#define EQADC_CFSSR0_CFS2_TCB0_WIDTH             2u
#define EQADC_CFSSR0_CFS2_TCB0(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_CFS2_TCB0_SHIFT))&EQADC_CFSSR0_CFS2_TCB0_MASK)
#define EQADC_CFSSR0_CFS1_TCB0_MASK              0x30000000u
#define EQADC_CFSSR0_CFS1_TCB0_SHIFT             28u
#define EQADC_CFSSR0_CFS1_TCB0_WIDTH             2u
#define EQADC_CFSSR0_CFS1_TCB0(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_CFS1_TCB0_SHIFT))&EQADC_CFSSR0_CFS1_TCB0_MASK)
#define EQADC_CFSSR0_CFS0_TCB0_MASK              0xC0000000u
#define EQADC_CFSSR0_CFS0_TCB0_SHIFT             30u
#define EQADC_CFSSR0_CFS0_TCB0_WIDTH             2u
#define EQADC_CFSSR0_CFS0_TCB0(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR0_CFS0_TCB0_SHIFT))&EQADC_CFSSR0_CFS0_TCB0_MASK)
/* CFSSR1 Bit Fields */
#define EQADC_CFSSR1_TC_LCFTCB1_MASK             0x7FFu
#define EQADC_CFSSR1_TC_LCFTCB1_SHIFT            0u
#define EQADC_CFSSR1_TC_LCFTCB1_WIDTH            11u
#define EQADC_CFSSR1_TC_LCFTCB1(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_TC_LCFTCB1_SHIFT))&EQADC_CFSSR1_TC_LCFTCB1_MASK)
#define EQADC_CFSSR1_LCFTCB1_MASK                0x7800u
#define EQADC_CFSSR1_LCFTCB1_SHIFT               11u
#define EQADC_CFSSR1_LCFTCB1_WIDTH               4u
#define EQADC_CFSSR1_LCFTCB1(x)                  (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_LCFTCB1_SHIFT))&EQADC_CFSSR1_LCFTCB1_MASK)
#define EQADC_CFSSR1_CFS5_TCB1_MASK              0x300000u
#define EQADC_CFSSR1_CFS5_TCB1_SHIFT             20u
#define EQADC_CFSSR1_CFS5_TCB1_WIDTH             2u
#define EQADC_CFSSR1_CFS5_TCB1(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_CFS5_TCB1_SHIFT))&EQADC_CFSSR1_CFS5_TCB1_MASK)
#define EQADC_CFSSR1_CFS4_TCB1_MASK              0xC00000u
#define EQADC_CFSSR1_CFS4_TCB1_SHIFT             22u
#define EQADC_CFSSR1_CFS4_TCB1_WIDTH             2u
#define EQADC_CFSSR1_CFS4_TCB1(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_CFS4_TCB1_SHIFT))&EQADC_CFSSR1_CFS4_TCB1_MASK)
#define EQADC_CFSSR1_CFS3_TCB1_MASK              0x3000000u
#define EQADC_CFSSR1_CFS3_TCB1_SHIFT             24u
#define EQADC_CFSSR1_CFS3_TCB1_WIDTH             2u
#define EQADC_CFSSR1_CFS3_TCB1(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_CFS3_TCB1_SHIFT))&EQADC_CFSSR1_CFS3_TCB1_MASK)
#define EQADC_CFSSR1_CFS2_TCB1_MASK              0xC000000u
#define EQADC_CFSSR1_CFS2_TCB1_SHIFT             26u
#define EQADC_CFSSR1_CFS2_TCB1_WIDTH             2u
#define EQADC_CFSSR1_CFS2_TCB1(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_CFS2_TCB1_SHIFT))&EQADC_CFSSR1_CFS2_TCB1_MASK)
#define EQADC_CFSSR1_CFS1_TCB1_MASK              0x30000000u
#define EQADC_CFSSR1_CFS1_TCB1_SHIFT             28u
#define EQADC_CFSSR1_CFS1_TCB1_WIDTH             2u
#define EQADC_CFSSR1_CFS1_TCB1(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_CFS1_TCB1_SHIFT))&EQADC_CFSSR1_CFS1_TCB1_MASK)
#define EQADC_CFSSR1_CFS0_TCB1_MASK              0xC0000000u
#define EQADC_CFSSR1_CFS0_TCB1_SHIFT             30u
#define EQADC_CFSSR1_CFS0_TCB1_WIDTH             2u
#define EQADC_CFSSR1_CFS0_TCB1(x)                (((uint32_t)(((uint32_t)(x))<<EQADC_CFSSR1_CFS0_TCB1_SHIFT))&EQADC_CFSSR1_CFS0_TCB1_MASK)
/* CFSR Bit Fields */
#define EQADC_CFSR_CFS5_MASK                     0x300000u
#define EQADC_CFSR_CFS5_SHIFT                    20u
#define EQADC_CFSR_CFS5_WIDTH                    2u
#define EQADC_CFSR_CFS5(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_CFSR_CFS5_SHIFT))&EQADC_CFSR_CFS5_MASK)
#define EQADC_CFSR_CFS4_MASK                     0xC00000u
#define EQADC_CFSR_CFS4_SHIFT                    22u
#define EQADC_CFSR_CFS4_WIDTH                    2u
#define EQADC_CFSR_CFS4(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_CFSR_CFS4_SHIFT))&EQADC_CFSR_CFS4_MASK)
#define EQADC_CFSR_CFS3_MASK                     0x3000000u
#define EQADC_CFSR_CFS3_SHIFT                    24u
#define EQADC_CFSR_CFS3_WIDTH                    2u
#define EQADC_CFSR_CFS3(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_CFSR_CFS3_SHIFT))&EQADC_CFSR_CFS3_MASK)
#define EQADC_CFSR_CFS2_MASK                     0xC000000u
#define EQADC_CFSR_CFS2_SHIFT                    26u
#define EQADC_CFSR_CFS2_WIDTH                    2u
#define EQADC_CFSR_CFS2(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_CFSR_CFS2_SHIFT))&EQADC_CFSR_CFS2_MASK)
#define EQADC_CFSR_CFS1_MASK                     0x30000000u
#define EQADC_CFSR_CFS1_SHIFT                    28u
#define EQADC_CFSR_CFS1_WIDTH                    2u
#define EQADC_CFSR_CFS1(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_CFSR_CFS1_SHIFT))&EQADC_CFSR_CFS1_MASK)
#define EQADC_CFSR_CFS0_MASK                     0xC0000000u
#define EQADC_CFSR_CFS0_SHIFT                    30u
#define EQADC_CFSR_CFS0_WIDTH                    2u
#define EQADC_CFSR_CFS0(x)                       (((uint32_t)(((uint32_t)(x))<<EQADC_CFSR_CFS0_SHIFT))&EQADC_CFSR_CFS0_MASK)
/* STACCCR Bit Fields */
#define EQADC_STACCCR_SRV1_MASK                  0xFu
#define EQADC_STACCCR_SRV1_SHIFT                 0u
#define EQADC_STACCCR_SRV1_WIDTH                 4u
#define EQADC_STACCCR_SRV1(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_STACCCR_SRV1_SHIFT))&EQADC_STACCCR_SRV1_MASK)
#define EQADC_STACCCR_STACBS1_MASK               0xF0u
#define EQADC_STACCCR_STACBS1_SHIFT              4u
#define EQADC_STACCCR_STACBS1_WIDTH              4u
#define EQADC_STACCCR_STACBS1(x)                 (((uint32_t)(((uint32_t)(x))<<EQADC_STACCCR_STACBS1_SHIFT))&EQADC_STACCCR_STACBS1_MASK)
#define EQADC_STACCCR_SRV2_MASK                  0xF00u
#define EQADC_STACCCR_SRV2_SHIFT                 8u
#define EQADC_STACCCR_SRV2_WIDTH                 4u
#define EQADC_STACCCR_SRV2(x)                    (((uint32_t)(((uint32_t)(x))<<EQADC_STACCCR_SRV2_SHIFT))&EQADC_STACCCR_SRV2_MASK)
#define EQADC_STACCCR_STACBS2_MASK               0xF000u
#define EQADC_STACCCR_STACBS2_SHIFT              12u
#define EQADC_STACCCR_STACBS2_WIDTH              4u
#define EQADC_STACCCR_STACBS2(x)                 (((uint32_t)(((uint32_t)(x))<<EQADC_STACCCR_STACBS2_SHIFT))&EQADC_STACCCR_STACBS2_MASK)
/* CF0R Bit Fields */
#define EQADC_CF0R_CFIFO0_DATAW_MASK             0xFFFFFFFFu
#define EQADC_CF0R_CFIFO0_DATAW_SHIFT            0u
#define EQADC_CF0R_CFIFO0_DATAW_WIDTH            32u
#define EQADC_CF0R_CFIFO0_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CF0R_CFIFO0_DATAW_SHIFT))&EQADC_CF0R_CFIFO0_DATAW_MASK)
/* CF0ER Bit Fields */
#define EQADC_CF0ER_CFIFO0_EDATAW_MASK           0xFFFFFFFFu
#define EQADC_CF0ER_CFIFO0_EDATAW_SHIFT          0u
#define EQADC_CF0ER_CFIFO0_EDATAW_WIDTH          32u
#define EQADC_CF0ER_CFIFO0_EDATAW(x)             (((uint32_t)(((uint32_t)(x))<<EQADC_CF0ER_CFIFO0_EDATAW_SHIFT))&EQADC_CF0ER_CFIFO0_EDATAW_MASK)
/* CF1R Bit Fields */
#define EQADC_CF1R_CFIFO1_DATAW_MASK             0xFFFFFFFFu
#define EQADC_CF1R_CFIFO1_DATAW_SHIFT            0u
#define EQADC_CF1R_CFIFO1_DATAW_WIDTH            32u
#define EQADC_CF1R_CFIFO1_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CF1R_CFIFO1_DATAW_SHIFT))&EQADC_CF1R_CFIFO1_DATAW_MASK)
/* CF2R Bit Fields */
#define EQADC_CF2R_CFIFO2_DATAW_MASK             0xFFFFFFFFu
#define EQADC_CF2R_CFIFO2_DATAW_SHIFT            0u
#define EQADC_CF2R_CFIFO2_DATAW_WIDTH            32u
#define EQADC_CF2R_CFIFO2_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CF2R_CFIFO2_DATAW_SHIFT))&EQADC_CF2R_CFIFO2_DATAW_MASK)
/* CF3R Bit Fields */
#define EQADC_CF3R_CFIFO3_DATAW_MASK             0xFFFFFFFFu
#define EQADC_CF3R_CFIFO3_DATAW_SHIFT            0u
#define EQADC_CF3R_CFIFO3_DATAW_WIDTH            32u
#define EQADC_CF3R_CFIFO3_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CF3R_CFIFO3_DATAW_SHIFT))&EQADC_CF3R_CFIFO3_DATAW_MASK)
/* CF4R Bit Fields */
#define EQADC_CF4R_CFIFO4_DATAW_MASK             0xFFFFFFFFu
#define EQADC_CF4R_CFIFO4_DATAW_SHIFT            0u
#define EQADC_CF4R_CFIFO4_DATAW_WIDTH            32u
#define EQADC_CF4R_CFIFO4_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CF4R_CFIFO4_DATAW_SHIFT))&EQADC_CF4R_CFIFO4_DATAW_MASK)
/* CF5R Bit Fields */
#define EQADC_CF5R_CFIFO5_DATAW_MASK             0xFFFFFFFFu
#define EQADC_CF5R_CFIFO5_DATAW_SHIFT            0u
#define EQADC_CF5R_CFIFO5_DATAW_WIDTH            32u
#define EQADC_CF5R_CFIFO5_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_CF5R_CFIFO5_DATAW_SHIFT))&EQADC_CF5R_CFIFO5_DATAW_MASK)
/* RF0R Bit Fields */
#define EQADC_RF0R_RFIFO0_DATAW_MASK             0xFFFFu
#define EQADC_RF0R_RFIFO0_DATAW_SHIFT            0u
#define EQADC_RF0R_RFIFO0_DATAW_WIDTH            16u
#define EQADC_RF0R_RFIFO0_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_RF0R_RFIFO0_DATAW_SHIFT))&EQADC_RF0R_RFIFO0_DATAW_MASK)
/* RF1R Bit Fields */
#define EQADC_RF1R_RFIFO1_DATAW_MASK             0xFFFFu
#define EQADC_RF1R_RFIFO1_DATAW_SHIFT            0u
#define EQADC_RF1R_RFIFO1_DATAW_WIDTH            16u
#define EQADC_RF1R_RFIFO1_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_RF1R_RFIFO1_DATAW_SHIFT))&EQADC_RF1R_RFIFO1_DATAW_MASK)
/* RF2R Bit Fields */
#define EQADC_RF2R_RFIFO2_DATAW_MASK             0xFFFFu
#define EQADC_RF2R_RFIFO2_DATAW_SHIFT            0u
#define EQADC_RF2R_RFIFO2_DATAW_WIDTH            16u
#define EQADC_RF2R_RFIFO2_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_RF2R_RFIFO2_DATAW_SHIFT))&EQADC_RF2R_RFIFO2_DATAW_MASK)
/* RF3R Bit Fields */
#define EQADC_RF3R_RFIFO3_DATAW_MASK             0xFFFFu
#define EQADC_RF3R_RFIFO3_DATAW_SHIFT            0u
#define EQADC_RF3R_RFIFO3_DATAW_WIDTH            16u
#define EQADC_RF3R_RFIFO3_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_RF3R_RFIFO3_DATAW_SHIFT))&EQADC_RF3R_RFIFO3_DATAW_MASK)
/* RF4R Bit Fields */
#define EQADC_RF4R_RFIFO4_DATAW_MASK             0xFFFFu
#define EQADC_RF4R_RFIFO4_DATAW_SHIFT            0u
#define EQADC_RF4R_RFIFO4_DATAW_WIDTH            16u
#define EQADC_RF4R_RFIFO4_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_RF4R_RFIFO4_DATAW_SHIFT))&EQADC_RF4R_RFIFO4_DATAW_MASK)
/* RF5R Bit Fields */
#define EQADC_RF5R_RFIFO5_DATAW_MASK             0xFFFFu
#define EQADC_RF5R_RFIFO5_DATAW_SHIFT            0u
#define EQADC_RF5R_RFIFO5_DATAW_WIDTH            16u
#define EQADC_RF5R_RFIFO5_DATAW(x)               (((uint32_t)(((uint32_t)(x))<<EQADC_RF5R_RFIFO5_DATAW_SHIFT))&EQADC_RF5R_RFIFO5_DATAW_MASK)

/*!
 * @}
 */ /* end of group EQADC_Register_Masks */


/*!
 * @}
 */ /* end of group EQADC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- ERM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Peripheral_Access_Layer ERM Peripheral Access Layer
 * @{
 */


/** ERM - Size of Registers Arrays */
#define ERM_EARn_COUNT                           20u

/** ERM - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR0;                               /**< ERM Configuration Register, offset: 0x0 */
  __IO uint32_t CR1;                               /**< ERM Configuration Register, offset: 0x4 */
  __IO uint32_t CR2;                               /**< ERM Configuration Register, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t SR0;                               /**< ERM Status Register, offset: 0x10 */
  __IO uint32_t SR1;                               /**< ERM Status Register, offset: 0x14 */
  __IO uint32_t SR2;                               /**< ERM Status Register, offset: 0x18 */
       uint8_t RESERVED_1[228];
  struct {                                         /* offset: 0x100, array step: 0x10 */
    __I  uint32_t EAR;                               /**< ERM Memory n Error Address Register, array offset: 0x100, array step: 0x10 */
    __I  uint32_t SYN;                               /**< ERM Memory n Syndrome Register, array offset: 0x104, array step: 0x10 */
         uint8_t RESERVED_0[8];
  } EARn[ERM_EARn_COUNT];
} ERM_Type, *ERM_MemMapPtr;

 /** Number of instances of the ERM module. */
#define ERM_INSTANCE_COUNT                       (1u)


/* ERM - Peripheral instance base addresses */
/** Peripheral ERM base address */
#define ERM_BASE                                 (0xFFF60000u)
/** Peripheral ERM base pointer */
#define ERM                                      ((ERM_Type *)ERM_BASE)
/** Array initializer of ERM peripheral base addresses */
#define ERM_BASE_ADDRS                           { ERM_BASE }
/** Array initializer of ERM peripheral base pointers */
#define ERM_BASE_PTRS                            { ERM }

/* ----------------------------------------------------------------------------
   -- ERM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ERM_Register_Masks ERM Register Masks
 * @{
 */

