neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* CR0 Bit Fields */
#define ERM_CR0_ENCIE7_MASK                      0x4u
#define ERM_CR0_ENCIE7_SHIFT                     2u
#define ERM_CR0_ENCIE7_WIDTH                     1u
#define ERM_CR0_ENCIE7(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE7_SHIFT))&ERM_CR0_ENCIE7_MASK)
#define ERM_CR0_ESCIE7_MASK                      0x8u
#define ERM_CR0_ESCIE7_SHIFT                     3u
#define ERM_CR0_ESCIE7_WIDTH                     1u
#define ERM_CR0_ESCIE7(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE7_SHIFT))&ERM_CR0_ESCIE7_MASK)
#define ERM_CR0_ENCIE6_MASK                      0x40u
#define ERM_CR0_ENCIE6_SHIFT                     6u
#define ERM_CR0_ENCIE6_WIDTH                     1u
#define ERM_CR0_ENCIE6(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE6_SHIFT))&ERM_CR0_ENCIE6_MASK)
#define ERM_CR0_ESCIE6_MASK                      0x80u
#define ERM_CR0_ESCIE6_SHIFT                     7u
#define ERM_CR0_ESCIE6_WIDTH                     1u
#define ERM_CR0_ESCIE6(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE6_SHIFT))&ERM_CR0_ESCIE6_MASK)
#define ERM_CR0_ENCIE5_MASK                      0x400u
#define ERM_CR0_ENCIE5_SHIFT                     10u
#define ERM_CR0_ENCIE5_WIDTH                     1u
#define ERM_CR0_ENCIE5(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE5_SHIFT))&ERM_CR0_ENCIE5_MASK)
#define ERM_CR0_ESCIE5_MASK                      0x800u
#define ERM_CR0_ESCIE5_SHIFT                     11u
#define ERM_CR0_ESCIE5_WIDTH                     1u
#define ERM_CR0_ESCIE5(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE5_SHIFT))&ERM_CR0_ESCIE5_MASK)
#define ERM_CR0_ENCIE4_MASK                      0x4000u
#define ERM_CR0_ENCIE4_SHIFT                     14u
#define ERM_CR0_ENCIE4_WIDTH                     1u
#define ERM_CR0_ENCIE4(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE4_SHIFT))&ERM_CR0_ENCIE4_MASK)
#define ERM_CR0_ESCIE4_MASK                      0x8000u
#define ERM_CR0_ESCIE4_SHIFT                     15u
#define ERM_CR0_ESCIE4_WIDTH                     1u
#define ERM_CR0_ESCIE4(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE4_SHIFT))&ERM_CR0_ESCIE4_MASK)
#define ERM_CR0_ENCIE3_MASK                      0x40000u
#define ERM_CR0_ENCIE3_SHIFT                     18u
#define ERM_CR0_ENCIE3_WIDTH                     1u
#define ERM_CR0_ENCIE3(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE3_SHIFT))&ERM_CR0_ENCIE3_MASK)
#define ERM_CR0_ESCIE3_MASK                      0x80000u
#define ERM_CR0_ESCIE3_SHIFT                     19u
#define ERM_CR0_ESCIE3_WIDTH                     1u
#define ERM_CR0_ESCIE3(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE3_SHIFT))&ERM_CR0_ESCIE3_MASK)
#define ERM_CR0_ENCIE2_MASK                      0x400000u
#define ERM_CR0_ENCIE2_SHIFT                     22u
#define ERM_CR0_ENCIE2_WIDTH                     1u
#define ERM_CR0_ENCIE2(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE2_SHIFT))&ERM_CR0_ENCIE2_MASK)
#define ERM_CR0_ESCIE2_MASK                      0x800000u
#define ERM_CR0_ESCIE2_SHIFT                     23u
#define ERM_CR0_ESCIE2_WIDTH                     1u
#define ERM_CR0_ESCIE2(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE2_SHIFT))&ERM_CR0_ESCIE2_MASK)
#define ERM_CR0_ENCIE1_MASK                      0x4000000u
#define ERM_CR0_ENCIE1_SHIFT                     26u
#define ERM_CR0_ENCIE1_WIDTH                     1u
#define ERM_CR0_ENCIE1(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE1_SHIFT))&ERM_CR0_ENCIE1_MASK)
#define ERM_CR0_ESCIE1_MASK                      0x8000000u
#define ERM_CR0_ESCIE1_SHIFT                     27u
#define ERM_CR0_ESCIE1_WIDTH                     1u
#define ERM_CR0_ESCIE1(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE1_SHIFT))&ERM_CR0_ESCIE1_MASK)
#define ERM_CR0_ENCIE0_MASK                      0x40000000u
#define ERM_CR0_ENCIE0_SHIFT                     30u
#define ERM_CR0_ENCIE0_WIDTH                     1u
#define ERM_CR0_ENCIE0(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ENCIE0_SHIFT))&ERM_CR0_ENCIE0_MASK)
#define ERM_CR0_ESCIE0_MASK                      0x80000000u
#define ERM_CR0_ESCIE0_SHIFT                     31u
#define ERM_CR0_ESCIE0_WIDTH                     1u
#define ERM_CR0_ESCIE0(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR0_ESCIE0_SHIFT))&ERM_CR0_ESCIE0_MASK)
/* CR1 Bit Fields */
#define ERM_CR1_ENCIE15_MASK                     0x4u
#define ERM_CR1_ENCIE15_SHIFT                    2u
#define ERM_CR1_ENCIE15_WIDTH                    1u
#define ERM_CR1_ENCIE15(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE15_SHIFT))&ERM_CR1_ENCIE15_MASK)
#define ERM_CR1_ESCIE15_MASK                     0x8u
#define ERM_CR1_ESCIE15_SHIFT                    3u
#define ERM_CR1_ESCIE15_WIDTH                    1u
#define ERM_CR1_ESCIE15(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE15_SHIFT))&ERM_CR1_ESCIE15_MASK)
#define ERM_CR1_ENCIE14_MASK                     0x40u
#define ERM_CR1_ENCIE14_SHIFT                    6u
#define ERM_CR1_ENCIE14_WIDTH                    1u
#define ERM_CR1_ENCIE14(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE14_SHIFT))&ERM_CR1_ENCIE14_MASK)
#define ERM_CR1_ESCIE14_MASK                     0x80u
#define ERM_CR1_ESCIE14_SHIFT                    7u
#define ERM_CR1_ESCIE14_WIDTH                    1u
#define ERM_CR1_ESCIE14(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE14_SHIFT))&ERM_CR1_ESCIE14_MASK)
#define ERM_CR1_ENCIE13_MASK                     0x400u
#define ERM_CR1_ENCIE13_SHIFT                    10u
#define ERM_CR1_ENCIE13_WIDTH                    1u
#define ERM_CR1_ENCIE13(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE13_SHIFT))&ERM_CR1_ENCIE13_MASK)
#define ERM_CR1_ESCIE13_MASK                     0x800u
#define ERM_CR1_ESCIE13_SHIFT                    11u
#define ERM_CR1_ESCIE13_WIDTH                    1u
#define ERM_CR1_ESCIE13(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE13_SHIFT))&ERM_CR1_ESCIE13_MASK)
#define ERM_CR1_ENCIE12_MASK                     0x4000u
#define ERM_CR1_ENCIE12_SHIFT                    14u
#define ERM_CR1_ENCIE12_WIDTH                    1u
#define ERM_CR1_ENCIE12(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE12_SHIFT))&ERM_CR1_ENCIE12_MASK)
#define ERM_CR1_ESCIE12_MASK                     0x8000u
#define ERM_CR1_ESCIE12_SHIFT                    15u
#define ERM_CR1_ESCIE12_WIDTH                    1u
#define ERM_CR1_ESCIE12(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE12_SHIFT))&ERM_CR1_ESCIE12_MASK)
#define ERM_CR1_ENCIE11_MASK                     0x40000u
#define ERM_CR1_ENCIE11_SHIFT                    18u
#define ERM_CR1_ENCIE11_WIDTH                    1u
#define ERM_CR1_ENCIE11(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE11_SHIFT))&ERM_CR1_ENCIE11_MASK)
#define ERM_CR1_ESCIE11_MASK                     0x80000u
#define ERM_CR1_ESCIE11_SHIFT                    19u
#define ERM_CR1_ESCIE11_WIDTH                    1u
#define ERM_CR1_ESCIE11(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE11_SHIFT))&ERM_CR1_ESCIE11_MASK)
#define ERM_CR1_ENCIE10_MASK                     0x400000u
#define ERM_CR1_ENCIE10_SHIFT                    22u
#define ERM_CR1_ENCIE10_WIDTH                    1u
#define ERM_CR1_ENCIE10(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE10_SHIFT))&ERM_CR1_ENCIE10_MASK)
#define ERM_CR1_ESCIE10_MASK                     0x800000u
#define ERM_CR1_ESCIE10_SHIFT                    23u
#define ERM_CR1_ESCIE10_WIDTH                    1u
#define ERM_CR1_ESCIE10(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE10_SHIFT))&ERM_CR1_ESCIE10_MASK)
#define ERM_CR1_ENCIE9_MASK                      0x4000000u
#define ERM_CR1_ENCIE9_SHIFT                     26u
#define ERM_CR1_ENCIE9_WIDTH                     1u
#define ERM_CR1_ENCIE9(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE9_SHIFT))&ERM_CR1_ENCIE9_MASK)
#define ERM_CR1_ESCIE9_MASK                      0x8000000u
#define ERM_CR1_ESCIE9_SHIFT                     27u
#define ERM_CR1_ESCIE9_WIDTH                     1u
#define ERM_CR1_ESCIE9(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE9_SHIFT))&ERM_CR1_ESCIE9_MASK)
#define ERM_CR1_ENCIE8_MASK                      0x40000000u
#define ERM_CR1_ENCIE8_SHIFT                     30u
#define ERM_CR1_ENCIE8_WIDTH                     1u
#define ERM_CR1_ENCIE8(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ENCIE8_SHIFT))&ERM_CR1_ENCIE8_MASK)
#define ERM_CR1_ESCIE8_MASK                      0x80000000u
#define ERM_CR1_ESCIE8_SHIFT                     31u
#define ERM_CR1_ESCIE8_WIDTH                     1u
#define ERM_CR1_ESCIE8(x)                        (((uint32_t)(((uint32_t)(x))<<ERM_CR1_ESCIE8_SHIFT))&ERM_CR1_ESCIE8_MASK)
/* CR2 Bit Fields */
#define ERM_CR2_ENCIE19_MASK                     0x40000u
#define ERM_CR2_ENCIE19_SHIFT                    18u
#define ERM_CR2_ENCIE19_WIDTH                    1u
#define ERM_CR2_ENCIE19(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ENCIE19_SHIFT))&ERM_CR2_ENCIE19_MASK)
#define ERM_CR2_ESCIE19_MASK                     0x80000u
#define ERM_CR2_ESCIE19_SHIFT                    19u
#define ERM_CR2_ESCIE19_WIDTH                    1u
#define ERM_CR2_ESCIE19(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ESCIE19_SHIFT))&ERM_CR2_ESCIE19_MASK)
#define ERM_CR2_ENCIE18_MASK                     0x400000u
#define ERM_CR2_ENCIE18_SHIFT                    22u
#define ERM_CR2_ENCIE18_WIDTH                    1u
#define ERM_CR2_ENCIE18(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ENCIE18_SHIFT))&ERM_CR2_ENCIE18_MASK)
#define ERM_CR2_ESCIE18_MASK                     0x800000u
#define ERM_CR2_ESCIE18_SHIFT                    23u
#define ERM_CR2_ESCIE18_WIDTH                    1u
#define ERM_CR2_ESCIE18(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ESCIE18_SHIFT))&ERM_CR2_ESCIE18_MASK)
#define ERM_CR2_ENCIE17_MASK                     0x4000000u
#define ERM_CR2_ENCIE17_SHIFT                    26u
#define ERM_CR2_ENCIE17_WIDTH                    1u
#define ERM_CR2_ENCIE17(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ENCIE17_SHIFT))&ERM_CR2_ENCIE17_MASK)
#define ERM_CR2_ESCIE17_MASK                     0x8000000u
#define ERM_CR2_ESCIE17_SHIFT                    27u
#define ERM_CR2_ESCIE17_WIDTH                    1u
#define ERM_CR2_ESCIE17(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ESCIE17_SHIFT))&ERM_CR2_ESCIE17_MASK)
#define ERM_CR2_ENCIE16_MASK                     0x40000000u
#define ERM_CR2_ENCIE16_SHIFT                    30u
#define ERM_CR2_ENCIE16_WIDTH                    1u
#define ERM_CR2_ENCIE16(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ENCIE16_SHIFT))&ERM_CR2_ENCIE16_MASK)
#define ERM_CR2_ESCIE16_MASK                     0x80000000u
#define ERM_CR2_ESCIE16_SHIFT                    31u
#define ERM_CR2_ESCIE16_WIDTH                    1u
#define ERM_CR2_ESCIE16(x)                       (((uint32_t)(((uint32_t)(x))<<ERM_CR2_ESCIE16_SHIFT))&ERM_CR2_ESCIE16_MASK)
/* SR0 Bit Fields */
#define ERM_SR0_NCE7_MASK                        0x4u
#define ERM_SR0_NCE7_SHIFT                       2u
#define ERM_SR0_NCE7_WIDTH                       1u
#define ERM_SR0_NCE7(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE7_SHIFT))&ERM_SR0_NCE7_MASK)
#define ERM_SR0_SBC7_MASK                        0x8u
#define ERM_SR0_SBC7_SHIFT                       3u
#define ERM_SR0_SBC7_WIDTH                       1u
#define ERM_SR0_SBC7(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC7_SHIFT))&ERM_SR0_SBC7_MASK)
#define ERM_SR0_NCE6_MASK                        0x40u
#define ERM_SR0_NCE6_SHIFT                       6u
#define ERM_SR0_NCE6_WIDTH                       1u
#define ERM_SR0_NCE6(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE6_SHIFT))&ERM_SR0_NCE6_MASK)
#define ERM_SR0_SBC6_MASK                        0x80u
#define ERM_SR0_SBC6_SHIFT                       7u
#define ERM_SR0_SBC6_WIDTH                       1u
#define ERM_SR0_SBC6(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC6_SHIFT))&ERM_SR0_SBC6_MASK)
#define ERM_SR0_NCE5_MASK                        0x400u
#define ERM_SR0_NCE5_SHIFT                       10u
#define ERM_SR0_NCE5_WIDTH                       1u
#define ERM_SR0_NCE5(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE5_SHIFT))&ERM_SR0_NCE5_MASK)
#define ERM_SR0_SBC5_MASK                        0x800u
#define ERM_SR0_SBC5_SHIFT                       11u
#define ERM_SR0_SBC5_WIDTH                       1u
#define ERM_SR0_SBC5(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC5_SHIFT))&ERM_SR0_SBC5_MASK)
#define ERM_SR0_NCE4_MASK                        0x4000u
#define ERM_SR0_NCE4_SHIFT                       14u
#define ERM_SR0_NCE4_WIDTH                       1u
#define ERM_SR0_NCE4(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE4_SHIFT))&ERM_SR0_NCE4_MASK)
#define ERM_SR0_SBC4_MASK                        0x8000u
#define ERM_SR0_SBC4_SHIFT                       15u
#define ERM_SR0_SBC4_WIDTH                       1u
#define ERM_SR0_SBC4(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC4_SHIFT))&ERM_SR0_SBC4_MASK)
#define ERM_SR0_NCE3_MASK                        0x40000u
#define ERM_SR0_NCE3_SHIFT                       18u
#define ERM_SR0_NCE3_WIDTH                       1u
#define ERM_SR0_NCE3(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE3_SHIFT))&ERM_SR0_NCE3_MASK)
#define ERM_SR0_SBC3_MASK                        0x80000u
#define ERM_SR0_SBC3_SHIFT                       19u
#define ERM_SR0_SBC3_WIDTH                       1u
#define ERM_SR0_SBC3(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC3_SHIFT))&ERM_SR0_SBC3_MASK)
#define ERM_SR0_NCE2_MASK                        0x400000u
#define ERM_SR0_NCE2_SHIFT                       22u
#define ERM_SR0_NCE2_WIDTH                       1u
#define ERM_SR0_NCE2(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE2_SHIFT))&ERM_SR0_NCE2_MASK)
#define ERM_SR0_SBC2_MASK                        0x800000u
#define ERM_SR0_SBC2_SHIFT                       23u
#define ERM_SR0_SBC2_WIDTH                       1u
#define ERM_SR0_SBC2(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC2_SHIFT))&ERM_SR0_SBC2_MASK)
#define ERM_SR0_NCE1_MASK                        0x4000000u
#define ERM_SR0_NCE1_SHIFT                       26u
#define ERM_SR0_NCE1_WIDTH                       1u
#define ERM_SR0_NCE1(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE1_SHIFT))&ERM_SR0_NCE1_MASK)
#define ERM_SR0_SBC1_MASK                        0x8000000u
#define ERM_SR0_SBC1_SHIFT                       27u
#define ERM_SR0_SBC1_WIDTH                       1u
#define ERM_SR0_SBC1(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC1_SHIFT))&ERM_SR0_SBC1_MASK)
#define ERM_SR0_NCE0_MASK                        0x40000000u
#define ERM_SR0_NCE0_SHIFT                       30u
#define ERM_SR0_NCE0_WIDTH                       1u
#define ERM_SR0_NCE0(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_NCE0_SHIFT))&ERM_SR0_NCE0_MASK)
#define ERM_SR0_SBC0_MASK                        0x80000000u
#define ERM_SR0_SBC0_SHIFT                       31u
#define ERM_SR0_SBC0_WIDTH                       1u
#define ERM_SR0_SBC0(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR0_SBC0_SHIFT))&ERM_SR0_SBC0_MASK)
/* SR1 Bit Fields */
#define ERM_SR1_NCE15_MASK                       0x4u
#define ERM_SR1_NCE15_SHIFT                      2u
#define ERM_SR1_NCE15_WIDTH                      1u
#define ERM_SR1_NCE15(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE15_SHIFT))&ERM_SR1_NCE15_MASK)
#define ERM_SR1_SBC15_MASK                       0x8u
#define ERM_SR1_SBC15_SHIFT                      3u
#define ERM_SR1_SBC15_WIDTH                      1u
#define ERM_SR1_SBC15(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC15_SHIFT))&ERM_SR1_SBC15_MASK)
#define ERM_SR1_NCE14_MASK                       0x40u
#define ERM_SR1_NCE14_SHIFT                      6u
#define ERM_SR1_NCE14_WIDTH                      1u
#define ERM_SR1_NCE14(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE14_SHIFT))&ERM_SR1_NCE14_MASK)
#define ERM_SR1_SBC14_MASK                       0x80u
#define ERM_SR1_SBC14_SHIFT                      7u
#define ERM_SR1_SBC14_WIDTH                      1u
#define ERM_SR1_SBC14(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC14_SHIFT))&ERM_SR1_SBC14_MASK)
#define ERM_SR1_NCE13_MASK                       0x400u
#define ERM_SR1_NCE13_SHIFT                      10u
#define ERM_SR1_NCE13_WIDTH                      1u
#define ERM_SR1_NCE13(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE13_SHIFT))&ERM_SR1_NCE13_MASK)
#define ERM_SR1_SBC13_MASK                       0x800u
#define ERM_SR1_SBC13_SHIFT                      11u
#define ERM_SR1_SBC13_WIDTH                      1u
#define ERM_SR1_SBC13(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC13_SHIFT))&ERM_SR1_SBC13_MASK)
#define ERM_SR1_NCE12_MASK                       0x4000u
#define ERM_SR1_NCE12_SHIFT                      14u
#define ERM_SR1_NCE12_WIDTH                      1u
#define ERM_SR1_NCE12(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE12_SHIFT))&ERM_SR1_NCE12_MASK)
#define ERM_SR1_SBC12_MASK                       0x8000u
#define ERM_SR1_SBC12_SHIFT                      15u
#define ERM_SR1_SBC12_WIDTH                      1u
#define ERM_SR1_SBC12(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC12_SHIFT))&ERM_SR1_SBC12_MASK)
#define ERM_SR1_NCE11_MASK                       0x40000u
#define ERM_SR1_NCE11_SHIFT                      18u
#define ERM_SR1_NCE11_WIDTH                      1u
#define ERM_SR1_NCE11(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE11_SHIFT))&ERM_SR1_NCE11_MASK)
#define ERM_SR1_SBC11_MASK                       0x80000u
#define ERM_SR1_SBC11_SHIFT                      19u
#define ERM_SR1_SBC11_WIDTH                      1u
#define ERM_SR1_SBC11(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC11_SHIFT))&ERM_SR1_SBC11_MASK)
#define ERM_SR1_NCE10_MASK                       0x400000u
#define ERM_SR1_NCE10_SHIFT                      22u
#define ERM_SR1_NCE10_WIDTH                      1u
#define ERM_SR1_NCE10(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE10_SHIFT))&ERM_SR1_NCE10_MASK)
#define ERM_SR1_SBC10_MASK                       0x800000u
#define ERM_SR1_SBC10_SHIFT                      23u
#define ERM_SR1_SBC10_WIDTH                      1u
#define ERM_SR1_SBC10(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC10_SHIFT))&ERM_SR1_SBC10_MASK)
#define ERM_SR1_NCE9_MASK                        0x4000000u
#define ERM_SR1_NCE9_SHIFT                       26u
#define ERM_SR1_NCE9_WIDTH                       1u
#define ERM_SR1_NCE9(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE9_SHIFT))&ERM_SR1_NCE9_MASK)
#define ERM_SR1_SBC9_MASK                        0x8000000u
#define ERM_SR1_SBC9_SHIFT                       27u
#define ERM_SR1_SBC9_WIDTH                       1u
#define ERM_SR1_SBC9(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC9_SHIFT))&ERM_SR1_SBC9_MASK)
#define ERM_SR1_NCE8_MASK                        0x40000000u
#define ERM_SR1_NCE8_SHIFT                       30u
#define ERM_SR1_NCE8_WIDTH                       1u
#define ERM_SR1_NCE8(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR1_NCE8_SHIFT))&ERM_SR1_NCE8_MASK)
#define ERM_SR1_SBC8_MASK                        0x80000000u
#define ERM_SR1_SBC8_SHIFT                       31u
#define ERM_SR1_SBC8_WIDTH                       1u
#define ERM_SR1_SBC8(x)                          (((uint32_t)(((uint32_t)(x))<<ERM_SR1_SBC8_SHIFT))&ERM_SR1_SBC8_MASK)
/* SR2 Bit Fields */
#define ERM_SR2_NCE19_MASK                       0x40000u
#define ERM_SR2_NCE19_SHIFT                      18u
#define ERM_SR2_NCE19_WIDTH                      1u
#define ERM_SR2_NCE19(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_NCE19_SHIFT))&ERM_SR2_NCE19_MASK)
#define ERM_SR2_SBC19_MASK                       0x80000u
#define ERM_SR2_SBC19_SHIFT                      19u
#define ERM_SR2_SBC19_WIDTH                      1u
#define ERM_SR2_SBC19(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_SBC19_SHIFT))&ERM_SR2_SBC19_MASK)
#define ERM_SR2_NCE18_MASK                       0x400000u
#define ERM_SR2_NCE18_SHIFT                      22u
#define ERM_SR2_NCE18_WIDTH                      1u
#define ERM_SR2_NCE18(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_NCE18_SHIFT))&ERM_SR2_NCE18_MASK)
#define ERM_SR2_SBC18_MASK                       0x800000u
#define ERM_SR2_SBC18_SHIFT                      23u
#define ERM_SR2_SBC18_WIDTH                      1u
#define ERM_SR2_SBC18(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_SBC18_SHIFT))&ERM_SR2_SBC18_MASK)
#define ERM_SR2_NCE17_MASK                       0x4000000u
#define ERM_SR2_NCE17_SHIFT                      26u
#define ERM_SR2_NCE17_WIDTH                      1u
#define ERM_SR2_NCE17(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_NCE17_SHIFT))&ERM_SR2_NCE17_MASK)
#define ERM_SR2_SBC17_MASK                       0x8000000u
#define ERM_SR2_SBC17_SHIFT                      27u
#define ERM_SR2_SBC17_WIDTH                      1u
#define ERM_SR2_SBC17(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_SBC17_SHIFT))&ERM_SR2_SBC17_MASK)
#define ERM_SR2_NCE16_MASK                       0x40000000u
#define ERM_SR2_NCE16_SHIFT                      30u
#define ERM_SR2_NCE16_WIDTH                      1u
#define ERM_SR2_NCE16(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_NCE16_SHIFT))&ERM_SR2_NCE16_MASK)
#define ERM_SR2_SBC16_MASK                       0x80000000u
#define ERM_SR2_SBC16_SHIFT                      31u
#define ERM_SR2_SBC16_WIDTH                      1u
#define ERM_SR2_SBC16(x)                         (((uint32_t)(((uint32_t)(x))<<ERM_SR2_SBC16_SHIFT))&ERM_SR2_SBC16_MASK)
/* EAR Bit Fields */
#define ERM_EAR_EAR_MASK                         0xFFFFFFFFu
#define ERM_EAR_EAR_SHIFT                        0u
#define ERM_EAR_EAR_WIDTH                        32u
#define ERM_EAR_EAR(x)                           (((uint32_t)(((uint32_t)(x))<<ERM_EAR_EAR_SHIFT))&ERM_EAR_EAR_MASK)
/* SYN Bit Fields */
#define ERM_SYN_SYNDROME_MASK                    0xFF000000u
#define ERM_SYN_SYNDROME_SHIFT                   24u
#define ERM_SYN_SYNDROME_WIDTH                   8u
#define ERM_SYN_SYNDROME(x)                      (((uint32_t)(((uint32_t)(x))<<ERM_SYN_SYNDROME_SHIFT))&ERM_SYN_SYNDROME_MASK)

/*!
 * @}
 */ /* end of group ERM_Register_Masks */


/*!
 * @}
 */ /* end of group ERM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FCCU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FCCU_Peripheral_Access_Layer FCCU Peripheral Access Layer
 * @{
 */


