neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** FCCU - Size of Registers Arrays */
#define FCCU_NCF_CFG_COUNT                       2u
#define FCCU_NCFS_CFG_COUNT                      3u
#define FCCU_NCF_S_COUNT                         2u
#define FCCU_NCF_E_COUNT                         2u
#define FCCU_NCF_TOE_COUNT                       2u
#define FCCU_IRQ_ALARM_EN_COUNT                  2u
#define FCCU_NMI_EN_COUNT                        2u
#define FCCU_EOUT_SIG_EN_COUNT                   2u

/** FCCU - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< Control, offset: 0x0 */
  __O  uint32_t CTRLK;                             /**< Control Key, offset: 0x4 */
  __IO uint32_t CFG;                               /**< Configuration, offset: 0x8 */
       uint8_t RESERVED_0[16];
  __IO uint32_t NCF_CFG[FCCU_NCF_CFG_COUNT];       /**< Noncritical Fault Configuration, array offset: 0x1C, array step: 0x4 */
       uint8_t RESERVED_1[40];
  __IO uint32_t NCFS_CFG[FCCU_NCFS_CFG_COUNT];     /**< Noncritical Fault State Configuration, array offset: 0x4C, array step: 0x4 */
       uint8_t RESERVED_2[40];
  __IO uint32_t NCF_S[FCCU_NCF_S_COUNT];           /**< Noncritical Fault Status, array offset: 0x80, array step: 0x4 */
       uint8_t RESERVED_3[8];
  __O  uint32_t NCFK;                              /**< Noncritical Fault Key, offset: 0x90 */
  __IO uint32_t NCF_E[FCCU_NCF_E_COUNT];           /**< Noncritical Fault Enable, array offset: 0x94, array step: 0x4 */
       uint8_t RESERVED_4[8];
  __IO uint32_t NCF_TOE[FCCU_NCF_TOE_COUNT];       /**< Noncritical Fault Timeout Enable, array offset: 0xA4, array step: 0x4 */
       uint8_t RESERVED_5[8];
  __IO uint32_t NCF_TO;                            /**< Noncritical Fault Timeout, offset: 0xB4 */
  __IO uint32_t CFG_TO;                            /**< Configuration-State Timer Interval, offset: 0xB8 */
  __IO uint32_t EINOUT;                            /**< IO Control, offset: 0xBC */
  __I  uint32_t STAT;                              /**< Status, offset: 0xC0 */
  __I  uint32_t N2AF_STATUS;                       /**< NA Freeze Status, offset: 0xC4 */
  __I  uint32_t A2FF_STATUS;                       /**< AF Freeze Status, offset: 0xC8 */
  __I  uint32_t N2FF_STATUS;                       /**< NF Freeze Status, offset: 0xCC */
  __I  uint32_t F2A_STATUS;                        /**< FA Freeze Status, offset: 0xD0 */
       uint8_t RESERVED_6[8];
  __IO uint32_t NCFF;                              /**< Noncritical Fault Fake, offset: 0xDC */
  __IO uint32_t IRQ_STAT;                          /**< IRQ Status, offset: 0xE0 */
  __IO uint32_t IRQ_EN;                            /**< IRQ Enable, offset: 0xE4 */
  __I  uint32_t XTMR;                              /**< XTMR, offset: 0xE8 */
       uint8_t RESERVED_7[4];
  __IO uint32_t TRANS_LOCK;                        /**< Transient Configuration Lock, offset: 0xF0 */
  __IO uint32_t PERMNT_LOCK;                       /**< Permanent Configuration Lock, offset: 0xF4 */
  __IO uint32_t DELTA_T;                           /**< Delta T, offset: 0xF8 */
  __IO uint32_t IRQ_ALARM_EN[FCCU_IRQ_ALARM_EN_COUNT]; /**< IRQ Alarm Enable, array offset: 0xFC, array step: 0x4 */
       uint8_t RESERVED_8[8];
  __IO uint32_t NMI_EN[FCCU_NMI_EN_COUNT];         /**< NMI Enable, array offset: 0x10C, array step: 0x4 */
       uint8_t RESERVED_9[8];
  __IO uint32_t EOUT_SIG_EN[FCCU_EOUT_SIG_EN_COUNT]; /**< Bistable Fault-Output (EOUT) Mode Signaling Enable, array offset: 0x11C, array step: 0x4 */
} FCCU_Type, *FCCU_MemMapPtr;

 /** Number of instances of the FCCU module. */
#define FCCU_INSTANCE_COUNT                      (1u)


/* FCCU - Peripheral instance base addresses */
/** Peripheral FCCU base address */
#define FCCU_BASE                                (0xC3F80000u)
/** Peripheral FCCU base pointer */
#define FCCU                                     ((FCCU_Type *)FCCU_BASE)
/** Array initializer of FCCU peripheral base addresses */
#define FCCU_BASE_ADDRS                          { FCCU_BASE }
/** Array initializer of FCCU peripheral base pointers */
#define FCCU_BASE_PTRS                           { FCCU }

/* ----------------------------------------------------------------------------
   -- FCCU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FCCU_Register_Masks FCCU Register Masks
 * @{
 */

/* CTRL Bit Fields */
#define FCCU_CTRL_OPR_MASK                       0x1Fu
#define FCCU_CTRL_OPR_SHIFT                      0u
#define FCCU_CTRL_OPR_WIDTH                      5u
#define FCCU_CTRL_OPR(x)                         (((uint32_t)(((uint32_t)(x))<<FCCU_CTRL_OPR_SHIFT))&FCCU_CTRL_OPR_MASK)
#define FCCU_CTRL_OPS_MASK                       0xC0u
#define FCCU_CTRL_OPS_SHIFT                      6u
#define FCCU_CTRL_OPS_WIDTH                      2u
#define FCCU_CTRL_OPS(x)                         (((uint32_t)(((uint32_t)(x))<<FCCU_CTRL_OPS_SHIFT))&FCCU_CTRL_OPS_MASK)
#define FCCU_CTRL_DEBUG_MASK                     0x200u
#define FCCU_CTRL_DEBUG_SHIFT                    9u
#define FCCU_CTRL_DEBUG_WIDTH                    1u
#define FCCU_CTRL_DEBUG(x)                       (((uint32_t)(((uint32_t)(x))<<FCCU_CTRL_DEBUG_SHIFT))&FCCU_CTRL_DEBUG_MASK)
#define FCCU_CTRL_FILTER_WIDTH_MASK              0x60000000u
#define FCCU_CTRL_FILTER_WIDTH_SHIFT             29u
#define FCCU_CTRL_FILTER_WIDTH_WIDTH             2u
#define FCCU_CTRL_FILTER_WIDTH(x)                (((uint32_t)(((uint32_t)(x))<<FCCU_CTRL_FILTER_WIDTH_SHIFT))&FCCU_CTRL_FILTER_WIDTH_MASK)
#define FCCU_CTRL_FILTER_BYPASS_MASK             0x80000000u
#define FCCU_CTRL_FILTER_BYPASS_SHIFT            31u
#define FCCU_CTRL_FILTER_BYPASS_WIDTH            1u
#define FCCU_CTRL_FILTER_BYPASS(x)               (((uint32_t)(((uint32_t)(x))<<FCCU_CTRL_FILTER_BYPASS_SHIFT))&FCCU_CTRL_FILTER_BYPASS_MASK)
/* CTRLK Bit Fields */
#define FCCU_CTRLK_CTRLK_MASK                    0xFFFFFFFFu
#define FCCU_CTRLK_CTRLK_SHIFT                   0u
#define FCCU_CTRLK_CTRLK_WIDTH                   32u
#define FCCU_CTRLK_CTRLK(x)                      (((uint32_t)(((uint32_t)(x))<<FCCU_CTRLK_CTRLK_SHIFT))&FCCU_CTRLK_CTRLK_MASK)
/* CFG Bit Fields */
#define FCCU_CFG_FOP_MASK                        0x3Fu
#define FCCU_CFG_FOP_SHIFT                       0u
#define FCCU_CFG_FOP_WIDTH                       6u
#define FCCU_CFG_FOP(x)                          (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_FOP_SHIFT))&FCCU_CFG_FOP_MASK)
#define FCCU_CFG_FOM_MASK                        0x1C0u
#define FCCU_CFG_FOM_SHIFT                       6u
#define FCCU_CFG_FOM_WIDTH                       3u
#define FCCU_CFG_FOM(x)                          (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_FOM_SHIFT))&FCCU_CFG_FOM_MASK)
#define FCCU_CFG_PS_MASK                         0x200u
#define FCCU_CFG_PS_SHIFT                        9u
#define FCCU_CFG_PS_WIDTH                        1u
#define FCCU_CFG_PS(x)                           (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_PS_SHIFT))&FCCU_CFG_PS_MASK)
#define FCCU_CFG_SM_MASK                         0x400u
#define FCCU_CFG_SM_SHIFT                        10u
#define FCCU_CFG_SM_WIDTH                        1u
#define FCCU_CFG_SM(x)                           (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_SM_SHIFT))&FCCU_CFG_SM_MASK)
#define FCCU_CFG_FOPE_MASK                       0x8000u
#define FCCU_CFG_FOPE_SHIFT                      15u
#define FCCU_CFG_FOPE_WIDTH                      1u
#define FCCU_CFG_FOPE(x)                         (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_FOPE_SHIFT))&FCCU_CFG_FOPE_MASK)
#define FCCU_CFG_FCCU_SET_CLEAR_MASK             0xC00000u
#define FCCU_CFG_FCCU_SET_CLEAR_SHIFT            22u
#define FCCU_CFG_FCCU_SET_CLEAR_WIDTH            2u
#define FCCU_CFG_FCCU_SET_CLEAR(x)               (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_FCCU_SET_CLEAR_SHIFT))&FCCU_CFG_FCCU_SET_CLEAR_MASK)
#define FCCU_CFG_FCCU_SET_AFTER_RESET_MASK       0x1000000u
#define FCCU_CFG_FCCU_SET_AFTER_RESET_SHIFT      24u
#define FCCU_CFG_FCCU_SET_AFTER_RESET_WIDTH      1u
#define FCCU_CFG_FCCU_SET_AFTER_RESET(x)         (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_FCCU_SET_AFTER_RESET_SHIFT))&FCCU_CFG_FCCU_SET_AFTER_RESET_MASK)
/* NCF_CFG Bit Fields */
#define FCCU_NCF_CFG_NCFCx_MASK                  0xFFFFFFFFu
#define FCCU_NCF_CFG_NCFCx_SHIFT                 0u
#define FCCU_NCF_CFG_NCFCx_WIDTH                 32u
#define FCCU_NCF_CFG_NCFCx(x)                    (((uint32_t)(((uint32_t)(x))<<FCCU_NCF_CFG_NCFCx_SHIFT))&FCCU_NCF_CFG_NCFCx_MASK)
/* NCFS_CFG Bit Fields */
#define FCCU_NCFS_CFG_NCFSCx_MASK                0xFFFFFFFFu
#define FCCU_NCFS_CFG_NCFSCx_SHIFT               0u
#define FCCU_NCFS_CFG_NCFSCx_WIDTH               32u
#define FCCU_NCFS_CFG_NCFSCx(x)                  (((uint32_t)(((uint32_t)(x))<<FCCU_NCFS_CFG_NCFSCx_SHIFT))&FCCU_NCFS_CFG_NCFSCx_MASK)
/* NCF_S Bit Fields */
#define FCCU_NCF_S_NCFSx_MASK                    0xFFFFFFFFu
#define FCCU_NCF_S_NCFSx_SHIFT                   0u
#define FCCU_NCF_S_NCFSx_WIDTH                   32u
#define FCCU_NCF_S_NCFSx(x)                      (((uint32_t)(((uint32_t)(x))<<FCCU_NCF_S_NCFSx_SHIFT))&FCCU_NCF_S_NCFSx_MASK)
/* NCFK Bit Fields */
#define FCCU_NCFK_NCFK_MASK                      0xFFFFFFFFu
#define FCCU_NCFK_NCFK_SHIFT                     0u
#define FCCU_NCFK_NCFK_WIDTH                     32u
#define FCCU_NCFK_NCFK(x)                        (((uint32_t)(((uint32_t)(x))<<FCCU_NCFK_NCFK_SHIFT))&FCCU_NCFK_NCFK_MASK)
/* NCF_E Bit Fields */
#define FCCU_NCF_E_NCFEx_MASK                    0xFFFFFFFFu
#define FCCU_NCF_E_NCFEx_SHIFT                   0u
#define FCCU_NCF_E_NCFEx_WIDTH                   32u
#define FCCU_NCF_E_NCFEx(x)                      (((uint32_t)(((uint32_t)(x))<<FCCU_NCF_E_NCFEx_SHIFT))&FCCU_NCF_E_NCFEx_MASK)
/* NCF_TOE Bit Fields */
#define FCCU_NCF_TOE_NCFTOEx_MASK                0xFFFFFFFFu
#define FCCU_NCF_TOE_NCFTOEx_SHIFT               0u
#define FCCU_NCF_TOE_NCFTOEx_WIDTH               32u
#define FCCU_NCF_TOE_NCFTOEx(x)                  (((uint32_t)(((uint32_t)(x))<<FCCU_NCF_TOE_NCFTOEx_SHIFT))&FCCU_NCF_TOE_NCFTOEx_MASK)
/* NCF_TO Bit Fields */
#define FCCU_NCF_TO_TO_MASK                      0xFFFFFFFFu
#define FCCU_NCF_TO_TO_SHIFT                     0u
#define FCCU_NCF_TO_TO_WIDTH                     32u
#define FCCU_NCF_TO_TO(x)                        (((uint32_t)(((uint32_t)(x))<<FCCU_NCF_TO_TO_SHIFT))&FCCU_NCF_TO_TO_MASK)
/* CFG_TO Bit Fields */
#define FCCU_CFG_TO_TO_MASK                      0x7u
#define FCCU_CFG_TO_TO_SHIFT                     0u
#define FCCU_CFG_TO_TO_WIDTH                     3u
#define FCCU_CFG_TO_TO(x)                        (((uint32_t)(((uint32_t)(x))<<FCCU_CFG_TO_TO_SHIFT))&FCCU_CFG_TO_TO_MASK)
/* EINOUT Bit Fields */
#define FCCU_EINOUT_EOUT0_MASK                   0x1u
#define FCCU_EINOUT_EOUT0_SHIFT                  0u
#define FCCU_EINOUT_EOUT0_WIDTH                  1u
#define FCCU_EINOUT_EOUT0(x)                     (((uint32_t)(((uint32_t)(x))<<FCCU_EINOUT_EOUT0_SHIFT))&FCCU_EINOUT_EOUT0_MASK)
#define FCCU_EINOUT_EOUT1_MASK                   0x2u
#define FCCU_EINOUT_EOUT1_SHIFT                  1u
#define FCCU_EINOUT_EOUT1_WIDTH                  1u
#define FCCU_EINOUT_EOUT1(x)                     (((uint32_t)(((uint32_t)(x))<<FCCU_EINOUT_EOUT1_SHIFT))&FCCU_EINOUT_EOUT1_MASK)
#define FCCU_EINOUT_EIN0_MASK                    0x10u
#define FCCU_EINOUT_EIN0_SHIFT                   4u
#define FCCU_EINOUT_EIN0_WIDTH                   1u
#define FCCU_EINOUT_EIN0(x)                      (((uint32_t)(((uint32_t)(x))<<FCCU_EINOUT_EIN0_SHIFT))&FCCU_EINOUT_EIN0_MASK)
#define FCCU_EINOUT_EIN1_MASK                    0x20u
#define FCCU_EINOUT_EIN1_SHIFT                   5u
#define FCCU_EINOUT_EIN1_WIDTH                   1u
#define FCCU_EINOUT_EIN1(x)                      (((uint32_t)(((uint32_t)(x))<<FCCU_EINOUT_EIN1_SHIFT))&FCCU_EINOUT_EIN1_MASK)
/* STAT Bit Fields */
#define FCCU_STAT_STATUS_MASK                    0x7u
#define FCCU_STAT_STATUS_SHIFT                   0u
#define FCCU_STAT_STATUS_WIDTH                   3u
#define FCCU_STAT_STATUS(x)                      (((uint32_t)(((uint32_t)(x))<<FCCU_STAT_STATUS_SHIFT))&FCCU_STAT_STATUS_MASK)
#define FCCU_STAT_ESTAT_MASK                     0x8u
#define FCCU_STAT_ESTAT_SHIFT                    3u
#define FCCU_STAT_ESTAT_WIDTH                    1u
#define FCCU_STAT_ESTAT(x)                       (((uint32_t)(((uint32_t)(x))<<FCCU_STAT_ESTAT_SHIFT))&FCCU_STAT_ESTAT_MASK)
#define FCCU_STAT_PhysicErrorPin_MASK            0x30u
#define FCCU_STAT_PhysicErrorPin_SHIFT           4u
#define FCCU_STAT_PhysicErrorPin_WIDTH           2u
#define FCCU_STAT_PhysicErrorPin(x)              (((uint32_t)(((uint32_t)(x))<<FCCU_STAT_PhysicErrorPin_SHIFT))&FCCU_STAT_PhysicErrorPin_MASK)
/* N2AF_STATUS Bit Fields */
#define FCCU_N2AF_STATUS_NAFS_MASK               0xFFu
#define FCCU_N2AF_STATUS_NAFS_SHIFT              0u
#define FCCU_N2AF_STATUS_NAFS_WIDTH              8u
#define FCCU_N2AF_STATUS_NAFS(x)                 (((uint32_t)(((uint32_t)(x))<<FCCU_N2AF_STATUS_NAFS_SHIFT))&FCCU_N2AF_STATUS_NAFS_MASK)
/* A2FF_STATUS Bit Fields */
#define FCCU_A2FF_STATUS_AFFS_MASK               0xFFu
#define FCCU_A2FF_STATUS_AFFS_SHIFT              0u
#define FCCU_A2FF_STATUS_AFFS_WIDTH              8u
#define FCCU_A2FF_STATUS_AFFS(x)                 (((uint32_t)(((uint32_t)(x))<<FCCU_A2FF_STATUS_AFFS_SHIFT))&FCCU_A2FF_STATUS_AFFS_MASK)
#define FCCU_A2FF_STATUS_AF_SRC_MASK             0x300u
#define FCCU_A2FF_STATUS_AF_SRC_SHIFT            8u
#define FCCU_A2FF_STATUS_AF_SRC_WIDTH            2u
#define FCCU_A2FF_STATUS_AF_SRC(x)               (((uint32_t)(((uint32_t)(x))<<FCCU_A2FF_STATUS_AF_SRC_SHIFT))&FCCU_A2FF_STATUS_AF_SRC_MASK)
/* N2FF_STATUS Bit Fields */
#define FCCU_N2FF_STATUS_NFFS_MASK               0xFFu
#define FCCU_N2FF_STATUS_NFFS_SHIFT              0u
#define FCCU_N2FF_STATUS_NFFS_WIDTH              8u
#define FCCU_N2FF_STATUS_NFFS(x)                 (((uint32_t)(((uint32_t)(x))<<FCCU_N2FF_STATUS_NFFS_SHIFT))&FCCU_N2FF_STATUS_NFFS_MASK)
#define FCCU_N2FF_STATUS_NF_SRC_MASK             0x300u
#define FCCU_N2FF_STATUS_NF_SRC_SHIFT            8u
#define FCCU_N2FF_STATUS_NF_SRC_WIDTH            2u
#define FCCU_N2FF_STATUS_NF_SRC(x)               (((uint32_t)(((uint32_t)(x))<<FCCU_N2FF_STATUS_NF_SRC_SHIFT))&FCCU_N2FF_STATUS_NF_SRC_MASK)
/* F2A_STATUS Bit Fields */
#define FCCU_F2A_STATUS_FAFS_MASK                0x1FFu
#define FCCU_F2A_STATUS_FAFS_SHIFT               0u
#define FCCU_F2A_STATUS_FAFS_WIDTH               9u
#define FCCU_F2A_STATUS_FAFS(x)                  (((uint32_t)(((uint32_t)(x))<<FCCU_F2A_STATUS_FAFS_SHIFT))&FCCU_F2A_STATUS_FAFS_MASK)
/* NCFF Bit Fields */
#define FCCU_NCFF_FNCFC_MASK                     0x7Fu
#define FCCU_NCFF_FNCFC_SHIFT                    0u
#define FCCU_NCFF_FNCFC_WIDTH                    7u
#define FCCU_NCFF_FNCFC(x)                       (((uint32_t)(((uint32_t)(x))<<FCCU_NCFF_FNCFC_SHIFT))&FCCU_NCFF_FNCFC_MASK)
/* IRQ_STAT Bit Fields */
#define FCCU_IRQ_STAT_CFG_TO_STAT_MASK           0x1u
#define FCCU_IRQ_STAT_CFG_TO_STAT_SHIFT          0u
#define FCCU_IRQ_STAT_CFG_TO_STAT_WIDTH          1u
#define FCCU_IRQ_STAT_CFG_TO_STAT(x)             (((uint32_t)(((uint32_t)(x))<<FCCU_IRQ_STAT_CFG_TO_STAT_SHIFT))&FCCU_IRQ_STAT_CFG_TO_STAT_MASK)
#define FCCU_IRQ_STAT_ALRM_STAT_MASK             0x2u
#define FCCU_IRQ_STAT_ALRM_STAT_SHIFT            1u
#define FCCU_IRQ_STAT_ALRM_STAT_WIDTH            1u
#define FCCU_IRQ_STAT_ALRM_STAT(x)               (((uint32_t)(((uint32_t)(x))<<FCCU_IRQ_STAT_ALRM_STAT_SHIFT))&FCCU_IRQ_STAT_ALRM_STAT_MASK)
#define FCCU_IRQ_STAT_NMI_STAT_MASK              0x4u
#define FCCU_IRQ_STAT_NMI_STAT_SHIFT             2u
#define FCCU_IRQ_STAT_NMI_STAT_WIDTH             1u
#define FCCU_IRQ_STAT_NMI_STAT(x)                (((uint32_t)(((uint32_t)(x))<<FCCU_IRQ_STAT_NMI_STAT_SHIFT))&FCCU_IRQ_STAT_NMI_STAT_MASK)
/* IRQ_EN Bit Fields */
#define FCCU_IRQ_EN_CFG_TO_IEN_MASK              0x1u
#define FCCU_IRQ_EN_CFG_TO_IEN_SHIFT             0u
#define FCCU_IRQ_EN_CFG_TO_IEN_WIDTH             1u
#define FCCU_IRQ_EN_CFG_TO_IEN(x)                (((uint32_t)(((uint32_t)(x))<<FCCU_IRQ_EN_CFG_TO_IEN_SHIFT))&FCCU_IRQ_EN_CFG_TO_IEN_MASK)
/* XTMR Bit Fields */
#define FCCU_XTMR_XTMR_MASK                      0xFFFFFFFFu
#define FCCU_XTMR_XTMR_SHIFT                     0u
#define FCCU_XTMR_XTMR_WIDTH                     32u
#define FCCU_XTMR_XTMR(x)                        (((uint32_t)(((uint32_t)(x))<<FCCU_XTMR_XTMR_SHIFT))&FCCU_XTMR_XTMR_MASK)
/* TRANS_LOCK Bit Fields */
#define FCCU_TRANS_LOCK_TRANSKEY_MASK            0x1FFu
#define FCCU_TRANS_LOCK_TRANSKEY_SHIFT           0u
#define FCCU_TRANS_LOCK_TRANSKEY_WIDTH           9u
#define FCCU_TRANS_LOCK_TRANSKEY(x)              (((uint32_t)(((uint32_t)(x))<<FCCU_TRANS_LOCK_TRANSKEY_SHIFT))&FCCU_TRANS_LOCK_TRANSKEY_MASK)
/* PERMNT_LOCK Bit Fields */
#define FCCU_PERMNT_LOCK_PERMNTKEY_MASK          0x1FFu
#define FCCU_PERMNT_LOCK_PERMNTKEY_SHIFT         0u
#define FCCU_PERMNT_LOCK_PERMNTKEY_WIDTH         9u
#define FCCU_PERMNT_LOCK_PERMNTKEY(x)            (((uint32_t)(((uint32_t)(x))<<FCCU_PERMNT_LOCK_PERMNTKEY_SHIFT))&FCCU_PERMNT_LOCK_PERMNTKEY_MASK)
/* DELTA_T Bit Fields */
#define FCCU_DELTA_T_DELTA_T_MASK                0x3FFFu
#define FCCU_DELTA_T_DELTA_T_SHIFT               0u
#define FCCU_DELTA_T_DELTA_T_WIDTH               14u
#define FCCU_DELTA_T_DELTA_T(x)                  (((uint32_t)(((uint32_t)(x))<<FCCU_DELTA_T_DELTA_T_SHIFT))&FCCU_DELTA_T_DELTA_T_MASK)
/* IRQ_ALARM_EN Bit Fields */
#define FCCU_IRQ_ALARM_EN_IRQENx_MASK            0xFFFFFFFFu
#define FCCU_IRQ_ALARM_EN_IRQENx_SHIFT           0u
#define FCCU_IRQ_ALARM_EN_IRQENx_WIDTH           32u
#define FCCU_IRQ_ALARM_EN_IRQENx(x)              (((uint32_t)(((uint32_t)(x))<<FCCU_IRQ_ALARM_EN_IRQENx_SHIFT))&FCCU_IRQ_ALARM_EN_IRQENx_MASK)
/* NMI_EN Bit Fields */
#define FCCU_NMI_EN_NMIENx_MASK                  0xFFFFFFFFu
#define FCCU_NMI_EN_NMIENx_SHIFT                 0u
#define FCCU_NMI_EN_NMIENx_WIDTH                 32u
#define FCCU_NMI_EN_NMIENx(x)                    (((uint32_t)(((uint32_t)(x))<<FCCU_NMI_EN_NMIENx_SHIFT))&FCCU_NMI_EN_NMIENx_MASK)
/* EOUT_SIG_EN Bit Fields */
#define FCCU_EOUT_SIG_EN_EOUTENx_MASK            0xFFFFFFFFu
#define FCCU_EOUT_SIG_EN_EOUTENx_SHIFT           0u
#define FCCU_EOUT_SIG_EN_EOUTENx_WIDTH           32u
#define FCCU_EOUT_SIG_EN_EOUTENx(x)              (((uint32_t)(((uint32_t)(x))<<FCCU_EOUT_SIG_EN_EOUTENx_SHIFT))&FCCU_EOUT_SIG_EN_EOUTENx_MASK)

/*!
 * @}
 */ /* end of group FCCU_Register_Masks */


/*!
 * @}
 */ /* end of group FCCU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FEC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FEC_Peripheral_Access_Layer FEC Peripheral Access Layer
 * @{
 */


