neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** FEC - Size of Registers Arrays */

/** FEC - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t EIR;                               /**< Interrupt Event Register, offset: 0x4 */
  __IO uint32_t EIMR;                              /**< Interrupt Mask Register, offset: 0x8 */
       uint8_t RESERVED_1[4];
  __IO uint32_t RDAR;                              /**< Receive Descriptor Active Register, offset: 0x10 */
  __IO uint32_t TDAR;                              /**< Transmit Descriptor Active Register, offset: 0x14 */
       uint8_t RESERVED_2[12];
  __IO uint32_t ECR;                               /**< Ethernet Control Register, offset: 0x24 */
       uint8_t RESERVED_3[24];
  __IO uint32_t MMFR;                              /**< MII Management Frame Register, offset: 0x40 */
  __IO uint32_t MSCR;                              /**< MII Speed Control Register, offset: 0x44 */
       uint8_t RESERVED_4[28];
  __IO uint32_t MIBC;                              /**< MIB Control Register, offset: 0x64 */
       uint8_t RESERVED_5[28];
  __IO uint32_t RCR;                               /**< Receive Control Register, offset: 0x84 */
       uint8_t RESERVED_6[60];
  __IO uint32_t TCR;                               /**< Transmit Control Register, offset: 0xC4 */
       uint8_t RESERVED_7[28];
  __IO uint32_t PALR;                              /**< Physical Address Low Register, offset: 0xE4 */
  __IO uint32_t PAUR;                              /**< Physical Address High Register and Type Field, offset: 0xE8 */
  __IO uint32_t OPD;                               /**< Opcode/Pause Duration, offset: 0xEC */
       uint8_t RESERVED_8[40];
  __IO uint32_t IAUR;                              /**< Descriptor Individual Upper Address Register, offset: 0x118 */
  __IO uint32_t IALR;                              /**< Descriptor Individual Lower Address Register, offset: 0x11C */
  __IO uint32_t GAUR;                              /**< Descriptor Group Upper Address Register, offset: 0x120 */
  __IO uint32_t GALR;                              /**< Descriptor Group Lower Address Register, offset: 0x124 */
       uint8_t RESERVED_9[28];
  __IO uint32_t TFWR;                              /**< Transmit FIFO Watermark, offset: 0x144 */
       uint8_t RESERVED_10[4];
  __I  uint32_t FRBR;                              /**< FIFO Receive Bound Register, offset: 0x14C */
  __IO uint32_t FRSR;                              /**< FIFO Receive Start Register, offset: 0x150 */
       uint8_t RESERVED_11[44];
  __IO uint32_t ERDSR;                             /**< Receive Descriptor Ring Start Register, offset: 0x180 */
  __IO uint32_t ETDSR;                             /**< Transmit Buffer Descriptor Ring Start Register, offset: 0x184 */
  __IO uint32_t EMRBR;                             /**< Receive Buffer Size Register, offset: 0x188 */
       uint8_t RESERVED_12[116];
  __IO uint32_t RMON_T_DROP;                       /**< Count of frames not counted correctly, offset: 0x200 */
  __IO uint32_t RMON_T_PACKETS;                    /**< RMON Tx packet count, offset: 0x204 */
  __IO uint32_t RMON_T_BC_PKT;                     /**< RMON Tx broadcast packets, offset: 0x208 */
  __IO uint32_t RMON_T_MC_PKT;                     /**< RMON Tx multicast packets, offset: 0x20C */
  __IO uint32_t RMON_T_CRC_ALIGN;                  /**< RMON Tx packets with CRC/align error, offset: 0x210 */
  __IO uint32_t RMON_T_UNDERSIZE;                  /**< RMON Tx packets < 64 bytes, good CRC, offset: 0x214 */
  __IO uint32_t RMON_T_OVERSIZE;                   /**< RMON Tx packets > MAX_FL bytes, good CRC, offset: 0x218 */
  __IO uint32_t RMON_T_FRAG;                       /**< RMON Tx packets < 64 bytes, bad CRC, offset: 0x21C */
  __IO uint32_t RMON_T_JAB;                        /**< RMON Tx packets > MAX_FL bytes, bad CRC, offset: 0x220 */
  __IO uint32_t RMON_T_COL;                        /**< RMON Tx collision count, offset: 0x224 */
  __IO uint32_t RMON_T_P64;                        /**< RMON Tx 64 byte packets, offset: 0x228 */
  __IO uint32_t RMON_T_P65TO127;                   /**< RMON Tx 65 to 127 byte packets, offset: 0x22C */
  __IO uint32_t RMON_T_P128TO255;                  /**< RMON Tx 128 to 255 byte packets, offset: 0x230 */
  __IO uint32_t RMON_T_P256TO511;                  /**< RMON Tx 256 to 511 byte packets, offset: 0x234 */
  __IO uint32_t RMON_T_P512TO1023;                 /**< RMON Tx 512 to 1023 byte packets, offset: 0x238 */
  __IO uint32_t RMON_T_P1024TO2047;                /**< RMON Tx 1024 to 2047 byte packets, offset: 0x23C */
  __IO uint32_t RMON_T_P_GTE2048;                  /**< RMON Tx packets with > 2048 bytes, offset: 0x240 */
  __IO uint32_t RMON_T_OCTETS;                     /**< RMON Tx Octets, offset: 0x244 */
  __IO uint32_t IEEE_T_DROP;                       /**< Count of transmitted frames not counted correctly, offset: 0x248 */
  __IO uint32_t IEEE_T_FRAME_OK;                   /**< Frames transmitted OK, offset: 0x24C */
  __IO uint32_t IEEE_T_1COL;                       /**< Frames transmitted with single collision, offset: 0x250 */
  __IO uint32_t IEEE_T_MCOL;                       /**< Frames transmitted with multiple collisions, offset: 0x254 */
  __IO uint32_t IEEE_T_DEF;                        /**< Frames transmitted after deferral delay, offset: 0x258 */
  __IO uint32_t IEEE_T_LCOL;                       /**< Frames transmitted with late collision, offset: 0x25C */
  __IO uint32_t IEEE_T_EXCOL;                      /**< Frames transmitted with excessive collisions, offset: 0x260 */
  __IO uint32_t IEEE_T_MACERR;                     /**< Frames transmitted with Tx FIFO underrun, offset: 0x264 */
  __IO uint32_t IEEE_T_CSERR;                      /**< Frames transmitted with carrier sense error, offset: 0x268 */
  __IO uint32_t IEEE_T_SQE;                        /**< Frames transmitted with SQE error, offset: 0x26C */
  __IO uint32_t IEEE_T_FDXFC;                      /**< Flow control pause frames transmitted, offset: 0x270 */
  __IO uint32_t IEEE_T_OCTETS_OK;                  /**< Octet count for frames transmitted without error, offset: 0x274 */
       uint8_t RESERVED_13[8];
  __IO uint32_t RMON_R_DROP;                       /**< Count of received frames not counted correctly, offset: 0x280 */
  __IO uint32_t RMON_R_PACKETS;                    /**< RMON Rx packet count, offset: 0x284 */
  __IO uint32_t RMON_R_BC_PKT;                     /**< RMON Rx broadcast packets, offset: 0x288 */
  __IO uint32_t RMON_R_MC_PKT;                     /**< RMON Rx multicast packets, offset: 0x28C */
  __IO uint32_t RMON_R_CRC_ALIGN;                  /**< RMON Rx packets with CRC/Align error, offset: 0x290 */
  __IO uint32_t RMON_R_UNDERSIZE;                  /**< RMON Rx packets < 64 bytes, good CRC, offset: 0x294 */
  __IO uint32_t RMON_R_OVERSIZE;                   /**< RMON Rx packets > MAX_FL bytes, good CRC, offset: 0x298 */
  __IO uint32_t RMON_R_FRAG;                       /**< RMON Rx packets < 64 bytes, bad CRC, offset: 0x29C */
  __IO uint32_t RMON_R_JAB;                        /**< RMON Rx packets > MAX_FL bytes, bad CRC, offset: 0x2A0 */
  __IO uint32_t RMON_R_RESVD_0;                    /**< Reserved, offset: 0x2A4 */
  __IO uint32_t RMON_R_P64;                        /**< RMON Rx 64 byte packets, offset: 0x2A8 */
  __IO uint32_t RMON_R_P65TO127;                   /**< RMON Rx 65 to 127 byte packets, offset: 0x2AC */
  __IO uint32_t RMON_R_P128TO255;                  /**< RMON Rx 128 to 255 byte packets, offset: 0x2B0 */
  __IO uint32_t RMON_R_P256TO511;                  /**< RMON Rx 256 to 511 byte packets, offset: 0x2B4 */
  __IO uint32_t RMON_R_P512TO1023;                 /**< RMON Rx 512 to 1023 byte packets, offset: 0x2B8 */
  __IO uint32_t RMON_R_P1024TO2047;                /**< RMON Rx 1024 to 2047 byte packets, offset: 0x2BC */
  __IO uint32_t RMON_R_P_GTE2048;                  /**< RMON Rx packets with > 2048 bytes, offset: 0x2C0 */
  __IO uint32_t RMON_R_OCTETS;                     /**< RMON Rx octets, offset: 0x2C4 */
  __IO uint32_t IEEE_R_DROP;                       /**< Count of received frames not counted correctly, offset: 0x2C8 */
  __IO uint32_t IEEE_R_FRAME_OK;                   /**< Frames received OK, offset: 0x2CC */
  __IO uint32_t IEEE_R_CRC;                        /**< Frames received with CRC error, offset: 0x2D0 */
  __IO uint32_t IEEE_R_ALIGN;                      /**< Frames received with alignment error, offset: 0x2D4 */
  __IO uint32_t IEEE_R_MACERR;                     /**< Receive FIFO overflow count, offset: 0x2D8 */
  __IO uint32_t IEEE_R_FDXFC;                      /**< Flow control pause frames received, offset: 0x2DC */
  __IO uint32_t IEEE_R_OCTETS_OK;                  /**< Octet count for frames received without error, offset: 0x2E0 */
} FEC_Type, *FEC_MemMapPtr;

