neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the FEC module. */
#define FEC_INSTANCE_COUNT                       (1u)


/* FEC - Peripheral instance base addresses */
/** Peripheral FEC base address */
#define FEC_BASE                                 (0xFFF4C000u)
/** Peripheral FEC base pointer */
#define FEC                                      ((FEC_Type *)FEC_BASE)
/** Array initializer of FEC peripheral base addresses */
#define FEC_BASE_ADDRS                           { FEC_BASE }
/** Array initializer of FEC peripheral base pointers */
#define FEC_BASE_PTRS                            { FEC }

/** Interrupt vectors for the FEC peripheral type */
#define FEC_ERR_IRQS                     { FEC_ERR_IRQn }
#define FEC_RX_IRQS                      { FEC_RXF_IRQn }
#define FEC_TX_IRQS                      { FEC_TXF_IRQn }

/* ----------------------------------------------------------------------------
   -- FEC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FEC_Register_Masks FEC Register Masks
 * @{
 */

/* EIR Bit Fields */
#define FEC_EIR_UN_MASK                          0x80000u
#define FEC_EIR_UN_SHIFT                         19u
#define FEC_EIR_UN_WIDTH                         1u
#define FEC_EIR_UN(x)                            (((uint32_t)(((uint32_t)(x))<<FEC_EIR_UN_SHIFT))&FEC_EIR_UN_MASK)
#define FEC_EIR_RL_MASK                          0x100000u
#define FEC_EIR_RL_SHIFT                         20u
#define FEC_EIR_RL_WIDTH                         1u
#define FEC_EIR_RL(x)                            (((uint32_t)(((uint32_t)(x))<<FEC_EIR_RL_SHIFT))&FEC_EIR_RL_MASK)
#define FEC_EIR_LC_MASK                          0x200000u
#define FEC_EIR_LC_SHIFT                         21u
#define FEC_EIR_LC_WIDTH                         1u
#define FEC_EIR_LC(x)                            (((uint32_t)(((uint32_t)(x))<<FEC_EIR_LC_SHIFT))&FEC_EIR_LC_MASK)
#define FEC_EIR_EBERR_MASK                       0x400000u
#define FEC_EIR_EBERR_SHIFT                      22u
#define FEC_EIR_EBERR_WIDTH                      1u
#define FEC_EIR_EBERR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_EIR_EBERR_SHIFT))&FEC_EIR_EBERR_MASK)
#define FEC_EIR_MII_MASK                         0x800000u
#define FEC_EIR_MII_SHIFT                        23u
#define FEC_EIR_MII_WIDTH                        1u
#define FEC_EIR_MII(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_MII_SHIFT))&FEC_EIR_MII_MASK)
#define FEC_EIR_RXB_MASK                         0x1000000u
#define FEC_EIR_RXB_SHIFT                        24u
#define FEC_EIR_RXB_WIDTH                        1u
#define FEC_EIR_RXB(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_RXB_SHIFT))&FEC_EIR_RXB_MASK)
#define FEC_EIR_RXF_MASK                         0x2000000u
#define FEC_EIR_RXF_SHIFT                        25u
#define FEC_EIR_RXF_WIDTH                        1u
#define FEC_EIR_RXF(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_RXF_SHIFT))&FEC_EIR_RXF_MASK)
#define FEC_EIR_TXB_MASK                         0x4000000u
#define FEC_EIR_TXB_SHIFT                        26u
#define FEC_EIR_TXB_WIDTH                        1u
#define FEC_EIR_TXB(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_TXB_SHIFT))&FEC_EIR_TXB_MASK)
#define FEC_EIR_TXF_MASK                         0x8000000u
#define FEC_EIR_TXF_SHIFT                        27u
#define FEC_EIR_TXF_WIDTH                        1u
#define FEC_EIR_TXF(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_TXF_SHIFT))&FEC_EIR_TXF_MASK)
#define FEC_EIR_GRA_MASK                         0x10000000u
#define FEC_EIR_GRA_SHIFT                        28u
#define FEC_EIR_GRA_WIDTH                        1u
#define FEC_EIR_GRA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIR_GRA_SHIFT))&FEC_EIR_GRA_MASK)
#define FEC_EIR_BABT_MASK                        0x20000000u
#define FEC_EIR_BABT_SHIFT                       29u
#define FEC_EIR_BABT_WIDTH                       1u
#define FEC_EIR_BABT(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIR_BABT_SHIFT))&FEC_EIR_BABT_MASK)
#define FEC_EIR_BABR_MASK                        0x40000000u
#define FEC_EIR_BABR_SHIFT                       30u
#define FEC_EIR_BABR_WIDTH                       1u
#define FEC_EIR_BABR(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIR_BABR_SHIFT))&FEC_EIR_BABR_MASK)
#define FEC_EIR_HBERR_MASK                       0x80000000u
#define FEC_EIR_HBERR_SHIFT                      31u
#define FEC_EIR_HBERR_WIDTH                      1u
#define FEC_EIR_HBERR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_EIR_HBERR_SHIFT))&FEC_EIR_HBERR_MASK)
/* EIMR Bit Fields */
#define FEC_EIMR_UN_MASK                         0x80000u
#define FEC_EIMR_UN_SHIFT                        19u
#define FEC_EIMR_UN_WIDTH                        1u
#define FEC_EIMR_UN(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_UN_SHIFT))&FEC_EIMR_UN_MASK)
#define FEC_EIMR_RL_MASK                         0x100000u
#define FEC_EIMR_RL_SHIFT                        20u
#define FEC_EIMR_RL_WIDTH                        1u
#define FEC_EIMR_RL(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_RL_SHIFT))&FEC_EIMR_RL_MASK)
#define FEC_EIMR_LC_MASK                         0x200000u
#define FEC_EIMR_LC_SHIFT                        21u
#define FEC_EIMR_LC_WIDTH                        1u
#define FEC_EIMR_LC(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_LC_SHIFT))&FEC_EIMR_LC_MASK)
#define FEC_EIMR_EBERR_MASK                      0x400000u
#define FEC_EIMR_EBERR_SHIFT                     22u
#define FEC_EIMR_EBERR_WIDTH                     1u
#define FEC_EIMR_EBERR(x)                        (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_EBERR_SHIFT))&FEC_EIMR_EBERR_MASK)
#define FEC_EIMR_MII_MASK                        0x800000u
#define FEC_EIMR_MII_SHIFT                       23u
#define FEC_EIMR_MII_WIDTH                       1u
#define FEC_EIMR_MII(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_MII_SHIFT))&FEC_EIMR_MII_MASK)
#define FEC_EIMR_RXB_MASK                        0x1000000u
#define FEC_EIMR_RXB_SHIFT                       24u
#define FEC_EIMR_RXB_WIDTH                       1u
#define FEC_EIMR_RXB(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_RXB_SHIFT))&FEC_EIMR_RXB_MASK)
#define FEC_EIMR_RXF_MASK                        0x2000000u
#define FEC_EIMR_RXF_SHIFT                       25u
#define FEC_EIMR_RXF_WIDTH                       1u
#define FEC_EIMR_RXF(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_RXF_SHIFT))&FEC_EIMR_RXF_MASK)
#define FEC_EIMR_TXB_MASK                        0x4000000u
#define FEC_EIMR_TXB_SHIFT                       26u
#define FEC_EIMR_TXB_WIDTH                       1u
#define FEC_EIMR_TXB(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_TXB_SHIFT))&FEC_EIMR_TXB_MASK)
#define FEC_EIMR_TXF_MASK                        0x8000000u
#define FEC_EIMR_TXF_SHIFT                       27u
#define FEC_EIMR_TXF_WIDTH                       1u
#define FEC_EIMR_TXF(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_TXF_SHIFT))&FEC_EIMR_TXF_MASK)
#define FEC_EIMR_GRA_MASK                        0x10000000u
#define FEC_EIMR_GRA_SHIFT                       28u
#define FEC_EIMR_GRA_WIDTH                       1u
#define FEC_EIMR_GRA(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_GRA_SHIFT))&FEC_EIMR_GRA_MASK)
#define FEC_EIMR_BABT_MASK                       0x20000000u
#define FEC_EIMR_BABT_SHIFT                      29u
#define FEC_EIMR_BABT_WIDTH                      1u
#define FEC_EIMR_BABT(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_BABT_SHIFT))&FEC_EIMR_BABT_MASK)
#define FEC_EIMR_BABR_MASK                       0x40000000u
#define FEC_EIMR_BABR_SHIFT                      30u
#define FEC_EIMR_BABR_WIDTH                      1u
#define FEC_EIMR_BABR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_BABR_SHIFT))&FEC_EIMR_BABR_MASK)
#define FEC_EIMR_HBERR_MASK                      0x80000000u
#define FEC_EIMR_HBERR_SHIFT                     31u
#define FEC_EIMR_HBERR_WIDTH                     1u
#define FEC_EIMR_HBERR(x)                        (((uint32_t)(((uint32_t)(x))<<FEC_EIMR_HBERR_SHIFT))&FEC_EIMR_HBERR_MASK)
/* RDAR Bit Fields */
#define FEC_RDAR_RDAR_MASK                       0x1000000u
#define FEC_RDAR_RDAR_SHIFT                      24u
#define FEC_RDAR_RDAR_WIDTH                      1u
#define FEC_RDAR_RDAR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_RDAR_RDAR_SHIFT))&FEC_RDAR_RDAR_MASK)
/* TDAR Bit Fields */
#define FEC_TDAR_TDAR_MASK                       0x1000000u
#define FEC_TDAR_TDAR_SHIFT                      24u
#define FEC_TDAR_TDAR_WIDTH                      1u
#define FEC_TDAR_TDAR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_TDAR_TDAR_SHIFT))&FEC_TDAR_TDAR_MASK)
/* ECR Bit Fields */
#define FEC_ECR_RESET_MASK                       0x1u
#define FEC_ECR_RESET_SHIFT                      0u
#define FEC_ECR_RESET_WIDTH                      1u
#define FEC_ECR_RESET(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_ECR_RESET_SHIFT))&FEC_ECR_RESET_MASK)
#define FEC_ECR_ETHER_EN_MASK                    0x2u
#define FEC_ECR_ETHER_EN_SHIFT                   1u
#define FEC_ECR_ETHER_EN_WIDTH                   1u
#define FEC_ECR_ETHER_EN(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_ECR_ETHER_EN_SHIFT))&FEC_ECR_ETHER_EN_MASK)
/* MMFR Bit Fields */
#define FEC_MMFR_DATA_MASK                       0xFFFFu
#define FEC_MMFR_DATA_SHIFT                      0u
#define FEC_MMFR_DATA_WIDTH                      16u
#define FEC_MMFR_DATA(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_DATA_SHIFT))&FEC_MMFR_DATA_MASK)
#define FEC_MMFR_TA_MASK                         0x30000u
#define FEC_MMFR_TA_SHIFT                        16u
#define FEC_MMFR_TA_WIDTH                        2u
#define FEC_MMFR_TA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_TA_SHIFT))&FEC_MMFR_TA_MASK)
#define FEC_MMFR_RA_MASK                         0x7C0000u
#define FEC_MMFR_RA_SHIFT                        18u
#define FEC_MMFR_RA_WIDTH                        5u
#define FEC_MMFR_RA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_RA_SHIFT))&FEC_MMFR_RA_MASK)
#define FEC_MMFR_PA_MASK                         0xF800000u
#define FEC_MMFR_PA_SHIFT                        23u
#define FEC_MMFR_PA_WIDTH                        5u
#define FEC_MMFR_PA(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_PA_SHIFT))&FEC_MMFR_PA_MASK)
#define FEC_MMFR_OP_MASK                         0x30000000u
#define FEC_MMFR_OP_SHIFT                        28u
#define FEC_MMFR_OP_WIDTH                        2u
#define FEC_MMFR_OP(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_OP_SHIFT))&FEC_MMFR_OP_MASK)
#define FEC_MMFR_ST_MASK                         0xC0000000u
#define FEC_MMFR_ST_SHIFT                        30u
#define FEC_MMFR_ST_WIDTH                        2u
#define FEC_MMFR_ST(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_MMFR_ST_SHIFT))&FEC_MMFR_ST_MASK)
/* MSCR Bit Fields */
#define FEC_MSCR_MII_SPEED_MASK                  0x7Eu
#define FEC_MSCR_MII_SPEED_SHIFT                 1u
#define FEC_MSCR_MII_SPEED_WIDTH                 6u
#define FEC_MSCR_MII_SPEED(x)                    (((uint32_t)(((uint32_t)(x))<<FEC_MSCR_MII_SPEED_SHIFT))&FEC_MSCR_MII_SPEED_MASK)
#define FEC_MSCR_DIS_PRE_MASK                    0x80u
#define FEC_MSCR_DIS_PRE_SHIFT                   7u
#define FEC_MSCR_DIS_PRE_WIDTH                   1u
#define FEC_MSCR_DIS_PRE(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_MSCR_DIS_PRE_SHIFT))&FEC_MSCR_DIS_PRE_MASK)
/* MIBC Bit Fields */
#define FEC_MIBC_MIB_IDLE_MASK                   0x40000000u
#define FEC_MIBC_MIB_IDLE_SHIFT                  30u
#define FEC_MIBC_MIB_IDLE_WIDTH                  1u
#define FEC_MIBC_MIB_IDLE(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_MIBC_MIB_IDLE_SHIFT))&FEC_MIBC_MIB_IDLE_MASK)
#define FEC_MIBC_MIB_DIS_MASK                    0x80000000u
#define FEC_MIBC_MIB_DIS_SHIFT                   31u
#define FEC_MIBC_MIB_DIS_WIDTH                   1u
#define FEC_MIBC_MIB_DIS(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_MIBC_MIB_DIS_SHIFT))&FEC_MIBC_MIB_DIS_MASK)
/* RCR Bit Fields */
#define FEC_RCR_LOOP_MASK                        0x1u
#define FEC_RCR_LOOP_SHIFT                       0u
#define FEC_RCR_LOOP_WIDTH                       1u
#define FEC_RCR_LOOP(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_RCR_LOOP_SHIFT))&FEC_RCR_LOOP_MASK)
#define FEC_RCR_DRT_MASK                         0x2u
#define FEC_RCR_DRT_SHIFT                        1u
#define FEC_RCR_DRT_WIDTH                        1u
#define FEC_RCR_DRT(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_RCR_DRT_SHIFT))&FEC_RCR_DRT_MASK)
#define FEC_RCR_MII_MODE_MASK                    0x4u
#define FEC_RCR_MII_MODE_SHIFT                   2u
#define FEC_RCR_MII_MODE_WIDTH                   1u
#define FEC_RCR_MII_MODE(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_RCR_MII_MODE_SHIFT))&FEC_RCR_MII_MODE_MASK)
#define FEC_RCR_PROM_MASK                        0x8u
#define FEC_RCR_PROM_SHIFT                       3u
#define FEC_RCR_PROM_WIDTH                       1u
#define FEC_RCR_PROM(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_RCR_PROM_SHIFT))&FEC_RCR_PROM_MASK)
#define FEC_RCR_BC_REJ_MASK                      0x10u
#define FEC_RCR_BC_REJ_SHIFT                     4u
#define FEC_RCR_BC_REJ_WIDTH                     1u
#define FEC_RCR_BC_REJ(x)                        (((uint32_t)(((uint32_t)(x))<<FEC_RCR_BC_REJ_SHIFT))&FEC_RCR_BC_REJ_MASK)
#define FEC_RCR_FCE_MASK                         0x20u
#define FEC_RCR_FCE_SHIFT                        5u
#define FEC_RCR_FCE_WIDTH                        1u
#define FEC_RCR_FCE(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_RCR_FCE_SHIFT))&FEC_RCR_FCE_MASK)
#define FEC_RCR_RMII_MODE_MASK                   0x100u
#define FEC_RCR_RMII_MODE_SHIFT                  8u
#define FEC_RCR_RMII_MODE_WIDTH                  1u
#define FEC_RCR_RMII_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_RCR_RMII_MODE_SHIFT))&FEC_RCR_RMII_MODE_MASK)
#define FEC_RCR_RMII_10T_MASK                    0x200u
#define FEC_RCR_RMII_10T_SHIFT                   9u
#define FEC_RCR_RMII_10T_WIDTH                   1u
#define FEC_RCR_RMII_10T(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_RCR_RMII_10T_SHIFT))&FEC_RCR_RMII_10T_MASK)
#define FEC_RCR_RMII_LOOP_MASK                   0x400u
#define FEC_RCR_RMII_LOOP_SHIFT                  10u
#define FEC_RCR_RMII_LOOP_WIDTH                  1u
#define FEC_RCR_RMII_LOOP(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_RCR_RMII_LOOP_SHIFT))&FEC_RCR_RMII_LOOP_MASK)
#define FEC_RCR_RMII_ECHO_MASK                   0x800u
#define FEC_RCR_RMII_ECHO_SHIFT                  11u
#define FEC_RCR_RMII_ECHO_WIDTH                  1u
#define FEC_RCR_RMII_ECHO(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_RCR_RMII_ECHO_SHIFT))&FEC_RCR_RMII_ECHO_MASK)
#define FEC_RCR_MAX_FL_MASK                      0x7FF0000u
#define FEC_RCR_MAX_FL_SHIFT                     16u
#define FEC_RCR_MAX_FL_WIDTH                     11u
#define FEC_RCR_MAX_FL(x)                        (((uint32_t)(((uint32_t)(x))<<FEC_RCR_MAX_FL_SHIFT))&FEC_RCR_MAX_FL_MASK)
/* TCR Bit Fields */
#define FEC_TCR_GTS_MASK                         0x1u
#define FEC_TCR_GTS_SHIFT                        0u
#define FEC_TCR_GTS_WIDTH                        1u
#define FEC_TCR_GTS(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_TCR_GTS_SHIFT))&FEC_TCR_GTS_MASK)
#define FEC_TCR_HBC_MASK                         0x2u
#define FEC_TCR_HBC_SHIFT                        1u
#define FEC_TCR_HBC_WIDTH                        1u
#define FEC_TCR_HBC(x)                           (((uint32_t)(((uint32_t)(x))<<FEC_TCR_HBC_SHIFT))&FEC_TCR_HBC_MASK)
#define FEC_TCR_FDEN_MASK                        0x4u
#define FEC_TCR_FDEN_SHIFT                       2u
#define FEC_TCR_FDEN_WIDTH                       1u
#define FEC_TCR_FDEN(x)                          (((uint32_t)(((uint32_t)(x))<<FEC_TCR_FDEN_SHIFT))&FEC_TCR_FDEN_MASK)
#define FEC_TCR_TFC_PAUSE_MASK                   0x8u
#define FEC_TCR_TFC_PAUSE_SHIFT                  3u
#define FEC_TCR_TFC_PAUSE_WIDTH                  1u
#define FEC_TCR_TFC_PAUSE(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_TCR_TFC_PAUSE_SHIFT))&FEC_TCR_TFC_PAUSE_MASK)
#define FEC_TCR_RFC_PAUSE_MASK                   0x10u
#define FEC_TCR_RFC_PAUSE_SHIFT                  4u
#define FEC_TCR_RFC_PAUSE_WIDTH                  1u
#define FEC_TCR_RFC_PAUSE(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_TCR_RFC_PAUSE_SHIFT))&FEC_TCR_RFC_PAUSE_MASK)
/* PALR Bit Fields */
#define FEC_PALR_PADDR1_MASK                     0xFFFFFFFFu
#define FEC_PALR_PADDR1_SHIFT                    0u
#define FEC_PALR_PADDR1_WIDTH                    32u
#define FEC_PALR_PADDR1(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_PALR_PADDR1_SHIFT))&FEC_PALR_PADDR1_MASK)
/* PAUR Bit Fields */
#define FEC_PAUR_TYPE_MASK                       0xFFFFu
#define FEC_PAUR_TYPE_SHIFT                      0u
#define FEC_PAUR_TYPE_WIDTH                      16u
#define FEC_PAUR_TYPE(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_PAUR_TYPE_SHIFT))&FEC_PAUR_TYPE_MASK)
#define FEC_PAUR_PADDR2_MASK                     0xFFFF0000u
#define FEC_PAUR_PADDR2_SHIFT                    16u
#define FEC_PAUR_PADDR2_WIDTH                    16u
#define FEC_PAUR_PADDR2(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_PAUR_PADDR2_SHIFT))&FEC_PAUR_PADDR2_MASK)
/* OPD Bit Fields */
#define FEC_OPD_PAUSE_DUR_MASK                   0xFFFFu
#define FEC_OPD_PAUSE_DUR_SHIFT                  0u
#define FEC_OPD_PAUSE_DUR_WIDTH                  16u
#define FEC_OPD_PAUSE_DUR(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_OPD_PAUSE_DUR_SHIFT))&FEC_OPD_PAUSE_DUR_MASK)
#define FEC_OPD_OPCODE_MASK                      0xFFFF0000u
#define FEC_OPD_OPCODE_SHIFT                     16u
#define FEC_OPD_OPCODE_WIDTH                     16u
#define FEC_OPD_OPCODE(x)                        (((uint32_t)(((uint32_t)(x))<<FEC_OPD_OPCODE_SHIFT))&FEC_OPD_OPCODE_MASK)
/* IAUR Bit Fields */
#define FEC_IAUR_IADDR1_MASK                     0xFFFFFFFFu
#define FEC_IAUR_IADDR1_SHIFT                    0u
#define FEC_IAUR_IADDR1_WIDTH                    32u
#define FEC_IAUR_IADDR1(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_IAUR_IADDR1_SHIFT))&FEC_IAUR_IADDR1_MASK)
/* IALR Bit Fields */
#define FEC_IALR_IADDR2_MASK                     0xFFFFFFFFu
#define FEC_IALR_IADDR2_SHIFT                    0u
#define FEC_IALR_IADDR2_WIDTH                    32u
#define FEC_IALR_IADDR2(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_IALR_IADDR2_SHIFT))&FEC_IALR_IADDR2_MASK)
/* GAUR Bit Fields */
#define FEC_GAUR_GADDR1_MASK                     0xFFFFFFFFu
#define FEC_GAUR_GADDR1_SHIFT                    0u
#define FEC_GAUR_GADDR1_WIDTH                    32u
#define FEC_GAUR_GADDR1(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_GAUR_GADDR1_SHIFT))&FEC_GAUR_GADDR1_MASK)
/* GALR Bit Fields */
#define FEC_GALR_GADDR2_MASK                     0xFFFFFFFFu
#define FEC_GALR_GADDR2_SHIFT                    0u
#define FEC_GALR_GADDR2_WIDTH                    32u
#define FEC_GALR_GADDR2(x)                       (((uint32_t)(((uint32_t)(x))<<FEC_GALR_GADDR2_SHIFT))&FEC_GALR_GADDR2_MASK)
/* TFWR Bit Fields */
#define FEC_TFWR_TFWR_MASK                       0x3u
#define FEC_TFWR_TFWR_SHIFT                      0u
#define FEC_TFWR_TFWR_WIDTH                      2u
#define FEC_TFWR_TFWR(x)                         (((uint32_t)(((uint32_t)(x))<<FEC_TFWR_TFWR_SHIFT))&FEC_TFWR_TFWR_MASK)
/* FRBR Bit Fields */
#define FEC_FRBR_R_BOUND_MASK                    0x3FCu
#define FEC_FRBR_R_BOUND_SHIFT                   2u
#define FEC_FRBR_R_BOUND_WIDTH                   8u
#define FEC_FRBR_R_BOUND(x)                      (((uint32_t)(((uint32_t)(x))<<FEC_FRBR_R_BOUND_SHIFT))&FEC_FRBR_R_BOUND_MASK)
/* FRSR Bit Fields */
#define FEC_FRSR_R_FSTART_MASK                   0x3FCu
#define FEC_FRSR_R_FSTART_SHIFT                  2u
#define FEC_FRSR_R_FSTART_WIDTH                  8u
#define FEC_FRSR_R_FSTART(x)                     (((uint32_t)(((uint32_t)(x))<<FEC_FRSR_R_FSTART_SHIFT))&FEC_FRSR_R_FSTART_MASK)
/* ERDSR Bit Fields */
#define FEC_ERDSR_R_DES_START_MASK               0xFFFFFFFCu
#define FEC_ERDSR_R_DES_START_SHIFT              2u
#define FEC_ERDSR_R_DES_START_WIDTH              30u
#define FEC_ERDSR_R_DES_START(x)                 (((uint32_t)(((uint32_t)(x))<<FEC_ERDSR_R_DES_START_SHIFT))&FEC_ERDSR_R_DES_START_MASK)
/* ETDSR Bit Fields */
#define FEC_ETDSR_X_DES_START_MASK               0xFFFFFFFCu
#define FEC_ETDSR_X_DES_START_SHIFT              2u
#define FEC_ETDSR_X_DES_START_WIDTH              30u
#define FEC_ETDSR_X_DES_START(x)                 (((uint32_t)(((uint32_t)(x))<<FEC_ETDSR_X_DES_START_SHIFT))&FEC_ETDSR_X_DES_START_MASK)
/* EMRBR Bit Fields */
#define FEC_EMRBR_R_BUF_SIZE_MASK                0x7F0u
#define FEC_EMRBR_R_BUF_SIZE_SHIFT               4u
#define FEC_EMRBR_R_BUF_SIZE_WIDTH               7u
#define FEC_EMRBR_R_BUF_SIZE(x)                  (((uint32_t)(((uint32_t)(x))<<FEC_EMRBR_R_BUF_SIZE_SHIFT))&FEC_EMRBR_R_BUF_SIZE_MASK)
/* RMON_T_DROP Bit Fields */
#define FEC_RMON_T_DROP_RMON_T_DROP_MASK         0xFFFFFFFFu
#define FEC_RMON_T_DROP_RMON_T_DROP_SHIFT        0u
#define FEC_RMON_T_DROP_RMON_T_DROP_WIDTH        32u
#define FEC_RMON_T_DROP_RMON_T_DROP(x)           (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_DROP_RMON_T_DROP_SHIFT))&FEC_RMON_T_DROP_RMON_T_DROP_MASK)
/* RMON_T_PACKETS Bit Fields */
#define FEC_RMON_T_PACKETS_RMON_T_PACKETS_MASK   0xFFFFFFFFu
#define FEC_RMON_T_PACKETS_RMON_T_PACKETS_SHIFT  0u
#define FEC_RMON_T_PACKETS_RMON_T_PACKETS_WIDTH  32u
#define FEC_RMON_T_PACKETS_RMON_T_PACKETS(x)     (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_PACKETS_RMON_T_PACKETS_SHIFT))&FEC_RMON_T_PACKETS_RMON_T_PACKETS_MASK)
/* RMON_T_BC_PKT Bit Fields */
#define FEC_RMON_T_BC_PKT_RMON_T_BC_PKT_MASK     0xFFFFFFFFu
#define FEC_RMON_T_BC_PKT_RMON_T_BC_PKT_SHIFT    0u
#define FEC_RMON_T_BC_PKT_RMON_T_BC_PKT_WIDTH    32u
#define FEC_RMON_T_BC_PKT_RMON_T_BC_PKT(x)       (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_BC_PKT_RMON_T_BC_PKT_SHIFT))&FEC_RMON_T_BC_PKT_RMON_T_BC_PKT_MASK)
/* RMON_T_MC_PKT Bit Fields */
#define FEC_RMON_T_MC_PKT_RMON_T_MC_PKT_MASK     0xFFFFFFFFu
#define FEC_RMON_T_MC_PKT_RMON_T_MC_PKT_SHIFT    0u
#define FEC_RMON_T_MC_PKT_RMON_T_MC_PKT_WIDTH    32u
#define FEC_RMON_T_MC_PKT_RMON_T_MC_PKT(x)       (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_MC_PKT_RMON_T_MC_PKT_SHIFT))&FEC_RMON_T_MC_PKT_RMON_T_MC_PKT_MASK)
/* RMON_T_CRC_ALIGN Bit Fields */
#define FEC_RMON_T_CRC_ALIGN_RMON_T_CRC_ALIGN_MASK 0xFFFFFFFFu
#define FEC_RMON_T_CRC_ALIGN_RMON_T_CRC_ALIGN_SHIFT 0u
#define FEC_RMON_T_CRC_ALIGN_RMON_T_CRC_ALIGN_WIDTH 32u
#define FEC_RMON_T_CRC_ALIGN_RMON_T_CRC_ALIGN(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_CRC_ALIGN_RMON_T_CRC_ALIGN_SHIFT))&FEC_RMON_T_CRC_ALIGN_RMON_T_CRC_ALIGN_MASK)
/* RMON_T_UNDERSIZE Bit Fields */
#define FEC_RMON_T_UNDERSIZE_RMON_T_UNDERSIZE_MASK 0xFFFFFFFFu
#define FEC_RMON_T_UNDERSIZE_RMON_T_UNDERSIZE_SHIFT 0u
#define FEC_RMON_T_UNDERSIZE_RMON_T_UNDERSIZE_WIDTH 32u
#define FEC_RMON_T_UNDERSIZE_RMON_T_UNDERSIZE(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_UNDERSIZE_RMON_T_UNDERSIZE_SHIFT))&FEC_RMON_T_UNDERSIZE_RMON_T_UNDERSIZE_MASK)
