neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* RMON_T_OVERSIZE Bit Fields */
#define FEC_RMON_T_OVERSIZE_RMON_T_OVERSIZE_MASK 0xFFFFFFFFu
#define FEC_RMON_T_OVERSIZE_RMON_T_OVERSIZE_SHIFT 0u
#define FEC_RMON_T_OVERSIZE_RMON_T_OVERSIZE_WIDTH 32u
#define FEC_RMON_T_OVERSIZE_RMON_T_OVERSIZE(x)   (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_OVERSIZE_RMON_T_OVERSIZE_SHIFT))&FEC_RMON_T_OVERSIZE_RMON_T_OVERSIZE_MASK)
/* RMON_T_FRAG Bit Fields */
#define FEC_RMON_T_FRAG_RMON_T_FRAG_MASK         0xFFFFFFFFu
#define FEC_RMON_T_FRAG_RMON_T_FRAG_SHIFT        0u
#define FEC_RMON_T_FRAG_RMON_T_FRAG_WIDTH        32u
#define FEC_RMON_T_FRAG_RMON_T_FRAG(x)           (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_FRAG_RMON_T_FRAG_SHIFT))&FEC_RMON_T_FRAG_RMON_T_FRAG_MASK)
/* RMON_T_JAB Bit Fields */
#define FEC_RMON_T_JAB_RMON_T_JAB_MASK           0xFFFFFFFFu
#define FEC_RMON_T_JAB_RMON_T_JAB_SHIFT          0u
#define FEC_RMON_T_JAB_RMON_T_JAB_WIDTH          32u
#define FEC_RMON_T_JAB_RMON_T_JAB(x)             (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_JAB_RMON_T_JAB_SHIFT))&FEC_RMON_T_JAB_RMON_T_JAB_MASK)
/* RMON_T_COL Bit Fields */
#define FEC_RMON_T_COL_RMON_T_COL_MASK           0xFFFFFFFFu
#define FEC_RMON_T_COL_RMON_T_COL_SHIFT          0u
#define FEC_RMON_T_COL_RMON_T_COL_WIDTH          32u
#define FEC_RMON_T_COL_RMON_T_COL(x)             (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_COL_RMON_T_COL_SHIFT))&FEC_RMON_T_COL_RMON_T_COL_MASK)
/* RMON_T_P64 Bit Fields */
#define FEC_RMON_T_P64_RMON_T_P64_MASK           0xFFFFFFFFu
#define FEC_RMON_T_P64_RMON_T_P64_SHIFT          0u
#define FEC_RMON_T_P64_RMON_T_P64_WIDTH          32u
#define FEC_RMON_T_P64_RMON_T_P64(x)             (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P64_RMON_T_P64_SHIFT))&FEC_RMON_T_P64_RMON_T_P64_MASK)
/* RMON_T_P65TO127 Bit Fields */
#define FEC_RMON_T_P65TO127_RMON_T_P65TO127_MASK 0xFFFFFFFFu
#define FEC_RMON_T_P65TO127_RMON_T_P65TO127_SHIFT 0u
#define FEC_RMON_T_P65TO127_RMON_T_P65TO127_WIDTH 32u
#define FEC_RMON_T_P65TO127_RMON_T_P65TO127(x)   (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P65TO127_RMON_T_P65TO127_SHIFT))&FEC_RMON_T_P65TO127_RMON_T_P65TO127_MASK)
/* RMON_T_P128TO255 Bit Fields */
#define FEC_RMON_T_P128TO255_RMON_T_P128TO255_MASK 0xFFFFFFFFu
#define FEC_RMON_T_P128TO255_RMON_T_P128TO255_SHIFT 0u
#define FEC_RMON_T_P128TO255_RMON_T_P128TO255_WIDTH 32u
#define FEC_RMON_T_P128TO255_RMON_T_P128TO255(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P128TO255_RMON_T_P128TO255_SHIFT))&FEC_RMON_T_P128TO255_RMON_T_P128TO255_MASK)
/* RMON_T_P256TO511 Bit Fields */
#define FEC_RMON_T_P256TO511_RMON_T_P256TO511_MASK 0xFFFFFFFFu
#define FEC_RMON_T_P256TO511_RMON_T_P256TO511_SHIFT 0u
#define FEC_RMON_T_P256TO511_RMON_T_P256TO511_WIDTH 32u
#define FEC_RMON_T_P256TO511_RMON_T_P256TO511(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P256TO511_RMON_T_P256TO511_SHIFT))&FEC_RMON_T_P256TO511_RMON_T_P256TO511_MASK)
/* RMON_T_P512TO1023 Bit Fields */
#define FEC_RMON_T_P512TO1023_RMON_T_P512TO1023_MASK 0xFFFFFFFFu
#define FEC_RMON_T_P512TO1023_RMON_T_P512TO1023_SHIFT 0u
#define FEC_RMON_T_P512TO1023_RMON_T_P512TO1023_WIDTH 32u
#define FEC_RMON_T_P512TO1023_RMON_T_P512TO1023(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P512TO1023_RMON_T_P512TO1023_SHIFT))&FEC_RMON_T_P512TO1023_RMON_T_P512TO1023_MASK)
/* RMON_T_P1024TO2047 Bit Fields */
#define FEC_RMON_T_P1024TO2047_RMON_T_P1024TO2047_MASK 0xFFFFFFFFu
#define FEC_RMON_T_P1024TO2047_RMON_T_P1024TO2047_SHIFT 0u
#define FEC_RMON_T_P1024TO2047_RMON_T_P1024TO2047_WIDTH 32u
#define FEC_RMON_T_P1024TO2047_RMON_T_P1024TO2047(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P1024TO2047_RMON_T_P1024TO2047_SHIFT))&FEC_RMON_T_P1024TO2047_RMON_T_P1024TO2047_MASK)
/* RMON_T_P_GTE2048 Bit Fields */
#define FEC_RMON_T_P_GTE2048_RMON_T_P_GTE2048_MASK 0xFFFFFFFFu
#define FEC_RMON_T_P_GTE2048_RMON_T_P_GTE2048_SHIFT 0u
#define FEC_RMON_T_P_GTE2048_RMON_T_P_GTE2048_WIDTH 32u
#define FEC_RMON_T_P_GTE2048_RMON_T_P_GTE2048(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_P_GTE2048_RMON_T_P_GTE2048_SHIFT))&FEC_RMON_T_P_GTE2048_RMON_T_P_GTE2048_MASK)
/* RMON_T_OCTETS Bit Fields */
#define FEC_RMON_T_OCTETS_RMON_T_OCTETS_MASK     0xFFFFFFFFu
#define FEC_RMON_T_OCTETS_RMON_T_OCTETS_SHIFT    0u
#define FEC_RMON_T_OCTETS_RMON_T_OCTETS_WIDTH    32u
#define FEC_RMON_T_OCTETS_RMON_T_OCTETS(x)       (((uint32_t)(((uint32_t)(x))<<FEC_RMON_T_OCTETS_RMON_T_OCTETS_SHIFT))&FEC_RMON_T_OCTETS_RMON_T_OCTETS_MASK)
/* IEEE_T_DROP Bit Fields */
#define FEC_IEEE_T_DROP_IEEE_T_DROP_MASK         0xFFFFFFFFu
#define FEC_IEEE_T_DROP_IEEE_T_DROP_SHIFT        0u
#define FEC_IEEE_T_DROP_IEEE_T_DROP_WIDTH        32u
#define FEC_IEEE_T_DROP_IEEE_T_DROP(x)           (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_DROP_IEEE_T_DROP_SHIFT))&FEC_IEEE_T_DROP_IEEE_T_DROP_MASK)
/* IEEE_T_FRAME_OK Bit Fields */
#define FEC_IEEE_T_FRAME_OK_IEEE_T_FRAME_OK_MASK 0xFFFFFFFFu
#define FEC_IEEE_T_FRAME_OK_IEEE_T_FRAME_OK_SHIFT 0u
#define FEC_IEEE_T_FRAME_OK_IEEE_T_FRAME_OK_WIDTH 32u
#define FEC_IEEE_T_FRAME_OK_IEEE_T_FRAME_OK(x)   (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_FRAME_OK_IEEE_T_FRAME_OK_SHIFT))&FEC_IEEE_T_FRAME_OK_IEEE_T_FRAME_OK_MASK)
/* IEEE_T_1COL Bit Fields */
#define FEC_IEEE_T_1COL_IEEE_T_1COL_MASK         0xFFFFFFFFu
#define FEC_IEEE_T_1COL_IEEE_T_1COL_SHIFT        0u
#define FEC_IEEE_T_1COL_IEEE_T_1COL_WIDTH        32u
#define FEC_IEEE_T_1COL_IEEE_T_1COL(x)           (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_1COL_IEEE_T_1COL_SHIFT))&FEC_IEEE_T_1COL_IEEE_T_1COL_MASK)
/* IEEE_T_MCOL Bit Fields */
#define FEC_IEEE_T_MCOL_IEEE_T_MCOL_MASK         0xFFFFFFFFu
#define FEC_IEEE_T_MCOL_IEEE_T_MCOL_SHIFT        0u
#define FEC_IEEE_T_MCOL_IEEE_T_MCOL_WIDTH        32u
#define FEC_IEEE_T_MCOL_IEEE_T_MCOL(x)           (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_MCOL_IEEE_T_MCOL_SHIFT))&FEC_IEEE_T_MCOL_IEEE_T_MCOL_MASK)
/* IEEE_T_DEF Bit Fields */
#define FEC_IEEE_T_DEF_IEEE_T_DEF_MASK           0xFFFFFFFFu
#define FEC_IEEE_T_DEF_IEEE_T_DEF_SHIFT          0u
#define FEC_IEEE_T_DEF_IEEE_T_DEF_WIDTH          32u
#define FEC_IEEE_T_DEF_IEEE_T_DEF(x)             (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_DEF_IEEE_T_DEF_SHIFT))&FEC_IEEE_T_DEF_IEEE_T_DEF_MASK)
/* IEEE_T_LCOL Bit Fields */
#define FEC_IEEE_T_LCOL_IEEE_T_LCOL_MASK         0xFFFFFFFFu
#define FEC_IEEE_T_LCOL_IEEE_T_LCOL_SHIFT        0u
#define FEC_IEEE_T_LCOL_IEEE_T_LCOL_WIDTH        32u
#define FEC_IEEE_T_LCOL_IEEE_T_LCOL(x)           (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_LCOL_IEEE_T_LCOL_SHIFT))&FEC_IEEE_T_LCOL_IEEE_T_LCOL_MASK)
/* IEEE_T_EXCOL Bit Fields */
#define FEC_IEEE_T_EXCOL_IEEE_T_EXCOL_MASK       0xFFFFFFFFu
#define FEC_IEEE_T_EXCOL_IEEE_T_EXCOL_SHIFT      0u
#define FEC_IEEE_T_EXCOL_IEEE_T_EXCOL_WIDTH      32u
#define FEC_IEEE_T_EXCOL_IEEE_T_EXCOL(x)         (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_EXCOL_IEEE_T_EXCOL_SHIFT))&FEC_IEEE_T_EXCOL_IEEE_T_EXCOL_MASK)
/* IEEE_T_MACERR Bit Fields */
#define FEC_IEEE_T_MACERR_IEEE_T_MACERR_MASK     0xFFFFFFFFu
#define FEC_IEEE_T_MACERR_IEEE_T_MACERR_SHIFT    0u
#define FEC_IEEE_T_MACERR_IEEE_T_MACERR_WIDTH    32u
#define FEC_IEEE_T_MACERR_IEEE_T_MACERR(x)       (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_MACERR_IEEE_T_MACERR_SHIFT))&FEC_IEEE_T_MACERR_IEEE_T_MACERR_MASK)
/* IEEE_T_CSERR Bit Fields */
#define FEC_IEEE_T_CSERR_IEEE_T_CSERR_MASK       0xFFFFFFFFu
#define FEC_IEEE_T_CSERR_IEEE_T_CSERR_SHIFT      0u
#define FEC_IEEE_T_CSERR_IEEE_T_CSERR_WIDTH      32u
#define FEC_IEEE_T_CSERR_IEEE_T_CSERR(x)         (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_CSERR_IEEE_T_CSERR_SHIFT))&FEC_IEEE_T_CSERR_IEEE_T_CSERR_MASK)
/* IEEE_T_SQE Bit Fields */
#define FEC_IEEE_T_SQE_IEEE_T_SQE_MASK           0xFFFFFFFFu
#define FEC_IEEE_T_SQE_IEEE_T_SQE_SHIFT          0u
#define FEC_IEEE_T_SQE_IEEE_T_SQE_WIDTH          32u
#define FEC_IEEE_T_SQE_IEEE_T_SQE(x)             (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_SQE_IEEE_T_SQE_SHIFT))&FEC_IEEE_T_SQE_IEEE_T_SQE_MASK)
/* IEEE_T_FDXFC Bit Fields */
#define FEC_IEEE_T_FDXFC_IEEE_T_FDXFC_MASK       0xFFFFFFFFu
#define FEC_IEEE_T_FDXFC_IEEE_T_FDXFC_SHIFT      0u
#define FEC_IEEE_T_FDXFC_IEEE_T_FDXFC_WIDTH      32u
#define FEC_IEEE_T_FDXFC_IEEE_T_FDXFC(x)         (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_FDXFC_IEEE_T_FDXFC_SHIFT))&FEC_IEEE_T_FDXFC_IEEE_T_FDXFC_MASK)
/* IEEE_T_OCTETS_OK Bit Fields */
#define FEC_IEEE_T_OCTETS_OK_IEEE_T_OCTETS_OK_MASK 0xFFFFFFFFu
#define FEC_IEEE_T_OCTETS_OK_IEEE_T_OCTETS_OK_SHIFT 0u
#define FEC_IEEE_T_OCTETS_OK_IEEE_T_OCTETS_OK_WIDTH 32u
#define FEC_IEEE_T_OCTETS_OK_IEEE_T_OCTETS_OK(x) (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_T_OCTETS_OK_IEEE_T_OCTETS_OK_SHIFT))&FEC_IEEE_T_OCTETS_OK_IEEE_T_OCTETS_OK_MASK)
/* RMON_R_DROP Bit Fields */
#define FEC_RMON_R_DROP_RMON_R_DROP_MASK         0xFFFFFFFFu
#define FEC_RMON_R_DROP_RMON_R_DROP_SHIFT        0u
#define FEC_RMON_R_DROP_RMON_R_DROP_WIDTH        32u
#define FEC_RMON_R_DROP_RMON_R_DROP(x)           (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_DROP_RMON_R_DROP_SHIFT))&FEC_RMON_R_DROP_RMON_R_DROP_MASK)
/* RMON_R_PACKETS Bit Fields */
#define FEC_RMON_R_PACKETS_RMON_R_PACKETS_MASK   0xFFFFFFFFu
#define FEC_RMON_R_PACKETS_RMON_R_PACKETS_SHIFT  0u
#define FEC_RMON_R_PACKETS_RMON_R_PACKETS_WIDTH  32u
#define FEC_RMON_R_PACKETS_RMON_R_PACKETS(x)     (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_PACKETS_RMON_R_PACKETS_SHIFT))&FEC_RMON_R_PACKETS_RMON_R_PACKETS_MASK)
/* RMON_R_BC_PKT Bit Fields */
#define FEC_RMON_R_BC_PKT_RMON_R_BC_PKT_MASK     0xFFFFFFFFu
#define FEC_RMON_R_BC_PKT_RMON_R_BC_PKT_SHIFT    0u
#define FEC_RMON_R_BC_PKT_RMON_R_BC_PKT_WIDTH    32u
#define FEC_RMON_R_BC_PKT_RMON_R_BC_PKT(x)       (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_BC_PKT_RMON_R_BC_PKT_SHIFT))&FEC_RMON_R_BC_PKT_RMON_R_BC_PKT_MASK)
/* RMON_R_MC_PKT Bit Fields */
#define FEC_RMON_R_MC_PKT_RMON_R_MC_PKT_MASK     0xFFFFFFFFu
#define FEC_RMON_R_MC_PKT_RMON_R_MC_PKT_SHIFT    0u
#define FEC_RMON_R_MC_PKT_RMON_R_MC_PKT_WIDTH    32u
#define FEC_RMON_R_MC_PKT_RMON_R_MC_PKT(x)       (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_MC_PKT_RMON_R_MC_PKT_SHIFT))&FEC_RMON_R_MC_PKT_RMON_R_MC_PKT_MASK)
/* RMON_R_CRC_ALIGN Bit Fields */
#define FEC_RMON_R_CRC_ALIGN_RMON_R_CRC_ALIGN_MASK 0xFFFFFFFFu
#define FEC_RMON_R_CRC_ALIGN_RMON_R_CRC_ALIGN_SHIFT 0u
#define FEC_RMON_R_CRC_ALIGN_RMON_R_CRC_ALIGN_WIDTH 32u
#define FEC_RMON_R_CRC_ALIGN_RMON_R_CRC_ALIGN(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_CRC_ALIGN_RMON_R_CRC_ALIGN_SHIFT))&FEC_RMON_R_CRC_ALIGN_RMON_R_CRC_ALIGN_MASK)
/* RMON_R_UNDERSIZE Bit Fields */
#define FEC_RMON_R_UNDERSIZE_RMON_R_UNDERSIZE_MASK 0xFFFFFFFFu
#define FEC_RMON_R_UNDERSIZE_RMON_R_UNDERSIZE_SHIFT 0u
#define FEC_RMON_R_UNDERSIZE_RMON_R_UNDERSIZE_WIDTH 32u
#define FEC_RMON_R_UNDERSIZE_RMON_R_UNDERSIZE(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_UNDERSIZE_RMON_R_UNDERSIZE_SHIFT))&FEC_RMON_R_UNDERSIZE_RMON_R_UNDERSIZE_MASK)
/* RMON_R_OVERSIZE Bit Fields */
#define FEC_RMON_R_OVERSIZE_RMON_R_OVERSIZE_MASK 0xFFFFFFFFu
#define FEC_RMON_R_OVERSIZE_RMON_R_OVERSIZE_SHIFT 0u
#define FEC_RMON_R_OVERSIZE_RMON_R_OVERSIZE_WIDTH 32u
#define FEC_RMON_R_OVERSIZE_RMON_R_OVERSIZE(x)   (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_OVERSIZE_RMON_R_OVERSIZE_SHIFT))&FEC_RMON_R_OVERSIZE_RMON_R_OVERSIZE_MASK)
/* RMON_R_FRAG Bit Fields */
#define FEC_RMON_R_FRAG_RMON_R_FRAG_MASK         0xFFFFFFFFu
#define FEC_RMON_R_FRAG_RMON_R_FRAG_SHIFT        0u
#define FEC_RMON_R_FRAG_RMON_R_FRAG_WIDTH        32u
#define FEC_RMON_R_FRAG_RMON_R_FRAG(x)           (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_FRAG_RMON_R_FRAG_SHIFT))&FEC_RMON_R_FRAG_RMON_R_FRAG_MASK)
/* RMON_R_JAB Bit Fields */
#define FEC_RMON_R_JAB_RMON_R_JAB_MASK           0xFFFFFFFFu
#define FEC_RMON_R_JAB_RMON_R_JAB_SHIFT          0u
#define FEC_RMON_R_JAB_RMON_R_JAB_WIDTH          32u
#define FEC_RMON_R_JAB_RMON_R_JAB(x)             (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_JAB_RMON_R_JAB_SHIFT))&FEC_RMON_R_JAB_RMON_R_JAB_MASK)
/* RMON_R_RESVD_0 Bit Fields */
#define FEC_RMON_R_RESVD_0_RMON_R_RESVD_0_MASK   0xFFFFFFFFu
#define FEC_RMON_R_RESVD_0_RMON_R_RESVD_0_SHIFT  0u
#define FEC_RMON_R_RESVD_0_RMON_R_RESVD_0_WIDTH  32u
#define FEC_RMON_R_RESVD_0_RMON_R_RESVD_0(x)     (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_RESVD_0_RMON_R_RESVD_0_SHIFT))&FEC_RMON_R_RESVD_0_RMON_R_RESVD_0_MASK)
/* RMON_R_P64 Bit Fields */
#define FEC_RMON_R_P64_RMON_R_P64_MASK           0xFFFFFFFFu
#define FEC_RMON_R_P64_RMON_R_P64_SHIFT          0u
#define FEC_RMON_R_P64_RMON_R_P64_WIDTH          32u
#define FEC_RMON_R_P64_RMON_R_P64(x)             (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P64_RMON_R_P64_SHIFT))&FEC_RMON_R_P64_RMON_R_P64_MASK)
/* RMON_R_P65TO127 Bit Fields */
#define FEC_RMON_R_P65TO127_RMON_R_P65TO127_MASK 0xFFFFFFFFu
#define FEC_RMON_R_P65TO127_RMON_R_P65TO127_SHIFT 0u
#define FEC_RMON_R_P65TO127_RMON_R_P65TO127_WIDTH 32u
#define FEC_RMON_R_P65TO127_RMON_R_P65TO127(x)   (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P65TO127_RMON_R_P65TO127_SHIFT))&FEC_RMON_R_P65TO127_RMON_R_P65TO127_MASK)
/* RMON_R_P128TO255 Bit Fields */
#define FEC_RMON_R_P128TO255_RMON_R_P128TO255_MASK 0xFFFFFFFFu
#define FEC_RMON_R_P128TO255_RMON_R_P128TO255_SHIFT 0u
#define FEC_RMON_R_P128TO255_RMON_R_P128TO255_WIDTH 32u
#define FEC_RMON_R_P128TO255_RMON_R_P128TO255(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P128TO255_RMON_R_P128TO255_SHIFT))&FEC_RMON_R_P128TO255_RMON_R_P128TO255_MASK)
/* RMON_R_P256TO511 Bit Fields */
#define FEC_RMON_R_P256TO511_RMON_R_P256TO511_MASK 0xFFFFFFFFu
#define FEC_RMON_R_P256TO511_RMON_R_P256TO511_SHIFT 0u
#define FEC_RMON_R_P256TO511_RMON_R_P256TO511_WIDTH 32u
#define FEC_RMON_R_P256TO511_RMON_R_P256TO511(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P256TO511_RMON_R_P256TO511_SHIFT))&FEC_RMON_R_P256TO511_RMON_R_P256TO511_MASK)
/* RMON_R_P512TO1023 Bit Fields */
#define FEC_RMON_R_P512TO1023_RMON_R_P512TO1023_MASK 0xFFFFFFFFu
#define FEC_RMON_R_P512TO1023_RMON_R_P512TO1023_SHIFT 0u
#define FEC_RMON_R_P512TO1023_RMON_R_P512TO1023_WIDTH 32u
#define FEC_RMON_R_P512TO1023_RMON_R_P512TO1023(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P512TO1023_RMON_R_P512TO1023_SHIFT))&FEC_RMON_R_P512TO1023_RMON_R_P512TO1023_MASK)
/* RMON_R_P1024TO2047 Bit Fields */
#define FEC_RMON_R_P1024TO2047_RMON_R_P1024TO2047_MASK 0xFFFFFFFFu
#define FEC_RMON_R_P1024TO2047_RMON_R_P1024TO2047_SHIFT 0u
#define FEC_RMON_R_P1024TO2047_RMON_R_P1024TO2047_WIDTH 32u
#define FEC_RMON_R_P1024TO2047_RMON_R_P1024TO2047(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P1024TO2047_RMON_R_P1024TO2047_SHIFT))&FEC_RMON_R_P1024TO2047_RMON_R_P1024TO2047_MASK)
/* RMON_R_P_GTE2048 Bit Fields */
#define FEC_RMON_R_P_GTE2048_RMON_R_P_GTE2048_MASK 0xFFFFFFFFu
#define FEC_RMON_R_P_GTE2048_RMON_R_P_GTE2048_SHIFT 0u
#define FEC_RMON_R_P_GTE2048_RMON_R_P_GTE2048_WIDTH 32u
#define FEC_RMON_R_P_GTE2048_RMON_R_P_GTE2048(x) (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_P_GTE2048_RMON_R_P_GTE2048_SHIFT))&FEC_RMON_R_P_GTE2048_RMON_R_P_GTE2048_MASK)
/* RMON_R_OCTETS Bit Fields */
#define FEC_RMON_R_OCTETS_RMON_R_OCTETS_MASK     0xFFFFFFFFu
#define FEC_RMON_R_OCTETS_RMON_R_OCTETS_SHIFT    0u
#define FEC_RMON_R_OCTETS_RMON_R_OCTETS_WIDTH    32u
#define FEC_RMON_R_OCTETS_RMON_R_OCTETS(x)       (((uint32_t)(((uint32_t)(x))<<FEC_RMON_R_OCTETS_RMON_R_OCTETS_SHIFT))&FEC_RMON_R_OCTETS_RMON_R_OCTETS_MASK)
/* IEEE_R_DROP Bit Fields */
#define FEC_IEEE_R_DROP_IEEE_R_DROP_MASK         0xFFFFFFFFu
#define FEC_IEEE_R_DROP_IEEE_R_DROP_SHIFT        0u
#define FEC_IEEE_R_DROP_IEEE_R_DROP_WIDTH        32u
#define FEC_IEEE_R_DROP_IEEE_R_DROP(x)           (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_DROP_IEEE_R_DROP_SHIFT))&FEC_IEEE_R_DROP_IEEE_R_DROP_MASK)
/* IEEE_R_FRAME_OK Bit Fields */
#define FEC_IEEE_R_FRAME_OK_IEEE_R_FRAME_OK_MASK 0xFFFFFFFFu
#define FEC_IEEE_R_FRAME_OK_IEEE_R_FRAME_OK_SHIFT 0u
#define FEC_IEEE_R_FRAME_OK_IEEE_R_FRAME_OK_WIDTH 32u
#define FEC_IEEE_R_FRAME_OK_IEEE_R_FRAME_OK(x)   (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_FRAME_OK_IEEE_R_FRAME_OK_SHIFT))&FEC_IEEE_R_FRAME_OK_IEEE_R_FRAME_OK_MASK)
/* IEEE_R_CRC Bit Fields */
#define FEC_IEEE_R_CRC_IEEE_R_CRC_MASK           0xFFFFFFFFu
#define FEC_IEEE_R_CRC_IEEE_R_CRC_SHIFT          0u
#define FEC_IEEE_R_CRC_IEEE_R_CRC_WIDTH          32u
#define FEC_IEEE_R_CRC_IEEE_R_CRC(x)             (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_CRC_IEEE_R_CRC_SHIFT))&FEC_IEEE_R_CRC_IEEE_R_CRC_MASK)
/* IEEE_R_ALIGN Bit Fields */
#define FEC_IEEE_R_ALIGN_IEEE_R_ALIGN_MASK       0xFFFFFFFFu
#define FEC_IEEE_R_ALIGN_IEEE_R_ALIGN_SHIFT      0u
#define FEC_IEEE_R_ALIGN_IEEE_R_ALIGN_WIDTH      32u
#define FEC_IEEE_R_ALIGN_IEEE_R_ALIGN(x)         (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_ALIGN_IEEE_R_ALIGN_SHIFT))&FEC_IEEE_R_ALIGN_IEEE_R_ALIGN_MASK)
/* IEEE_R_MACERR Bit Fields */
#define FEC_IEEE_R_MACERR_IEEE_R_MACERR_MASK     0xFFFFFFFFu
#define FEC_IEEE_R_MACERR_IEEE_R_MACERR_SHIFT    0u
#define FEC_IEEE_R_MACERR_IEEE_R_MACERR_WIDTH    32u
#define FEC_IEEE_R_MACERR_IEEE_R_MACERR(x)       (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_MACERR_IEEE_R_MACERR_SHIFT))&FEC_IEEE_R_MACERR_IEEE_R_MACERR_MASK)
/* IEEE_R_FDXFC Bit Fields */
#define FEC_IEEE_R_FDXFC_IEEE_R_FDXFC_MASK       0xFFFFFFFFu
#define FEC_IEEE_R_FDXFC_IEEE_R_FDXFC_SHIFT      0u
#define FEC_IEEE_R_FDXFC_IEEE_R_FDXFC_WIDTH      32u
#define FEC_IEEE_R_FDXFC_IEEE_R_FDXFC(x)         (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_FDXFC_IEEE_R_FDXFC_SHIFT))&FEC_IEEE_R_FDXFC_IEEE_R_FDXFC_MASK)
/* IEEE_R_OCTETS_OK Bit Fields */
#define FEC_IEEE_R_OCTETS_OK_IEEE_R_OCTETS_OK_MASK 0xFFFFFFFFu
#define FEC_IEEE_R_OCTETS_OK_IEEE_R_OCTETS_OK_SHIFT 0u
#define FEC_IEEE_R_OCTETS_OK_IEEE_R_OCTETS_OK_WIDTH 32u
#define FEC_IEEE_R_OCTETS_OK_IEEE_R_OCTETS_OK(x) (((uint32_t)(((uint32_t)(x))<<FEC_IEEE_R_OCTETS_OK_IEEE_R_OCTETS_OK_SHIFT))&FEC_IEEE_R_OCTETS_OK_IEEE_R_OCTETS_OK_MASK)

/*!
 * @}
 */ /* end of group FEC_Register_Masks */


/*!
 * @}
 */ /* end of group FEC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- IGF Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IGF_Peripheral_Access_Layer IGF Peripheral Access Layer
 * @{
 */


