neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** IGF - Size of Registers Arrays */
#define IGF_CHa_COUNT                            31u
#define IGF_CHb_COUNT                            13u

/** IGF - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR_CH0;                           /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t MSR_CH0;                           /**< Module Status Register, offset: 0x4 */
       uint8_t RESERVED_0[8];
  __IO uint32_t PRESR_CH0;                         /**< Prescaler Register, offset: 0x10 */
       uint8_t RESERVED_1[8];
  __IO uint32_t RTHR_CH0;                          /**< Rising edge Threshold Register, offset: 0x1C */
  __IO uint32_t FTHR;                              /**< Falling edge Threshold Register, offset: 0x20 */
       uint8_t RESERVED_2[28];
  struct {                                         /* offset: 0x40, array step: 0x40 */
    __IO uint32_t MCR;                               /**< Module Configuration Register, array offset: 0x40, array step: 0x40 */
    __IO uint32_t MSR;                               /**< Module Status Register, array offset: 0x44, array step: 0x40 */
         uint8_t RESERVED_0[20];
    __IO uint32_t RTHR;                              /**< Rising edge Threshold Register, array offset: 0x5C, array step: 0x40 */
         uint8_t RESERVED_1[32];
  } CHa[IGF_CHa_COUNT];
  __IO uint32_t MCR_CH32;                          /**< Module Configuration Register, offset: 0x800 */
  __IO uint32_t MSR_CH32;                          /**< Module Status Register, offset: 0x804 */
       uint8_t RESERVED_3[8];
  __IO uint32_t PRESR_CH32;                        /**< Prescaler Register, offset: 0x810 */
       uint8_t RESERVED_4[8];
  __IO uint32_t RTHR_CH32;                         /**< Rising edge Threshold Register, offset: 0x81C */
       uint8_t RESERVED_5[32];
  struct {                                         /* offset: 0x840, array step: 0x40 */
    __IO uint32_t MCR;                               /**< Module Configuration Register, array offset: 0x840, array step: 0x40 */
    __IO uint32_t MSR;                               /**< Module Status Register, array offset: 0x844, array step: 0x40 */
         uint8_t RESERVED_0[20];
    __IO uint32_t RTHR;                              /**< Rising edge Threshold Register, array offset: 0x85C, array step: 0x40 */
         uint8_t RESERVED_1[32];
  } CHb[IGF_CHb_COUNT];
} IGF_Type, *IGF_MemMapPtr;

 /** Number of instances of the IGF module. */
#define IGF_INSTANCE_COUNT                       (2u)


/* IGF - Peripheral instance base addresses */
/** Peripheral IGF_0 base address */
#define IGF_0_BASE                               (0xFFE20000u)
/** Peripheral IGF_0 base pointer */
#define IGF_0                                    ((IGF_Type *)IGF_0_BASE)
/** Peripheral IGF_1 base address */
#define IGF_1_BASE                               (0xC3E04000u)
/** Peripheral IGF_1 base pointer */
#define IGF_1                                    ((IGF_Type *)IGF_1_BASE)
/** Array initializer of IGF peripheral base addresses */
#define IGF_BASE_ADDRS                           { IGF_0_BASE, IGF_1_BASE }
/** Array initializer of IGF peripheral base pointers */
#define IGF_BASE_PTRS                            { IGF_0, IGF_1 }

/* ----------------------------------------------------------------------------
   -- IGF Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IGF_Register_Masks IGF Register Masks
 * @{
 */

/* MCR_CH0 Bit Fields */
#define IGF_MCR_CH0_RFM_MASK                     0x3u
#define IGF_MCR_CH0_RFM_SHIFT                    0u
#define IGF_MCR_CH0_RFM_WIDTH                    2u
#define IGF_MCR_CH0_RFM(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_RFM_SHIFT))&IGF_MCR_CH0_RFM_MASK)
#define IGF_MCR_CH0_FFM_MASK                     0x18u
#define IGF_MCR_CH0_FFM_SHIFT                    3u
#define IGF_MCR_CH0_FFM_WIDTH                    2u
#define IGF_MCR_CH0_FFM(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_FFM_SHIFT))&IGF_MCR_CH0_FFM_MASK)
#define IGF_MCR_CH0_FGEN_MASK                    0x40u
#define IGF_MCR_CH0_FGEN_SHIFT                   6u
#define IGF_MCR_CH0_FGEN_WIDTH                   1u
#define IGF_MCR_CH0_FGEN(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_FGEN_SHIFT))&IGF_MCR_CH0_FGEN_MASK)
#define IGF_MCR_CH0_POL_MASK                     0x80u
#define IGF_MCR_CH0_POL_SHIFT                    7u
#define IGF_MCR_CH0_POL_WIDTH                    1u
#define IGF_MCR_CH0_POL(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_POL_SHIFT))&IGF_MCR_CH0_POL_MASK)
#define IGF_MCR_CH0_PSSEL_MASK                   0x100u
#define IGF_MCR_CH0_PSSEL_SHIFT                  8u
#define IGF_MCR_CH0_PSSEL_WIDTH                  1u
#define IGF_MCR_CH0_PSSEL(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_PSSEL_SHIFT))&IGF_MCR_CH0_PSSEL_MASK)
#define IGF_MCR_CH0_IMM_MASK                     0x200u
#define IGF_MCR_CH0_IMM_SHIFT                    9u
#define IGF_MCR_CH0_IMM_WIDTH                    1u
#define IGF_MCR_CH0_IMM(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_IMM_SHIFT))&IGF_MCR_CH0_IMM_MASK)
#define IGF_MCR_CH0_FOL_MASK                     0x4000000u
#define IGF_MCR_CH0_FOL_SHIFT                    26u
#define IGF_MCR_CH0_FOL_WIDTH                    1u
#define IGF_MCR_CH0_FOL(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_FOL_SHIFT))&IGF_MCR_CH0_FOL_MASK)
#define IGF_MCR_CH0_FOH_MASK                     0x8000000u
#define IGF_MCR_CH0_FOH_SHIFT                    27u
#define IGF_MCR_CH0_FOH_WIDTH                    1u
#define IGF_MCR_CH0_FOH(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_FOH_SHIFT))&IGF_MCR_CH0_FOH_MASK)
#define IGF_MCR_CH0_FBP_MASK                     0x10000000u
#define IGF_MCR_CH0_FBP_SHIFT                    28u
#define IGF_MCR_CH0_FBP_WIDTH                    1u
#define IGF_MCR_CH0_FBP(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_FBP_SHIFT))&IGF_MCR_CH0_FBP_MASK)
#define IGF_MCR_CH0_FRZ_MASK                     0x20000000u
#define IGF_MCR_CH0_FRZ_SHIFT                    29u
#define IGF_MCR_CH0_FRZ_WIDTH                    1u
#define IGF_MCR_CH0_FRZ(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_FRZ_SHIFT))&IGF_MCR_CH0_FRZ_MASK)
#define IGF_MCR_CH0_MDIS_MASK                    0x40000000u
#define IGF_MCR_CH0_MDIS_SHIFT                   30u
#define IGF_MCR_CH0_MDIS_WIDTH                   1u
#define IGF_MCR_CH0_MDIS(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH0_MDIS_SHIFT))&IGF_MCR_CH0_MDIS_MASK)
/* MSR_CH0 Bit Fields */
#define IGF_MSR_CH0_FLO_MASK                     0x1u
#define IGF_MSR_CH0_FLO_SHIFT                    0u
#define IGF_MSR_CH0_FLO_WIDTH                    1u
#define IGF_MSR_CH0_FLO(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH0_FLO_SHIFT))&IGF_MSR_CH0_FLO_MASK)
#define IGF_MSR_CH0_FLI_MASK                     0x2u
#define IGF_MSR_CH0_FLI_SHIFT                    1u
#define IGF_MSR_CH0_FLI_WIDTH                    1u
#define IGF_MSR_CH0_FLI(x)                       (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH0_FLI_SHIFT))&IGF_MSR_CH0_FLI_MASK)
#define IGF_MSR_CH0_FNDET_MASK                   0x4u
#define IGF_MSR_CH0_FNDET_SHIFT                  2u
#define IGF_MSR_CH0_FNDET_WIDTH                  1u
#define IGF_MSR_CH0_FNDET(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH0_FNDET_SHIFT))&IGF_MSR_CH0_FNDET_MASK)
#define IGF_MSR_CH0_RNDET_MASK                   0x8u
#define IGF_MSR_CH0_RNDET_SHIFT                  3u
#define IGF_MSR_CH0_RNDET_WIDTH                  1u
#define IGF_MSR_CH0_RNDET(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH0_RNDET_SHIFT))&IGF_MSR_CH0_RNDET_MASK)
#define IGF_MSR_CH0_FEDGE_MASK                   0x10u
#define IGF_MSR_CH0_FEDGE_SHIFT                  4u
#define IGF_MSR_CH0_FEDGE_WIDTH                  1u
#define IGF_MSR_CH0_FEDGE(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH0_FEDGE_SHIFT))&IGF_MSR_CH0_FEDGE_MASK)
#define IGF_MSR_CH0_WEDGE_MASK                   0x20u
#define IGF_MSR_CH0_WEDGE_SHIFT                  5u
#define IGF_MSR_CH0_WEDGE_WIDTH                  1u
#define IGF_MSR_CH0_WEDGE(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH0_WEDGE_SHIFT))&IGF_MSR_CH0_WEDGE_MASK)
/* PRESR_CH0 Bit Fields */
#define IGF_PRESR_CH0_FPRE_MASK                  0x1FFu
#define IGF_PRESR_CH0_FPRE_SHIFT                 0u
#define IGF_PRESR_CH0_FPRE_WIDTH                 9u
#define IGF_PRESR_CH0_FPRE(x)                    (((uint32_t)(((uint32_t)(x))<<IGF_PRESR_CH0_FPRE_SHIFT))&IGF_PRESR_CH0_FPRE_MASK)
/* RTHR_CH0 Bit Fields */
#define IGF_RTHR_CH0_RTH_MASK                    0xFFFFFFu
#define IGF_RTHR_CH0_RTH_SHIFT                   0u
#define IGF_RTHR_CH0_RTH_WIDTH                   24u
#define IGF_RTHR_CH0_RTH(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_RTHR_CH0_RTH_SHIFT))&IGF_RTHR_CH0_RTH_MASK)
/* FTHR Bit Fields */
#define IGF_FTHR_FTH_MASK                        0xFFFFFFu
#define IGF_FTHR_FTH_SHIFT                       0u
#define IGF_FTHR_FTH_WIDTH                       24u
#define IGF_FTHR_FTH(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_FTHR_FTH_SHIFT))&IGF_FTHR_FTH_MASK)
/* MCR Bit Fields */
#define IGF_MCR_RFM_MASK                         0x3u
#define IGF_MCR_RFM_SHIFT                        0u
#define IGF_MCR_RFM_WIDTH                        2u
#define IGF_MCR_RFM(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_RFM_SHIFT))&IGF_MCR_RFM_MASK)
#define IGF_MCR_FFM_MASK                         0x18u
#define IGF_MCR_FFM_SHIFT                        3u
#define IGF_MCR_FFM_WIDTH                        2u
#define IGF_MCR_FFM(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FFM_SHIFT))&IGF_MCR_FFM_MASK)
#define IGF_MCR_FGEN_MASK                        0x40u
#define IGF_MCR_FGEN_SHIFT                       6u
#define IGF_MCR_FGEN_WIDTH                       1u
#define IGF_MCR_FGEN(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FGEN_SHIFT))&IGF_MCR_FGEN_MASK)
#define IGF_MCR_POL_MASK                         0x80u
#define IGF_MCR_POL_SHIFT                        7u
#define IGF_MCR_POL_WIDTH                        1u
#define IGF_MCR_POL(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_POL_SHIFT))&IGF_MCR_POL_MASK)
#define IGF_MCR_PSSEL_MASK                       0x100u
#define IGF_MCR_PSSEL_SHIFT                      8u
#define IGF_MCR_PSSEL_WIDTH                      1u
#define IGF_MCR_PSSEL(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MCR_PSSEL_SHIFT))&IGF_MCR_PSSEL_MASK)
#define IGF_MCR_IMM_MASK                         0x200u
#define IGF_MCR_IMM_SHIFT                        9u
#define IGF_MCR_IMM_WIDTH                        1u
#define IGF_MCR_IMM(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_IMM_SHIFT))&IGF_MCR_IMM_MASK)
#define IGF_MCR_FOL_MASK                         0x4000000u
#define IGF_MCR_FOL_SHIFT                        26u
#define IGF_MCR_FOL_WIDTH                        1u
#define IGF_MCR_FOL(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FOL_SHIFT))&IGF_MCR_FOL_MASK)
#define IGF_MCR_FOH_MASK                         0x8000000u
#define IGF_MCR_FOH_SHIFT                        27u
#define IGF_MCR_FOH_WIDTH                        1u
#define IGF_MCR_FOH(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FOH_SHIFT))&IGF_MCR_FOH_MASK)
#define IGF_MCR_FBP_MASK                         0x10000000u
#define IGF_MCR_FBP_SHIFT                        28u
#define IGF_MCR_FBP_WIDTH                        1u
#define IGF_MCR_FBP(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FBP_SHIFT))&IGF_MCR_FBP_MASK)
#define IGF_MCR_FRZ_MASK                         0x20000000u
#define IGF_MCR_FRZ_SHIFT                        29u
#define IGF_MCR_FRZ_WIDTH                        1u
#define IGF_MCR_FRZ(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FRZ_SHIFT))&IGF_MCR_FRZ_MASK)
#define IGF_MCR_MDIS_MASK                        0x40000000u
#define IGF_MCR_MDIS_SHIFT                       30u
#define IGF_MCR_MDIS_WIDTH                       1u
#define IGF_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_MCR_MDIS_SHIFT))&IGF_MCR_MDIS_MASK)
/* MSR Bit Fields */
#define IGF_MSR_FLO_MASK                         0x1u
#define IGF_MSR_FLO_SHIFT                        0u
#define IGF_MSR_FLO_WIDTH                        1u
#define IGF_MSR_FLO(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FLO_SHIFT))&IGF_MSR_FLO_MASK)
#define IGF_MSR_FLI_MASK                         0x2u
#define IGF_MSR_FLI_SHIFT                        1u
#define IGF_MSR_FLI_WIDTH                        1u
#define IGF_MSR_FLI(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FLI_SHIFT))&IGF_MSR_FLI_MASK)
#define IGF_MSR_FNDET_MASK                       0x4u
#define IGF_MSR_FNDET_SHIFT                      2u
#define IGF_MSR_FNDET_WIDTH                      1u
#define IGF_MSR_FNDET(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FNDET_SHIFT))&IGF_MSR_FNDET_MASK)
#define IGF_MSR_RNDET_MASK                       0x8u
#define IGF_MSR_RNDET_SHIFT                      3u
#define IGF_MSR_RNDET_WIDTH                      1u
#define IGF_MSR_RNDET(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_RNDET_SHIFT))&IGF_MSR_RNDET_MASK)
#define IGF_MSR_FEDGE_MASK                       0x10u
#define IGF_MSR_FEDGE_SHIFT                      4u
#define IGF_MSR_FEDGE_WIDTH                      1u
#define IGF_MSR_FEDGE(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FEDGE_SHIFT))&IGF_MSR_FEDGE_MASK)
#define IGF_MSR_WEDGE_MASK                       0x20u
#define IGF_MSR_WEDGE_SHIFT                      5u
#define IGF_MSR_WEDGE_WIDTH                      1u
#define IGF_MSR_WEDGE(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_WEDGE_SHIFT))&IGF_MSR_WEDGE_MASK)
/* RTHR Bit Fields */
#define IGF_RTHR_RTH_MASK                        0xFFFFFFu
#define IGF_RTHR_RTH_SHIFT                       0u
#define IGF_RTHR_RTH_WIDTH                       24u
#define IGF_RTHR_RTH(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_RTHR_RTH_SHIFT))&IGF_RTHR_RTH_MASK)
/* MCR_CH32 Bit Fields */
#define IGF_MCR_CH32_RFM_MASK                    0x3u
#define IGF_MCR_CH32_RFM_SHIFT                   0u
#define IGF_MCR_CH32_RFM_WIDTH                   2u
#define IGF_MCR_CH32_RFM(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_RFM_SHIFT))&IGF_MCR_CH32_RFM_MASK)
#define IGF_MCR_CH32_FFM_MASK                    0x18u
#define IGF_MCR_CH32_FFM_SHIFT                   3u
#define IGF_MCR_CH32_FFM_WIDTH                   2u
#define IGF_MCR_CH32_FFM(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_FFM_SHIFT))&IGF_MCR_CH32_FFM_MASK)
#define IGF_MCR_CH32_FGEN_MASK                   0x40u
#define IGF_MCR_CH32_FGEN_SHIFT                  6u
#define IGF_MCR_CH32_FGEN_WIDTH                  1u
#define IGF_MCR_CH32_FGEN(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_FGEN_SHIFT))&IGF_MCR_CH32_FGEN_MASK)
#define IGF_MCR_CH32_POL_MASK                    0x80u
#define IGF_MCR_CH32_POL_SHIFT                   7u
#define IGF_MCR_CH32_POL_WIDTH                   1u
#define IGF_MCR_CH32_POL(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_POL_SHIFT))&IGF_MCR_CH32_POL_MASK)
#define IGF_MCR_CH32_PSSEL_MASK                  0x100u
#define IGF_MCR_CH32_PSSEL_SHIFT                 8u
#define IGF_MCR_CH32_PSSEL_WIDTH                 1u
#define IGF_MCR_CH32_PSSEL(x)                    (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_PSSEL_SHIFT))&IGF_MCR_CH32_PSSEL_MASK)
#define IGF_MCR_CH32_IMM_MASK                    0x200u
#define IGF_MCR_CH32_IMM_SHIFT                   9u
#define IGF_MCR_CH32_IMM_WIDTH                   1u
#define IGF_MCR_CH32_IMM(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_IMM_SHIFT))&IGF_MCR_CH32_IMM_MASK)
#define IGF_MCR_CH32_FOL_MASK                    0x4000000u
#define IGF_MCR_CH32_FOL_SHIFT                   26u
#define IGF_MCR_CH32_FOL_WIDTH                   1u
#define IGF_MCR_CH32_FOL(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_FOL_SHIFT))&IGF_MCR_CH32_FOL_MASK)
#define IGF_MCR_CH32_FOH_MASK                    0x8000000u
#define IGF_MCR_CH32_FOH_SHIFT                   27u
#define IGF_MCR_CH32_FOH_WIDTH                   1u
#define IGF_MCR_CH32_FOH(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_FOH_SHIFT))&IGF_MCR_CH32_FOH_MASK)
#define IGF_MCR_CH32_FBP_MASK                    0x10000000u
#define IGF_MCR_CH32_FBP_SHIFT                   28u
#define IGF_MCR_CH32_FBP_WIDTH                   1u
#define IGF_MCR_CH32_FBP(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_FBP_SHIFT))&IGF_MCR_CH32_FBP_MASK)
#define IGF_MCR_CH32_FRZ_MASK                    0x20000000u
#define IGF_MCR_CH32_FRZ_SHIFT                   29u
#define IGF_MCR_CH32_FRZ_WIDTH                   1u
#define IGF_MCR_CH32_FRZ(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_FRZ_SHIFT))&IGF_MCR_CH32_FRZ_MASK)
#define IGF_MCR_CH32_MDIS_MASK                   0x40000000u
#define IGF_MCR_CH32_MDIS_SHIFT                  30u
#define IGF_MCR_CH32_MDIS_WIDTH                  1u
#define IGF_MCR_CH32_MDIS(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_MCR_CH32_MDIS_SHIFT))&IGF_MCR_CH32_MDIS_MASK)
/* MSR_CH32 Bit Fields */
#define IGF_MSR_CH32_FLO_MASK                    0x1u
#define IGF_MSR_CH32_FLO_SHIFT                   0u
#define IGF_MSR_CH32_FLO_WIDTH                   1u
#define IGF_MSR_CH32_FLO(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH32_FLO_SHIFT))&IGF_MSR_CH32_FLO_MASK)
#define IGF_MSR_CH32_FLI_MASK                    0x2u
#define IGF_MSR_CH32_FLI_SHIFT                   1u
#define IGF_MSR_CH32_FLI_WIDTH                   1u
#define IGF_MSR_CH32_FLI(x)                      (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH32_FLI_SHIFT))&IGF_MSR_CH32_FLI_MASK)
#define IGF_MSR_CH32_FNDET_MASK                  0x4u
#define IGF_MSR_CH32_FNDET_SHIFT                 2u
#define IGF_MSR_CH32_FNDET_WIDTH                 1u
#define IGF_MSR_CH32_FNDET(x)                    (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH32_FNDET_SHIFT))&IGF_MSR_CH32_FNDET_MASK)
#define IGF_MSR_CH32_RNDET_MASK                  0x8u
#define IGF_MSR_CH32_RNDET_SHIFT                 3u
#define IGF_MSR_CH32_RNDET_WIDTH                 1u
#define IGF_MSR_CH32_RNDET(x)                    (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH32_RNDET_SHIFT))&IGF_MSR_CH32_RNDET_MASK)
#define IGF_MSR_CH32_FEDGE_MASK                  0x10u
#define IGF_MSR_CH32_FEDGE_SHIFT                 4u
#define IGF_MSR_CH32_FEDGE_WIDTH                 1u
#define IGF_MSR_CH32_FEDGE(x)                    (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH32_FEDGE_SHIFT))&IGF_MSR_CH32_FEDGE_MASK)
#define IGF_MSR_CH32_WEDGE_MASK                  0x20u
#define IGF_MSR_CH32_WEDGE_SHIFT                 5u
#define IGF_MSR_CH32_WEDGE_WIDTH                 1u
#define IGF_MSR_CH32_WEDGE(x)                    (((uint32_t)(((uint32_t)(x))<<IGF_MSR_CH32_WEDGE_SHIFT))&IGF_MSR_CH32_WEDGE_MASK)
/* PRESR_CH32 Bit Fields */
#define IGF_PRESR_CH32_FPRE_MASK                 0x1FFu
#define IGF_PRESR_CH32_FPRE_SHIFT                0u
#define IGF_PRESR_CH32_FPRE_WIDTH                9u
#define IGF_PRESR_CH32_FPRE(x)                   (((uint32_t)(((uint32_t)(x))<<IGF_PRESR_CH32_FPRE_SHIFT))&IGF_PRESR_CH32_FPRE_MASK)
/* RTHR_CH32 Bit Fields */
#define IGF_RTHR_CH32_RTH_MASK                   0xFFFFFFu
#define IGF_RTHR_CH32_RTH_SHIFT                  0u
#define IGF_RTHR_CH32_RTH_WIDTH                  24u
#define IGF_RTHR_CH32_RTH(x)                     (((uint32_t)(((uint32_t)(x))<<IGF_RTHR_CH32_RTH_SHIFT))&IGF_RTHR_CH32_RTH_MASK)
/* MCR Bit Fields */
#define IGF_MCR_RFM_MASK                         0x3u
#define IGF_MCR_RFM_SHIFT                        0u
#define IGF_MCR_RFM_WIDTH                        2u
#define IGF_MCR_RFM(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_RFM_SHIFT))&IGF_MCR_RFM_MASK)
#define IGF_MCR_FFM_MASK                         0x18u
#define IGF_MCR_FFM_SHIFT                        3u
#define IGF_MCR_FFM_WIDTH                        2u
#define IGF_MCR_FFM(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FFM_SHIFT))&IGF_MCR_FFM_MASK)
#define IGF_MCR_FGEN_MASK                        0x40u
#define IGF_MCR_FGEN_SHIFT                       6u
#define IGF_MCR_FGEN_WIDTH                       1u
#define IGF_MCR_FGEN(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FGEN_SHIFT))&IGF_MCR_FGEN_MASK)
#define IGF_MCR_POL_MASK                         0x80u
#define IGF_MCR_POL_SHIFT                        7u
#define IGF_MCR_POL_WIDTH                        1u
#define IGF_MCR_POL(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_POL_SHIFT))&IGF_MCR_POL_MASK)
#define IGF_MCR_PSSEL_MASK                       0x100u
#define IGF_MCR_PSSEL_SHIFT                      8u
#define IGF_MCR_PSSEL_WIDTH                      1u
#define IGF_MCR_PSSEL(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MCR_PSSEL_SHIFT))&IGF_MCR_PSSEL_MASK)
#define IGF_MCR_IMM_MASK                         0x200u
#define IGF_MCR_IMM_SHIFT                        9u
#define IGF_MCR_IMM_WIDTH                        1u
#define IGF_MCR_IMM(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_IMM_SHIFT))&IGF_MCR_IMM_MASK)
#define IGF_MCR_FOL_MASK                         0x4000000u
#define IGF_MCR_FOL_SHIFT                        26u
#define IGF_MCR_FOL_WIDTH                        1u
#define IGF_MCR_FOL(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FOL_SHIFT))&IGF_MCR_FOL_MASK)
#define IGF_MCR_FOH_MASK                         0x8000000u
#define IGF_MCR_FOH_SHIFT                        27u
#define IGF_MCR_FOH_WIDTH                        1u
#define IGF_MCR_FOH(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FOH_SHIFT))&IGF_MCR_FOH_MASK)
#define IGF_MCR_FBP_MASK                         0x10000000u
#define IGF_MCR_FBP_SHIFT                        28u
#define IGF_MCR_FBP_WIDTH                        1u
#define IGF_MCR_FBP(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FBP_SHIFT))&IGF_MCR_FBP_MASK)
#define IGF_MCR_FRZ_MASK                         0x20000000u
#define IGF_MCR_FRZ_SHIFT                        29u
#define IGF_MCR_FRZ_WIDTH                        1u
#define IGF_MCR_FRZ(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MCR_FRZ_SHIFT))&IGF_MCR_FRZ_MASK)
#define IGF_MCR_MDIS_MASK                        0x40000000u
#define IGF_MCR_MDIS_SHIFT                       30u
#define IGF_MCR_MDIS_WIDTH                       1u
#define IGF_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_MCR_MDIS_SHIFT))&IGF_MCR_MDIS_MASK)
/* MSR Bit Fields */
#define IGF_MSR_FLO_MASK                         0x1u
#define IGF_MSR_FLO_SHIFT                        0u
#define IGF_MSR_FLO_WIDTH                        1u
#define IGF_MSR_FLO(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FLO_SHIFT))&IGF_MSR_FLO_MASK)
#define IGF_MSR_FLI_MASK                         0x2u
#define IGF_MSR_FLI_SHIFT                        1u
#define IGF_MSR_FLI_WIDTH                        1u
#define IGF_MSR_FLI(x)                           (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FLI_SHIFT))&IGF_MSR_FLI_MASK)
#define IGF_MSR_FNDET_MASK                       0x4u
#define IGF_MSR_FNDET_SHIFT                      2u
#define IGF_MSR_FNDET_WIDTH                      1u
