neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define IGF_MSR_FNDET(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FNDET_SHIFT))&IGF_MSR_FNDET_MASK)
#define IGF_MSR_RNDET_MASK                       0x8u
#define IGF_MSR_RNDET_SHIFT                      3u
#define IGF_MSR_RNDET_WIDTH                      1u
#define IGF_MSR_RNDET(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_RNDET_SHIFT))&IGF_MSR_RNDET_MASK)
#define IGF_MSR_FEDGE_MASK                       0x10u
#define IGF_MSR_FEDGE_SHIFT                      4u
#define IGF_MSR_FEDGE_WIDTH                      1u
#define IGF_MSR_FEDGE(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_FEDGE_SHIFT))&IGF_MSR_FEDGE_MASK)
#define IGF_MSR_WEDGE_MASK                       0x20u
#define IGF_MSR_WEDGE_SHIFT                      5u
#define IGF_MSR_WEDGE_WIDTH                      1u
#define IGF_MSR_WEDGE(x)                         (((uint32_t)(((uint32_t)(x))<<IGF_MSR_WEDGE_SHIFT))&IGF_MSR_WEDGE_MASK)
/* RTHR Bit Fields */
#define IGF_RTHR_RTH_MASK                        0xFFFFFFu
#define IGF_RTHR_RTH_SHIFT                       0u
#define IGF_RTHR_RTH_WIDTH                       24u
#define IGF_RTHR_RTH(x)                          (((uint32_t)(((uint32_t)(x))<<IGF_RTHR_RTH_SHIFT))&IGF_RTHR_RTH_MASK)

/*!
 * @}
 */ /* end of group IGF_Register_Masks */


/*!
 * @}
 */ /* end of group IGF_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- INTC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INTC_Peripheral_Access_Layer INTC Peripheral Access Layer
 * @{
 */


/** INTC - Size of Registers Arrays */
#define INTC_SSCIR_COUNT                         8u
#define INTC_PSR_COUNT                           512u

/** INTC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< INTC Module Configuration Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t CPR0;                              /**< INTC Current Priority Register for Processor n, offset: 0x8 */
  __IO uint32_t CPR1;                              /**< INTC Current Priority Register for Processor n, offset: 0xC */
  __IO uint32_t IACKR0;                            /**< INTC Interrupt Acknowledge Register for Processor n, offset: 0x10 */
  __IO uint32_t IACKR1;                            /**< INTC Interrupt Acknowledge Register for Processor n, offset: 0x14 */
  __O  uint32_t EOIR0;                             /**< INTC End Of Interrupt Register for Processor n, offset: 0x18 */
  __O  uint32_t EOIR1;                             /**< INTC End Of Interrupt Register for Processor n, offset: 0x1C */
  __IO uint8_t SSCIR[INTC_SSCIR_COUNT];            /**< INTC Software Set/Clear Interrupt Register, array offset: 0x20, array step: 0x1 */
       uint8_t RESERVED_1[24];
  __IO uint8_t PSR[INTC_PSR_COUNT];                /**< INTC Priority Select Register, array offset: 0x40, array step: 0x1 */
} INTC_Type, *INTC_MemMapPtr;

 /** Number of instances of the INTC module. */
#define INTC_INSTANCE_COUNT                      (1u)


/* INTC - Peripheral instance base addresses */
/** Peripheral INTC base address */
#define INTC_BASE                                (0xFFF48000u)
/** Peripheral INTC base pointer */
#define INTC                                     ((INTC_Type *)INTC_BASE)
/** Array initializer of INTC peripheral base addresses */
#define INTC_BASE_ADDRS                          { INTC_BASE }
/** Array initializer of INTC peripheral base pointers */
#define INTC_BASE_PTRS                           { INTC }

/* ----------------------------------------------------------------------------
   -- INTC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup INTC_Register_Masks INTC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define INTC_MCR_HVEN_PRC0_MASK                  0x1u
#define INTC_MCR_HVEN_PRC0_SHIFT                 0u
#define INTC_MCR_HVEN_PRC0_WIDTH                 1u
#define INTC_MCR_HVEN_PRC0(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_HVEN_PRC0_SHIFT))&INTC_MCR_HVEN_PRC0_MASK)
#define INTC_MCR_VTES_PRC0_MASK                  0x20u
#define INTC_MCR_VTES_PRC0_SHIFT                 5u
#define INTC_MCR_VTES_PRC0_WIDTH                 1u
#define INTC_MCR_VTES_PRC0(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_VTES_PRC0_SHIFT))&INTC_MCR_VTES_PRC0_MASK)
#define INTC_MCR_HVEN_PRC1_MASK                  0x100u
#define INTC_MCR_HVEN_PRC1_SHIFT                 8u
#define INTC_MCR_HVEN_PRC1_WIDTH                 1u
#define INTC_MCR_HVEN_PRC1(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_HVEN_PRC1_SHIFT))&INTC_MCR_HVEN_PRC1_MASK)
#define INTC_MCR_VTES_PRC1_MASK                  0x2000u
#define INTC_MCR_VTES_PRC1_SHIFT                 13u
#define INTC_MCR_VTES_PRC1_WIDTH                 1u
#define INTC_MCR_VTES_PRC1(x)                    (((uint32_t)(((uint32_t)(x))<<INTC_MCR_VTES_PRC1_SHIFT))&INTC_MCR_VTES_PRC1_MASK)
/* CPR0 Bit Fields */
#define INTC_CPR0_PRI_MASK                       0xFu
#define INTC_CPR0_PRI_SHIFT                      0u
#define INTC_CPR0_PRI_WIDTH                      4u
#define INTC_CPR0_PRI(x)                         (((uint32_t)(((uint32_t)(x))<<INTC_CPR0_PRI_SHIFT))&INTC_CPR0_PRI_MASK)
/* CPR1 Bit Fields */
#define INTC_CPR1_PRI_MASK                       0xFu
#define INTC_CPR1_PRI_SHIFT                      0u
#define INTC_CPR1_PRI_WIDTH                      4u
#define INTC_CPR1_PRI(x)                         (((uint32_t)(((uint32_t)(x))<<INTC_CPR1_PRI_SHIFT))&INTC_CPR1_PRI_MASK)
/* IACKR0 Bit Fields */
#define INTC_IACKR0_INTVEC_PRCn_MASK             0x7FCu
#define INTC_IACKR0_INTVEC_PRCn_SHIFT            2u
#define INTC_IACKR0_INTVEC_PRCn_WIDTH            9u
#define INTC_IACKR0_INTVEC_PRCn(x)               (((uint32_t)(((uint32_t)(x))<<INTC_IACKR0_INTVEC_PRCn_SHIFT))&INTC_IACKR0_INTVEC_PRCn_MASK)
#define INTC_IACKR0_VTBA_PRCn_MASK               0xFFFFF800u
#define INTC_IACKR0_VTBA_PRCn_SHIFT              11u
#define INTC_IACKR0_VTBA_PRCn_WIDTH              21u
#define INTC_IACKR0_VTBA_PRCn(x)                 (((uint32_t)(((uint32_t)(x))<<INTC_IACKR0_VTBA_PRCn_SHIFT))&INTC_IACKR0_VTBA_PRCn_MASK)
/* IACKR1 Bit Fields */
#define INTC_IACKR1_INTVEC_PRCn_MASK             0x7FCu
#define INTC_IACKR1_INTVEC_PRCn_SHIFT            2u
#define INTC_IACKR1_INTVEC_PRCn_WIDTH            9u
#define INTC_IACKR1_INTVEC_PRCn(x)               (((uint32_t)(((uint32_t)(x))<<INTC_IACKR1_INTVEC_PRCn_SHIFT))&INTC_IACKR1_INTVEC_PRCn_MASK)
#define INTC_IACKR1_VTBA_PRCn_MASK               0xFFFFF800u
#define INTC_IACKR1_VTBA_PRCn_SHIFT              11u
#define INTC_IACKR1_VTBA_PRCn_WIDTH              21u
#define INTC_IACKR1_VTBA_PRCn(x)                 (((uint32_t)(((uint32_t)(x))<<INTC_IACKR1_VTBA_PRCn_SHIFT))&INTC_IACKR1_VTBA_PRCn_MASK)
/* EOIR0 Bit Fields */
#define INTC_EOIR0_EOI_PRCn_MASK                 0xFFFFFFFFu
#define INTC_EOIR0_EOI_PRCn_SHIFT                0u
#define INTC_EOIR0_EOI_PRCn_WIDTH                32u
#define INTC_EOIR0_EOI_PRCn(x)                   (((uint32_t)(((uint32_t)(x))<<INTC_EOIR0_EOI_PRCn_SHIFT))&INTC_EOIR0_EOI_PRCn_MASK)
/* EOIR1 Bit Fields */
#define INTC_EOIR1_EOI_PRCn_MASK                 0xFFFFFFFFu
#define INTC_EOIR1_EOI_PRCn_SHIFT                0u
#define INTC_EOIR1_EOI_PRCn_WIDTH                32u
#define INTC_EOIR1_EOI_PRCn(x)                   (((uint32_t)(((uint32_t)(x))<<INTC_EOIR1_EOI_PRCn_SHIFT))&INTC_EOIR1_EOI_PRCn_MASK)
/* SSCIR Bit Fields */
#define INTC_SSCIR_CLR_MASK                      0x1u
#define INTC_SSCIR_CLR_SHIFT                     0u
#define INTC_SSCIR_CLR_WIDTH                     1u
#define INTC_SSCIR_CLR(x)                        (((uint8_t)(((uint8_t)(x))<<INTC_SSCIR_CLR_SHIFT))&INTC_SSCIR_CLR_MASK)
#define INTC_SSCIR_SET_MASK                      0x2u
#define INTC_SSCIR_SET_SHIFT                     1u
#define INTC_SSCIR_SET_WIDTH                     1u
#define INTC_SSCIR_SET(x)                        (((uint8_t)(((uint8_t)(x))<<INTC_SSCIR_SET_SHIFT))&INTC_SSCIR_SET_MASK)
/* PSR Bit Fields */
#define INTC_PSR_PRIN_MASK                       0xFu
#define INTC_PSR_PRIN_SHIFT                      0u
#define INTC_PSR_PRIN_WIDTH                      4u
#define INTC_PSR_PRIN(x)                         (((uint8_t)(((uint8_t)(x))<<INTC_PSR_PRIN_SHIFT))&INTC_PSR_PRIN_MASK)
#define INTC_PSR_PRC_SELn_MASK                   0xC0u
#define INTC_PSR_PRC_SELn_SHIFT                  6u
#define INTC_PSR_PRC_SELn_WIDTH                  2u
#define INTC_PSR_PRC_SELn(x)                     (((uint8_t)(((uint8_t)(x))<<INTC_PSR_PRC_SELn_SHIFT))&INTC_PSR_PRC_SELn_MASK)

/*!
 * @}
 */ /* end of group INTC_Register_Masks */


/*!
 * @}
 */ /* end of group INTC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- JDC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup JDC_Peripheral_Access_Layer JDC Peripheral Access Layer
 * @{
 */


/** JDC - Size of Registers Arrays */

