neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** JDC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t MSR;                               /**< Module Status Register, offset: 0x4 */
  __IO uint32_t JOUT_IPS;                          /**< JTAG Output Data Register, offset: 0x8 */
  __I  uint32_t JIN_IPS;                           /**< JTAG Input Data Register, offset: 0xC */
} JDC_Type, *JDC_MemMapPtr;

 /** Number of instances of the JDC module. */
#define JDC_INSTANCE_COUNT                       (1u)


/* JDC - Peripheral instance base addresses */
/** Peripheral JDC base address */
#define JDC_BASE                                 (0xFFE7C000u)
/** Peripheral JDC base pointer */
#define JDC                                      ((JDC_Type *)JDC_BASE)
/** Array initializer of JDC peripheral base addresses */
#define JDC_BASE_ADDRS                           { JDC_BASE }
/** Array initializer of JDC peripheral base pointers */
#define JDC_BASE_PTRS                            { JDC }

/* ----------------------------------------------------------------------------
   -- JDC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup JDC_Register_Masks JDC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define JDC_MCR_JOUT_IEN_MASK                    0x1u
#define JDC_MCR_JOUT_IEN_SHIFT                   0u
#define JDC_MCR_JOUT_IEN_WIDTH                   1u
#define JDC_MCR_JOUT_IEN(x)                      (((uint32_t)(((uint32_t)(x))<<JDC_MCR_JOUT_IEN_SHIFT))&JDC_MCR_JOUT_IEN_MASK)
#define JDC_MCR_JIN_IEN_MASK                     0x10000u
#define JDC_MCR_JIN_IEN_SHIFT                    16u
#define JDC_MCR_JIN_IEN_WIDTH                    1u
#define JDC_MCR_JIN_IEN(x)                       (((uint32_t)(((uint32_t)(x))<<JDC_MCR_JIN_IEN_SHIFT))&JDC_MCR_JIN_IEN_MASK)
/* MSR Bit Fields */
#define JDC_MSR_JOUT_INT_MASK                    0x1u
#define JDC_MSR_JOUT_INT_SHIFT                   0u
#define JDC_MSR_JOUT_INT_WIDTH                   1u
#define JDC_MSR_JOUT_INT(x)                      (((uint32_t)(((uint32_t)(x))<<JDC_MSR_JOUT_INT_SHIFT))&JDC_MSR_JOUT_INT_MASK)
#define JDC_MSR_JOUT_RDY_MASK                    0x4u
#define JDC_MSR_JOUT_RDY_SHIFT                   2u
#define JDC_MSR_JOUT_RDY_WIDTH                   1u
#define JDC_MSR_JOUT_RDY(x)                      (((uint32_t)(((uint32_t)(x))<<JDC_MSR_JOUT_RDY_SHIFT))&JDC_MSR_JOUT_RDY_MASK)
#define JDC_MSR_JIN_INT_MASK                     0x10000u
#define JDC_MSR_JIN_INT_SHIFT                    16u
#define JDC_MSR_JIN_INT_WIDTH                    1u
#define JDC_MSR_JIN_INT(x)                       (((uint32_t)(((uint32_t)(x))<<JDC_MSR_JIN_INT_SHIFT))&JDC_MSR_JIN_INT_MASK)
#define JDC_MSR_JIN_RDY_MASK                     0x40000u
#define JDC_MSR_JIN_RDY_SHIFT                    18u
#define JDC_MSR_JIN_RDY_WIDTH                    1u
#define JDC_MSR_JIN_RDY(x)                       (((uint32_t)(((uint32_t)(x))<<JDC_MSR_JIN_RDY_SHIFT))&JDC_MSR_JIN_RDY_MASK)
/* JOUT_IPS Bit Fields */
#define JDC_JOUT_IPS_Data_MASK                   0xFFFFFFFFu
#define JDC_JOUT_IPS_Data_SHIFT                  0u
#define JDC_JOUT_IPS_Data_WIDTH                  32u
#define JDC_JOUT_IPS_Data(x)                     (((uint32_t)(((uint32_t)(x))<<JDC_JOUT_IPS_Data_SHIFT))&JDC_JOUT_IPS_Data_MASK)
/* JIN_IPS Bit Fields */
#define JDC_JIN_IPS_Data_MASK                    0xFFFFFFFFu
#define JDC_JIN_IPS_Data_SHIFT                   0u
#define JDC_JIN_IPS_Data_WIDTH                   32u
#define JDC_JIN_IPS_Data(x)                      (((uint32_t)(((uint32_t)(x))<<JDC_JIN_IPS_Data_SHIFT))&JDC_JIN_IPS_Data_MASK)

/*!
 * @}
 */ /* end of group JDC_Register_Masks */


/*!
 * @}
 */ /* end of group JDC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- LFAST Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LFAST_Peripheral_Access_Layer LFAST Peripheral Access Layer
 * @{
 */


/** LFAST - Size of Registers Arrays */
#define LFAST_UNSTDR_COUNT                       9u
#define LFAST_UNSRDR_COUNT                       9u

/** LFAST - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< LFAST Mode Configuration Register, offset: 0x0 */
  __IO uint32_t SCR;                               /**< LFAST Speed Control Register, offset: 0x4 */
  __IO uint32_t COCR;                              /**< LFAST Correlator Control Register, offset: 0x8 */
  __IO uint32_t TMCR;                              /**< LFAST Test Mode Control Register, offset: 0xC */
  __IO uint32_t ALCR;                              /**< LFAST Auto Loopback Control Register, offset: 0x10 */
  __IO uint32_t RCDCR;                             /**< LFAST Rate Change Delay Control Register, offset: 0x14 */
  __IO uint32_t SLCR;                              /**< LFAST Wakeup Delay Control Register, offset: 0x18 */
  __IO uint32_t ICR;                               /**< LFAST ICLC Control Register, offset: 0x1C */
  __IO uint32_t PICR;                              /**< LFAST Ping Control Register, offset: 0x20 */
       uint8_t RESERVED_0[8];
  __IO uint32_t RFCR;                              /**< LFAST Rx FIFO CTS Control Register, offset: 0x2C */
  __IO uint32_t TIER;                              /**< LFAST Tx Interrupt Enable Register, offset: 0x30 */
  __IO uint32_t RIER;                              /**< LFAST Rx Interrupt Enable Register, offset: 0x34 */
  __IO uint32_t RIIER;                             /**< LFAST Rx ICLC Interrupt Enable Register, offset: 0x38 */
  __IO uint32_t PLLCR;                             /**< LFAST PLL Control Register, offset: 0x3C */
  __IO uint32_t LCR;                               /**< LFAST LVDS Control Register, offset: 0x40 */
  __IO uint32_t UNSTCR;                            /**< LFAST Unsolicited Tx Control Register, offset: 0x44 */
  __IO uint32_t UNSTDR[LFAST_UNSTDR_COUNT];        /**< LFAST Unsolicited Tx Data Registers, array offset: 0x48, array step: 0x4 */
       uint8_t RESERVED_1[20];
  __I  uint32_t GSR;                               /**< LFAST Global Status Register, offset: 0x80 */
  __I  uint32_t PISR;                              /**< LFAST Ping Status Register, offset: 0x84 */
       uint8_t RESERVED_2[12];
  __I  uint32_t DFSR;                              /**< LFAST Data Frame Status Register, offset: 0x94 */
  __IO uint32_t TISR;                              /**< LFAST Tx Interrupt Status Register, offset: 0x98 */
  __IO uint32_t RISR;                              /**< LFAST Rx Interrupt Status Register, offset: 0x9C */
  __IO uint32_t RIISR;                             /**< LFAST Rx ICLC Interrupt Status Register, offset: 0xA0 */
  __I  uint32_t PLLLSR;                            /**< LFAST PLL and LVDS Status Register, offset: 0xA4 */
  __IO uint32_t UNSRSR;                            /**< LFAST Unsolicited Rx Status Register, offset: 0xA8 */
  __I  uint32_t UNSRDR[LFAST_UNSRDR_COUNT];        /**< LFAST Unsolicited Rx Data Register, array offset: 0xAC, array step: 0x4 */
} LFAST_Type, *LFAST_MemMapPtr;

 /** Number of instances of the LFAST module. */
#define LFAST_INSTANCE_COUNT                     (1u)


