neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* LFAST - Peripheral instance base addresses */
/** Peripheral LFAST base address */
#define LFAST_BASE                               (0xFFFD8000u)
/** Peripheral LFAST base pointer */
#define LFAST                                    ((LFAST_Type *)LFAST_BASE)
/** Array initializer of LFAST peripheral base addresses */
#define LFAST_BASE_ADDRS                         { LFAST_BASE }
/** Array initializer of LFAST peripheral base pointers */
#define LFAST_BASE_PTRS                          { LFAST }

/* ----------------------------------------------------------------------------
   -- LFAST Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup LFAST_Register_Masks LFAST Register Masks
 * @{
 */

/* MCR Bit Fields */
#define LFAST_MCR_DATAEN_MASK                    0x1u
#define LFAST_MCR_DATAEN_SHIFT                   0u
#define LFAST_MCR_DATAEN_WIDTH                   1u
#define LFAST_MCR_DATAEN(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_DATAEN_SHIFT))&LFAST_MCR_DATAEN_MASK)
#define LFAST_MCR_DRFRST_MASK                    0x2u
#define LFAST_MCR_DRFRST_SHIFT                   1u
#define LFAST_MCR_DRFRST_WIDTH                   1u
#define LFAST_MCR_DRFRST(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_DRFRST_SHIFT))&LFAST_MCR_DRFRST_MASK)
#define LFAST_MCR_CTSEN_MASK                     0x8u
#define LFAST_MCR_CTSEN_SHIFT                    3u
#define LFAST_MCR_CTSEN_WIDTH                    1u
#define LFAST_MCR_CTSEN(x)                       (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_CTSEN_SHIFT))&LFAST_MCR_CTSEN_MASK)
#define LFAST_MCR_TXARBD_MASK                    0x10u
#define LFAST_MCR_TXARBD_SHIFT                   4u
#define LFAST_MCR_TXARBD_WIDTH                   1u
#define LFAST_MCR_TXARBD(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_TXARBD_SHIFT))&LFAST_MCR_TXARBD_MASK)
#define LFAST_MCR_TXEN_MASK                      0x2000u
#define LFAST_MCR_TXEN_SHIFT                     13u
#define LFAST_MCR_TXEN_WIDTH                     1u
#define LFAST_MCR_TXEN(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_TXEN_SHIFT))&LFAST_MCR_TXEN_MASK)
#define LFAST_MCR_RXEN_MASK                      0x4000u
#define LFAST_MCR_RXEN_SHIFT                     14u
#define LFAST_MCR_RXEN_WIDTH                     1u
#define LFAST_MCR_RXEN(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_RXEN_SHIFT))&LFAST_MCR_RXEN_MASK)
#define LFAST_MCR_DRFEN_MASK                     0x8000u
#define LFAST_MCR_DRFEN_SHIFT                    15u
#define LFAST_MCR_DRFEN_WIDTH                    1u
#define LFAST_MCR_DRFEN(x)                       (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_DRFEN_SHIFT))&LFAST_MCR_DRFEN_MASK)
#define LFAST_MCR_LSSEL_MASK                     0x10000u
#define LFAST_MCR_LSSEL_SHIFT                    16u
#define LFAST_MCR_LSSEL_WIDTH                    1u
#define LFAST_MCR_LSSEL(x)                       (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_LSSEL_SHIFT))&LFAST_MCR_LSSEL_MASK)
#define LFAST_MCR_IPGDBG_MASK                    0x1000000u
#define LFAST_MCR_IPGDBG_SHIFT                   24u
#define LFAST_MCR_IPGDBG_WIDTH                   1u
#define LFAST_MCR_IPGDBG(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_IPGDBG_SHIFT))&LFAST_MCR_IPGDBG_MASK)
#define LFAST_MCR_MSEN_MASK                      0x80000000u
#define LFAST_MCR_MSEN_SHIFT                     31u
#define LFAST_MCR_MSEN_WIDTH                     1u
#define LFAST_MCR_MSEN(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_MCR_MSEN_SHIFT))&LFAST_MCR_MSEN_MASK)
/* SCR Bit Fields */
#define LFAST_SCR_TDR_MASK                       0x1u
#define LFAST_SCR_TDR_SHIFT                      0u
#define LFAST_SCR_TDR_WIDTH                      1u
#define LFAST_SCR_TDR(x)                         (((uint32_t)(((uint32_t)(x))<<LFAST_SCR_TDR_SHIFT))&LFAST_SCR_TDR_MASK)
#define LFAST_SCR_RDR_MASK                       0x100u
#define LFAST_SCR_RDR_SHIFT                      8u
#define LFAST_SCR_RDR_WIDTH                      1u
#define LFAST_SCR_RDR(x)                         (((uint32_t)(((uint32_t)(x))<<LFAST_SCR_RDR_SHIFT))&LFAST_SCR_RDR_MASK)
#define LFAST_SCR_DRMD_MASK                      0x10000u
#define LFAST_SCR_DRMD_SHIFT                     16u
#define LFAST_SCR_DRMD_WIDTH                     1u
#define LFAST_SCR_DRMD(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_SCR_DRMD_SHIFT))&LFAST_SCR_DRMD_MASK)
/* COCR Bit Fields */
#define LFAST_COCR_PHSSEL_MASK                   0x1u
#define LFAST_COCR_PHSSEL_SHIFT                  0u
#define LFAST_COCR_PHSSEL_WIDTH                  1u
#define LFAST_COCR_PHSSEL(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_COCR_PHSSEL_SHIFT))&LFAST_COCR_PHSSEL_MASK)
#define LFAST_COCR_CORRTH_MASK                   0xEu
#define LFAST_COCR_CORRTH_SHIFT                  1u
#define LFAST_COCR_CORRTH_WIDTH                  3u
#define LFAST_COCR_CORRTH(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_COCR_CORRTH_SHIFT))&LFAST_COCR_CORRTH_MASK)
#define LFAST_COCR_SMPSEL_MASK                   0xFF000000u
#define LFAST_COCR_SMPSEL_SHIFT                  24u
#define LFAST_COCR_SMPSEL_WIDTH                  8u
#define LFAST_COCR_SMPSEL(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_COCR_SMPSEL_SHIFT))&LFAST_COCR_SMPSEL_MASK)
/* TMCR Bit Fields */
#define LFAST_TMCR_LPFRMTH_MASK                  0xFFFFu
#define LFAST_TMCR_LPFRMTH_SHIFT                 0u
#define LFAST_TMCR_LPFRMTH_WIDTH                 16u
#define LFAST_TMCR_LPFRMTH(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_TMCR_LPFRMTH_SHIFT))&LFAST_TMCR_LPFRMTH_MASK)
#define LFAST_TMCR_LPMOD_MASK                    0x70000u
#define LFAST_TMCR_LPMOD_SHIFT                   16u
#define LFAST_TMCR_LPMOD_WIDTH                   3u
#define LFAST_TMCR_LPMOD(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_TMCR_LPMOD_SHIFT))&LFAST_TMCR_LPMOD_MASK)
#define LFAST_TMCR_LPON_MASK                     0x1000000u
#define LFAST_TMCR_LPON_SHIFT                    24u
#define LFAST_TMCR_LPON_WIDTH                    1u
#define LFAST_TMCR_LPON(x)                       (((uint32_t)(((uint32_t)(x))<<LFAST_TMCR_LPON_SHIFT))&LFAST_TMCR_LPON_MASK)
#define LFAST_TMCR_CLKTST_MASK                   0x2000000u
#define LFAST_TMCR_CLKTST_SHIFT                  25u
#define LFAST_TMCR_CLKTST_WIDTH                  1u
#define LFAST_TMCR_CLKTST(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_TMCR_CLKTST_SHIFT))&LFAST_TMCR_CLKTST_MASK)
/* ALCR Bit Fields */
#define LFAST_ALCR_LPFMCNT_MASK                  0xFFFFu
#define LFAST_ALCR_LPFMCNT_SHIFT                 0u
#define LFAST_ALCR_LPFMCNT_WIDTH                 16u
#define LFAST_ALCR_LPFMCNT(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_ALCR_LPFMCNT_SHIFT))&LFAST_ALCR_LPFMCNT_MASK)
#define LFAST_ALCR_LPCNTEN_MASK                  0x10000u
#define LFAST_ALCR_LPCNTEN_SHIFT                 16u
#define LFAST_ALCR_LPCNTEN_WIDTH                 1u
#define LFAST_ALCR_LPCNTEN(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_ALCR_LPCNTEN_SHIFT))&LFAST_ALCR_LPCNTEN_MASK)
/* RCDCR Bit Fields */
#define LFAST_RCDCR_DRCNT_MASK                   0xF0000u
#define LFAST_RCDCR_DRCNT_SHIFT                  16u
#define LFAST_RCDCR_DRCNT_WIDTH                  4u
#define LFAST_RCDCR_DRCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RCDCR_DRCNT_SHIFT))&LFAST_RCDCR_DRCNT_MASK)
/* SLCR Bit Fields */
#define LFAST_SLCR_LWKCNT_MASK                   0xFu
#define LFAST_SLCR_LWKCNT_SHIFT                  0u
#define LFAST_SLCR_LWKCNT_WIDTH                  4u
#define LFAST_SLCR_LWKCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_SLCR_LWKCNT_SHIFT))&LFAST_SLCR_LWKCNT_MASK)
#define LFAST_SLCR_HWKCNT_MASK                   0xFF00u
#define LFAST_SLCR_HWKCNT_SHIFT                  8u
#define LFAST_SLCR_HWKCNT_WIDTH                  8u
#define LFAST_SLCR_HWKCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_SLCR_HWKCNT_SHIFT))&LFAST_SLCR_HWKCNT_MASK)
#define LFAST_SLCR_LSCNT_MASK                    0xF0000u
#define LFAST_SLCR_LSCNT_SHIFT                   16u
#define LFAST_SLCR_LSCNT_WIDTH                   4u
#define LFAST_SLCR_LSCNT(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_SLCR_LSCNT_SHIFT))&LFAST_SLCR_LSCNT_MASK)
#define LFAST_SLCR_HSCNT_MASK                    0xFF000000u
#define LFAST_SLCR_HSCNT_SHIFT                   24u
#define LFAST_SLCR_HSCNT_WIDTH                   8u
#define LFAST_SLCR_HSCNT(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_SLCR_HSCNT_SHIFT))&LFAST_SLCR_HSCNT_MASK)
/* ICR Bit Fields */
#define LFAST_ICR_ICLCPLD_MASK                   0xFFu
#define LFAST_ICR_ICLCPLD_SHIFT                  0u
#define LFAST_ICR_ICLCPLD_WIDTH                  8u
#define LFAST_ICR_ICLCPLD(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_ICR_ICLCPLD_SHIFT))&LFAST_ICR_ICLCPLD_MASK)
#define LFAST_ICR_SNDICLC_MASK                   0x10000u
#define LFAST_ICR_SNDICLC_SHIFT                  16u
#define LFAST_ICR_SNDICLC_WIDTH                  1u
#define LFAST_ICR_SNDICLC(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_ICR_SNDICLC_SHIFT))&LFAST_ICR_SNDICLC_MASK)
#define LFAST_ICR_ICLCSEQ_MASK                   0x20000u
#define LFAST_ICR_ICLCSEQ_SHIFT                  17u
#define LFAST_ICR_ICLCSEQ_WIDTH                  1u
#define LFAST_ICR_ICLCSEQ(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_ICR_ICLCSEQ_SHIFT))&LFAST_ICR_ICLCSEQ_MASK)
/* PICR Bit Fields */
#define LFAST_PICR_PNGPYLD_MASK                  0xFFu
#define LFAST_PICR_PNGPYLD_SHIFT                 0u
#define LFAST_PICR_PNGPYLD_WIDTH                 8u
#define LFAST_PICR_PNGPYLD(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PICR_PNGPYLD_SHIFT))&LFAST_PICR_PNGPYLD_MASK)
#define LFAST_PICR_PNGAUTO_MASK                  0x8000u
#define LFAST_PICR_PNGAUTO_SHIFT                 15u
#define LFAST_PICR_PNGAUTO_WIDTH                 1u
#define LFAST_PICR_PNGAUTO(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PICR_PNGAUTO_SHIFT))&LFAST_PICR_PNGAUTO_MASK)
#define LFAST_PICR_PNGREQ_MASK                   0x10000u
#define LFAST_PICR_PNGREQ_SHIFT                  16u
#define LFAST_PICR_PNGREQ_WIDTH                  1u
#define LFAST_PICR_PNGREQ(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_PICR_PNGREQ_SHIFT))&LFAST_PICR_PNGREQ_MASK)
/* RFCR Bit Fields */
#define LFAST_RFCR_RCTSMN_MASK                   0x3Fu
#define LFAST_RFCR_RCTSMN_SHIFT                  0u
#define LFAST_RFCR_RCTSMN_WIDTH                  6u
#define LFAST_RFCR_RCTSMN(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RFCR_RCTSMN_SHIFT))&LFAST_RFCR_RCTSMN_MASK)
#define LFAST_RFCR_RCTSMX_MASK                   0x3F0000u
#define LFAST_RFCR_RCTSMX_SHIFT                  16u
#define LFAST_RFCR_RCTSMX_WIDTH                  6u
#define LFAST_RFCR_RCTSMX(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RFCR_RCTSMX_SHIFT))&LFAST_RFCR_RCTSMX_MASK)
/* TIER Bit Fields */
#define LFAST_TIER_TXDTIE_MASK                   0x1u
#define LFAST_TIER_TXDTIE_SHIFT                  0u
#define LFAST_TIER_TXDTIE_WIDTH                  1u
#define LFAST_TIER_TXDTIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_TIER_TXDTIE_SHIFT))&LFAST_TIER_TXDTIE_MASK)
#define LFAST_TIER_TXICLCIE_MASK                 0x2u
#define LFAST_TIER_TXICLCIE_SHIFT                1u
#define LFAST_TIER_TXICLCIE_WIDTH                1u
#define LFAST_TIER_TXICLCIE(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_TIER_TXICLCIE_SHIFT))&LFAST_TIER_TXICLCIE_MASK)
#define LFAST_TIER_TXUNSIE_MASK                  0x4u
#define LFAST_TIER_TXUNSIE_SHIFT                 2u
#define LFAST_TIER_TXUNSIE_WIDTH                 1u
#define LFAST_TIER_TXUNSIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_TIER_TXUNSIE_SHIFT))&LFAST_TIER_TXUNSIE_MASK)
#define LFAST_TIER_TXPNGIE_MASK                  0x10u
#define LFAST_TIER_TXPNGIE_SHIFT                 4u
#define LFAST_TIER_TXPNGIE_WIDTH                 1u
#define LFAST_TIER_TXPNGIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_TIER_TXPNGIE_SHIFT))&LFAST_TIER_TXPNGIE_MASK)
#define LFAST_TIER_TXOVIE_MASK                   0x10000u
#define LFAST_TIER_TXOVIE_SHIFT                  16u
#define LFAST_TIER_TXOVIE_WIDTH                  1u
#define LFAST_TIER_TXOVIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_TIER_TXOVIE_SHIFT))&LFAST_TIER_TXOVIE_MASK)
#define LFAST_TIER_TXIIE_MASK                    0x20000u
#define LFAST_TIER_TXIIE_SHIFT                   17u
#define LFAST_TIER_TXIIE_WIDTH                   1u
#define LFAST_TIER_TXIIE(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_TIER_TXIIE_SHIFT))&LFAST_TIER_TXIIE_MASK)
/* RIER Bit Fields */
#define LFAST_RIER_RXUNSIE_MASK                  0x2u
#define LFAST_RIER_RXUNSIE_SHIFT                 1u
#define LFAST_RIER_RXUNSIE_WIDTH                 1u
#define LFAST_RIER_RXUNSIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXUNSIE_SHIFT))&LFAST_RIER_RXUNSIE_MASK)
#define LFAST_RIER_RXDIE_MASK                    0x4u
#define LFAST_RIER_RXDIE_SHIFT                   2u
#define LFAST_RIER_RXDIE_WIDTH                   1u
#define LFAST_RIER_RXDIE(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXDIE_SHIFT))&LFAST_RIER_RXDIE_MASK)
#define LFAST_RIER_RXCTSIE_MASK                  0x8u
#define LFAST_RIER_RXCTSIE_SHIFT                 3u
#define LFAST_RIER_RXCTSIE_WIDTH                 1u
#define LFAST_RIER_RXCTSIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXCTSIE_SHIFT))&LFAST_RIER_RXCTSIE_MASK)
#define LFAST_RIER_RXLCEIE_MASK                  0x10000u
#define LFAST_RIER_RXLCEIE_SHIFT                 16u
#define LFAST_RIER_RXLCEIE_WIDTH                 1u
#define LFAST_RIER_RXLCEIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXLCEIE_SHIFT))&LFAST_RIER_RXLCEIE_MASK)
#define LFAST_RIER_RXICIE_MASK                   0x20000u
#define LFAST_RIER_RXICIE_SHIFT                  17u
#define LFAST_RIER_RXICIE_WIDTH                  1u
#define LFAST_RIER_RXICIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXICIE_SHIFT))&LFAST_RIER_RXICIE_MASK)
#define LFAST_RIER_RXSZIE_MASK                   0x40000u
#define LFAST_RIER_RXSZIE_SHIFT                  18u
#define LFAST_RIER_RXSZIE_WIDTH                  1u
#define LFAST_RIER_RXSZIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXSZIE_SHIFT))&LFAST_RIER_RXSZIE_MASK)
#define LFAST_RIER_RXOFIE_MASK                   0x80000u
#define LFAST_RIER_RXOFIE_SHIFT                  19u
#define LFAST_RIER_RXOFIE_WIDTH                  1u
#define LFAST_RIER_RXOFIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXOFIE_SHIFT))&LFAST_RIER_RXOFIE_MASK)
#define LFAST_RIER_RXUFIE_MASK                   0x100000u
#define LFAST_RIER_RXUFIE_SHIFT                  20u
#define LFAST_RIER_RXUFIE_WIDTH                  1u
#define LFAST_RIER_RXUFIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXUFIE_SHIFT))&LFAST_RIER_RXUFIE_MASK)
#define LFAST_RIER_RXMXIE_MASK                   0x200000u
#define LFAST_RIER_RXMXIE_SHIFT                  21u
#define LFAST_RIER_RXMXIE_WIDTH                  1u
#define LFAST_RIER_RXMXIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXMXIE_SHIFT))&LFAST_RIER_RXMXIE_MASK)
#define LFAST_RIER_RXMNIE_MASK                   0x400000u
#define LFAST_RIER_RXMNIE_SHIFT                  22u
#define LFAST_RIER_RXMNIE_WIDTH                  1u
#define LFAST_RIER_RXMNIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXMNIE_SHIFT))&LFAST_RIER_RXMNIE_MASK)
#define LFAST_RIER_RXUOIE_MASK                   0x800000u
#define LFAST_RIER_RXUOIE_SHIFT                  23u
#define LFAST_RIER_RXUOIE_WIDTH                  1u
#define LFAST_RIER_RXUOIE(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIER_RXUOIE_SHIFT))&LFAST_RIER_RXUOIE_MASK)
/* RIIER Bit Fields */
#define LFAST_RIIER_ICPONIE_MASK                 0x1u
#define LFAST_RIIER_ICPONIE_SHIFT                0u
#define LFAST_RIIER_ICPONIE_WIDTH                1u
#define LFAST_RIIER_ICPONIE(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICPONIE_SHIFT))&LFAST_RIIER_ICPONIE_MASK)
#define LFAST_RIIER_ICPOFIE_MASK                 0x2u
#define LFAST_RIIER_ICPOFIE_SHIFT                1u
#define LFAST_RIIER_ICPOFIE_WIDTH                1u
#define LFAST_RIIER_ICPOFIE(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICPOFIE_SHIFT))&LFAST_RIIER_ICPOFIE_MASK)
#define LFAST_RIIER_ICTSIE_MASK                  0x4u
#define LFAST_RIIER_ICTSIE_SHIFT                 2u
#define LFAST_RIIER_ICTSIE_WIDTH                 1u
#define LFAST_RIIER_ICTSIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICTSIE_SHIFT))&LFAST_RIIER_ICTSIE_MASK)
#define LFAST_RIIER_ICTFIE_MASK                  0x8u
#define LFAST_RIIER_ICTFIE_SHIFT                 3u
#define LFAST_RIIER_ICTFIE_WIDTH                 1u
#define LFAST_RIIER_ICTFIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICTFIE_SHIFT))&LFAST_RIIER_ICTFIE_MASK)
#define LFAST_RIIER_ICRSIE_MASK                  0x10u
#define LFAST_RIIER_ICRSIE_SHIFT                 4u
#define LFAST_RIIER_ICRSIE_WIDTH                 1u
#define LFAST_RIIER_ICRSIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICRSIE_SHIFT))&LFAST_RIIER_ICRSIE_MASK)
#define LFAST_RIIER_ICRFIE_MASK                  0x20u
#define LFAST_RIIER_ICRFIE_SHIFT                 5u
#define LFAST_RIIER_ICRFIE_WIDTH                 1u
#define LFAST_RIIER_ICRFIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICRFIE_SHIFT))&LFAST_RIIER_ICRFIE_MASK)
#define LFAST_RIIER_ICTEIE_MASK                  0x40u
#define LFAST_RIIER_ICTEIE_SHIFT                 6u
#define LFAST_RIIER_ICTEIE_WIDTH                 1u
#define LFAST_RIIER_ICTEIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICTEIE_SHIFT))&LFAST_RIIER_ICTEIE_MASK)
#define LFAST_RIIER_ICTDIE_MASK                  0x80u
#define LFAST_RIIER_ICTDIE_SHIFT                 7u
#define LFAST_RIIER_ICTDIE_WIDTH                 1u
#define LFAST_RIIER_ICTDIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICTDIE_SHIFT))&LFAST_RIIER_ICTDIE_MASK)
#define LFAST_RIIER_ICCTIE_MASK                  0x100u
#define LFAST_RIIER_ICCTIE_SHIFT                 8u
#define LFAST_RIIER_ICCTIE_WIDTH                 1u
#define LFAST_RIIER_ICCTIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICCTIE_SHIFT))&LFAST_RIIER_ICCTIE_MASK)
#define LFAST_RIIER_ICLPIE_MASK                  0x200u
#define LFAST_RIIER_ICLPIE_SHIFT                 9u
#define LFAST_RIIER_ICLPIE_WIDTH                 1u
#define LFAST_RIIER_ICLPIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICLPIE_SHIFT))&LFAST_RIIER_ICLPIE_MASK)
#define LFAST_RIIER_ICTOIE_MASK                  0x400u
#define LFAST_RIIER_ICTOIE_SHIFT                 10u
#define LFAST_RIIER_ICTOIE_WIDTH                 1u
#define LFAST_RIIER_ICTOIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICTOIE_SHIFT))&LFAST_RIIER_ICTOIE_MASK)
#define LFAST_RIIER_ICPRIE_MASK                  0x800u
#define LFAST_RIIER_ICPRIE_SHIFT                 11u
#define LFAST_RIIER_ICPRIE_WIDTH                 1u
#define LFAST_RIIER_ICPRIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICPRIE_SHIFT))&LFAST_RIIER_ICPRIE_MASK)
#define LFAST_RIIER_ICPSIE_MASK                  0x1000u
#define LFAST_RIIER_ICPSIE_SHIFT                 12u
#define LFAST_RIIER_ICPSIE_WIDTH                 1u
#define LFAST_RIIER_ICPSIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICPSIE_SHIFT))&LFAST_RIIER_ICPSIE_MASK)
#define LFAST_RIIER_ICPFIE_MASK                  0x2000u
#define LFAST_RIIER_ICPFIE_SHIFT                 13u
#define LFAST_RIIER_ICPFIE_WIDTH                 1u
#define LFAST_RIIER_ICPFIE(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIIER_ICPFIE_SHIFT))&LFAST_RIIER_ICPFIE_MASK)
/* PLLCR Bit Fields */
#define LFAST_PLLCR_PREDIV_MASK                  0x3u
#define LFAST_PLLCR_PREDIV_SHIFT                 0u
#define LFAST_PLLCR_PREDIV_WIDTH                 2u
#define LFAST_PLLCR_PREDIV(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_PREDIV_SHIFT))&LFAST_PLLCR_PREDIV_MASK)
#define LFAST_PLLCR_FBDIV_MASK                   0xFCu
#define LFAST_PLLCR_FBDIV_SHIFT                  2u
#define LFAST_PLLCR_FBDIV_WIDTH                  6u
#define LFAST_PLLCR_FBDIV(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_FBDIV_SHIFT))&LFAST_PLLCR_FBDIV_MASK)
#define LFAST_PLLCR_FDIVEN_MASK                  0x100u
#define LFAST_PLLCR_FDIVEN_SHIFT                 8u
#define LFAST_PLLCR_FDIVEN_WIDTH                 1u
#define LFAST_PLLCR_FDIVEN(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_FDIVEN_SHIFT))&LFAST_PLLCR_FDIVEN_MASK)
#define LFAST_PLLCR_PLCKCW_MASK                  0x600u
#define LFAST_PLLCR_PLCKCW_SHIFT                 9u
#define LFAST_PLLCR_PLCKCW_WIDTH                 2u
#define LFAST_PLLCR_PLCKCW(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_PLCKCW_SHIFT))&LFAST_PLLCR_PLCKCW_MASK)
#define LFAST_PLLCR_REFINV_MASK                  0x8000u
#define LFAST_PLLCR_REFINV_SHIFT                 15u
#define LFAST_PLLCR_REFINV_WIDTH                 1u
#define LFAST_PLLCR_REFINV(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_REFINV_SHIFT))&LFAST_PLLCR_REFINV_MASK)
#define LFAST_PLLCR_SWPON_MASK                   0x10000u
#define LFAST_PLLCR_SWPON_SHIFT                  16u
#define LFAST_PLLCR_SWPON_WIDTH                  1u
#define LFAST_PLLCR_SWPON(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_SWPON_SHIFT))&LFAST_PLLCR_SWPON_MASK)
#define LFAST_PLLCR_SWPOFF_MASK                  0x20000u
#define LFAST_PLLCR_SWPOFF_SHIFT                 17u
#define LFAST_PLLCR_SWPOFF_WIDTH                 1u
#define LFAST_PLLCR_SWPOFF(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_SWPOFF_SHIFT))&LFAST_PLLCR_SWPOFF_MASK)
#define LFAST_PLLCR_IPTMOD_MASK                  0xE0000000u
#define LFAST_PLLCR_IPTMOD_SHIFT                 29u
#define LFAST_PLLCR_IPTMOD_WIDTH                 3u
#define LFAST_PLLCR_IPTMOD(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLCR_IPTMOD_SHIFT))&LFAST_PLLCR_IPTMOD_MASK)
/* LCR Bit Fields */
#define LFAST_LCR_LVCKP_MASK                     0x1u
#define LFAST_LCR_LVCKP_SHIFT                    0u
#define LFAST_LCR_LVCKP_WIDTH                    1u
#define LFAST_LCR_LVCKP(x)                       (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVCKP_SHIFT))&LFAST_LCR_LVCKP_MASK)
#define LFAST_LCR_LVCKSS_MASK                    0x2u
#define LFAST_LCR_LVCKSS_SHIFT                   1u
#define LFAST_LCR_LVCKSS_WIDTH                   1u
#define LFAST_LCR_LVCKSS(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVCKSS_SHIFT))&LFAST_LCR_LVCKSS_MASK)
#define LFAST_LCR_LVTXOP_MASK                    0x4u
#define LFAST_LCR_LVTXOP_SHIFT                   2u
#define LFAST_LCR_LVTXOP_WIDTH                   1u
#define LFAST_LCR_LVTXOP(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVTXOP_SHIFT))&LFAST_LCR_LVTXOP_MASK)
#define LFAST_LCR_LVRXOP_BR_MASK                 0x8u
#define LFAST_LCR_LVRXOP_BR_SHIFT                3u
#define LFAST_LCR_LVRXOP_BR_WIDTH                1u
#define LFAST_LCR_LVRXOP_BR(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVRXOP_BR_SHIFT))&LFAST_LCR_LVRXOP_BR_MASK)
#define LFAST_LCR_LVRXOP_TR_MASK                 0x20u
#define LFAST_LCR_LVRXOP_TR_SHIFT                5u
#define LFAST_LCR_LVRXOP_TR_WIDTH                1u
#define LFAST_LCR_LVRXOP_TR(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVRXOP_TR_SHIFT))&LFAST_LCR_LVRXOP_TR_MASK)
