neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define LFAST_LCR_LVLPEN_MASK                    0x800u
#define LFAST_LCR_LVLPEN_SHIFT                   11u
#define LFAST_LCR_LVLPEN_WIDTH                   1u
#define LFAST_LCR_LVLPEN(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVLPEN_SHIFT))&LFAST_LCR_LVLPEN_MASK)
#define LFAST_LCR_LVRFEN_MASK                    0x1000u
#define LFAST_LCR_LVRFEN_SHIFT                   12u
#define LFAST_LCR_LVRFEN_WIDTH                   1u
#define LFAST_LCR_LVRFEN(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVRFEN_SHIFT))&LFAST_LCR_LVRFEN_MASK)
#define LFAST_LCR_TXCMUX_MASK                    0x2000u
#define LFAST_LCR_TXCMUX_SHIFT                   13u
#define LFAST_LCR_TXCMUX_WIDTH                   1u
#define LFAST_LCR_TXCMUX(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_TXCMUX_SHIFT))&LFAST_LCR_TXCMUX_MASK)
#define LFAST_LCR_LVTXOE_MASK                    0x4000u
#define LFAST_LCR_LVTXOE_SHIFT                   14u
#define LFAST_LCR_LVTXOE_WIDTH                   1u
#define LFAST_LCR_LVTXOE(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVTXOE_SHIFT))&LFAST_LCR_LVTXOE_MASK)
#define LFAST_LCR_LVRXOFF_MASK                   0x8000u
#define LFAST_LCR_LVRXOFF_SHIFT                  15u
#define LFAST_LCR_LVRXOFF_WIDTH                  1u
#define LFAST_LCR_LVRXOFF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_LVRXOFF_SHIFT))&LFAST_LCR_LVRXOFF_MASK)
#define LFAST_LCR_SWONLR_MASK                    0x10000u
#define LFAST_LCR_SWONLR_SHIFT                   16u
#define LFAST_LCR_SWONLR_WIDTH                   1u
#define LFAST_LCR_SWONLR(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWONLR_SHIFT))&LFAST_LCR_SWONLR_MASK)
#define LFAST_LCR_SWOFFLR_MASK                   0x20000u
#define LFAST_LCR_SWOFFLR_SHIFT                  17u
#define LFAST_LCR_SWOFFLR_WIDTH                  1u
#define LFAST_LCR_SWOFFLR(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWOFFLR_SHIFT))&LFAST_LCR_SWOFFLR_MASK)
#define LFAST_LCR_SWONLD_MASK                    0x40000u
#define LFAST_LCR_SWONLD_SHIFT                   18u
#define LFAST_LCR_SWONLD_WIDTH                   1u
#define LFAST_LCR_SWONLD(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWONLD_SHIFT))&LFAST_LCR_SWONLD_MASK)
#define LFAST_LCR_SWOFFLD_MASK                   0x80000u
#define LFAST_LCR_SWOFFLD_SHIFT                  19u
#define LFAST_LCR_SWOFFLD_WIDTH                  1u
#define LFAST_LCR_SWOFFLD(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWOFFLD_SHIFT))&LFAST_LCR_SWOFFLD_MASK)
#define LFAST_LCR_SWSLPLR_MASK                   0x100000u
#define LFAST_LCR_SWSLPLR_SHIFT                  20u
#define LFAST_LCR_SWSLPLR_WIDTH                  1u
#define LFAST_LCR_SWSLPLR(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWSLPLR_SHIFT))&LFAST_LCR_SWSLPLR_MASK)
#define LFAST_LCR_SWWKLR_MASK                    0x200000u
#define LFAST_LCR_SWWKLR_SHIFT                   21u
#define LFAST_LCR_SWWKLR_WIDTH                   1u
#define LFAST_LCR_SWWKLR(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWWKLR_SHIFT))&LFAST_LCR_SWWKLR_MASK)
#define LFAST_LCR_SWSLPLD_MASK                   0x400000u
#define LFAST_LCR_SWSLPLD_SHIFT                  22u
#define LFAST_LCR_SWSLPLD_WIDTH                  1u
#define LFAST_LCR_SWSLPLD(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWSLPLD_SHIFT))&LFAST_LCR_SWSLPLD_MASK)
#define LFAST_LCR_SWWKLD_MASK                    0x800000u
#define LFAST_LCR_SWWKLD_SHIFT                   23u
#define LFAST_LCR_SWWKLD_WIDTH                   1u
#define LFAST_LCR_SWWKLD(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_LCR_SWWKLD_SHIFT))&LFAST_LCR_SWWKLD_MASK)
/* UNSTCR Bit Fields */
#define LFAST_UNSTCR_UNSHDR_MASK                 0x7Fu
#define LFAST_UNSTCR_UNSHDR_SHIFT                0u
#define LFAST_UNSTCR_UNSHDR_WIDTH                7u
#define LFAST_UNSTCR_UNSHDR(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_UNSTCR_UNSHDR_SHIFT))&LFAST_UNSTCR_UNSHDR_MASK)
#define LFAST_UNSTCR_USNDRQ_MASK                 0x10000u
#define LFAST_UNSTCR_USNDRQ_SHIFT                16u
#define LFAST_UNSTCR_USNDRQ_WIDTH                1u
#define LFAST_UNSTCR_USNDRQ(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_UNSTCR_USNDRQ_SHIFT))&LFAST_UNSTCR_USNDRQ_MASK)
/* UNSTDR Bit Fields */
#define LFAST_UNSTDR_UNTXD_MASK                  0xFFFFFFFFu
#define LFAST_UNSTDR_UNTXD_SHIFT                 0u
#define LFAST_UNSTDR_UNTXD_WIDTH                 32u
#define LFAST_UNSTDR_UNTXD(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_UNSTDR_UNTXD_SHIFT))&LFAST_UNSTDR_UNTXD_MASK)
/* GSR Bit Fields */
#define LFAST_GSR_LPCSDV_MASK                    0x1u
#define LFAST_GSR_LPCSDV_SHIFT                   0u
#define LFAST_GSR_LPCSDV_WIDTH                   1u
#define LFAST_GSR_LPCSDV(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LPCSDV_SHIFT))&LFAST_GSR_LPCSDV_MASK)
#define LFAST_GSR_LPCHDV_MASK                    0x2u
#define LFAST_GSR_LPCHDV_SHIFT                   1u
#define LFAST_GSR_LPCHDV_WIDTH                   1u
#define LFAST_GSR_LPCHDV(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LPCHDV_SHIFT))&LFAST_GSR_LPCHDV_MASK)
#define LFAST_GSR_LPCPDV_MASK                    0x4u
#define LFAST_GSR_LPCPDV_SHIFT                   2u
#define LFAST_GSR_LPCPDV_WIDTH                   1u
#define LFAST_GSR_LPCPDV(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LPCPDV_SHIFT))&LFAST_GSR_LPCPDV_MASK)
#define LFAST_GSR_LPFPDV_MASK                    0x8u
#define LFAST_GSR_LPFPDV_SHIFT                   3u
#define LFAST_GSR_LPFPDV_WIDTH                   1u
#define LFAST_GSR_LPFPDV(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LPFPDV_SHIFT))&LFAST_GSR_LPFPDV_MASK)
#define LFAST_GSR_LPTXDN_MASK                    0x10u
#define LFAST_GSR_LPTXDN_SHIFT                   4u
#define LFAST_GSR_LPTXDN_WIDTH                   1u
#define LFAST_GSR_LPTXDN(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LPTXDN_SHIFT))&LFAST_GSR_LPTXDN_MASK)
#define LFAST_GSR_DRSM_MASK                      0x10000u
#define LFAST_GSR_DRSM_SHIFT                     16u
#define LFAST_GSR_DRSM_WIDTH                     1u
#define LFAST_GSR_DRSM(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_DRSM_SHIFT))&LFAST_GSR_DRSM_MASK)
#define LFAST_GSR_LDSM_MASK                      0x20000u
#define LFAST_GSR_LDSM_SHIFT                     17u
#define LFAST_GSR_LDSM_WIDTH                     1u
#define LFAST_GSR_LDSM(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LDSM_SHIFT))&LFAST_GSR_LDSM_MASK)
#define LFAST_GSR_LRMD_MASK                      0x40000u
#define LFAST_GSR_LRMD_SHIFT                     18u
#define LFAST_GSR_LRMD_WIDTH                     1u
#define LFAST_GSR_LRMD(x)                        (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_LRMD_SHIFT))&LFAST_GSR_LRMD_MASK)
#define LFAST_GSR_DUALMD_MASK                    0x80000000u
#define LFAST_GSR_DUALMD_SHIFT                   31u
#define LFAST_GSR_DUALMD_WIDTH                   1u
#define LFAST_GSR_DUALMD(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_GSR_DUALMD_SHIFT))&LFAST_GSR_DUALMD_MASK)
/* PISR Bit Fields */
#define LFAST_PISR_RXPNGD_MASK                   0xFFu
#define LFAST_PISR_RXPNGD_SHIFT                  0u
#define LFAST_PISR_RXPNGD_WIDTH                  8u
#define LFAST_PISR_RXPNGD(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_PISR_RXPNGD_SHIFT))&LFAST_PISR_RXPNGD_MASK)
/* DFSR Bit Fields */
#define LFAST_DFSR_TXFCNT_MASK                   0x7u
#define LFAST_DFSR_TXFCNT_SHIFT                  0u
#define LFAST_DFSR_TXFCNT_WIDTH                  3u
#define LFAST_DFSR_TXFCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_DFSR_TXFCNT_SHIFT))&LFAST_DFSR_TXFCNT_MASK)
#define LFAST_DFSR_TXDCNT_MASK                   0x3F00u
#define LFAST_DFSR_TXDCNT_SHIFT                  8u
#define LFAST_DFSR_TXDCNT_WIDTH                  6u
#define LFAST_DFSR_TXDCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_DFSR_TXDCNT_SHIFT))&LFAST_DFSR_TXDCNT_MASK)
#define LFAST_DFSR_RXFCNT_MASK                   0x70000u
#define LFAST_DFSR_RXFCNT_SHIFT                  16u
#define LFAST_DFSR_RXFCNT_WIDTH                  3u
#define LFAST_DFSR_RXFCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_DFSR_RXFCNT_SHIFT))&LFAST_DFSR_RXFCNT_MASK)
#define LFAST_DFSR_RXDCNT_MASK                   0x3F000000u
#define LFAST_DFSR_RXDCNT_SHIFT                  24u
#define LFAST_DFSR_RXDCNT_WIDTH                  6u
#define LFAST_DFSR_RXDCNT(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_DFSR_RXDCNT_SHIFT))&LFAST_DFSR_RXDCNT_MASK)
/* TISR Bit Fields */
#define LFAST_TISR_TXDTF_MASK                    0x1u
#define LFAST_TISR_TXDTF_SHIFT                   0u
#define LFAST_TISR_TXDTF_WIDTH                   1u
#define LFAST_TISR_TXDTF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_TISR_TXDTF_SHIFT))&LFAST_TISR_TXDTF_MASK)
#define LFAST_TISR_TXICLCF_MASK                  0x2u
#define LFAST_TISR_TXICLCF_SHIFT                 1u
#define LFAST_TISR_TXICLCF_WIDTH                 1u
#define LFAST_TISR_TXICLCF(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_TISR_TXICLCF_SHIFT))&LFAST_TISR_TXICLCF_MASK)
#define LFAST_TISR_TXUNSF_MASK                   0x4u
#define LFAST_TISR_TXUNSF_SHIFT                  2u
#define LFAST_TISR_TXUNSF_WIDTH                  1u
#define LFAST_TISR_TXUNSF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_TISR_TXUNSF_SHIFT))&LFAST_TISR_TXUNSF_MASK)
#define LFAST_TISR_TXPNGF_MASK                   0x10u
#define LFAST_TISR_TXPNGF_SHIFT                  4u
#define LFAST_TISR_TXPNGF_WIDTH                  1u
#define LFAST_TISR_TXPNGF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_TISR_TXPNGF_SHIFT))&LFAST_TISR_TXPNGF_MASK)
#define LFAST_TISR_TXOVF_MASK                    0x10000u
#define LFAST_TISR_TXOVF_SHIFT                   16u
#define LFAST_TISR_TXOVF_WIDTH                   1u
#define LFAST_TISR_TXOVF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_TISR_TXOVF_SHIFT))&LFAST_TISR_TXOVF_MASK)
#define LFAST_TISR_TXIEF_MASK                    0x20000u
#define LFAST_TISR_TXIEF_SHIFT                   17u
#define LFAST_TISR_TXIEF_WIDTH                   1u
#define LFAST_TISR_TXIEF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_TISR_TXIEF_SHIFT))&LFAST_TISR_TXIEF_MASK)
/* RISR Bit Fields */
#define LFAST_RISR_RXUNSF_MASK                   0x2u
#define LFAST_RISR_RXUNSF_SHIFT                  1u
#define LFAST_RISR_RXUNSF_WIDTH                  1u
#define LFAST_RISR_RXUNSF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXUNSF_SHIFT))&LFAST_RISR_RXUNSF_MASK)
#define LFAST_RISR_RXDF_MASK                     0x4u
#define LFAST_RISR_RXDF_SHIFT                    2u
#define LFAST_RISR_RXDF_WIDTH                    1u
#define LFAST_RISR_RXDF(x)                       (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXDF_SHIFT))&LFAST_RISR_RXDF_MASK)
#define LFAST_RISR_RXCTSF_MASK                   0x8u
#define LFAST_RISR_RXCTSF_SHIFT                  3u
#define LFAST_RISR_RXCTSF_WIDTH                  1u
#define LFAST_RISR_RXCTSF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXCTSF_SHIFT))&LFAST_RISR_RXCTSF_MASK)
#define LFAST_RISR_RXLCEF_MASK                   0x10000u
#define LFAST_RISR_RXLCEF_SHIFT                  16u
#define LFAST_RISR_RXLCEF_WIDTH                  1u
#define LFAST_RISR_RXLCEF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXLCEF_SHIFT))&LFAST_RISR_RXLCEF_MASK)
#define LFAST_RISR_RXICF_MASK                    0x20000u
#define LFAST_RISR_RXICF_SHIFT                   17u
#define LFAST_RISR_RXICF_WIDTH                   1u
#define LFAST_RISR_RXICF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXICF_SHIFT))&LFAST_RISR_RXICF_MASK)
#define LFAST_RISR_RXSZF_MASK                    0x40000u
#define LFAST_RISR_RXSZF_SHIFT                   18u
#define LFAST_RISR_RXSZF_WIDTH                   1u
#define LFAST_RISR_RXSZF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXSZF_SHIFT))&LFAST_RISR_RXSZF_MASK)
#define LFAST_RISR_RXOFF_MASK                    0x80000u
#define LFAST_RISR_RXOFF_SHIFT                   19u
#define LFAST_RISR_RXOFF_WIDTH                   1u
#define LFAST_RISR_RXOFF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXOFF_SHIFT))&LFAST_RISR_RXOFF_MASK)
#define LFAST_RISR_RXUFF_MASK                    0x100000u
#define LFAST_RISR_RXUFF_SHIFT                   20u
#define LFAST_RISR_RXUFF_WIDTH                   1u
#define LFAST_RISR_RXUFF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXUFF_SHIFT))&LFAST_RISR_RXUFF_MASK)
#define LFAST_RISR_RXMXF_MASK                    0x200000u
#define LFAST_RISR_RXMXF_SHIFT                   21u
#define LFAST_RISR_RXMXF_WIDTH                   1u
#define LFAST_RISR_RXMXF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXMXF_SHIFT))&LFAST_RISR_RXMXF_MASK)
#define LFAST_RISR_RXMNF_MASK                    0x400000u
#define LFAST_RISR_RXMNF_SHIFT                   22u
#define LFAST_RISR_RXMNF_WIDTH                   1u
#define LFAST_RISR_RXMNF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXMNF_SHIFT))&LFAST_RISR_RXMNF_MASK)
#define LFAST_RISR_RXUOF_MASK                    0x800000u
#define LFAST_RISR_RXUOF_SHIFT                   23u
#define LFAST_RISR_RXUOF_WIDTH                   1u
#define LFAST_RISR_RXUOF(x)                      (((uint32_t)(((uint32_t)(x))<<LFAST_RISR_RXUOF_SHIFT))&LFAST_RISR_RXUOF_MASK)
/* RIISR Bit Fields */
#define LFAST_RIISR_ICPONF_MASK                  0x1u
#define LFAST_RIISR_ICPONF_SHIFT                 0u
#define LFAST_RIISR_ICPONF_WIDTH                 1u
#define LFAST_RIISR_ICPONF(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICPONF_SHIFT))&LFAST_RIISR_ICPONF_MASK)
#define LFAST_RIISR_ICPOFF_MASK                  0x2u
#define LFAST_RIISR_ICPOFF_SHIFT                 1u
#define LFAST_RIISR_ICPOFF_WIDTH                 1u
#define LFAST_RIISR_ICPOFF(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICPOFF_SHIFT))&LFAST_RIISR_ICPOFF_MASK)
#define LFAST_RIISR_ICTSF_MASK                   0x4u
#define LFAST_RIISR_ICTSF_SHIFT                  2u
#define LFAST_RIISR_ICTSF_WIDTH                  1u
#define LFAST_RIISR_ICTSF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICTSF_SHIFT))&LFAST_RIISR_ICTSF_MASK)
#define LFAST_RIISR_ICTFF_MASK                   0x8u
#define LFAST_RIISR_ICTFF_SHIFT                  3u
#define LFAST_RIISR_ICTFF_WIDTH                  1u
#define LFAST_RIISR_ICTFF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICTFF_SHIFT))&LFAST_RIISR_ICTFF_MASK)
#define LFAST_RIISR_ICRSF_MASK                   0x10u
#define LFAST_RIISR_ICRSF_SHIFT                  4u
#define LFAST_RIISR_ICRSF_WIDTH                  1u
#define LFAST_RIISR_ICRSF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICRSF_SHIFT))&LFAST_RIISR_ICRSF_MASK)
#define LFAST_RIISR_ICRFF_MASK                   0x20u
#define LFAST_RIISR_ICRFF_SHIFT                  5u
#define LFAST_RIISR_ICRFF_WIDTH                  1u
#define LFAST_RIISR_ICRFF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICRFF_SHIFT))&LFAST_RIISR_ICRFF_MASK)
#define LFAST_RIISR_ICTEF_MASK                   0x40u
#define LFAST_RIISR_ICTEF_SHIFT                  6u
#define LFAST_RIISR_ICTEF_WIDTH                  1u
#define LFAST_RIISR_ICTEF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICTEF_SHIFT))&LFAST_RIISR_ICTEF_MASK)
#define LFAST_RIISR_ICTDF_MASK                   0x80u
#define LFAST_RIISR_ICTDF_SHIFT                  7u
#define LFAST_RIISR_ICTDF_WIDTH                  1u
#define LFAST_RIISR_ICTDF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICTDF_SHIFT))&LFAST_RIISR_ICTDF_MASK)
#define LFAST_RIISR_ICCTF_MASK                   0x100u
#define LFAST_RIISR_ICCTF_SHIFT                  8u
#define LFAST_RIISR_ICCTF_WIDTH                  1u
#define LFAST_RIISR_ICCTF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICCTF_SHIFT))&LFAST_RIISR_ICCTF_MASK)
#define LFAST_RIISR_ICLPF_MASK                   0x200u
#define LFAST_RIISR_ICLPF_SHIFT                  9u
#define LFAST_RIISR_ICLPF_WIDTH                  1u
#define LFAST_RIISR_ICLPF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICLPF_SHIFT))&LFAST_RIISR_ICLPF_MASK)
#define LFAST_RIISR_ICTOF_MASK                   0x400u
#define LFAST_RIISR_ICTOF_SHIFT                  10u
#define LFAST_RIISR_ICTOF_WIDTH                  1u
#define LFAST_RIISR_ICTOF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICTOF_SHIFT))&LFAST_RIISR_ICTOF_MASK)
#define LFAST_RIISR_ICPRF_MASK                   0x800u
#define LFAST_RIISR_ICPRF_SHIFT                  11u
#define LFAST_RIISR_ICPRF_WIDTH                  1u
#define LFAST_RIISR_ICPRF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICPRF_SHIFT))&LFAST_RIISR_ICPRF_MASK)
#define LFAST_RIISR_ICPSF_MASK                   0x1000u
#define LFAST_RIISR_ICPSF_SHIFT                  12u
#define LFAST_RIISR_ICPSF_WIDTH                  1u
#define LFAST_RIISR_ICPSF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICPSF_SHIFT))&LFAST_RIISR_ICPSF_MASK)
#define LFAST_RIISR_ICPFF_MASK                   0x2000u
#define LFAST_RIISR_ICPFF_SHIFT                  13u
#define LFAST_RIISR_ICPFF_WIDTH                  1u
#define LFAST_RIISR_ICPFF(x)                     (((uint32_t)(((uint32_t)(x))<<LFAST_RIISR_ICPFF_SHIFT))&LFAST_RIISR_ICPFF_MASK)
/* PLLLSR Bit Fields */
#define LFAST_PLLLSR_LRPDS_MASK                  0x1u
#define LFAST_PLLLSR_LRPDS_SHIFT                 0u
#define LFAST_PLLLSR_LRPDS_WIDTH                 1u
#define LFAST_PLLLSR_LRPDS(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLLSR_LRPDS_SHIFT))&LFAST_PLLLSR_LRPDS_MASK)
#define LFAST_PLLLSR_LDPDS_MASK                  0x2u
#define LFAST_PLLLSR_LDPDS_SHIFT                 1u
#define LFAST_PLLLSR_LDPDS_WIDTH                 1u
#define LFAST_PLLLSR_LDPDS(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLLSR_LDPDS_SHIFT))&LFAST_PLLLSR_LDPDS_MASK)
#define LFAST_PLLLSR_LDSLPS_MASK                 0x4u
#define LFAST_PLLLSR_LDSLPS_SHIFT                2u
#define LFAST_PLLLSR_LDSLPS_WIDTH                1u
#define LFAST_PLLLSR_LDSLPS(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_PLLLSR_LDSLPS_SHIFT))&LFAST_PLLLSR_LDSLPS_MASK)
#define LFAST_PLLLSR_LRSLPS_MASK                 0x8u
#define LFAST_PLLLSR_LRSLPS_SHIFT                3u
#define LFAST_PLLLSR_LRSLPS_WIDTH                1u
#define LFAST_PLLLSR_LRSLPS(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_PLLLSR_LRSLPS_SHIFT))&LFAST_PLLLSR_LRSLPS_MASK)
#define LFAST_PLLLSR_PLDCR_MASK                  0x10000u
#define LFAST_PLLLSR_PLDCR_SHIFT                 16u
#define LFAST_PLLLSR_PLDCR_WIDTH                 1u
#define LFAST_PLLLSR_PLDCR(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_PLLLSR_PLDCR_SHIFT))&LFAST_PLLLSR_PLDCR_MASK)
#define LFAST_PLLLSR_PLLDIS_MASK                 0x20000u
#define LFAST_PLLLSR_PLLDIS_SHIFT                17u
#define LFAST_PLLLSR_PLLDIS_WIDTH                1u
#define LFAST_PLLLSR_PLLDIS(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_PLLLSR_PLLDIS_SHIFT))&LFAST_PLLLSR_PLLDIS_MASK)
/* UNSRSR Bit Fields */
#define LFAST_UNSRSR_URPCNT_MASK                 0x7u
#define LFAST_UNSRSR_URPCNT_SHIFT                0u
#define LFAST_UNSRSR_URPCNT_WIDTH                3u
#define LFAST_UNSRSR_URPCNT(x)                   (((uint32_t)(((uint32_t)(x))<<LFAST_UNSRSR_URPCNT_SHIFT))&LFAST_UNSRSR_URPCNT_MASK)
#define LFAST_UNSRSR_URXDV_MASK                  0x100u
#define LFAST_UNSRSR_URXDV_SHIFT                 8u
#define LFAST_UNSRSR_URXDV_WIDTH                 1u
#define LFAST_UNSRSR_URXDV(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_UNSRSR_URXDV_SHIFT))&LFAST_UNSRSR_URXDV_MASK)
/* UNSRDR Bit Fields */
#define LFAST_UNSRDR_UNRXD_MASK                  0xFFFFFFFFu
#define LFAST_UNSRDR_UNRXD_SHIFT                 0u
#define LFAST_UNSRDR_UNRXD_WIDTH                 32u
#define LFAST_UNSRDR_UNRXD(x)                    (((uint32_t)(((uint32_t)(x))<<LFAST_UNSRDR_UNRXD_SHIFT))&LFAST_UNSRDR_UNRXD_MASK)

/*!
 * @}
 */ /* end of group LFAST_Register_Masks */


/*!
 * @}
 */ /* end of group LFAST_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- MPU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup MPU_Peripheral_Access_Layer MPU Peripheral Access Layer
 * @{
 */


/** MPU - Size of Registers Arrays */
#define MPU_EAR_EDR_COUNT                        3u
#define MPU_RGD_COUNT                            16u
#define MPU_RGDAAC_COUNT                         16u

/** MPU - Register Layout Typedef */
typedef struct {
  __IO uint32_t CESR;                              /**< Control/Error Status Register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  struct {                                         /* offset: 0x10, array step: 0x8 */
    __I  uint32_t EAR;                               /**< Error Address Register, slave port n, array offset: 0x10, array step: 0x8 */
    __I  uint32_t EDR;                               /**< Error Detail Register, slave port n, array offset: 0x14, array step: 0x8 */
  } EAR_EDR[MPU_EAR_EDR_COUNT];
       uint8_t RESERVED_1[984];
  struct {                                         /* offset: 0x400, array step: 0x10 */
    __IO uint32_t WORD0;                             /**< Region Descriptor n, Word 0, array offset: 0x400, array step: 0x10 */
    __IO uint32_t WORD1;                             /**< Region Descriptor n, Word 1, array offset: 0x404, array step: 0x10 */
    __IO uint32_t WORD2;                             /**< Region Descriptor n, Word 2, array offset: 0x408, array step: 0x10 */
    __IO uint32_t WORD3;                             /**< Region Descriptor n, Word 3, array offset: 0x40C, array step: 0x10 */
  } RGD[MPU_RGD_COUNT];
       uint8_t RESERVED_2[768];
  __IO uint32_t RGDAAC[MPU_RGDAAC_COUNT];          /**< Region Descriptor Alternate Access Control n, array offset: 0x800, array step: 0x4 */
} MPU_Type, *MPU_MemMapPtr;

