neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* ----------------------------------------------------------------------------
   -- M_CAN Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup M_CAN_Register_Masks M_CAN Register Masks
 * @{
 */

/* CREL Bit Fields */
#define M_CAN_CREL_DAY_MASK                      0xFFu
#define M_CAN_CREL_DAY_SHIFT                     0u
#define M_CAN_CREL_DAY_WIDTH                     8u
#define M_CAN_CREL_DAY(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CREL_DAY_SHIFT))&M_CAN_CREL_DAY_MASK)
#define M_CAN_CREL_MON_MASK                      0xFF00u
#define M_CAN_CREL_MON_SHIFT                     8u
#define M_CAN_CREL_MON_WIDTH                     8u
#define M_CAN_CREL_MON(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CREL_MON_SHIFT))&M_CAN_CREL_MON_MASK)
#define M_CAN_CREL_YEAR_MASK                     0xF0000u
#define M_CAN_CREL_YEAR_SHIFT                    16u
#define M_CAN_CREL_YEAR_WIDTH                    4u
#define M_CAN_CREL_YEAR(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CREL_YEAR_SHIFT))&M_CAN_CREL_YEAR_MASK)
#define M_CAN_CREL_SUBSTEP_MASK                  0xF00000u
#define M_CAN_CREL_SUBSTEP_SHIFT                 20u
#define M_CAN_CREL_SUBSTEP_WIDTH                 4u
#define M_CAN_CREL_SUBSTEP(x)                    (((uint32_t)(((uint32_t)(x))<<M_CAN_CREL_SUBSTEP_SHIFT))&M_CAN_CREL_SUBSTEP_MASK)
#define M_CAN_CREL_STEP_MASK                     0xF000000u
#define M_CAN_CREL_STEP_SHIFT                    24u
#define M_CAN_CREL_STEP_WIDTH                    4u
#define M_CAN_CREL_STEP(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CREL_STEP_SHIFT))&M_CAN_CREL_STEP_MASK)
#define M_CAN_CREL_REL_MASK                      0xF0000000u
#define M_CAN_CREL_REL_SHIFT                     28u
#define M_CAN_CREL_REL_WIDTH                     4u
#define M_CAN_CREL_REL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CREL_REL_SHIFT))&M_CAN_CREL_REL_MASK)
/* ENDN Bit Fields */
#define M_CAN_ENDN_ETV_MASK                      0xFFFFFFFFu
#define M_CAN_ENDN_ETV_SHIFT                     0u
#define M_CAN_ENDN_ETV_WIDTH                     32u
#define M_CAN_ENDN_ETV(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ENDN_ETV_SHIFT))&M_CAN_ENDN_ETV_MASK)
/* DBTP Bit Fields */
#define M_CAN_DBTP_DSJW_MASK                     0xFu
#define M_CAN_DBTP_DSJW_SHIFT                    0u
#define M_CAN_DBTP_DSJW_WIDTH                    4u
#define M_CAN_DBTP_DSJW(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_DBTP_DSJW_SHIFT))&M_CAN_DBTP_DSJW_MASK)
#define M_CAN_DBTP_DTSEG2_MASK                   0xF0u
#define M_CAN_DBTP_DTSEG2_SHIFT                  4u
#define M_CAN_DBTP_DTSEG2_WIDTH                  4u
#define M_CAN_DBTP_DTSEG2(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_DBTP_DTSEG2_SHIFT))&M_CAN_DBTP_DTSEG2_MASK)
#define M_CAN_DBTP_DTSEG1_MASK                   0x1F00u
#define M_CAN_DBTP_DTSEG1_SHIFT                  8u
#define M_CAN_DBTP_DTSEG1_WIDTH                  5u
#define M_CAN_DBTP_DTSEG1(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_DBTP_DTSEG1_SHIFT))&M_CAN_DBTP_DTSEG1_MASK)
#define M_CAN_DBTP_DBRP_MASK                     0x1F0000u
#define M_CAN_DBTP_DBRP_SHIFT                    16u
#define M_CAN_DBTP_DBRP_WIDTH                    5u
#define M_CAN_DBTP_DBRP(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_DBTP_DBRP_SHIFT))&M_CAN_DBTP_DBRP_MASK)
#define M_CAN_DBTP_TDC_MASK                      0x800000u
#define M_CAN_DBTP_TDC_SHIFT                     23u
#define M_CAN_DBTP_TDC_WIDTH                     1u
#define M_CAN_DBTP_TDC(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_DBTP_TDC_SHIFT))&M_CAN_DBTP_TDC_MASK)
/* TEST Bit Fields */
#define M_CAN_TEST_LBCK_MASK                     0x10u
#define M_CAN_TEST_LBCK_SHIFT                    4u
#define M_CAN_TEST_LBCK_WIDTH                    1u
#define M_CAN_TEST_LBCK(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TEST_LBCK_SHIFT))&M_CAN_TEST_LBCK_MASK)
#define M_CAN_TEST_TX_MASK                       0x60u
#define M_CAN_TEST_TX_SHIFT                      5u
#define M_CAN_TEST_TX_WIDTH                      2u
#define M_CAN_TEST_TX(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_TEST_TX_SHIFT))&M_CAN_TEST_TX_MASK)
#define M_CAN_TEST_RX_MASK                       0x80u
#define M_CAN_TEST_RX_SHIFT                      7u
#define M_CAN_TEST_RX_WIDTH                      1u
#define M_CAN_TEST_RX(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_TEST_RX_SHIFT))&M_CAN_TEST_RX_MASK)
/* RWD Bit Fields */
#define M_CAN_RWD_WDC_MASK                       0xFFu
#define M_CAN_RWD_WDC_SHIFT                      0u
#define M_CAN_RWD_WDC_WIDTH                      8u
#define M_CAN_RWD_WDC(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_RWD_WDC_SHIFT))&M_CAN_RWD_WDC_MASK)
#define M_CAN_RWD_WDV_MASK                       0xFF00u
#define M_CAN_RWD_WDV_SHIFT                      8u
#define M_CAN_RWD_WDV_WIDTH                      8u
#define M_CAN_RWD_WDV(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_RWD_WDV_SHIFT))&M_CAN_RWD_WDV_MASK)
/* CCCR Bit Fields */
#define M_CAN_CCCR_INIT_MASK                     0x1u
#define M_CAN_CCCR_INIT_SHIFT                    0u
#define M_CAN_CCCR_INIT_WIDTH                    1u
#define M_CAN_CCCR_INIT(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_INIT_SHIFT))&M_CAN_CCCR_INIT_MASK)
#define M_CAN_CCCR_CCE_MASK                      0x2u
#define M_CAN_CCCR_CCE_SHIFT                     1u
#define M_CAN_CCCR_CCE_WIDTH                     1u
#define M_CAN_CCCR_CCE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_CCE_SHIFT))&M_CAN_CCCR_CCE_MASK)
#define M_CAN_CCCR_ASM_MASK                      0x4u
#define M_CAN_CCCR_ASM_SHIFT                     2u
#define M_CAN_CCCR_ASM_WIDTH                     1u
#define M_CAN_CCCR_ASM(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_ASM_SHIFT))&M_CAN_CCCR_ASM_MASK)
#define M_CAN_CCCR_CSA_MASK                      0x8u
#define M_CAN_CCCR_CSA_SHIFT                     3u
#define M_CAN_CCCR_CSA_WIDTH                     1u
#define M_CAN_CCCR_CSA(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_CSA_SHIFT))&M_CAN_CCCR_CSA_MASK)
#define M_CAN_CCCR_CSR_MASK                      0x10u
#define M_CAN_CCCR_CSR_SHIFT                     4u
#define M_CAN_CCCR_CSR_WIDTH                     1u
#define M_CAN_CCCR_CSR(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_CSR_SHIFT))&M_CAN_CCCR_CSR_MASK)
#define M_CAN_CCCR_MON_MASK                      0x20u
#define M_CAN_CCCR_MON_SHIFT                     5u
#define M_CAN_CCCR_MON_WIDTH                     1u
#define M_CAN_CCCR_MON(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_MON_SHIFT))&M_CAN_CCCR_MON_MASK)
#define M_CAN_CCCR_DAR_MASK                      0x40u
#define M_CAN_CCCR_DAR_SHIFT                     6u
#define M_CAN_CCCR_DAR_WIDTH                     1u
#define M_CAN_CCCR_DAR(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_DAR_SHIFT))&M_CAN_CCCR_DAR_MASK)
#define M_CAN_CCCR_TEST_MASK                     0x80u
#define M_CAN_CCCR_TEST_SHIFT                    7u
#define M_CAN_CCCR_TEST_WIDTH                    1u
#define M_CAN_CCCR_TEST(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_TEST_SHIFT))&M_CAN_CCCR_TEST_MASK)
#define M_CAN_CCCR_FDOE_MASK                     0x100u
#define M_CAN_CCCR_FDOE_SHIFT                    8u
#define M_CAN_CCCR_FDOE_WIDTH                    1u
#define M_CAN_CCCR_FDOE(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_FDOE_SHIFT))&M_CAN_CCCR_FDOE_MASK)
#define M_CAN_CCCR_BRSE_MASK                     0x200u
#define M_CAN_CCCR_BRSE_SHIFT                    9u
#define M_CAN_CCCR_BRSE_WIDTH                    1u
#define M_CAN_CCCR_BRSE(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_BRSE_SHIFT))&M_CAN_CCCR_BRSE_MASK)
#define M_CAN_CCCR_PHDX_MASK                     0x1000u
#define M_CAN_CCCR_PHDX_SHIFT                    12u
#define M_CAN_CCCR_PHDX_WIDTH                    1u
#define M_CAN_CCCR_PHDX(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_PHDX_SHIFT))&M_CAN_CCCR_PHDX_MASK)
#define M_CAN_CCCR_EFBI_MASK                     0x2000u
#define M_CAN_CCCR_EFBI_SHIFT                    13u
#define M_CAN_CCCR_EFBI_WIDTH                    1u
#define M_CAN_CCCR_EFBI(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_EFBI_SHIFT))&M_CAN_CCCR_EFBI_MASK)
#define M_CAN_CCCR_TXP_MASK                      0x4000u
#define M_CAN_CCCR_TXP_SHIFT                     14u
#define M_CAN_CCCR_TXP_WIDTH                     1u
#define M_CAN_CCCR_TXP(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_TXP_SHIFT))&M_CAN_CCCR_TXP_MASK)
#define M_CAN_CCCR_NISO_MASK                     0x8000u
#define M_CAN_CCCR_NISO_SHIFT                    15u
#define M_CAN_CCCR_NISO_WIDTH                    1u
#define M_CAN_CCCR_NISO(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_CCCR_NISO_SHIFT))&M_CAN_CCCR_NISO_MASK)
/* NBTP Bit Fields */
#define M_CAN_NBTP_NTSEG2_MASK                   0x7Fu
#define M_CAN_NBTP_NTSEG2_SHIFT                  0u
#define M_CAN_NBTP_NTSEG2_WIDTH                  7u
#define M_CAN_NBTP_NTSEG2(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_NBTP_NTSEG2_SHIFT))&M_CAN_NBTP_NTSEG2_MASK)
#define M_CAN_NBTP_NTSEG1_MASK                   0xFF00u
#define M_CAN_NBTP_NTSEG1_SHIFT                  8u
#define M_CAN_NBTP_NTSEG1_WIDTH                  8u
#define M_CAN_NBTP_NTSEG1(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_NBTP_NTSEG1_SHIFT))&M_CAN_NBTP_NTSEG1_MASK)
#define M_CAN_NBTP_NBRP_MASK                     0x1FF0000u
#define M_CAN_NBTP_NBRP_SHIFT                    16u
#define M_CAN_NBTP_NBRP_WIDTH                    9u
#define M_CAN_NBTP_NBRP(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_NBTP_NBRP_SHIFT))&M_CAN_NBTP_NBRP_MASK)
#define M_CAN_NBTP_NSJW_MASK                     0xFE000000u
#define M_CAN_NBTP_NSJW_SHIFT                    25u
#define M_CAN_NBTP_NSJW_WIDTH                    7u
#define M_CAN_NBTP_NSJW(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_NBTP_NSJW_SHIFT))&M_CAN_NBTP_NSJW_MASK)
/* TSCC Bit Fields */
#define M_CAN_TSCC_TSS_MASK                      0x3u
#define M_CAN_TSCC_TSS_SHIFT                     0u
#define M_CAN_TSCC_TSS_WIDTH                     2u
#define M_CAN_TSCC_TSS(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TSCC_TSS_SHIFT))&M_CAN_TSCC_TSS_MASK)
#define M_CAN_TSCC_TCP_MASK                      0xF0000u
#define M_CAN_TSCC_TCP_SHIFT                     16u
#define M_CAN_TSCC_TCP_WIDTH                     4u
#define M_CAN_TSCC_TCP(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TSCC_TCP_SHIFT))&M_CAN_TSCC_TCP_MASK)
/* TSCV Bit Fields */
#define M_CAN_TSCV_TSC_MASK                      0xFFFFu
#define M_CAN_TSCV_TSC_SHIFT                     0u
#define M_CAN_TSCV_TSC_WIDTH                     16u
#define M_CAN_TSCV_TSC(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TSCV_TSC_SHIFT))&M_CAN_TSCV_TSC_MASK)
/* TOCC Bit Fields */
#define M_CAN_TOCC_ETOC_MASK                     0x1u
#define M_CAN_TOCC_ETOC_SHIFT                    0u
#define M_CAN_TOCC_ETOC_WIDTH                    1u
#define M_CAN_TOCC_ETOC(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TOCC_ETOC_SHIFT))&M_CAN_TOCC_ETOC_MASK)
#define M_CAN_TOCC_TOS_MASK                      0x6u
#define M_CAN_TOCC_TOS_SHIFT                     1u
#define M_CAN_TOCC_TOS_WIDTH                     2u
#define M_CAN_TOCC_TOS(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TOCC_TOS_SHIFT))&M_CAN_TOCC_TOS_MASK)
#define M_CAN_TOCC_TOP_MASK                      0xFFFF0000u
#define M_CAN_TOCC_TOP_SHIFT                     16u
#define M_CAN_TOCC_TOP_WIDTH                     16u
#define M_CAN_TOCC_TOP(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TOCC_TOP_SHIFT))&M_CAN_TOCC_TOP_MASK)
/* TOCV Bit Fields */
#define M_CAN_TOCV_TOC_MASK                      0xFFFFu
#define M_CAN_TOCV_TOC_SHIFT                     0u
#define M_CAN_TOCV_TOC_WIDTH                     16u
#define M_CAN_TOCV_TOC(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TOCV_TOC_SHIFT))&M_CAN_TOCV_TOC_MASK)
/* ECR Bit Fields */
#define M_CAN_ECR_TEC_MASK                       0xFFu
#define M_CAN_ECR_TEC_SHIFT                      0u
#define M_CAN_ECR_TEC_WIDTH                      8u
#define M_CAN_ECR_TEC(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ECR_TEC_SHIFT))&M_CAN_ECR_TEC_MASK)
#define M_CAN_ECR_REC_MASK                       0x7F00u
#define M_CAN_ECR_REC_SHIFT                      8u
#define M_CAN_ECR_REC_WIDTH                      7u
#define M_CAN_ECR_REC(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ECR_REC_SHIFT))&M_CAN_ECR_REC_MASK)
#define M_CAN_ECR_RP_MASK                        0x8000u
#define M_CAN_ECR_RP_SHIFT                       15u
#define M_CAN_ECR_RP_WIDTH                       1u
#define M_CAN_ECR_RP(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_ECR_RP_SHIFT))&M_CAN_ECR_RP_MASK)
#define M_CAN_ECR_CEL_MASK                       0xFF0000u
#define M_CAN_ECR_CEL_SHIFT                      16u
#define M_CAN_ECR_CEL_WIDTH                      8u
#define M_CAN_ECR_CEL(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ECR_CEL_SHIFT))&M_CAN_ECR_CEL_MASK)
/* PSR Bit Fields */
#define M_CAN_PSR_LEC_MASK                       0x7u
#define M_CAN_PSR_LEC_SHIFT                      0u
#define M_CAN_PSR_LEC_WIDTH                      3u
#define M_CAN_PSR_LEC(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_LEC_SHIFT))&M_CAN_PSR_LEC_MASK)
#define M_CAN_PSR_ACT_MASK                       0x18u
#define M_CAN_PSR_ACT_SHIFT                      3u
#define M_CAN_PSR_ACT_WIDTH                      2u
#define M_CAN_PSR_ACT(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_ACT_SHIFT))&M_CAN_PSR_ACT_MASK)
#define M_CAN_PSR_EP_MASK                        0x20u
#define M_CAN_PSR_EP_SHIFT                       5u
#define M_CAN_PSR_EP_WIDTH                       1u
#define M_CAN_PSR_EP(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_EP_SHIFT))&M_CAN_PSR_EP_MASK)
#define M_CAN_PSR_EW_MASK                        0x40u
#define M_CAN_PSR_EW_SHIFT                       6u
#define M_CAN_PSR_EW_WIDTH                       1u
#define M_CAN_PSR_EW(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_EW_SHIFT))&M_CAN_PSR_EW_MASK)
#define M_CAN_PSR_BO_MASK                        0x80u
#define M_CAN_PSR_BO_SHIFT                       7u
#define M_CAN_PSR_BO_WIDTH                       1u
#define M_CAN_PSR_BO(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_BO_SHIFT))&M_CAN_PSR_BO_MASK)
#define M_CAN_PSR_DLEC_MASK                      0x700u
#define M_CAN_PSR_DLEC_SHIFT                     8u
#define M_CAN_PSR_DLEC_WIDTH                     3u
#define M_CAN_PSR_DLEC(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_DLEC_SHIFT))&M_CAN_PSR_DLEC_MASK)
#define M_CAN_PSR_RESI_MASK                      0x800u
#define M_CAN_PSR_RESI_SHIFT                     11u
#define M_CAN_PSR_RESI_WIDTH                     1u
#define M_CAN_PSR_RESI(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_RESI_SHIFT))&M_CAN_PSR_RESI_MASK)
#define M_CAN_PSR_RBRS_MASK                      0x1000u
#define M_CAN_PSR_RBRS_SHIFT                     12u
#define M_CAN_PSR_RBRS_WIDTH                     1u
#define M_CAN_PSR_RBRS(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_RBRS_SHIFT))&M_CAN_PSR_RBRS_MASK)
#define M_CAN_PSR_RFDF_MASK                      0x2000u
#define M_CAN_PSR_RFDF_SHIFT                     13u
#define M_CAN_PSR_RFDF_WIDTH                     1u
#define M_CAN_PSR_RFDF(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_RFDF_SHIFT))&M_CAN_PSR_RFDF_MASK)
#define M_CAN_PSR_PXE_MASK                       0x4000u
#define M_CAN_PSR_PXE_SHIFT                      14u
#define M_CAN_PSR_PXE_WIDTH                      1u
#define M_CAN_PSR_PXE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_PXE_SHIFT))&M_CAN_PSR_PXE_MASK)
#define M_CAN_PSR_TDCV_MASK                      0x7F0000u
#define M_CAN_PSR_TDCV_SHIFT                     16u
#define M_CAN_PSR_TDCV_WIDTH                     7u
#define M_CAN_PSR_TDCV(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_PSR_TDCV_SHIFT))&M_CAN_PSR_TDCV_MASK)
/* TDCR Bit Fields */
#define M_CAN_TDCR_TDCF_MASK                     0x7Fu
#define M_CAN_TDCR_TDCF_SHIFT                    0u
#define M_CAN_TDCR_TDCF_WIDTH                    7u
#define M_CAN_TDCR_TDCF(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TDCR_TDCF_SHIFT))&M_CAN_TDCR_TDCF_MASK)
#define M_CAN_TDCR_TDCO_MASK                     0x7F00u
#define M_CAN_TDCR_TDCO_SHIFT                    8u
#define M_CAN_TDCR_TDCO_WIDTH                    7u
#define M_CAN_TDCR_TDCO(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TDCR_TDCO_SHIFT))&M_CAN_TDCR_TDCO_MASK)
/* IR Bit Fields */
#define M_CAN_IR_RF0N_MASK                       0x1u
#define M_CAN_IR_RF0N_SHIFT                      0u
#define M_CAN_IR_RF0N_WIDTH                      1u
#define M_CAN_IR_RF0N(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF0N_SHIFT))&M_CAN_IR_RF0N_MASK)
#define M_CAN_IR_RF0W_MASK                       0x2u
#define M_CAN_IR_RF0W_SHIFT                      1u
#define M_CAN_IR_RF0W_WIDTH                      1u
#define M_CAN_IR_RF0W(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF0W_SHIFT))&M_CAN_IR_RF0W_MASK)
#define M_CAN_IR_RF0F_MASK                       0x4u
#define M_CAN_IR_RF0F_SHIFT                      2u
#define M_CAN_IR_RF0F_WIDTH                      1u
#define M_CAN_IR_RF0F(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF0F_SHIFT))&M_CAN_IR_RF0F_MASK)
#define M_CAN_IR_RF0L_MASK                       0x8u
#define M_CAN_IR_RF0L_SHIFT                      3u
#define M_CAN_IR_RF0L_WIDTH                      1u
#define M_CAN_IR_RF0L(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF0L_SHIFT))&M_CAN_IR_RF0L_MASK)
#define M_CAN_IR_RF1N_MASK                       0x10u
#define M_CAN_IR_RF1N_SHIFT                      4u
#define M_CAN_IR_RF1N_WIDTH                      1u
#define M_CAN_IR_RF1N(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF1N_SHIFT))&M_CAN_IR_RF1N_MASK)
#define M_CAN_IR_RF1W_MASK                       0x20u
#define M_CAN_IR_RF1W_SHIFT                      5u
#define M_CAN_IR_RF1W_WIDTH                      1u
#define M_CAN_IR_RF1W(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF1W_SHIFT))&M_CAN_IR_RF1W_MASK)
#define M_CAN_IR_RF1F_MASK                       0x40u
#define M_CAN_IR_RF1F_SHIFT                      6u
#define M_CAN_IR_RF1F_WIDTH                      1u
#define M_CAN_IR_RF1F(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF1F_SHIFT))&M_CAN_IR_RF1F_MASK)
#define M_CAN_IR_RF1L_MASK                       0x80u
#define M_CAN_IR_RF1L_SHIFT                      7u
#define M_CAN_IR_RF1L_WIDTH                      1u
#define M_CAN_IR_RF1L(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_RF1L_SHIFT))&M_CAN_IR_RF1L_MASK)
#define M_CAN_IR_HPM_MASK                        0x100u
#define M_CAN_IR_HPM_SHIFT                       8u
#define M_CAN_IR_HPM_WIDTH                       1u
#define M_CAN_IR_HPM(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_HPM_SHIFT))&M_CAN_IR_HPM_MASK)
#define M_CAN_IR_TC_MASK                         0x200u
#define M_CAN_IR_TC_SHIFT                        9u
#define M_CAN_IR_TC_WIDTH                        1u
#define M_CAN_IR_TC(x)                           (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TC_SHIFT))&M_CAN_IR_TC_MASK)
#define M_CAN_IR_TCF_MASK                        0x400u
#define M_CAN_IR_TCF_SHIFT                       10u
#define M_CAN_IR_TCF_WIDTH                       1u
#define M_CAN_IR_TCF(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TCF_SHIFT))&M_CAN_IR_TCF_MASK)
#define M_CAN_IR_TFE_MASK                        0x800u
#define M_CAN_IR_TFE_SHIFT                       11u
#define M_CAN_IR_TFE_WIDTH                       1u
#define M_CAN_IR_TFE(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TFE_SHIFT))&M_CAN_IR_TFE_MASK)
#define M_CAN_IR_TEFN_MASK                       0x1000u
#define M_CAN_IR_TEFN_SHIFT                      12u
#define M_CAN_IR_TEFN_WIDTH                      1u
#define M_CAN_IR_TEFN(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TEFN_SHIFT))&M_CAN_IR_TEFN_MASK)
#define M_CAN_IR_TEFW_MASK                       0x2000u
#define M_CAN_IR_TEFW_SHIFT                      13u
#define M_CAN_IR_TEFW_WIDTH                      1u
#define M_CAN_IR_TEFW(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TEFW_SHIFT))&M_CAN_IR_TEFW_MASK)
#define M_CAN_IR_TEFF_MASK                       0x4000u
#define M_CAN_IR_TEFF_SHIFT                      14u
#define M_CAN_IR_TEFF_WIDTH                      1u
#define M_CAN_IR_TEFF(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TEFF_SHIFT))&M_CAN_IR_TEFF_MASK)
#define M_CAN_IR_TEFL_MASK                       0x8000u
#define M_CAN_IR_TEFL_SHIFT                      15u
#define M_CAN_IR_TEFL_WIDTH                      1u
#define M_CAN_IR_TEFL(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TEFL_SHIFT))&M_CAN_IR_TEFL_MASK)
#define M_CAN_IR_TSW_MASK                        0x10000u
#define M_CAN_IR_TSW_SHIFT                       16u
#define M_CAN_IR_TSW_WIDTH                       1u
#define M_CAN_IR_TSW(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TSW_SHIFT))&M_CAN_IR_TSW_MASK)
#define M_CAN_IR_MRAF_MASK                       0x20000u
#define M_CAN_IR_MRAF_SHIFT                      17u
#define M_CAN_IR_MRAF_WIDTH                      1u
#define M_CAN_IR_MRAF(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_MRAF_SHIFT))&M_CAN_IR_MRAF_MASK)
#define M_CAN_IR_TOO_MASK                        0x40000u
#define M_CAN_IR_TOO_SHIFT                       18u
#define M_CAN_IR_TOO_WIDTH                       1u
#define M_CAN_IR_TOO(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_TOO_SHIFT))&M_CAN_IR_TOO_MASK)
#define M_CAN_IR_DRX_MASK                        0x80000u
#define M_CAN_IR_DRX_SHIFT                       19u
#define M_CAN_IR_DRX_WIDTH                       1u
#define M_CAN_IR_DRX(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_DRX_SHIFT))&M_CAN_IR_DRX_MASK)
#define M_CAN_IR_BEC_MASK                        0x100000u
#define M_CAN_IR_BEC_SHIFT                       20u
#define M_CAN_IR_BEC_WIDTH                       1u
#define M_CAN_IR_BEC(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_BEC_SHIFT))&M_CAN_IR_BEC_MASK)
#define M_CAN_IR_BEU_MASK                        0x200000u
#define M_CAN_IR_BEU_SHIFT                       21u
#define M_CAN_IR_BEU_WIDTH                       1u
#define M_CAN_IR_BEU(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_BEU_SHIFT))&M_CAN_IR_BEU_MASK)
#define M_CAN_IR_ELO_MASK                        0x400000u
#define M_CAN_IR_ELO_SHIFT                       22u
#define M_CAN_IR_ELO_WIDTH                       1u
#define M_CAN_IR_ELO(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_ELO_SHIFT))&M_CAN_IR_ELO_MASK)
#define M_CAN_IR_EP_MASK                         0x800000u
#define M_CAN_IR_EP_SHIFT                        23u
#define M_CAN_IR_EP_WIDTH                        1u
