neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define M_CAN_IR_EP(x)                           (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_EP_SHIFT))&M_CAN_IR_EP_MASK)
#define M_CAN_IR_EW_MASK                         0x1000000u
#define M_CAN_IR_EW_SHIFT                        24u
#define M_CAN_IR_EW_WIDTH                        1u
#define M_CAN_IR_EW(x)                           (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_EW_SHIFT))&M_CAN_IR_EW_MASK)
#define M_CAN_IR_BO_MASK                         0x2000000u
#define M_CAN_IR_BO_SHIFT                        25u
#define M_CAN_IR_BO_WIDTH                        1u
#define M_CAN_IR_BO(x)                           (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_BO_SHIFT))&M_CAN_IR_BO_MASK)
#define M_CAN_IR_WDI_MASK                        0x4000000u
#define M_CAN_IR_WDI_SHIFT                       26u
#define M_CAN_IR_WDI_WIDTH                       1u
#define M_CAN_IR_WDI(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_WDI_SHIFT))&M_CAN_IR_WDI_MASK)
#define M_CAN_IR_PEA_MASK                        0x8000000u
#define M_CAN_IR_PEA_SHIFT                       27u
#define M_CAN_IR_PEA_WIDTH                       1u
#define M_CAN_IR_PEA(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_PEA_SHIFT))&M_CAN_IR_PEA_MASK)
#define M_CAN_IR_PED_MASK                        0x10000000u
#define M_CAN_IR_PED_SHIFT                       28u
#define M_CAN_IR_PED_WIDTH                       1u
#define M_CAN_IR_PED(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_PED_SHIFT))&M_CAN_IR_PED_MASK)
#define M_CAN_IR_ARA_MASK                        0x20000000u
#define M_CAN_IR_ARA_SHIFT                       29u
#define M_CAN_IR_ARA_WIDTH                       1u
#define M_CAN_IR_ARA(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IR_ARA_SHIFT))&M_CAN_IR_ARA_MASK)
/* IE Bit Fields */
#define M_CAN_IE_RF0NE_MASK                      0x1u
#define M_CAN_IE_RF0NE_SHIFT                     0u
#define M_CAN_IE_RF0NE_WIDTH                     1u
#define M_CAN_IE_RF0NE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF0NE_SHIFT))&M_CAN_IE_RF0NE_MASK)
#define M_CAN_IE_RF0WE_MASK                      0x2u
#define M_CAN_IE_RF0WE_SHIFT                     1u
#define M_CAN_IE_RF0WE_WIDTH                     1u
#define M_CAN_IE_RF0WE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF0WE_SHIFT))&M_CAN_IE_RF0WE_MASK)
#define M_CAN_IE_RF0FE_MASK                      0x4u
#define M_CAN_IE_RF0FE_SHIFT                     2u
#define M_CAN_IE_RF0FE_WIDTH                     1u
#define M_CAN_IE_RF0FE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF0FE_SHIFT))&M_CAN_IE_RF0FE_MASK)
#define M_CAN_IE_RF0LE_MASK                      0x8u
#define M_CAN_IE_RF0LE_SHIFT                     3u
#define M_CAN_IE_RF0LE_WIDTH                     1u
#define M_CAN_IE_RF0LE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF0LE_SHIFT))&M_CAN_IE_RF0LE_MASK)
#define M_CAN_IE_RF1NE_MASK                      0x10u
#define M_CAN_IE_RF1NE_SHIFT                     4u
#define M_CAN_IE_RF1NE_WIDTH                     1u
#define M_CAN_IE_RF1NE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF1NE_SHIFT))&M_CAN_IE_RF1NE_MASK)
#define M_CAN_IE_RF1WE_MASK                      0x20u
#define M_CAN_IE_RF1WE_SHIFT                     5u
#define M_CAN_IE_RF1WE_WIDTH                     1u
#define M_CAN_IE_RF1WE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF1WE_SHIFT))&M_CAN_IE_RF1WE_MASK)
#define M_CAN_IE_RF1FE_MASK                      0x40u
#define M_CAN_IE_RF1FE_SHIFT                     6u
#define M_CAN_IE_RF1FE_WIDTH                     1u
#define M_CAN_IE_RF1FE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF1FE_SHIFT))&M_CAN_IE_RF1FE_MASK)
#define M_CAN_IE_RF1LE_MASK                      0x80u
#define M_CAN_IE_RF1LE_SHIFT                     7u
#define M_CAN_IE_RF1LE_WIDTH                     1u
#define M_CAN_IE_RF1LE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_RF1LE_SHIFT))&M_CAN_IE_RF1LE_MASK)
#define M_CAN_IE_HPME_MASK                       0x100u
#define M_CAN_IE_HPME_SHIFT                      8u
#define M_CAN_IE_HPME_WIDTH                      1u
#define M_CAN_IE_HPME(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_HPME_SHIFT))&M_CAN_IE_HPME_MASK)
#define M_CAN_IE_TCE_MASK                        0x200u
#define M_CAN_IE_TCE_SHIFT                       9u
#define M_CAN_IE_TCE_WIDTH                       1u
#define M_CAN_IE_TCE(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TCE_SHIFT))&M_CAN_IE_TCE_MASK)
#define M_CAN_IE_TCFE_MASK                       0x400u
#define M_CAN_IE_TCFE_SHIFT                      10u
#define M_CAN_IE_TCFE_WIDTH                      1u
#define M_CAN_IE_TCFE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TCFE_SHIFT))&M_CAN_IE_TCFE_MASK)
#define M_CAN_IE_TFEE_MASK                       0x800u
#define M_CAN_IE_TFEE_SHIFT                      11u
#define M_CAN_IE_TFEE_WIDTH                      1u
#define M_CAN_IE_TFEE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TFEE_SHIFT))&M_CAN_IE_TFEE_MASK)
#define M_CAN_IE_TEFNE_MASK                      0x1000u
#define M_CAN_IE_TEFNE_SHIFT                     12u
#define M_CAN_IE_TEFNE_WIDTH                     1u
#define M_CAN_IE_TEFNE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TEFNE_SHIFT))&M_CAN_IE_TEFNE_MASK)
#define M_CAN_IE_TEFWE_MASK                      0x2000u
#define M_CAN_IE_TEFWE_SHIFT                     13u
#define M_CAN_IE_TEFWE_WIDTH                     1u
#define M_CAN_IE_TEFWE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TEFWE_SHIFT))&M_CAN_IE_TEFWE_MASK)
#define M_CAN_IE_TEFFE_MASK                      0x4000u
#define M_CAN_IE_TEFFE_SHIFT                     14u
#define M_CAN_IE_TEFFE_WIDTH                     1u
#define M_CAN_IE_TEFFE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TEFFE_SHIFT))&M_CAN_IE_TEFFE_MASK)
#define M_CAN_IE_TEFLE_MASK                      0x8000u
#define M_CAN_IE_TEFLE_SHIFT                     15u
#define M_CAN_IE_TEFLE_WIDTH                     1u
#define M_CAN_IE_TEFLE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TEFLE_SHIFT))&M_CAN_IE_TEFLE_MASK)
#define M_CAN_IE_TSWE_MASK                       0x10000u
#define M_CAN_IE_TSWE_SHIFT                      16u
#define M_CAN_IE_TSWE_WIDTH                      1u
#define M_CAN_IE_TSWE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TSWE_SHIFT))&M_CAN_IE_TSWE_MASK)
#define M_CAN_IE_MRAFE_MASK                      0x20000u
#define M_CAN_IE_MRAFE_SHIFT                     17u
#define M_CAN_IE_MRAFE_WIDTH                     1u
#define M_CAN_IE_MRAFE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_MRAFE_SHIFT))&M_CAN_IE_MRAFE_MASK)
#define M_CAN_IE_TOOE_MASK                       0x40000u
#define M_CAN_IE_TOOE_SHIFT                      18u
#define M_CAN_IE_TOOE_WIDTH                      1u
#define M_CAN_IE_TOOE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_TOOE_SHIFT))&M_CAN_IE_TOOE_MASK)
#define M_CAN_IE_DRXE_MASK                       0x80000u
#define M_CAN_IE_DRXE_SHIFT                      19u
#define M_CAN_IE_DRXE_WIDTH                      1u
#define M_CAN_IE_DRXE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_DRXE_SHIFT))&M_CAN_IE_DRXE_MASK)
#define M_CAN_IE_BECE_MASK                       0x100000u
#define M_CAN_IE_BECE_SHIFT                      20u
#define M_CAN_IE_BECE_WIDTH                      1u
#define M_CAN_IE_BECE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_BECE_SHIFT))&M_CAN_IE_BECE_MASK)
#define M_CAN_IE_BEUE_MASK                       0x200000u
#define M_CAN_IE_BEUE_SHIFT                      21u
#define M_CAN_IE_BEUE_WIDTH                      1u
#define M_CAN_IE_BEUE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_BEUE_SHIFT))&M_CAN_IE_BEUE_MASK)
#define M_CAN_IE_ELOE_MASK                       0x400000u
#define M_CAN_IE_ELOE_SHIFT                      22u
#define M_CAN_IE_ELOE_WIDTH                      1u
#define M_CAN_IE_ELOE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_ELOE_SHIFT))&M_CAN_IE_ELOE_MASK)
#define M_CAN_IE_EPE_MASK                        0x800000u
#define M_CAN_IE_EPE_SHIFT                       23u
#define M_CAN_IE_EPE_WIDTH                       1u
#define M_CAN_IE_EPE(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_EPE_SHIFT))&M_CAN_IE_EPE_MASK)
#define M_CAN_IE_EWE_MASK                        0x1000000u
#define M_CAN_IE_EWE_SHIFT                       24u
#define M_CAN_IE_EWE_WIDTH                       1u
#define M_CAN_IE_EWE(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_EWE_SHIFT))&M_CAN_IE_EWE_MASK)
#define M_CAN_IE_BOE_MASK                        0x2000000u
#define M_CAN_IE_BOE_SHIFT                       25u
#define M_CAN_IE_BOE_WIDTH                       1u
#define M_CAN_IE_BOE(x)                          (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_BOE_SHIFT))&M_CAN_IE_BOE_MASK)
#define M_CAN_IE_WDIE_MASK                       0x4000000u
#define M_CAN_IE_WDIE_SHIFT                      26u
#define M_CAN_IE_WDIE_WIDTH                      1u
#define M_CAN_IE_WDIE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_WDIE_SHIFT))&M_CAN_IE_WDIE_MASK)
#define M_CAN_IE_PEAE_MASK                       0x8000000u
#define M_CAN_IE_PEAE_SHIFT                      27u
#define M_CAN_IE_PEAE_WIDTH                      1u
#define M_CAN_IE_PEAE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_PEAE_SHIFT))&M_CAN_IE_PEAE_MASK)
#define M_CAN_IE_PEDE_MASK                       0x10000000u
#define M_CAN_IE_PEDE_SHIFT                      28u
#define M_CAN_IE_PEDE_WIDTH                      1u
#define M_CAN_IE_PEDE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_PEDE_SHIFT))&M_CAN_IE_PEDE_MASK)
#define M_CAN_IE_ARAE_MASK                       0x20000000u
#define M_CAN_IE_ARAE_SHIFT                      29u
#define M_CAN_IE_ARAE_WIDTH                      1u
#define M_CAN_IE_ARAE(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_IE_ARAE_SHIFT))&M_CAN_IE_ARAE_MASK)
/* ILS Bit Fields */
#define M_CAN_ILS_RF0NL_MASK                     0x1u
#define M_CAN_ILS_RF0NL_SHIFT                    0u
#define M_CAN_ILS_RF0NL_WIDTH                    1u
#define M_CAN_ILS_RF0NL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF0NL_SHIFT))&M_CAN_ILS_RF0NL_MASK)
#define M_CAN_ILS_RF0WL_MASK                     0x2u
#define M_CAN_ILS_RF0WL_SHIFT                    1u
#define M_CAN_ILS_RF0WL_WIDTH                    1u
#define M_CAN_ILS_RF0WL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF0WL_SHIFT))&M_CAN_ILS_RF0WL_MASK)
#define M_CAN_ILS_RF0FL_MASK                     0x4u
#define M_CAN_ILS_RF0FL_SHIFT                    2u
#define M_CAN_ILS_RF0FL_WIDTH                    1u
#define M_CAN_ILS_RF0FL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF0FL_SHIFT))&M_CAN_ILS_RF0FL_MASK)
#define M_CAN_ILS_RF0LL_MASK                     0x8u
#define M_CAN_ILS_RF0LL_SHIFT                    3u
#define M_CAN_ILS_RF0LL_WIDTH                    1u
#define M_CAN_ILS_RF0LL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF0LL_SHIFT))&M_CAN_ILS_RF0LL_MASK)
#define M_CAN_ILS_RF1NL_MASK                     0x10u
#define M_CAN_ILS_RF1NL_SHIFT                    4u
#define M_CAN_ILS_RF1NL_WIDTH                    1u
#define M_CAN_ILS_RF1NL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF1NL_SHIFT))&M_CAN_ILS_RF1NL_MASK)
#define M_CAN_ILS_RF1WL_MASK                     0x20u
#define M_CAN_ILS_RF1WL_SHIFT                    5u
#define M_CAN_ILS_RF1WL_WIDTH                    1u
#define M_CAN_ILS_RF1WL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF1WL_SHIFT))&M_CAN_ILS_RF1WL_MASK)
#define M_CAN_ILS_RF1FL_MASK                     0x40u
#define M_CAN_ILS_RF1FL_SHIFT                    6u
#define M_CAN_ILS_RF1FL_WIDTH                    1u
#define M_CAN_ILS_RF1FL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF1FL_SHIFT))&M_CAN_ILS_RF1FL_MASK)
#define M_CAN_ILS_RF1LL_MASK                     0x80u
#define M_CAN_ILS_RF1LL_SHIFT                    7u
#define M_CAN_ILS_RF1LL_WIDTH                    1u
#define M_CAN_ILS_RF1LL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_RF1LL_SHIFT))&M_CAN_ILS_RF1LL_MASK)
#define M_CAN_ILS_HPML_MASK                      0x100u
#define M_CAN_ILS_HPML_SHIFT                     8u
#define M_CAN_ILS_HPML_WIDTH                     1u
#define M_CAN_ILS_HPML(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_HPML_SHIFT))&M_CAN_ILS_HPML_MASK)
#define M_CAN_ILS_TCL_MASK                       0x200u
#define M_CAN_ILS_TCL_SHIFT                      9u
#define M_CAN_ILS_TCL_WIDTH                      1u
#define M_CAN_ILS_TCL(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TCL_SHIFT))&M_CAN_ILS_TCL_MASK)
#define M_CAN_ILS_TCFL_MASK                      0x400u
#define M_CAN_ILS_TCFL_SHIFT                     10u
#define M_CAN_ILS_TCFL_WIDTH                     1u
#define M_CAN_ILS_TCFL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TCFL_SHIFT))&M_CAN_ILS_TCFL_MASK)
#define M_CAN_ILS_TFEL_MASK                      0x800u
#define M_CAN_ILS_TFEL_SHIFT                     11u
#define M_CAN_ILS_TFEL_WIDTH                     1u
#define M_CAN_ILS_TFEL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TFEL_SHIFT))&M_CAN_ILS_TFEL_MASK)
#define M_CAN_ILS_TEFNL_MASK                     0x1000u
#define M_CAN_ILS_TEFNL_SHIFT                    12u
#define M_CAN_ILS_TEFNL_WIDTH                    1u
#define M_CAN_ILS_TEFNL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TEFNL_SHIFT))&M_CAN_ILS_TEFNL_MASK)
#define M_CAN_ILS_TEFWL_MASK                     0x2000u
#define M_CAN_ILS_TEFWL_SHIFT                    13u
#define M_CAN_ILS_TEFWL_WIDTH                    1u
#define M_CAN_ILS_TEFWL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TEFWL_SHIFT))&M_CAN_ILS_TEFWL_MASK)
#define M_CAN_ILS_TEFFL_MASK                     0x4000u
#define M_CAN_ILS_TEFFL_SHIFT                    14u
#define M_CAN_ILS_TEFFL_WIDTH                    1u
#define M_CAN_ILS_TEFFL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TEFFL_SHIFT))&M_CAN_ILS_TEFFL_MASK)
#define M_CAN_ILS_TEFLL_MASK                     0x8000u
#define M_CAN_ILS_TEFLL_SHIFT                    15u
#define M_CAN_ILS_TEFLL_WIDTH                    1u
#define M_CAN_ILS_TEFLL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TEFLL_SHIFT))&M_CAN_ILS_TEFLL_MASK)
#define M_CAN_ILS_TSWL_MASK                      0x10000u
#define M_CAN_ILS_TSWL_SHIFT                     16u
#define M_CAN_ILS_TSWL_WIDTH                     1u
#define M_CAN_ILS_TSWL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TSWL_SHIFT))&M_CAN_ILS_TSWL_MASK)
#define M_CAN_ILS_MRAFL_MASK                     0x20000u
#define M_CAN_ILS_MRAFL_SHIFT                    17u
#define M_CAN_ILS_MRAFL_WIDTH                    1u
#define M_CAN_ILS_MRAFL(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_MRAFL_SHIFT))&M_CAN_ILS_MRAFL_MASK)
#define M_CAN_ILS_TOOL_MASK                      0x40000u
#define M_CAN_ILS_TOOL_SHIFT                     18u
#define M_CAN_ILS_TOOL_WIDTH                     1u
#define M_CAN_ILS_TOOL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_TOOL_SHIFT))&M_CAN_ILS_TOOL_MASK)
#define M_CAN_ILS_DRXL_MASK                      0x80000u
#define M_CAN_ILS_DRXL_SHIFT                     19u
#define M_CAN_ILS_DRXL_WIDTH                     1u
#define M_CAN_ILS_DRXL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_DRXL_SHIFT))&M_CAN_ILS_DRXL_MASK)
#define M_CAN_ILS_BECL_MASK                      0x100000u
#define M_CAN_ILS_BECL_SHIFT                     20u
#define M_CAN_ILS_BECL_WIDTH                     1u
#define M_CAN_ILS_BECL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_BECL_SHIFT))&M_CAN_ILS_BECL_MASK)
#define M_CAN_ILS_BEUL_MASK                      0x200000u
#define M_CAN_ILS_BEUL_SHIFT                     21u
#define M_CAN_ILS_BEUL_WIDTH                     1u
#define M_CAN_ILS_BEUL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_BEUL_SHIFT))&M_CAN_ILS_BEUL_MASK)
#define M_CAN_ILS_ELOL_MASK                      0x400000u
#define M_CAN_ILS_ELOL_SHIFT                     22u
#define M_CAN_ILS_ELOL_WIDTH                     1u
#define M_CAN_ILS_ELOL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_ELOL_SHIFT))&M_CAN_ILS_ELOL_MASK)
#define M_CAN_ILS_EPL_MASK                       0x800000u
#define M_CAN_ILS_EPL_SHIFT                      23u
#define M_CAN_ILS_EPL_WIDTH                      1u
#define M_CAN_ILS_EPL(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_EPL_SHIFT))&M_CAN_ILS_EPL_MASK)
#define M_CAN_ILS_EWL_MASK                       0x1000000u
#define M_CAN_ILS_EWL_SHIFT                      24u
#define M_CAN_ILS_EWL_WIDTH                      1u
#define M_CAN_ILS_EWL(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_EWL_SHIFT))&M_CAN_ILS_EWL_MASK)
#define M_CAN_ILS_BOL_MASK                       0x2000000u
#define M_CAN_ILS_BOL_SHIFT                      25u
#define M_CAN_ILS_BOL_WIDTH                      1u
#define M_CAN_ILS_BOL(x)                         (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_BOL_SHIFT))&M_CAN_ILS_BOL_MASK)
#define M_CAN_ILS_WDIL_MASK                      0x4000000u
#define M_CAN_ILS_WDIL_SHIFT                     26u
#define M_CAN_ILS_WDIL_WIDTH                     1u
#define M_CAN_ILS_WDIL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_WDIL_SHIFT))&M_CAN_ILS_WDIL_MASK)
#define M_CAN_ILS_PEAL_MASK                      0x8000000u
#define M_CAN_ILS_PEAL_SHIFT                     27u
#define M_CAN_ILS_PEAL_WIDTH                     1u
#define M_CAN_ILS_PEAL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_PEAL_SHIFT))&M_CAN_ILS_PEAL_MASK)
#define M_CAN_ILS_PEDL_MASK                      0x10000000u
#define M_CAN_ILS_PEDL_SHIFT                     28u
#define M_CAN_ILS_PEDL_WIDTH                     1u
#define M_CAN_ILS_PEDL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_PEDL_SHIFT))&M_CAN_ILS_PEDL_MASK)
#define M_CAN_ILS_ARAL_MASK                      0x20000000u
#define M_CAN_ILS_ARAL_SHIFT                     29u
#define M_CAN_ILS_ARAL_WIDTH                     1u
#define M_CAN_ILS_ARAL(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_ILS_ARAL_SHIFT))&M_CAN_ILS_ARAL_MASK)
/* ILE Bit Fields */
#define M_CAN_ILE_EINT0_MASK                     0x1u
#define M_CAN_ILE_EINT0_SHIFT                    0u
#define M_CAN_ILE_EINT0_WIDTH                    1u
#define M_CAN_ILE_EINT0(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILE_EINT0_SHIFT))&M_CAN_ILE_EINT0_MASK)
#define M_CAN_ILE_EINT1_MASK                     0x2u
#define M_CAN_ILE_EINT1_SHIFT                    1u
#define M_CAN_ILE_EINT1_WIDTH                    1u
#define M_CAN_ILE_EINT1(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_ILE_EINT1_SHIFT))&M_CAN_ILE_EINT1_MASK)
/* GFC Bit Fields */
#define M_CAN_GFC_RRFE_MASK                      0x1u
#define M_CAN_GFC_RRFE_SHIFT                     0u
#define M_CAN_GFC_RRFE_WIDTH                     1u
#define M_CAN_GFC_RRFE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_GFC_RRFE_SHIFT))&M_CAN_GFC_RRFE_MASK)
#define M_CAN_GFC_RRFS_MASK                      0x2u
#define M_CAN_GFC_RRFS_SHIFT                     1u
#define M_CAN_GFC_RRFS_WIDTH                     1u
#define M_CAN_GFC_RRFS(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_GFC_RRFS_SHIFT))&M_CAN_GFC_RRFS_MASK)
#define M_CAN_GFC_ANFE_MASK                      0xCu
#define M_CAN_GFC_ANFE_SHIFT                     2u
#define M_CAN_GFC_ANFE_WIDTH                     2u
#define M_CAN_GFC_ANFE(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_GFC_ANFE_SHIFT))&M_CAN_GFC_ANFE_MASK)
#define M_CAN_GFC_ANFS_MASK                      0x30u
#define M_CAN_GFC_ANFS_SHIFT                     4u
#define M_CAN_GFC_ANFS_WIDTH                     2u
#define M_CAN_GFC_ANFS(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_GFC_ANFS_SHIFT))&M_CAN_GFC_ANFS_MASK)
/* SIDFC Bit Fields */
#define M_CAN_SIDFC_FLSSA_MASK                   0xFFFCu
#define M_CAN_SIDFC_FLSSA_SHIFT                  2u
#define M_CAN_SIDFC_FLSSA_WIDTH                  14u
#define M_CAN_SIDFC_FLSSA(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_SIDFC_FLSSA_SHIFT))&M_CAN_SIDFC_FLSSA_MASK)
#define M_CAN_SIDFC_LSS_MASK                     0xFF0000u
#define M_CAN_SIDFC_LSS_SHIFT                    16u
#define M_CAN_SIDFC_LSS_WIDTH                    8u
#define M_CAN_SIDFC_LSS(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_SIDFC_LSS_SHIFT))&M_CAN_SIDFC_LSS_MASK)
/* XIDFC Bit Fields */
#define M_CAN_XIDFC_FLESA_MASK                   0xFFFCu
#define M_CAN_XIDFC_FLESA_SHIFT                  2u
#define M_CAN_XIDFC_FLESA_WIDTH                  14u
#define M_CAN_XIDFC_FLESA(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_XIDFC_FLESA_SHIFT))&M_CAN_XIDFC_FLESA_MASK)
#define M_CAN_XIDFC_LSE_MASK                     0x7F0000u
#define M_CAN_XIDFC_LSE_SHIFT                    16u
#define M_CAN_XIDFC_LSE_WIDTH                    7u
#define M_CAN_XIDFC_LSE(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_XIDFC_LSE_SHIFT))&M_CAN_XIDFC_LSE_MASK)
/* XIDAM Bit Fields */
#define M_CAN_XIDAM_EIDM_MASK                    0x1FFFFFFFu
#define M_CAN_XIDAM_EIDM_SHIFT                   0u
#define M_CAN_XIDAM_EIDM_WIDTH                   29u
#define M_CAN_XIDAM_EIDM(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_XIDAM_EIDM_SHIFT))&M_CAN_XIDAM_EIDM_MASK)
/* HPMS Bit Fields */
#define M_CAN_HPMS_BIDX_MASK                     0x3Fu
#define M_CAN_HPMS_BIDX_SHIFT                    0u
#define M_CAN_HPMS_BIDX_WIDTH                    6u
#define M_CAN_HPMS_BIDX(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_HPMS_BIDX_SHIFT))&M_CAN_HPMS_BIDX_MASK)
#define M_CAN_HPMS_MSI_MASK                      0xC0u
#define M_CAN_HPMS_MSI_SHIFT                     6u
#define M_CAN_HPMS_MSI_WIDTH                     2u
#define M_CAN_HPMS_MSI(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_HPMS_MSI_SHIFT))&M_CAN_HPMS_MSI_MASK)
#define M_CAN_HPMS_FIDX_MASK                     0x7F00u
#define M_CAN_HPMS_FIDX_SHIFT                    8u
#define M_CAN_HPMS_FIDX_WIDTH                    7u
#define M_CAN_HPMS_FIDX(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_HPMS_FIDX_SHIFT))&M_CAN_HPMS_FIDX_MASK)
#define M_CAN_HPMS_FLST_MASK                     0x8000u
#define M_CAN_HPMS_FLST_SHIFT                    15u
#define M_CAN_HPMS_FLST_WIDTH                    1u
#define M_CAN_HPMS_FLST(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_HPMS_FLST_SHIFT))&M_CAN_HPMS_FLST_MASK)
/* NDAT1 Bit Fields */
#define M_CAN_NDAT1_ND1_MASK                     0xFFFFFFFFu
#define M_CAN_NDAT1_ND1_SHIFT                    0u
#define M_CAN_NDAT1_ND1_WIDTH                    32u
#define M_CAN_NDAT1_ND1(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_NDAT1_ND1_SHIFT))&M_CAN_NDAT1_ND1_MASK)
/* NDAT2 Bit Fields */
#define M_CAN_NDAT2_ND2_MASK                     0xFFFFFFFFu
#define M_CAN_NDAT2_ND2_SHIFT                    0u
#define M_CAN_NDAT2_ND2_WIDTH                    32u
#define M_CAN_NDAT2_ND2(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_NDAT2_ND2_SHIFT))&M_CAN_NDAT2_ND2_MASK)
/* RXF0C Bit Fields */
