neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define M_CAN_RXF0C_F0SA_MASK                    0xFFFCu
#define M_CAN_RXF0C_F0SA_SHIFT                   2u
#define M_CAN_RXF0C_F0SA_WIDTH                   14u
#define M_CAN_RXF0C_F0SA(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0C_F0SA_SHIFT))&M_CAN_RXF0C_F0SA_MASK)
#define M_CAN_RXF0C_F0S_MASK                     0x7F0000u
#define M_CAN_RXF0C_F0S_SHIFT                    16u
#define M_CAN_RXF0C_F0S_WIDTH                    7u
#define M_CAN_RXF0C_F0S(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0C_F0S_SHIFT))&M_CAN_RXF0C_F0S_MASK)
#define M_CAN_RXF0C_F0WM_MASK                    0x7F000000u
#define M_CAN_RXF0C_F0WM_SHIFT                   24u
#define M_CAN_RXF0C_F0WM_WIDTH                   7u
#define M_CAN_RXF0C_F0WM(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0C_F0WM_SHIFT))&M_CAN_RXF0C_F0WM_MASK)
#define M_CAN_RXF0C_F0OM_MASK                    0x80000000u
#define M_CAN_RXF0C_F0OM_SHIFT                   31u
#define M_CAN_RXF0C_F0OM_WIDTH                   1u
#define M_CAN_RXF0C_F0OM(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0C_F0OM_SHIFT))&M_CAN_RXF0C_F0OM_MASK)
/* RXF0S Bit Fields */
#define M_CAN_RXF0S_F0FL_MASK                    0x7Fu
#define M_CAN_RXF0S_F0FL_SHIFT                   0u
#define M_CAN_RXF0S_F0FL_WIDTH                   7u
#define M_CAN_RXF0S_F0FL(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0S_F0FL_SHIFT))&M_CAN_RXF0S_F0FL_MASK)
#define M_CAN_RXF0S_F0GI_MASK                    0x3F00u
#define M_CAN_RXF0S_F0GI_SHIFT                   8u
#define M_CAN_RXF0S_F0GI_WIDTH                   6u
#define M_CAN_RXF0S_F0GI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0S_F0GI_SHIFT))&M_CAN_RXF0S_F0GI_MASK)
#define M_CAN_RXF0S_F0PI_MASK                    0x3F0000u
#define M_CAN_RXF0S_F0PI_SHIFT                   16u
#define M_CAN_RXF0S_F0PI_WIDTH                   6u
#define M_CAN_RXF0S_F0PI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0S_F0PI_SHIFT))&M_CAN_RXF0S_F0PI_MASK)
#define M_CAN_RXF0S_F0F_MASK                     0x1000000u
#define M_CAN_RXF0S_F0F_SHIFT                    24u
#define M_CAN_RXF0S_F0F_WIDTH                    1u
#define M_CAN_RXF0S_F0F(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0S_F0F_SHIFT))&M_CAN_RXF0S_F0F_MASK)
#define M_CAN_RXF0S_RF0L_MASK                    0x2000000u
#define M_CAN_RXF0S_RF0L_SHIFT                   25u
#define M_CAN_RXF0S_RF0L_WIDTH                   1u
#define M_CAN_RXF0S_RF0L(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0S_RF0L_SHIFT))&M_CAN_RXF0S_RF0L_MASK)
/* RXF0A Bit Fields */
#define M_CAN_RXF0A_F0AI_MASK                    0x3Fu
#define M_CAN_RXF0A_F0AI_SHIFT                   0u
#define M_CAN_RXF0A_F0AI_WIDTH                   6u
#define M_CAN_RXF0A_F0AI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF0A_F0AI_SHIFT))&M_CAN_RXF0A_F0AI_MASK)
/* RXBC Bit Fields */
#define M_CAN_RXBC_RBSA_MASK                     0xFFFCu
#define M_CAN_RXBC_RBSA_SHIFT                    2u
#define M_CAN_RXBC_RBSA_WIDTH                    14u
#define M_CAN_RXBC_RBSA(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_RXBC_RBSA_SHIFT))&M_CAN_RXBC_RBSA_MASK)
/* RXF1C Bit Fields */
#define M_CAN_RXF1C_F1SA_MASK                    0xFFFCu
#define M_CAN_RXF1C_F1SA_SHIFT                   2u
#define M_CAN_RXF1C_F1SA_WIDTH                   14u
#define M_CAN_RXF1C_F1SA(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1C_F1SA_SHIFT))&M_CAN_RXF1C_F1SA_MASK)
#define M_CAN_RXF1C_F1S_MASK                     0x7F0000u
#define M_CAN_RXF1C_F1S_SHIFT                    16u
#define M_CAN_RXF1C_F1S_WIDTH                    7u
#define M_CAN_RXF1C_F1S(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1C_F1S_SHIFT))&M_CAN_RXF1C_F1S_MASK)
#define M_CAN_RXF1C_F1WM_MASK                    0x7F000000u
#define M_CAN_RXF1C_F1WM_SHIFT                   24u
#define M_CAN_RXF1C_F1WM_WIDTH                   7u
#define M_CAN_RXF1C_F1WM(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1C_F1WM_SHIFT))&M_CAN_RXF1C_F1WM_MASK)
#define M_CAN_RXF1C_F1OM_MASK                    0x80000000u
#define M_CAN_RXF1C_F1OM_SHIFT                   31u
#define M_CAN_RXF1C_F1OM_WIDTH                   1u
#define M_CAN_RXF1C_F1OM(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1C_F1OM_SHIFT))&M_CAN_RXF1C_F1OM_MASK)
/* RXF1S Bit Fields */
#define M_CAN_RXF1S_F1FL_MASK                    0x7Fu
#define M_CAN_RXF1S_F1FL_SHIFT                   0u
#define M_CAN_RXF1S_F1FL_WIDTH                   7u
#define M_CAN_RXF1S_F1FL(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1S_F1FL_SHIFT))&M_CAN_RXF1S_F1FL_MASK)
#define M_CAN_RXF1S_F1GI_MASK                    0x3F00u
#define M_CAN_RXF1S_F1GI_SHIFT                   8u
#define M_CAN_RXF1S_F1GI_WIDTH                   6u
#define M_CAN_RXF1S_F1GI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1S_F1GI_SHIFT))&M_CAN_RXF1S_F1GI_MASK)
#define M_CAN_RXF1S_F1PI_MASK                    0x3F0000u
#define M_CAN_RXF1S_F1PI_SHIFT                   16u
#define M_CAN_RXF1S_F1PI_WIDTH                   6u
#define M_CAN_RXF1S_F1PI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1S_F1PI_SHIFT))&M_CAN_RXF1S_F1PI_MASK)
#define M_CAN_RXF1S_F1F_MASK                     0x1000000u
#define M_CAN_RXF1S_F1F_SHIFT                    24u
#define M_CAN_RXF1S_F1F_WIDTH                    1u
#define M_CAN_RXF1S_F1F(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1S_F1F_SHIFT))&M_CAN_RXF1S_F1F_MASK)
#define M_CAN_RXF1S_RF1L_MASK                    0x2000000u
#define M_CAN_RXF1S_RF1L_SHIFT                   25u
#define M_CAN_RXF1S_RF1L_WIDTH                   1u
#define M_CAN_RXF1S_RF1L(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1S_RF1L_SHIFT))&M_CAN_RXF1S_RF1L_MASK)
#define M_CAN_RXF1S_DMS_MASK                     0xC0000000u
#define M_CAN_RXF1S_DMS_SHIFT                    30u
#define M_CAN_RXF1S_DMS_WIDTH                    2u
#define M_CAN_RXF1S_DMS(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1S_DMS_SHIFT))&M_CAN_RXF1S_DMS_MASK)
/* RXF1A Bit Fields */
#define M_CAN_RXF1A_F1AI_MASK                    0x3Fu
#define M_CAN_RXF1A_F1AI_SHIFT                   0u
#define M_CAN_RXF1A_F1AI_WIDTH                   6u
#define M_CAN_RXF1A_F1AI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXF1A_F1AI_SHIFT))&M_CAN_RXF1A_F1AI_MASK)
/* RXESC Bit Fields */
#define M_CAN_RXESC_F0DS_MASK                    0x7u
#define M_CAN_RXESC_F0DS_SHIFT                   0u
#define M_CAN_RXESC_F0DS_WIDTH                   3u
#define M_CAN_RXESC_F0DS(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXESC_F0DS_SHIFT))&M_CAN_RXESC_F0DS_MASK)
#define M_CAN_RXESC_F1DS_MASK                    0x70u
#define M_CAN_RXESC_F1DS_SHIFT                   4u
#define M_CAN_RXESC_F1DS_WIDTH                   3u
#define M_CAN_RXESC_F1DS(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXESC_F1DS_SHIFT))&M_CAN_RXESC_F1DS_MASK)
#define M_CAN_RXESC_RBDS_MASK                    0x700u
#define M_CAN_RXESC_RBDS_SHIFT                   8u
#define M_CAN_RXESC_RBDS_WIDTH                   3u
#define M_CAN_RXESC_RBDS(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_RXESC_RBDS_SHIFT))&M_CAN_RXESC_RBDS_MASK)
/* TXBC Bit Fields */
#define M_CAN_TXBC_TBSA_MASK                     0xFFFCu
#define M_CAN_TXBC_TBSA_SHIFT                    2u
#define M_CAN_TXBC_TBSA_WIDTH                    14u
#define M_CAN_TXBC_TBSA(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBC_TBSA_SHIFT))&M_CAN_TXBC_TBSA_MASK)
#define M_CAN_TXBC_NDTB_MASK                     0x3F0000u
#define M_CAN_TXBC_NDTB_SHIFT                    16u
#define M_CAN_TXBC_NDTB_WIDTH                    6u
#define M_CAN_TXBC_NDTB(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBC_NDTB_SHIFT))&M_CAN_TXBC_NDTB_MASK)
#define M_CAN_TXBC_TFQS_MASK                     0x3F000000u
#define M_CAN_TXBC_TFQS_SHIFT                    24u
#define M_CAN_TXBC_TFQS_WIDTH                    6u
#define M_CAN_TXBC_TFQS(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBC_TFQS_SHIFT))&M_CAN_TXBC_TFQS_MASK)
#define M_CAN_TXBC_TFQM_MASK                     0x40000000u
#define M_CAN_TXBC_TFQM_SHIFT                    30u
#define M_CAN_TXBC_TFQM_WIDTH                    1u
#define M_CAN_TXBC_TFQM(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBC_TFQM_SHIFT))&M_CAN_TXBC_TFQM_MASK)
/* TXFQS Bit Fields */
#define M_CAN_TXFQS_TFFL_MASK                    0x3Fu
#define M_CAN_TXFQS_TFFL_SHIFT                   0u
#define M_CAN_TXFQS_TFFL_WIDTH                   6u
#define M_CAN_TXFQS_TFFL(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXFQS_TFFL_SHIFT))&M_CAN_TXFQS_TFFL_MASK)
#define M_CAN_TXFQS_TFGI_MASK                    0x1F00u
#define M_CAN_TXFQS_TFGI_SHIFT                   8u
#define M_CAN_TXFQS_TFGI_WIDTH                   5u
#define M_CAN_TXFQS_TFGI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXFQS_TFGI_SHIFT))&M_CAN_TXFQS_TFGI_MASK)
#define M_CAN_TXFQS_TFQPI_MASK                   0x1F0000u
#define M_CAN_TXFQS_TFQPI_SHIFT                  16u
#define M_CAN_TXFQS_TFQPI_WIDTH                  5u
#define M_CAN_TXFQS_TFQPI(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_TXFQS_TFQPI_SHIFT))&M_CAN_TXFQS_TFQPI_MASK)
#define M_CAN_TXFQS_TFQF_MASK                    0x200000u
#define M_CAN_TXFQS_TFQF_SHIFT                   21u
#define M_CAN_TXFQS_TFQF_WIDTH                   1u
#define M_CAN_TXFQS_TFQF(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXFQS_TFQF_SHIFT))&M_CAN_TXFQS_TFQF_MASK)
/* TXESC Bit Fields */
#define M_CAN_TXESC_TBDS_MASK                    0x7u
#define M_CAN_TXESC_TBDS_SHIFT                   0u
#define M_CAN_TXESC_TBDS_WIDTH                   3u
#define M_CAN_TXESC_TBDS(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXESC_TBDS_SHIFT))&M_CAN_TXESC_TBDS_MASK)
/* TXBRP Bit Fields */
#define M_CAN_TXBRP_TRP_MASK                     0xFFFFFFFFu
#define M_CAN_TXBRP_TRP_SHIFT                    0u
#define M_CAN_TXBRP_TRP_WIDTH                    32u
#define M_CAN_TXBRP_TRP(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBRP_TRP_SHIFT))&M_CAN_TXBRP_TRP_MASK)
/* TXBAR Bit Fields */
#define M_CAN_TXBAR_AR_MASK                      0xFFFFFFFFu
#define M_CAN_TXBAR_AR_SHIFT                     0u
#define M_CAN_TXBAR_AR_WIDTH                     32u
#define M_CAN_TXBAR_AR(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBAR_AR_SHIFT))&M_CAN_TXBAR_AR_MASK)
/* TXBCR Bit Fields */
#define M_CAN_TXBCR_CR_MASK                      0xFFFFFFFFu
#define M_CAN_TXBCR_CR_SHIFT                     0u
#define M_CAN_TXBCR_CR_WIDTH                     32u
#define M_CAN_TXBCR_CR(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBCR_CR_SHIFT))&M_CAN_TXBCR_CR_MASK)
/* TXBTO Bit Fields */
#define M_CAN_TXBTO_TO_MASK                      0xFFFFFFFFu
#define M_CAN_TXBTO_TO_SHIFT                     0u
#define M_CAN_TXBTO_TO_WIDTH                     32u
#define M_CAN_TXBTO_TO(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBTO_TO_SHIFT))&M_CAN_TXBTO_TO_MASK)
/* TXBCF Bit Fields */
#define M_CAN_TXBCF_CF_MASK                      0xFFFFFFFFu
#define M_CAN_TXBCF_CF_SHIFT                     0u
#define M_CAN_TXBCF_CF_WIDTH                     32u
#define M_CAN_TXBCF_CF(x)                        (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBCF_CF_SHIFT))&M_CAN_TXBCF_CF_MASK)
/* TXBTIE Bit Fields */
#define M_CAN_TXBTIE_TIE_MASK                    0xFFFFFFFFu
#define M_CAN_TXBTIE_TIE_SHIFT                   0u
#define M_CAN_TXBTIE_TIE_WIDTH                   32u
#define M_CAN_TXBTIE_TIE(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBTIE_TIE_SHIFT))&M_CAN_TXBTIE_TIE_MASK)
/* TXBCIE Bit Fields */
#define M_CAN_TXBCIE_CFIE_MASK                   0xFFFFFFFFu
#define M_CAN_TXBCIE_CFIE_SHIFT                  0u
#define M_CAN_TXBCIE_CFIE_WIDTH                  32u
#define M_CAN_TXBCIE_CFIE(x)                     (((uint32_t)(((uint32_t)(x))<<M_CAN_TXBCIE_CFIE_SHIFT))&M_CAN_TXBCIE_CFIE_MASK)
/* TXEFC Bit Fields */
#define M_CAN_TXEFC_EFSA_MASK                    0xFFFCu
#define M_CAN_TXEFC_EFSA_SHIFT                   2u
#define M_CAN_TXEFC_EFSA_WIDTH                   14u
#define M_CAN_TXEFC_EFSA(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFC_EFSA_SHIFT))&M_CAN_TXEFC_EFSA_MASK)
#define M_CAN_TXEFC_EFS_MASK                     0x3F0000u
#define M_CAN_TXEFC_EFS_SHIFT                    16u
#define M_CAN_TXEFC_EFS_WIDTH                    6u
#define M_CAN_TXEFC_EFS(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFC_EFS_SHIFT))&M_CAN_TXEFC_EFS_MASK)
#define M_CAN_TXEFC_EFWM_MASK                    0x3F000000u
#define M_CAN_TXEFC_EFWM_SHIFT                   24u
#define M_CAN_TXEFC_EFWM_WIDTH                   6u
#define M_CAN_TXEFC_EFWM(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFC_EFWM_SHIFT))&M_CAN_TXEFC_EFWM_MASK)
/* TXEFS Bit Fields */
#define M_CAN_TXEFS_EFFL_MASK                    0x3Fu
#define M_CAN_TXEFS_EFFL_SHIFT                   0u
#define M_CAN_TXEFS_EFFL_WIDTH                   6u
#define M_CAN_TXEFS_EFFL(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFS_EFFL_SHIFT))&M_CAN_TXEFS_EFFL_MASK)
#define M_CAN_TXEFS_EFGI_MASK                    0x1F00u
#define M_CAN_TXEFS_EFGI_SHIFT                   8u
#define M_CAN_TXEFS_EFGI_WIDTH                   5u
#define M_CAN_TXEFS_EFGI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFS_EFGI_SHIFT))&M_CAN_TXEFS_EFGI_MASK)
#define M_CAN_TXEFS_EFPI_MASK                    0x1F0000u
#define M_CAN_TXEFS_EFPI_SHIFT                   16u
#define M_CAN_TXEFS_EFPI_WIDTH                   5u
#define M_CAN_TXEFS_EFPI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFS_EFPI_SHIFT))&M_CAN_TXEFS_EFPI_MASK)
#define M_CAN_TXEFS_EFF_MASK                     0x1000000u
#define M_CAN_TXEFS_EFF_SHIFT                    24u
#define M_CAN_TXEFS_EFF_WIDTH                    1u
#define M_CAN_TXEFS_EFF(x)                       (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFS_EFF_SHIFT))&M_CAN_TXEFS_EFF_MASK)
#define M_CAN_TXEFS_TEFL_MASK                    0x2000000u
#define M_CAN_TXEFS_TEFL_SHIFT                   25u
#define M_CAN_TXEFS_TEFL_WIDTH                   1u
#define M_CAN_TXEFS_TEFL(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFS_TEFL_SHIFT))&M_CAN_TXEFS_TEFL_MASK)
/* TXEFA Bit Fields */
#define M_CAN_TXEFA_EFAI_MASK                    0x1Fu
#define M_CAN_TXEFA_EFAI_SHIFT                   0u
#define M_CAN_TXEFA_EFAI_WIDTH                   5u
#define M_CAN_TXEFA_EFAI(x)                      (((uint32_t)(((uint32_t)(x))<<M_CAN_TXEFA_EFAI_SHIFT))&M_CAN_TXEFA_EFAI_MASK)

/*!
 * @}
 */ /* end of group M_CAN_Register_Masks */


/*!
 * @}
 */ /* end of group M_CAN_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PASS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PASS_Peripheral_Access_Layer PASS Peripheral Access Layer
 * @{
 */


