neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** PASS - Size of Registers Arrays */
#define PASS_CIN_COUNT                           8u
#define PASS_PG_COUNT                            4u

/** PASS - Register Layout Typedef */
typedef struct {
  __I  uint32_t LCSTAT;                            /**< Life Cycle Status Register, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint32_t CHSEL;                             /**< Challenge Selector Register, offset: 0x8 */
       uint8_t RESERVED_1[4];
  __I  uint32_t CSTAT;                             /**< Challenge Status Register, offset: 0x10 */
       uint8_t RESERVED_2[12];
  __O  uint32_t CIN[PASS_CIN_COUNT];               /**< Challenge Input Register, array offset: 0x20, array step: 0x4 */
       uint8_t RESERVED_3[192];
  struct {                                         /* offset: 0x100, array step: 0x10 */
    __IO uint32_t LOCK0;                             /**< Password Group n - Lock 0 Status Register, array offset: 0x100, array step: 0x10 */
    __IO uint32_t LOCK1;                             /**< Password Group n - Lock 1 Status Register, array offset: 0x104, array step: 0x10 */
    __IO uint32_t LOCK2;                             /**< Password Group n - Lock 2 Status Register, array offset: 0x108, array step: 0x10 */
    __IO uint32_t LOCK3;                             /**< Password Group n - Lock 3 Status Register, array offset: 0x10C, array step: 0x10 */
  } PG[PASS_PG_COUNT];
} PASS_Type, *PASS_MemMapPtr;

 /** Number of instances of the PASS module. */
#define PASS_INSTANCE_COUNT                      (1u)


/* PASS - Peripheral instance base addresses */
/** Peripheral PASS base address */
#define PASS_BASE                                (0xFFFF4000u)
/** Peripheral PASS base pointer */
#define PASS                                     ((PASS_Type *)PASS_BASE)
/** Array initializer of PASS peripheral base addresses */
#define PASS_BASE_ADDRS                          { PASS_BASE }
/** Array initializer of PASS peripheral base pointers */
#define PASS_BASE_PTRS                           { PASS }

/* ----------------------------------------------------------------------------
   -- PASS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PASS_Register_Masks PASS Register Masks
 * @{
 */

/* LCSTAT Bit Fields */
#define PASS_LCSTAT_LIFE_MASK                    0x7u
#define PASS_LCSTAT_LIFE_SHIFT                   0u
#define PASS_LCSTAT_LIFE_WIDTH                   3u
#define PASS_LCSTAT_LIFE(x)                      (((uint32_t)(((uint32_t)(x))<<PASS_LCSTAT_LIFE_SHIFT))&PASS_LCSTAT_LIFE_MASK)
#define PASS_LCSTAT_JUN_MASK                     0x40000000u
#define PASS_LCSTAT_JUN_SHIFT                    30u
#define PASS_LCSTAT_JUN_WIDTH                    1u
#define PASS_LCSTAT_JUN(x)                       (((uint32_t)(((uint32_t)(x))<<PASS_LCSTAT_JUN_SHIFT))&PASS_LCSTAT_JUN_MASK)
#define PASS_LCSTAT_CNS_MASK                     0x80000000u
#define PASS_LCSTAT_CNS_SHIFT                    31u
#define PASS_LCSTAT_CNS_WIDTH                    1u
#define PASS_LCSTAT_CNS(x)                       (((uint32_t)(((uint32_t)(x))<<PASS_LCSTAT_CNS_SHIFT))&PASS_LCSTAT_CNS_MASK)
/* CHSEL Bit Fields */
#define PASS_CHSEL_GRP_MASK                      0x3u
#define PASS_CHSEL_GRP_SHIFT                     0u
#define PASS_CHSEL_GRP_WIDTH                     2u
#define PASS_CHSEL_GRP(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_CHSEL_GRP_SHIFT))&PASS_CHSEL_GRP_MASK)
/* CSTAT Bit Fields */
#define PASS_CSTAT_CMST_MASK                     0xFu
#define PASS_CSTAT_CMST_SHIFT                    0u
#define PASS_CSTAT_CMST_WIDTH                    4u
#define PASS_CSTAT_CMST(x)                       (((uint32_t)(((uint32_t)(x))<<PASS_CSTAT_CMST_SHIFT))&PASS_CSTAT_CMST_MASK)
/* CIN Bit Fields */
#define PASS_CIN_PW32_MASK                       0xFFFFFFFFu
#define PASS_CIN_PW32_SHIFT                      0u
#define PASS_CIN_PW32_WIDTH                      32u
#define PASS_CIN_PW32(x)                         (((uint32_t)(((uint32_t)(x))<<PASS_CIN_PW32_SHIFT))&PASS_CIN_PW32_MASK)
/* LOCK0 Bit Fields */
#define PASS_LOCK0_MIDLOCK_MASK                  0xFFFFu
#define PASS_LOCK0_MIDLOCK_SHIFT                 0u
#define PASS_LOCK0_MIDLOCK_WIDTH                 16u
#define PASS_LOCK0_MIDLOCK(x)                    (((uint32_t)(((uint32_t)(x))<<PASS_LOCK0_MIDLOCK_SHIFT))&PASS_LOCK0_MIDLOCK_MASK)
#define PASS_LOCK0_LOWLOCK_MASK                  0x3FFF0000u
#define PASS_LOCK0_LOWLOCK_SHIFT                 16u
#define PASS_LOCK0_LOWLOCK_WIDTH                 14u
#define PASS_LOCK0_LOWLOCK(x)                    (((uint32_t)(((uint32_t)(x))<<PASS_LOCK0_LOWLOCK_SHIFT))&PASS_LOCK0_LOWLOCK_MASK)
#define PASS_LOCK0_TSLOCK_MASK                   0x80000000u
#define PASS_LOCK0_TSLOCK_SHIFT                  31u
#define PASS_LOCK0_TSLOCK_WIDTH                  1u
#define PASS_LOCK0_TSLOCK(x)                     (((uint32_t)(((uint32_t)(x))<<PASS_LOCK0_TSLOCK_SHIFT))&PASS_LOCK0_TSLOCK_MASK)
/* LOCK1 Bit Fields */
#define PASS_LOCK1_HIGHLOCK_MASK                 0xFFFFu
#define PASS_LOCK1_HIGHLOCK_SHIFT                0u
#define PASS_LOCK1_HIGHLOCK_WIDTH                16u
#define PASS_LOCK1_HIGHLOCK(x)                   (((uint32_t)(((uint32_t)(x))<<PASS_LOCK1_HIGHLOCK_SHIFT))&PASS_LOCK1_HIGHLOCK_MASK)
/* LOCK2 Bit Fields */
#define PASS_LOCK2_L_256LCK_MASK                 0xFFFFFFFFu
#define PASS_LOCK2_L_256LCK_SHIFT                0u
#define PASS_LOCK2_L_256LCK_WIDTH                32u
#define PASS_LOCK2_L_256LCK(x)                   (((uint32_t)(((uint32_t)(x))<<PASS_LOCK2_L_256LCK_SHIFT))&PASS_LOCK2_L_256LCK_MASK)
/* LOCK3 Bit Fields */
#define PASS_LOCK3_U_256LCK_MASK                 0xFFFFu
#define PASS_LOCK3_U_256LCK_SHIFT                0u
#define PASS_LOCK3_U_256LCK_WIDTH                16u
#define PASS_LOCK3_U_256LCK(x)                   (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_U_256LCK_SHIFT))&PASS_LOCK3_U_256LCK_MASK)
#define PASS_LOCK3_RL0_MASK                      0x10000u
#define PASS_LOCK3_RL0_SHIFT                     16u
#define PASS_LOCK3_RL0_WIDTH                     1u
#define PASS_LOCK3_RL0(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_RL0_SHIFT))&PASS_LOCK3_RL0_MASK)
#define PASS_LOCK3_RL1_MASK                      0x20000u
#define PASS_LOCK3_RL1_SHIFT                     17u
#define PASS_LOCK3_RL1_WIDTH                     1u
#define PASS_LOCK3_RL1(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_RL1_SHIFT))&PASS_LOCK3_RL1_MASK)
#define PASS_LOCK3_RL2_MASK                      0x40000u
#define PASS_LOCK3_RL2_SHIFT                     18u
#define PASS_LOCK3_RL2_WIDTH                     1u
#define PASS_LOCK3_RL2(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_RL2_SHIFT))&PASS_LOCK3_RL2_MASK)
#define PASS_LOCK3_RL3_MASK                      0x80000u
#define PASS_LOCK3_RL3_SHIFT                     19u
#define PASS_LOCK3_RL3_WIDTH                     1u
#define PASS_LOCK3_RL3(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_RL3_SHIFT))&PASS_LOCK3_RL3_MASK)
#define PASS_LOCK3_MSTR_MASK                     0xF000000u
#define PASS_LOCK3_MSTR_SHIFT                    24u
#define PASS_LOCK3_MSTR_WIDTH                    4u
#define PASS_LOCK3_MSTR(x)                       (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_MSTR_SHIFT))&PASS_LOCK3_MSTR_MASK)
#define PASS_LOCK3_MO_MASK                       0x20000000u
#define PASS_LOCK3_MO_SHIFT                      29u
#define PASS_LOCK3_MO_WIDTH                      1u
#define PASS_LOCK3_MO(x)                         (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_MO_SHIFT))&PASS_LOCK3_MO_MASK)
#define PASS_LOCK3_DBL_MASK                      0x40000000u
#define PASS_LOCK3_DBL_SHIFT                     30u
#define PASS_LOCK3_DBL_WIDTH                     1u
#define PASS_LOCK3_DBL(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_DBL_SHIFT))&PASS_LOCK3_DBL_MASK)
#define PASS_LOCK3_PGL_MASK                      0x80000000u
#define PASS_LOCK3_PGL_SHIFT                     31u
#define PASS_LOCK3_PGL_WIDTH                     1u
#define PASS_LOCK3_PGL(x)                        (((uint32_t)(((uint32_t)(x))<<PASS_LOCK3_PGL_SHIFT))&PASS_LOCK3_PGL_MASK)

/*!
 * @}
 */ /* end of group PASS_Register_Masks */


/*!
 * @}
 */ /* end of group PASS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCM_Peripheral_Access_Layer PCM Peripheral Access Layer
 * @{
 */


/** PCM - Size of Registers Arrays */

/** PCM - Register Layout Typedef */
typedef struct {
  __IO uint32_t FBOMCR;                            /**< FEC Burst Optimization Master Control Register, offset: 0x0 */
  __IO uint32_t IAHB_BE1;                          /**< Bus Bridge Configuration Register 1, offset: 0x4 */
  __IO uint32_t IAHB_BE2;                          /**< Bus Bridge Configuration Register 2, offset: 0x8 */
} PCM_Type, *PCM_MemMapPtr;

 /** Number of instances of the PCM module. */
#define PCM_INSTANCE_COUNT                       (1u)


/* PCM - Peripheral instance base addresses */
/** Peripheral PCM base address */
#define PCM_BASE                                 (0xFFF6C000u)
/** Peripheral PCM base pointer */
#define PCM                                      ((PCM_Type *)PCM_BASE)
/** Array initializer of PCM peripheral base addresses */
#define PCM_BASE_ADDRS                           { PCM_BASE }
/** Array initializer of PCM peripheral base pointers */
#define PCM_BASE_PTRS                            { PCM }

/* ----------------------------------------------------------------------------
   -- PCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCM_Register_Masks PCM Register Masks
 * @{
 */

