neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* FBOMCR Bit Fields */
#define PCM_FBOMCR_FXSBE_MASK                    0xFFu
#define PCM_FBOMCR_FXSBE_SHIFT                   0u
#define PCM_FBOMCR_FXSBE_WIDTH                   8u
#define PCM_FBOMCR_FXSBE(x)                      (((uint32_t)(((uint32_t)(x))<<PCM_FBOMCR_FXSBE_SHIFT))&PCM_FBOMCR_FXSBE_MASK)
#define PCM_FBOMCR_RBEN_MASK                     0x100u
#define PCM_FBOMCR_RBEN_SHIFT                    8u
#define PCM_FBOMCR_RBEN_WIDTH                    1u
#define PCM_FBOMCR_RBEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCM_FBOMCR_RBEN_SHIFT))&PCM_FBOMCR_RBEN_MASK)
#define PCM_FBOMCR_WBEN_MASK                     0x200u
#define PCM_FBOMCR_WBEN_SHIFT                    9u
#define PCM_FBOMCR_WBEN_WIDTH                    1u
#define PCM_FBOMCR_WBEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCM_FBOMCR_WBEN_SHIFT))&PCM_FBOMCR_WBEN_MASK)
#define PCM_FBOMCR_ACCERR_MASK                   0x400u
#define PCM_FBOMCR_ACCERR_SHIFT                  10u
#define PCM_FBOMCR_ACCERR_WIDTH                  1u
#define PCM_FBOMCR_ACCERR(x)                     (((uint32_t)(((uint32_t)(x))<<PCM_FBOMCR_ACCERR_SHIFT))&PCM_FBOMCR_ACCERR_MASK)
/* IAHB_BE1 Bit Fields */
#define PCM_IAHB_BE1_BWE_CORE0_I_MASK            0x1u
#define PCM_IAHB_BE1_BWE_CORE0_I_SHIFT           0u
#define PCM_IAHB_BE1_BWE_CORE0_I_WIDTH           1u
#define PCM_IAHB_BE1_BWE_CORE0_I(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BWE_CORE0_I_SHIFT))&PCM_IAHB_BE1_BWE_CORE0_I_MASK)
#define PCM_IAHB_BE1_BRE_CORE0_I_MASK            0x2u
#define PCM_IAHB_BE1_BRE_CORE0_I_SHIFT           1u
#define PCM_IAHB_BE1_BRE_CORE0_I_WIDTH           1u
#define PCM_IAHB_BE1_BRE_CORE0_I(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BRE_CORE0_I_SHIFT))&PCM_IAHB_BE1_BRE_CORE0_I_MASK)
#define PCM_IAHB_BE1_PRE_CORE0_I_MASK            0x4u
#define PCM_IAHB_BE1_PRE_CORE0_I_SHIFT           2u
#define PCM_IAHB_BE1_PRE_CORE0_I_WIDTH           1u
#define PCM_IAHB_BE1_PRE_CORE0_I(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_PRE_CORE0_I_SHIFT))&PCM_IAHB_BE1_PRE_CORE0_I_MASK)
#define PCM_IAHB_BE1_BWE_CORE0_D_MASK            0x100u
#define PCM_IAHB_BE1_BWE_CORE0_D_SHIFT           8u
#define PCM_IAHB_BE1_BWE_CORE0_D_WIDTH           1u
#define PCM_IAHB_BE1_BWE_CORE0_D(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BWE_CORE0_D_SHIFT))&PCM_IAHB_BE1_BWE_CORE0_D_MASK)
#define PCM_IAHB_BE1_BRE_CORE0_D_MASK            0x200u
#define PCM_IAHB_BE1_BRE_CORE0_D_SHIFT           9u
#define PCM_IAHB_BE1_BRE_CORE0_D_WIDTH           1u
#define PCM_IAHB_BE1_BRE_CORE0_D(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BRE_CORE0_D_SHIFT))&PCM_IAHB_BE1_BRE_CORE0_D_MASK)
#define PCM_IAHB_BE1_PRE_CORE0_D_MASK            0x400u
#define PCM_IAHB_BE1_PRE_CORE0_D_SHIFT           10u
#define PCM_IAHB_BE1_PRE_CORE0_D_WIDTH           1u
#define PCM_IAHB_BE1_PRE_CORE0_D(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_PRE_CORE0_D_SHIFT))&PCM_IAHB_BE1_PRE_CORE0_D_MASK)
#define PCM_IAHB_BE1_BWE_CORE1_I_MASK            0x10000u
#define PCM_IAHB_BE1_BWE_CORE1_I_SHIFT           16u
#define PCM_IAHB_BE1_BWE_CORE1_I_WIDTH           1u
#define PCM_IAHB_BE1_BWE_CORE1_I(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BWE_CORE1_I_SHIFT))&PCM_IAHB_BE1_BWE_CORE1_I_MASK)
#define PCM_IAHB_BE1_BRE_CORE1_I_MASK            0x20000u
#define PCM_IAHB_BE1_BRE_CORE1_I_SHIFT           17u
#define PCM_IAHB_BE1_BRE_CORE1_I_WIDTH           1u
#define PCM_IAHB_BE1_BRE_CORE1_I(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BRE_CORE1_I_SHIFT))&PCM_IAHB_BE1_BRE_CORE1_I_MASK)
#define PCM_IAHB_BE1_PRE_CORE1_I_MASK            0x40000u
#define PCM_IAHB_BE1_PRE_CORE1_I_SHIFT           18u
#define PCM_IAHB_BE1_PRE_CORE1_I_WIDTH           1u
#define PCM_IAHB_BE1_PRE_CORE1_I(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_PRE_CORE1_I_SHIFT))&PCM_IAHB_BE1_PRE_CORE1_I_MASK)
#define PCM_IAHB_BE1_BWE_CORE1_D_MASK            0x1000000u
#define PCM_IAHB_BE1_BWE_CORE1_D_SHIFT           24u
#define PCM_IAHB_BE1_BWE_CORE1_D_WIDTH           1u
#define PCM_IAHB_BE1_BWE_CORE1_D(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BWE_CORE1_D_SHIFT))&PCM_IAHB_BE1_BWE_CORE1_D_MASK)
#define PCM_IAHB_BE1_BRE_CORE1_D_MASK            0x2000000u
#define PCM_IAHB_BE1_BRE_CORE1_D_SHIFT           25u
#define PCM_IAHB_BE1_BRE_CORE1_D_WIDTH           1u
#define PCM_IAHB_BE1_BRE_CORE1_D(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_BRE_CORE1_D_SHIFT))&PCM_IAHB_BE1_BRE_CORE1_D_MASK)
#define PCM_IAHB_BE1_PRE_CORE1_D_MASK            0x4000000u
#define PCM_IAHB_BE1_PRE_CORE1_D_SHIFT           26u
#define PCM_IAHB_BE1_PRE_CORE1_D_WIDTH           1u
#define PCM_IAHB_BE1_PRE_CORE1_D(x)              (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE1_PRE_CORE1_D_SHIFT))&PCM_IAHB_BE1_PRE_CORE1_D_MASK)
/* IAHB_BE2 Bit Fields */
#define PCM_IAHB_BE2_BWE_DMA_A_MASK              0x1u
#define PCM_IAHB_BE2_BWE_DMA_A_SHIFT             0u
#define PCM_IAHB_BE2_BWE_DMA_A_WIDTH             1u
#define PCM_IAHB_BE2_BWE_DMA_A(x)                (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BWE_DMA_A_SHIFT))&PCM_IAHB_BE2_BWE_DMA_A_MASK)
#define PCM_IAHB_BE2_BRE_DMA_A_MASK              0x2u
#define PCM_IAHB_BE2_BRE_DMA_A_SHIFT             1u
#define PCM_IAHB_BE2_BRE_DMA_A_WIDTH             1u
#define PCM_IAHB_BE2_BRE_DMA_A(x)                (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BRE_DMA_A_SHIFT))&PCM_IAHB_BE2_BRE_DMA_A_MASK)
#define PCM_IAHB_BE2_PRE_DMA_A_MASK              0x4u
#define PCM_IAHB_BE2_PRE_DMA_A_SHIFT             2u
#define PCM_IAHB_BE2_PRE_DMA_A_WIDTH             1u
#define PCM_IAHB_BE2_PRE_DMA_A(x)                (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_PRE_DMA_A_SHIFT))&PCM_IAHB_BE2_PRE_DMA_A_MASK)
#define PCM_IAHB_BE2_BWE_DMA_B_MASK              0x100u
#define PCM_IAHB_BE2_BWE_DMA_B_SHIFT             8u
#define PCM_IAHB_BE2_BWE_DMA_B_WIDTH             1u
#define PCM_IAHB_BE2_BWE_DMA_B(x)                (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BWE_DMA_B_SHIFT))&PCM_IAHB_BE2_BWE_DMA_B_MASK)
#define PCM_IAHB_BE2_BRE_DMA_B_MASK              0x200u
#define PCM_IAHB_BE2_BRE_DMA_B_SHIFT             9u
#define PCM_IAHB_BE2_BRE_DMA_B_WIDTH             1u
#define PCM_IAHB_BE2_BRE_DMA_B(x)                (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BRE_DMA_B_SHIFT))&PCM_IAHB_BE2_BRE_DMA_B_MASK)
#define PCM_IAHB_BE2_PRE_DMA_B_MASK              0x400u
#define PCM_IAHB_BE2_PRE_DMA_B_SHIFT             10u
#define PCM_IAHB_BE2_PRE_DMA_B_WIDTH             1u
#define PCM_IAHB_BE2_PRE_DMA_B(x)                (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_PRE_DMA_B_SHIFT))&PCM_IAHB_BE2_PRE_DMA_B_MASK)
#define PCM_IAHB_BE2_BWE_M6_MASK                 0x10000u
#define PCM_IAHB_BE2_BWE_M6_SHIFT                16u
#define PCM_IAHB_BE2_BWE_M6_WIDTH                1u
#define PCM_IAHB_BE2_BWE_M6(x)                   (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BWE_M6_SHIFT))&PCM_IAHB_BE2_BWE_M6_MASK)
#define PCM_IAHB_BE2_BRE_M6_MASK                 0x20000u
#define PCM_IAHB_BE2_BRE_M6_SHIFT                17u
#define PCM_IAHB_BE2_BRE_M6_WIDTH                1u
#define PCM_IAHB_BE2_BRE_M6(x)                   (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BRE_M6_SHIFT))&PCM_IAHB_BE2_BRE_M6_MASK)
#define PCM_IAHB_BE2_PRE_M6_MASK                 0x40000u
#define PCM_IAHB_BE2_PRE_M6_SHIFT                18u
#define PCM_IAHB_BE2_PRE_M6_WIDTH                1u
#define PCM_IAHB_BE2_PRE_M6(x)                   (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_PRE_M6_SHIFT))&PCM_IAHB_BE2_PRE_M6_MASK)
#define PCM_IAHB_BE2_BWE_FEC_MASK                0x1000000u
#define PCM_IAHB_BE2_BWE_FEC_SHIFT               24u
#define PCM_IAHB_BE2_BWE_FEC_WIDTH               1u
#define PCM_IAHB_BE2_BWE_FEC(x)                  (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BWE_FEC_SHIFT))&PCM_IAHB_BE2_BWE_FEC_MASK)
#define PCM_IAHB_BE2_BRE_FEC_MASK                0x2000000u
#define PCM_IAHB_BE2_BRE_FEC_SHIFT               25u
#define PCM_IAHB_BE2_BRE_FEC_WIDTH               1u
#define PCM_IAHB_BE2_BRE_FEC(x)                  (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_BRE_FEC_SHIFT))&PCM_IAHB_BE2_BRE_FEC_MASK)
#define PCM_IAHB_BE2_PRE_FEC_MASK                0x4000000u
#define PCM_IAHB_BE2_PRE_FEC_SHIFT               26u
#define PCM_IAHB_BE2_PRE_FEC_WIDTH               1u
#define PCM_IAHB_BE2_PRE_FEC(x)                  (((uint32_t)(((uint32_t)(x))<<PCM_IAHB_BE2_PRE_FEC_SHIFT))&PCM_IAHB_BE2_PRE_FEC_MASK)

/*!
 * @}
 */ /* end of group PCM_Register_Masks */


/*!
 * @}
 */ /* end of group PCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PCS_0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCS_0_Peripheral_Access_Layer PCS_0 Peripheral Access Layer
 * @{
 */


/** PCS_0 - Size of Registers Arrays */

/** PCS_0 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[1792];
  __IO uint32_t SDUR;                              /**< PCS Switch Duration Register, offset: 0x700 */
  __IO uint32_t DIVC1;                             /**< PCS Divider Change Register for XOSC, offset: 0x704 */
  __IO uint32_t DIVE1;                             /**< PCS Divider End Register for XOSC, offset: 0x708 */
  __IO uint32_t DIVS1;                             /**< PCS Divider Start Register for XOSC, offset: 0x70C */
  __IO uint32_t DIVC2;                             /**< PCS Divider Change Register for PLL1, offset: 0x710 */
  __IO uint32_t DIVE2;                             /**< PCS Divider End Register for PLL1, offset: 0x714 */
  __IO uint32_t DIVS2;                             /**< PCS Divider Start Register for PLL1, offset: 0x718 */
  __IO uint32_t DIVC3;                             /**< PCS Divider Change Register for PLL0, offset: 0x71C */
  __IO uint32_t DIVE3;                             /**< PCS Divider End Register for PLL0, offset: 0x720 */
  __IO uint32_t DIVS3;                             /**< PCS Divider Start Register for PLL0, offset: 0x724 */
} PCS_0_Type, *PCS_0_MemMapPtr;

 /** Number of instances of the PCS_0 module. */
#define PCS_0_INSTANCE_COUNT                     (1u)


/* PCS_0 - Peripheral instance base addresses */
/** Peripheral PCS_0 base address */
#define PCS_0_BASE                               (0xFFE70000u)
/** Peripheral PCS_0 base pointer */
#define PCS_0                                    ((PCS_0_Type *)PCS_0_BASE)
/** Array initializer of PCS_0 peripheral base addresses */
#define PCS_0_BASE_ADDRS                         { PCS_0_BASE }
/** Array initializer of PCS_0 peripheral base pointers */
#define PCS_0_BASE_PTRS                          { PCS_0 }

/* ----------------------------------------------------------------------------
   -- PCS_0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCS_0_Register_Masks PCS_0 Register Masks
 * @{
 */

