neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* SDUR Bit Fields */
#define PCS_0_SDUR_SDUR_MASK                     0xFF000000u
#define PCS_0_SDUR_SDUR_SHIFT                    24u
#define PCS_0_SDUR_SDUR_WIDTH                    8u
#define PCS_0_SDUR_SDUR(x)                       (((uint32_t)(((uint32_t)(x))<<PCS_0_SDUR_SDUR_SHIFT))&PCS_0_SDUR_SDUR_MASK)
/* DIVC1 Bit Fields */
#define PCS_0_DIVC1_RATE_MASK                    0xFFu
#define PCS_0_DIVC1_RATE_SHIFT                   0u
#define PCS_0_DIVC1_RATE_WIDTH                   8u
#define PCS_0_DIVC1_RATE(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVC1_RATE_SHIFT))&PCS_0_DIVC1_RATE_MASK)
#define PCS_0_DIVC1_INIT_MASK                    0xFFFF0000u
#define PCS_0_DIVC1_INIT_SHIFT                   16u
#define PCS_0_DIVC1_INIT_WIDTH                   16u
#define PCS_0_DIVC1_INIT(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVC1_INIT_SHIFT))&PCS_0_DIVC1_INIT_MASK)
/* DIVE1 Bit Fields */
#define PCS_0_DIVE1_DIVE_MASK                    0xFFFFFu
#define PCS_0_DIVE1_DIVE_SHIFT                   0u
#define PCS_0_DIVE1_DIVE_WIDTH                   20u
#define PCS_0_DIVE1_DIVE(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVE1_DIVE_SHIFT))&PCS_0_DIVE1_DIVE_MASK)
/* DIVS1 Bit Fields */
#define PCS_0_DIVS1_DIVS_MASK                    0xFFFFFu
#define PCS_0_DIVS1_DIVS_SHIFT                   0u
#define PCS_0_DIVS1_DIVS_WIDTH                   20u
#define PCS_0_DIVS1_DIVS(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVS1_DIVS_SHIFT))&PCS_0_DIVS1_DIVS_MASK)
/* DIVC2 Bit Fields */
#define PCS_0_DIVC2_RATE_MASK                    0xFFu
#define PCS_0_DIVC2_RATE_SHIFT                   0u
#define PCS_0_DIVC2_RATE_WIDTH                   8u
#define PCS_0_DIVC2_RATE(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVC2_RATE_SHIFT))&PCS_0_DIVC2_RATE_MASK)
#define PCS_0_DIVC2_INIT_MASK                    0xFFFF0000u
#define PCS_0_DIVC2_INIT_SHIFT                   16u
#define PCS_0_DIVC2_INIT_WIDTH                   16u
#define PCS_0_DIVC2_INIT(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVC2_INIT_SHIFT))&PCS_0_DIVC2_INIT_MASK)
/* DIVE2 Bit Fields */
#define PCS_0_DIVE2_DIVE_MASK                    0xFFFFFu
#define PCS_0_DIVE2_DIVE_SHIFT                   0u
#define PCS_0_DIVE2_DIVE_WIDTH                   20u
#define PCS_0_DIVE2_DIVE(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVE2_DIVE_SHIFT))&PCS_0_DIVE2_DIVE_MASK)
/* DIVS2 Bit Fields */
#define PCS_0_DIVS2_DIVS_MASK                    0xFFFFFu
#define PCS_0_DIVS2_DIVS_SHIFT                   0u
#define PCS_0_DIVS2_DIVS_WIDTH                   20u
#define PCS_0_DIVS2_DIVS(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVS2_DIVS_SHIFT))&PCS_0_DIVS2_DIVS_MASK)
/* DIVC3 Bit Fields */
#define PCS_0_DIVC3_RATE_MASK                    0xFFu
#define PCS_0_DIVC3_RATE_SHIFT                   0u
#define PCS_0_DIVC3_RATE_WIDTH                   8u
#define PCS_0_DIVC3_RATE(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVC3_RATE_SHIFT))&PCS_0_DIVC3_RATE_MASK)
#define PCS_0_DIVC3_INIT_MASK                    0xFFFF0000u
#define PCS_0_DIVC3_INIT_SHIFT                   16u
#define PCS_0_DIVC3_INIT_WIDTH                   16u
#define PCS_0_DIVC3_INIT(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVC3_INIT_SHIFT))&PCS_0_DIVC3_INIT_MASK)
/* DIVE3 Bit Fields */
#define PCS_0_DIVE3_DIVE_MASK                    0xFFFFFu
#define PCS_0_DIVE3_DIVE_SHIFT                   0u
#define PCS_0_DIVE3_DIVE_WIDTH                   20u
#define PCS_0_DIVE3_DIVE(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVE3_DIVE_SHIFT))&PCS_0_DIVE3_DIVE_MASK)
/* DIVS3 Bit Fields */
#define PCS_0_DIVS3_DIVS_MASK                    0xFFFFFu
#define PCS_0_DIVS3_DIVS_SHIFT                   0u
#define PCS_0_DIVS3_DIVS_WIDTH                   20u
#define PCS_0_DIVS3_DIVS(x)                      (((uint32_t)(((uint32_t)(x))<<PCS_0_DIVS3_DIVS_SHIFT))&PCS_0_DIVS3_DIVS_MASK)

/*!
 * @}
 */ /* end of group PCS_0_Register_Masks */


/*!
 * @}
 */ /* end of group PCS_0_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PCU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCU_Peripheral_Access_Layer PCU Peripheral Access Layer
 * @{
 */


/** PCU - Size of Registers Arrays */
#define PCU_EAR_EDR_COUNT                        2u
#define PCU_IR_COUNT                             2u

/** PCU - Register Layout Typedef */
typedef struct {
  __IO uint32_t CESR;                              /**< PCU Configuration and Error Status Register, offset: 0x0 */
       uint8_t RESERVED_0[12];
  struct {                                         /* offset: 0x10, array step: 0x10 */
    __I  uint32_t EAR;                               /**< PCU Error Address Register, Core n, array offset: 0x10, array step: 0x10 */
    __I  uint32_t EDR;                               /**< PCU Error Detail Register, Core n, array offset: 0x14, array step: 0x10 */
         uint8_t RESERVED_0[8];
  } EAR_EDR[PCU_EAR_EDR_COUNT];
  __IO uint32_t IR[PCU_IR_COUNT];                  /**< PCU Interrupt Register, Core n, array offset: 0x30, array step: 0x4 */
} PCU_Type, *PCU_MemMapPtr;

 /** Number of instances of the PCU module. */
#define PCU_INSTANCE_COUNT                       (1u)


/* PCU - Peripheral instance base addresses */
/** Peripheral PCU base address */
#define PCU_BASE                                 (0xFFF50000u)
/** Peripheral PCU base pointer */
#define PCU                                      ((PCU_Type *)PCU_BASE)
/** Array initializer of PCU peripheral base addresses */
#define PCU_BASE_ADDRS                           { PCU_BASE }
/** Array initializer of PCU peripheral base pointers */
#define PCU_BASE_PTRS                            { PCU }

/* ----------------------------------------------------------------------------
   -- PCU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PCU_Register_Masks PCU Register Masks
 * @{
 */

/* CESR Bit Fields */
#define PCU_CESR_ENB_MASK                        0x1u
#define PCU_CESR_ENB_SHIFT                       0u
#define PCU_CESR_ENB_WIDTH                       1u
#define PCU_CESR_ENB(x)                          (((uint32_t)(((uint32_t)(x))<<PCU_CESR_ENB_SHIFT))&PCU_CESR_ENB_MASK)
#define PCU_CESR_SRST_EN_MASK                    0x2u
#define PCU_CESR_SRST_EN_SHIFT                   1u
#define PCU_CESR_SRST_EN_WIDTH                   1u
#define PCU_CESR_SRST_EN(x)                      (((uint32_t)(((uint32_t)(x))<<PCU_CESR_SRST_EN_SHIFT))&PCU_CESR_SRST_EN_MASK)
#define PCU_CESR_CP0DS_MASK                      0x70u
#define PCU_CESR_CP0DS_SHIFT                     4u
#define PCU_CESR_CP0DS_WIDTH                     3u
#define PCU_CESR_CP0DS(x)                        (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP0DS_SHIFT))&PCU_CESR_CP0DS_MASK)
#define PCU_CESR_CP1DS_MASK                      0x380u
#define PCU_CESR_CP1DS_SHIFT                     7u
#define PCU_CESR_CP1DS_WIDTH                     3u
#define PCU_CESR_CP1DS(x)                        (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP1DS_SHIFT))&PCU_CESR_CP1DS_MASK)
#define PCU_CESR_M0WMEN_MASK                     0x1000u
#define PCU_CESR_M0WMEN_SHIFT                    12u
#define PCU_CESR_M0WMEN_WIDTH                    1u
#define PCU_CESR_M0WMEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_M0WMEN_SHIFT))&PCU_CESR_M0WMEN_MASK)
#define PCU_CESR_M1WMEN_MASK                     0x2000u
#define PCU_CESR_M1WMEN_SHIFT                    13u
#define PCU_CESR_M1WMEN_WIDTH                    1u
#define PCU_CESR_M1WMEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_M1WMEN_SHIFT))&PCU_CESR_M1WMEN_MASK)
#define PCU_CESR_M2WMEN_MASK                     0x4000u
#define PCU_CESR_M2WMEN_SHIFT                    14u
#define PCU_CESR_M2WMEN_WIDTH                    1u
#define PCU_CESR_M2WMEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_M2WMEN_SHIFT))&PCU_CESR_M2WMEN_MASK)
#define PCU_CESR_M3WMEN_MASK                     0x8000u
#define PCU_CESR_M3WMEN_SHIFT                    15u
#define PCU_CESR_M3WMEN_WIDTH                    1u
#define PCU_CESR_M3WMEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_M3WMEN_SHIFT))&PCU_CESR_M3WMEN_MASK)
#define PCU_CESR_CP0IEN_MASK                     0x100000u
#define PCU_CESR_CP0IEN_SHIFT                    20u
#define PCU_CESR_CP0IEN_WIDTH                    1u
#define PCU_CESR_CP0IEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP0IEN_SHIFT))&PCU_CESR_CP0IEN_MASK)
#define PCU_CESR_CP1IEN_MASK                     0x200000u
#define PCU_CESR_CP1IEN_SHIFT                    21u
#define PCU_CESR_CP1IEN_WIDTH                    1u
#define PCU_CESR_CP1IEN(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP1IEN_SHIFT))&PCU_CESR_CP1IEN_MASK)
#define PCU_CESR_CP0IDLE_MASK                    0x1000000u
#define PCU_CESR_CP0IDLE_SHIFT                   24u
#define PCU_CESR_CP0IDLE_WIDTH                   1u
#define PCU_CESR_CP0IDLE(x)                      (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP0IDLE_SHIFT))&PCU_CESR_CP0IDLE_MASK)
#define PCU_CESR_CP1IDLE_MASK                    0x2000000u
#define PCU_CESR_CP1IDLE_SHIFT                   25u
#define PCU_CESR_CP1IDLE_WIDTH                   1u
#define PCU_CESR_CP1IDLE(x)                      (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP1IDLE_SHIFT))&PCU_CESR_CP1IDLE_MASK)
#define PCU_CESR_SRST_FLAG_MASK                  0x8000000u
#define PCU_CESR_SRST_FLAG_SHIFT                 27u
#define PCU_CESR_SRST_FLAG_WIDTH                 1u
#define PCU_CESR_SRST_FLAG(x)                    (((uint32_t)(((uint32_t)(x))<<PCU_CESR_SRST_FLAG_SHIFT))&PCU_CESR_SRST_FLAG_MASK)
#define PCU_CESR_CP0ERR_MASK                     0x30000000u
#define PCU_CESR_CP0ERR_SHIFT                    28u
#define PCU_CESR_CP0ERR_WIDTH                    2u
#define PCU_CESR_CP0ERR(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP0ERR_SHIFT))&PCU_CESR_CP0ERR_MASK)
#define PCU_CESR_CP1ERR_MASK                     0xC0000000u
#define PCU_CESR_CP1ERR_SHIFT                    30u
#define PCU_CESR_CP1ERR_WIDTH                    2u
#define PCU_CESR_CP1ERR(x)                       (((uint32_t)(((uint32_t)(x))<<PCU_CESR_CP1ERR_SHIFT))&PCU_CESR_CP1ERR_MASK)
/* EAR Bit Fields */
#define PCU_EAR_EADDR_MASK                       0xFFFFFFFFu
#define PCU_EAR_EADDR_SHIFT                      0u
#define PCU_EAR_EADDR_WIDTH                      32u
#define PCU_EAR_EADDR(x)                         (((uint32_t)(((uint32_t)(x))<<PCU_EAR_EADDR_SHIFT))&PCU_EAR_EADDR_MASK)
/* EDR Bit Fields */
#define PCU_EDR_ERESP_MASK                       0xF8u
#define PCU_EDR_ERESP_SHIFT                      3u
#define PCU_EDR_ERESP_WIDTH                      5u
#define PCU_EDR_ERESP(x)                         (((uint32_t)(((uint32_t)(x))<<PCU_EDR_ERESP_SHIFT))&PCU_EDR_ERESP_MASK)
#define PCU_EDR_EPROT_MASK                       0x3F00u
#define PCU_EDR_EPROT_SHIFT                      8u
#define PCU_EDR_EPROT_WIDTH                      6u
#define PCU_EDR_EPROT(x)                         (((uint32_t)(((uint32_t)(x))<<PCU_EDR_EPROT_SHIFT))&PCU_EDR_EPROT_MASK)
#define PCU_EDR_ESTAMP_MASK                      0xFF0000u
#define PCU_EDR_ESTAMP_SHIFT                     16u
#define PCU_EDR_ESTAMP_WIDTH                     8u
#define PCU_EDR_ESTAMP(x)                        (((uint32_t)(((uint32_t)(x))<<PCU_EDR_ESTAMP_SHIFT))&PCU_EDR_ESTAMP_MASK)
#define PCU_EDR_EPTR_MASK                        0xF000000u
#define PCU_EDR_EPTR_SHIFT                       24u
#define PCU_EDR_EPTR_WIDTH                       4u
#define PCU_EDR_EPTR(x)                          (((uint32_t)(((uint32_t)(x))<<PCU_EDR_EPTR_SHIFT))&PCU_EDR_EPTR_MASK)
#define PCU_EDR_EMSTR_MASK                       0xF0000000u
#define PCU_EDR_EMSTR_SHIFT                      28u
#define PCU_EDR_EMSTR_WIDTH                      4u
#define PCU_EDR_EMSTR(x)                         (((uint32_t)(((uint32_t)(x))<<PCU_EDR_EMSTR_SHIFT))&PCU_EDR_EMSTR_MASK)
/* IR Bit Fields */
#define PCU_IR_EIF_MASK                          0x1u
#define PCU_IR_EIF_SHIFT                         0u
#define PCU_IR_EIF_WIDTH                         1u
#define PCU_IR_EIF(x)                            (((uint32_t)(((uint32_t)(x))<<PCU_IR_EIF_SHIFT))&PCU_IR_EIF_MASK)
#define PCU_IR_OIF_MASK                          0x2u
#define PCU_IR_OIF_SHIFT                         1u
#define PCU_IR_OIF_WIDTH                         1u
#define PCU_IR_OIF(x)                            (((uint32_t)(((uint32_t)(x))<<PCU_IR_OIF_SHIFT))&PCU_IR_OIF_MASK)

/*!
 * @}
 */ /* end of group PCU_Register_Masks */


/*!
 * @}
 */ /* end of group PCU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PFLASH Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PFLASH_Peripheral_Access_Layer PFLASH Peripheral Access Layer
 * @{
 */


/** PFLASH - Size of Registers Arrays */

