neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** PFLASH - Register Layout Typedef */
typedef struct {
  __IO uint32_t PFCR1;                             /**< Platform Flash Configuration Register 1, offset: 0x0 */
  __IO uint32_t PFCR2;                             /**< Platform Flash Configuration Register 2, offset: 0x4 */
  __IO uint32_t PFCR3;                             /**< Platform Flash Configuration Register 3, offset: 0x8 */
  __IO uint32_t PFAPR;                             /**< Platform Flash Access Protection Register, offset: 0xC */
} PFLASH_Type, *PFLASH_MemMapPtr;

 /** Number of instances of the PFLASH module. */
#define PFLASH_INSTANCE_COUNT                    (1u)


/* PFLASH - Peripheral instance base addresses */
/** Peripheral PFLASH base address */
#define PFLASH_BASE                              (0xFFF68000u)
/** Peripheral PFLASH base pointer */
#define PFLASH                                   ((PFLASH_Type *)PFLASH_BASE)
/** Array initializer of PFLASH peripheral base addresses */
#define PFLASH_BASE_ADDRS                        { PFLASH_BASE }
/** Array initializer of PFLASH peripheral base pointers */
#define PFLASH_BASE_PTRS                         { PFLASH }

/* ----------------------------------------------------------------------------
   -- PFLASH Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PFLASH_Register_Masks PFLASH Register Masks
 * @{
 */

/* PFCR1 Bit Fields */
#define PFLASH_PFCR1_P0_BFEN_MASK                0x1u
#define PFLASH_PFCR1_P0_BFEN_SHIFT               0u
#define PFLASH_PFCR1_P0_BFEN_WIDTH               1u
#define PFLASH_PFCR1_P0_BFEN(x)                  (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_BFEN_SHIFT))&PFLASH_PFCR1_P0_BFEN_MASK)
#define PFLASH_PFCR1_P0_PFLIM_MASK               0x6u
#define PFLASH_PFCR1_P0_PFLIM_SHIFT              1u
#define PFLASH_PFCR1_P0_PFLIM_WIDTH              2u
#define PFLASH_PFCR1_P0_PFLIM(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_PFLIM_SHIFT))&PFLASH_PFCR1_P0_PFLIM_MASK)
#define PFLASH_PFCR1_P0_IPFEN_MASK               0x10u
#define PFLASH_PFCR1_P0_IPFEN_SHIFT              4u
#define PFLASH_PFCR1_P0_IPFEN_WIDTH              1u
#define PFLASH_PFCR1_P0_IPFEN(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_IPFEN_SHIFT))&PFLASH_PFCR1_P0_IPFEN_MASK)
#define PFLASH_PFCR1_P0_DPFEN_MASK               0x40u
#define PFLASH_PFCR1_P0_DPFEN_SHIFT              6u
#define PFLASH_PFCR1_P0_DPFEN_WIDTH              1u
#define PFLASH_PFCR1_P0_DPFEN(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_DPFEN_SHIFT))&PFLASH_PFCR1_P0_DPFEN_MASK)
#define PFLASH_PFCR1_RWSC_MASK                   0xF00u
#define PFLASH_PFCR1_RWSC_SHIFT                  8u
#define PFLASH_PFCR1_RWSC_WIDTH                  4u
#define PFLASH_PFCR1_RWSC(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_RWSC_SHIFT))&PFLASH_PFCR1_RWSC_MASK)
#define PFLASH_PFCR1_APC_MASK                    0xE000u
#define PFLASH_PFCR1_APC_SHIFT                   13u
#define PFLASH_PFCR1_APC_WIDTH                   3u
#define PFLASH_PFCR1_APC(x)                      (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_APC_SHIFT))&PFLASH_PFCR1_APC_MASK)
#define PFLASH_PFCR1_P0_M0PFE_MASK               0x10000u
#define PFLASH_PFCR1_P0_M0PFE_SHIFT              16u
#define PFLASH_PFCR1_P0_M0PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M0PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M0PFE_SHIFT))&PFLASH_PFCR1_P0_M0PFE_MASK)
#define PFLASH_PFCR1_P0_M1PFE_MASK               0x20000u
#define PFLASH_PFCR1_P0_M1PFE_SHIFT              17u
#define PFLASH_PFCR1_P0_M1PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M1PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M1PFE_SHIFT))&PFLASH_PFCR1_P0_M1PFE_MASK)
#define PFLASH_PFCR1_P0_M2PFE_MASK               0x40000u
#define PFLASH_PFCR1_P0_M2PFE_SHIFT              18u
#define PFLASH_PFCR1_P0_M2PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M2PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M2PFE_SHIFT))&PFLASH_PFCR1_P0_M2PFE_MASK)
#define PFLASH_PFCR1_P0_M3PFE_MASK               0x80000u
#define PFLASH_PFCR1_P0_M3PFE_SHIFT              19u
#define PFLASH_PFCR1_P0_M3PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M3PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M3PFE_SHIFT))&PFLASH_PFCR1_P0_M3PFE_MASK)
#define PFLASH_PFCR1_P0_M4PFE_MASK               0x100000u
#define PFLASH_PFCR1_P0_M4PFE_SHIFT              20u
#define PFLASH_PFCR1_P0_M4PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M4PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M4PFE_SHIFT))&PFLASH_PFCR1_P0_M4PFE_MASK)
#define PFLASH_PFCR1_P0_M5PFE_MASK               0x200000u
#define PFLASH_PFCR1_P0_M5PFE_SHIFT              21u
#define PFLASH_PFCR1_P0_M5PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M5PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M5PFE_SHIFT))&PFLASH_PFCR1_P0_M5PFE_MASK)
#define PFLASH_PFCR1_P0_M6PFE_MASK               0x400000u
#define PFLASH_PFCR1_P0_M6PFE_SHIFT              22u
#define PFLASH_PFCR1_P0_M6PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M6PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M6PFE_SHIFT))&PFLASH_PFCR1_P0_M6PFE_MASK)
#define PFLASH_PFCR1_P0_M7PFE_MASK               0x800000u
#define PFLASH_PFCR1_P0_M7PFE_SHIFT              23u
#define PFLASH_PFCR1_P0_M7PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M7PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M7PFE_SHIFT))&PFLASH_PFCR1_P0_M7PFE_MASK)
#define PFLASH_PFCR1_P0_M8PFE_MASK               0x1000000u
#define PFLASH_PFCR1_P0_M8PFE_SHIFT              24u
#define PFLASH_PFCR1_P0_M8PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M8PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M8PFE_SHIFT))&PFLASH_PFCR1_P0_M8PFE_MASK)
#define PFLASH_PFCR1_P0_M9PFE_MASK               0x2000000u
#define PFLASH_PFCR1_P0_M9PFE_SHIFT              25u
#define PFLASH_PFCR1_P0_M9PFE_WIDTH              1u
#define PFLASH_PFCR1_P0_M9PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M9PFE_SHIFT))&PFLASH_PFCR1_P0_M9PFE_MASK)
#define PFLASH_PFCR1_P0_M10PFE_MASK              0x4000000u
#define PFLASH_PFCR1_P0_M10PFE_SHIFT             26u
#define PFLASH_PFCR1_P0_M10PFE_WIDTH             1u
#define PFLASH_PFCR1_P0_M10PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M10PFE_SHIFT))&PFLASH_PFCR1_P0_M10PFE_MASK)
#define PFLASH_PFCR1_P0_M11PFE_MASK              0x8000000u
#define PFLASH_PFCR1_P0_M11PFE_SHIFT             27u
#define PFLASH_PFCR1_P0_M11PFE_WIDTH             1u
#define PFLASH_PFCR1_P0_M11PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M11PFE_SHIFT))&PFLASH_PFCR1_P0_M11PFE_MASK)
#define PFLASH_PFCR1_P0_M12PFE_MASK              0x10000000u
#define PFLASH_PFCR1_P0_M12PFE_SHIFT             28u
#define PFLASH_PFCR1_P0_M12PFE_WIDTH             1u
#define PFLASH_PFCR1_P0_M12PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M12PFE_SHIFT))&PFLASH_PFCR1_P0_M12PFE_MASK)
#define PFLASH_PFCR1_P0_M13PFE_MASK              0x20000000u
#define PFLASH_PFCR1_P0_M13PFE_SHIFT             29u
#define PFLASH_PFCR1_P0_M13PFE_WIDTH             1u
#define PFLASH_PFCR1_P0_M13PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M13PFE_SHIFT))&PFLASH_PFCR1_P0_M13PFE_MASK)
#define PFLASH_PFCR1_P0_M14PFE_MASK              0x40000000u
#define PFLASH_PFCR1_P0_M14PFE_SHIFT             30u
#define PFLASH_PFCR1_P0_M14PFE_WIDTH             1u
#define PFLASH_PFCR1_P0_M14PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M14PFE_SHIFT))&PFLASH_PFCR1_P0_M14PFE_MASK)
#define PFLASH_PFCR1_P0_M15PFE_MASK              0x80000000u
#define PFLASH_PFCR1_P0_M15PFE_SHIFT             31u
#define PFLASH_PFCR1_P0_M15PFE_WIDTH             1u
#define PFLASH_PFCR1_P0_M15PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR1_P0_M15PFE_SHIFT))&PFLASH_PFCR1_P0_M15PFE_MASK)
/* PFCR2 Bit Fields */
#define PFLASH_PFCR2_P1_BFEN_MASK                0x1u
#define PFLASH_PFCR2_P1_BFEN_SHIFT               0u
#define PFLASH_PFCR2_P1_BFEN_WIDTH               1u
#define PFLASH_PFCR2_P1_BFEN(x)                  (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_BFEN_SHIFT))&PFLASH_PFCR2_P1_BFEN_MASK)
#define PFLASH_PFCR2_P1_PFLIM_MASK               0x6u
#define PFLASH_PFCR2_P1_PFLIM_SHIFT              1u
#define PFLASH_PFCR2_P1_PFLIM_WIDTH              2u
#define PFLASH_PFCR2_P1_PFLIM(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_PFLIM_SHIFT))&PFLASH_PFCR2_P1_PFLIM_MASK)
#define PFLASH_PFCR2_P1_IPFEN_MASK               0x10u
#define PFLASH_PFCR2_P1_IPFEN_SHIFT              4u
#define PFLASH_PFCR2_P1_IPFEN_WIDTH              1u
#define PFLASH_PFCR2_P1_IPFEN(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_IPFEN_SHIFT))&PFLASH_PFCR2_P1_IPFEN_MASK)
#define PFLASH_PFCR2_P1_DPFEN_MASK               0x40u
#define PFLASH_PFCR2_P1_DPFEN_SHIFT              6u
#define PFLASH_PFCR2_P1_DPFEN_WIDTH              1u
#define PFLASH_PFCR2_P1_DPFEN(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_DPFEN_SHIFT))&PFLASH_PFCR2_P1_DPFEN_MASK)
#define PFLASH_PFCR2_P1_M0PFE_MASK               0x10000u
#define PFLASH_PFCR2_P1_M0PFE_SHIFT              16u
#define PFLASH_PFCR2_P1_M0PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M0PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M0PFE_SHIFT))&PFLASH_PFCR2_P1_M0PFE_MASK)
#define PFLASH_PFCR2_P1_M1PFE_MASK               0x20000u
#define PFLASH_PFCR2_P1_M1PFE_SHIFT              17u
#define PFLASH_PFCR2_P1_M1PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M1PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M1PFE_SHIFT))&PFLASH_PFCR2_P1_M1PFE_MASK)
#define PFLASH_PFCR2_P1_M2PFE_MASK               0x40000u
#define PFLASH_PFCR2_P1_M2PFE_SHIFT              18u
#define PFLASH_PFCR2_P1_M2PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M2PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M2PFE_SHIFT))&PFLASH_PFCR2_P1_M2PFE_MASK)
#define PFLASH_PFCR2_P1_M3PFE_MASK               0x80000u
#define PFLASH_PFCR2_P1_M3PFE_SHIFT              19u
#define PFLASH_PFCR2_P1_M3PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M3PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M3PFE_SHIFT))&PFLASH_PFCR2_P1_M3PFE_MASK)
#define PFLASH_PFCR2_P1_M4PFE_MASK               0x100000u
#define PFLASH_PFCR2_P1_M4PFE_SHIFT              20u
#define PFLASH_PFCR2_P1_M4PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M4PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M4PFE_SHIFT))&PFLASH_PFCR2_P1_M4PFE_MASK)
#define PFLASH_PFCR2_P1_M5PFE_MASK               0x200000u
#define PFLASH_PFCR2_P1_M5PFE_SHIFT              21u
#define PFLASH_PFCR2_P1_M5PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M5PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M5PFE_SHIFT))&PFLASH_PFCR2_P1_M5PFE_MASK)
#define PFLASH_PFCR2_P1_M6PFE_MASK               0x400000u
#define PFLASH_PFCR2_P1_M6PFE_SHIFT              22u
#define PFLASH_PFCR2_P1_M6PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M6PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M6PFE_SHIFT))&PFLASH_PFCR2_P1_M6PFE_MASK)
#define PFLASH_PFCR2_P1_M7PFE_MASK               0x800000u
#define PFLASH_PFCR2_P1_M7PFE_SHIFT              23u
#define PFLASH_PFCR2_P1_M7PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M7PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M7PFE_SHIFT))&PFLASH_PFCR2_P1_M7PFE_MASK)
#define PFLASH_PFCR2_P1_M8PFE_MASK               0x1000000u
#define PFLASH_PFCR2_P1_M8PFE_SHIFT              24u
#define PFLASH_PFCR2_P1_M8PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M8PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M8PFE_SHIFT))&PFLASH_PFCR2_P1_M8PFE_MASK)
#define PFLASH_PFCR2_P1_M9PFE_MASK               0x2000000u
#define PFLASH_PFCR2_P1_M9PFE_SHIFT              25u
#define PFLASH_PFCR2_P1_M9PFE_WIDTH              1u
#define PFLASH_PFCR2_P1_M9PFE(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M9PFE_SHIFT))&PFLASH_PFCR2_P1_M9PFE_MASK)
#define PFLASH_PFCR2_P1_M10PFE_MASK              0x4000000u
#define PFLASH_PFCR2_P1_M10PFE_SHIFT             26u
#define PFLASH_PFCR2_P1_M10PFE_WIDTH             1u
#define PFLASH_PFCR2_P1_M10PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M10PFE_SHIFT))&PFLASH_PFCR2_P1_M10PFE_MASK)
#define PFLASH_PFCR2_P1_M11PFE_MASK              0x8000000u
#define PFLASH_PFCR2_P1_M11PFE_SHIFT             27u
#define PFLASH_PFCR2_P1_M11PFE_WIDTH             1u
#define PFLASH_PFCR2_P1_M11PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M11PFE_SHIFT))&PFLASH_PFCR2_P1_M11PFE_MASK)
#define PFLASH_PFCR2_P1_M12PFE_MASK              0x10000000u
#define PFLASH_PFCR2_P1_M12PFE_SHIFT             28u
#define PFLASH_PFCR2_P1_M12PFE_WIDTH             1u
#define PFLASH_PFCR2_P1_M12PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M12PFE_SHIFT))&PFLASH_PFCR2_P1_M12PFE_MASK)
#define PFLASH_PFCR2_P1_M13PFE_MASK              0x20000000u
#define PFLASH_PFCR2_P1_M13PFE_SHIFT             29u
#define PFLASH_PFCR2_P1_M13PFE_WIDTH             1u
#define PFLASH_PFCR2_P1_M13PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M13PFE_SHIFT))&PFLASH_PFCR2_P1_M13PFE_MASK)
#define PFLASH_PFCR2_P1_M14PFE_MASK              0x40000000u
#define PFLASH_PFCR2_P1_M14PFE_SHIFT             30u
#define PFLASH_PFCR2_P1_M14PFE_WIDTH             1u
#define PFLASH_PFCR2_P1_M14PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M14PFE_SHIFT))&PFLASH_PFCR2_P1_M14PFE_MASK)
#define PFLASH_PFCR2_P1_M15PFE_MASK              0x80000000u
#define PFLASH_PFCR2_P1_M15PFE_SHIFT             31u
#define PFLASH_PFCR2_P1_M15PFE_WIDTH             1u
#define PFLASH_PFCR2_P1_M15PFE(x)                (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR2_P1_M15PFE_SHIFT))&PFLASH_PFCR2_P1_M15PFE_MASK)
/* PFCR3 Bit Fields */
#define PFLASH_PFCR3_DERR_SUP_MASK               0x1u
#define PFLASH_PFCR3_DERR_SUP_SHIFT              0u
#define PFLASH_PFCR3_DERR_SUP_WIDTH              1u
#define PFLASH_PFCR3_DERR_SUP(x)                 (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR3_DERR_SUP_SHIFT))&PFLASH_PFCR3_DERR_SUP_MASK)
#define PFLASH_PFCR3_ARBM_MASK                   0xC000u
#define PFLASH_PFCR3_ARBM_SHIFT                  14u
#define PFLASH_PFCR3_ARBM_WIDTH                  2u
#define PFLASH_PFCR3_ARBM(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR3_ARBM_SHIFT))&PFLASH_PFCR3_ARBM_MASK)
#define PFLASH_PFCR3_BFEN_LK_MASK                0x10000u
#define PFLASH_PFCR3_BFEN_LK_SHIFT               16u
#define PFLASH_PFCR3_BFEN_LK_WIDTH               1u
#define PFLASH_PFCR3_BFEN_LK(x)                  (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR3_BFEN_LK_SHIFT))&PFLASH_PFCR3_BFEN_LK_MASK)
#define PFLASH_PFCR3_P1_WCFG_MASK                0x30000000u
#define PFLASH_PFCR3_P1_WCFG_SHIFT               28u
#define PFLASH_PFCR3_P1_WCFG_WIDTH               2u
#define PFLASH_PFCR3_P1_WCFG(x)                  (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR3_P1_WCFG_SHIFT))&PFLASH_PFCR3_P1_WCFG_MASK)
#define PFLASH_PFCR3_P0_WCFG_MASK                0xC0000000u
#define PFLASH_PFCR3_P0_WCFG_SHIFT               30u
#define PFLASH_PFCR3_P0_WCFG_WIDTH               2u
#define PFLASH_PFCR3_P0_WCFG(x)                  (((uint32_t)(((uint32_t)(x))<<PFLASH_PFCR3_P0_WCFG_SHIFT))&PFLASH_PFCR3_P0_WCFG_MASK)
/* PFAPR Bit Fields */
#define PFLASH_PFAPR_M15AP_MASK                  0x3u
#define PFLASH_PFAPR_M15AP_SHIFT                 0u
#define PFLASH_PFAPR_M15AP_WIDTH                 2u
#define PFLASH_PFAPR_M15AP(x)                    (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M15AP_SHIFT))&PFLASH_PFAPR_M15AP_MASK)
#define PFLASH_PFAPR_M14AP_MASK                  0xCu
#define PFLASH_PFAPR_M14AP_SHIFT                 2u
#define PFLASH_PFAPR_M14AP_WIDTH                 2u
#define PFLASH_PFAPR_M14AP(x)                    (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M14AP_SHIFT))&PFLASH_PFAPR_M14AP_MASK)
#define PFLASH_PFAPR_M13AP_MASK                  0x30u
#define PFLASH_PFAPR_M13AP_SHIFT                 4u
#define PFLASH_PFAPR_M13AP_WIDTH                 2u
#define PFLASH_PFAPR_M13AP(x)                    (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M13AP_SHIFT))&PFLASH_PFAPR_M13AP_MASK)
#define PFLASH_PFAPR_M12AP_MASK                  0xC0u
#define PFLASH_PFAPR_M12AP_SHIFT                 6u
#define PFLASH_PFAPR_M12AP_WIDTH                 2u
#define PFLASH_PFAPR_M12AP(x)                    (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M12AP_SHIFT))&PFLASH_PFAPR_M12AP_MASK)
#define PFLASH_PFAPR_M11AP_MASK                  0x300u
#define PFLASH_PFAPR_M11AP_SHIFT                 8u
#define PFLASH_PFAPR_M11AP_WIDTH                 2u
#define PFLASH_PFAPR_M11AP(x)                    (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M11AP_SHIFT))&PFLASH_PFAPR_M11AP_MASK)
#define PFLASH_PFAPR_M10AP_MASK                  0xC00u
#define PFLASH_PFAPR_M10AP_SHIFT                 10u
#define PFLASH_PFAPR_M10AP_WIDTH                 2u
#define PFLASH_PFAPR_M10AP(x)                    (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M10AP_SHIFT))&PFLASH_PFAPR_M10AP_MASK)
#define PFLASH_PFAPR_M9AP_MASK                   0x3000u
#define PFLASH_PFAPR_M9AP_SHIFT                  12u
#define PFLASH_PFAPR_M9AP_WIDTH                  2u
#define PFLASH_PFAPR_M9AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M9AP_SHIFT))&PFLASH_PFAPR_M9AP_MASK)
#define PFLASH_PFAPR_M8AP_MASK                   0xC000u
#define PFLASH_PFAPR_M8AP_SHIFT                  14u
#define PFLASH_PFAPR_M8AP_WIDTH                  2u
#define PFLASH_PFAPR_M8AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M8AP_SHIFT))&PFLASH_PFAPR_M8AP_MASK)
#define PFLASH_PFAPR_M7AP_MASK                   0x30000u
#define PFLASH_PFAPR_M7AP_SHIFT                  16u
#define PFLASH_PFAPR_M7AP_WIDTH                  2u
#define PFLASH_PFAPR_M7AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M7AP_SHIFT))&PFLASH_PFAPR_M7AP_MASK)
#define PFLASH_PFAPR_M6AP_MASK                   0xC0000u
#define PFLASH_PFAPR_M6AP_SHIFT                  18u
#define PFLASH_PFAPR_M6AP_WIDTH                  2u
#define PFLASH_PFAPR_M6AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M6AP_SHIFT))&PFLASH_PFAPR_M6AP_MASK)
#define PFLASH_PFAPR_M5AP_MASK                   0x300000u
#define PFLASH_PFAPR_M5AP_SHIFT                  20u
#define PFLASH_PFAPR_M5AP_WIDTH                  2u
#define PFLASH_PFAPR_M5AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M5AP_SHIFT))&PFLASH_PFAPR_M5AP_MASK)
#define PFLASH_PFAPR_M4AP_MASK                   0xC00000u
#define PFLASH_PFAPR_M4AP_SHIFT                  22u
#define PFLASH_PFAPR_M4AP_WIDTH                  2u
#define PFLASH_PFAPR_M4AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M4AP_SHIFT))&PFLASH_PFAPR_M4AP_MASK)
#define PFLASH_PFAPR_M3AP_MASK                   0x3000000u
#define PFLASH_PFAPR_M3AP_SHIFT                  24u
#define PFLASH_PFAPR_M3AP_WIDTH                  2u
#define PFLASH_PFAPR_M3AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M3AP_SHIFT))&PFLASH_PFAPR_M3AP_MASK)
#define PFLASH_PFAPR_M2AP_MASK                   0xC000000u
#define PFLASH_PFAPR_M2AP_SHIFT                  26u
#define PFLASH_PFAPR_M2AP_WIDTH                  2u
#define PFLASH_PFAPR_M2AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M2AP_SHIFT))&PFLASH_PFAPR_M2AP_MASK)
#define PFLASH_PFAPR_M1AP_MASK                   0x30000000u
#define PFLASH_PFAPR_M1AP_SHIFT                  28u
#define PFLASH_PFAPR_M1AP_WIDTH                  2u
#define PFLASH_PFAPR_M1AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M1AP_SHIFT))&PFLASH_PFAPR_M1AP_MASK)
#define PFLASH_PFAPR_M0AP_MASK                   0xC0000000u
#define PFLASH_PFAPR_M0AP_SHIFT                  30u
#define PFLASH_PFAPR_M0AP_WIDTH                  2u
#define PFLASH_PFAPR_M0AP(x)                     (((uint32_t)(((uint32_t)(x))<<PFLASH_PFAPR_M0AP_SHIFT))&PFLASH_PFAPR_M0AP_MASK)

/*!
 * @}
 */ /* end of group PFLASH_Register_Masks */


/*!
 * @}
 */ /* end of group PFLASH_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PIT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PIT_Peripheral_Access_Layer PIT Peripheral Access Layer
 * @{
 */


/** PIT - Size of Registers Arrays */
#define PIT_TIMER_COUNT                          4u

/** PIT - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< PIT Module Control Register, offset: 0x0 */
       uint8_t RESERVED_0[220];
  __I  uint32_t LTMR64H;                           /**< PIT Upper Lifetime Timer Register, offset: 0xE0 */
  __I  uint32_t LTMR64L;                           /**< PIT Lower Lifetime Timer Register, offset: 0xE4 */
       uint8_t RESERVED_1[8];
  __IO uint32_t RTI_LDVAL;                         /**< Timer Load Value Register, offset: 0xF0 */
  __I  uint32_t RTI_CVAL;                          /**< Current Timer Value Register, offset: 0xF4 */
  __IO uint32_t RTI_TCTRL;                         /**< Timer Control Register, offset: 0xF8 */
  __IO uint32_t RTI_TFLG;                          /**< Timer Flag Register, offset: 0xFC */
  struct {                                         /* offset: 0x100, array step: 0x10 */
    __IO uint32_t LDVAL;                             /**< Timer Load Value Register, array offset: 0x100, array step: 0x10 */
    __I  uint32_t CVAL;                              /**< Current Timer Value Register, array offset: 0x104, array step: 0x10 */
    __IO uint32_t TCTRL;                             /**< Timer Control Register, array offset: 0x108, array step: 0x10 */
    __IO uint32_t TFLG;                              /**< Timer Flag Register, array offset: 0x10C, array step: 0x10 */
  } TIMER[PIT_TIMER_COUNT];
} PIT_Type, *PIT_MemMapPtr;

 /** Number of instances of the PIT module. */
#define PIT_INSTANCE_COUNT                       (1u)


/* PIT - Peripheral instance base addresses */
/** Peripheral PIT base address */
#define PIT_BASE                                 (0xC3FF0000u)
/** Peripheral PIT base pointer */
#define PIT                                      ((PIT_Type *)PIT_BASE)
/** Array initializer of PIT peripheral base addresses */
#define PIT_BASE_ADDRS                           { PIT_BASE }
/** Array initializer of PIT peripheral base pointers */
#define PIT_BASE_PTRS                            { PIT }
/** Number of interrupt vector arrays for the PIT module. */
#define PIT_IRQS_ARR_COUNT                       (1u)
/** Number of interrupt channels for the PIT module. */
#define PIT_IRQS_CH_COUNT                        (5u)
/** Interrupt vectors for the PIT peripheral type */
#define PIT_IRQS                                 { { PIT_RTI0_IRQn, PIT_RTI1_IRQn, PIT_RTI2_IRQn, PIT_RTI3_IRQn, PIT_RTIINT_IRQn } }
/* ----------------------------------------------------------------------------
   -- PIT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PIT_Register_Masks PIT Register Masks
 * @{
 */

