neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* MCR Bit Fields */
#define PIT_MCR_FRZ_MASK                         0x1u
#define PIT_MCR_FRZ_SHIFT                        0u
#define PIT_MCR_FRZ_WIDTH                        1u
#define PIT_MCR_FRZ(x)                           (((uint32_t)(((uint32_t)(x))<<PIT_MCR_FRZ_SHIFT))&PIT_MCR_FRZ_MASK)
#define PIT_MCR_MDIS_MASK                        0x2u
#define PIT_MCR_MDIS_SHIFT                       1u
#define PIT_MCR_MDIS_WIDTH                       1u
#define PIT_MCR_MDIS(x)                          (((uint32_t)(((uint32_t)(x))<<PIT_MCR_MDIS_SHIFT))&PIT_MCR_MDIS_MASK)
#define PIT_MCR_MDIS_RTI_MASK                    0x4u
#define PIT_MCR_MDIS_RTI_SHIFT                   2u
#define PIT_MCR_MDIS_RTI_WIDTH                   1u
#define PIT_MCR_MDIS_RTI(x)                      (((uint32_t)(((uint32_t)(x))<<PIT_MCR_MDIS_RTI_SHIFT))&PIT_MCR_MDIS_RTI_MASK)
/* LTMR64H Bit Fields */
#define PIT_LTMR64H_LTH_MASK                     0xFFFFFFFFu
#define PIT_LTMR64H_LTH_SHIFT                    0u
#define PIT_LTMR64H_LTH_WIDTH                    32u
#define PIT_LTMR64H_LTH(x)                       (((uint32_t)(((uint32_t)(x))<<PIT_LTMR64H_LTH_SHIFT))&PIT_LTMR64H_LTH_MASK)
/* LTMR64L Bit Fields */
#define PIT_LTMR64L_LTL_MASK                     0xFFFFFFFFu
#define PIT_LTMR64L_LTL_SHIFT                    0u
#define PIT_LTMR64L_LTL_WIDTH                    32u
#define PIT_LTMR64L_LTL(x)                       (((uint32_t)(((uint32_t)(x))<<PIT_LTMR64L_LTL_SHIFT))&PIT_LTMR64L_LTL_MASK)
/* RTI_LDVAL Bit Fields */
#define PIT_RTI_LDVAL_TSV_MASK                   0xFFFFFFFFu
#define PIT_RTI_LDVAL_TSV_SHIFT                  0u
#define PIT_RTI_LDVAL_TSV_WIDTH                  32u
#define PIT_RTI_LDVAL_TSV(x)                     (((uint32_t)(((uint32_t)(x))<<PIT_RTI_LDVAL_TSV_SHIFT))&PIT_RTI_LDVAL_TSV_MASK)
/* RTI_CVAL Bit Fields */
#define PIT_RTI_CVAL_TVL_MASK                    0xFFFFFFFFu
#define PIT_RTI_CVAL_TVL_SHIFT                   0u
#define PIT_RTI_CVAL_TVL_WIDTH                   32u
#define PIT_RTI_CVAL_TVL(x)                      (((uint32_t)(((uint32_t)(x))<<PIT_RTI_CVAL_TVL_SHIFT))&PIT_RTI_CVAL_TVL_MASK)
/* RTI_TCTRL Bit Fields */
#define PIT_RTI_TCTRL_TEN_MASK                   0x1u
#define PIT_RTI_TCTRL_TEN_SHIFT                  0u
#define PIT_RTI_TCTRL_TEN_WIDTH                  1u
#define PIT_RTI_TCTRL_TEN(x)                     (((uint32_t)(((uint32_t)(x))<<PIT_RTI_TCTRL_TEN_SHIFT))&PIT_RTI_TCTRL_TEN_MASK)
#define PIT_RTI_TCTRL_TIE_MASK                   0x2u
#define PIT_RTI_TCTRL_TIE_SHIFT                  1u
#define PIT_RTI_TCTRL_TIE_WIDTH                  1u
#define PIT_RTI_TCTRL_TIE(x)                     (((uint32_t)(((uint32_t)(x))<<PIT_RTI_TCTRL_TIE_SHIFT))&PIT_RTI_TCTRL_TIE_MASK)
/* RTI_TFLG Bit Fields */
#define PIT_RTI_TFLG_TIF_MASK                    0x1u
#define PIT_RTI_TFLG_TIF_SHIFT                   0u
#define PIT_RTI_TFLG_TIF_WIDTH                   1u
#define PIT_RTI_TFLG_TIF(x)                      (((uint32_t)(((uint32_t)(x))<<PIT_RTI_TFLG_TIF_SHIFT))&PIT_RTI_TFLG_TIF_MASK)
/* LDVAL Bit Fields */
#define PIT_LDVAL_TSV_MASK                       0xFFFFFFFFu
#define PIT_LDVAL_TSV_SHIFT                      0u
#define PIT_LDVAL_TSV_WIDTH                      32u
#define PIT_LDVAL_TSV(x)                         (((uint32_t)(((uint32_t)(x))<<PIT_LDVAL_TSV_SHIFT))&PIT_LDVAL_TSV_MASK)
/* CVAL Bit Fields */
#define PIT_CVAL_TVL_MASK                        0xFFFFFFFFu
#define PIT_CVAL_TVL_SHIFT                       0u
#define PIT_CVAL_TVL_WIDTH                       32u
#define PIT_CVAL_TVL(x)                          (((uint32_t)(((uint32_t)(x))<<PIT_CVAL_TVL_SHIFT))&PIT_CVAL_TVL_MASK)
/* TCTRL Bit Fields */
#define PIT_TCTRL_TEN_MASK                       0x1u
#define PIT_TCTRL_TEN_SHIFT                      0u
#define PIT_TCTRL_TEN_WIDTH                      1u
#define PIT_TCTRL_TEN(x)                         (((uint32_t)(((uint32_t)(x))<<PIT_TCTRL_TEN_SHIFT))&PIT_TCTRL_TEN_MASK)
#define PIT_TCTRL_TIE_MASK                       0x2u
#define PIT_TCTRL_TIE_SHIFT                      1u
#define PIT_TCTRL_TIE_WIDTH                      1u
#define PIT_TCTRL_TIE(x)                         (((uint32_t)(((uint32_t)(x))<<PIT_TCTRL_TIE_SHIFT))&PIT_TCTRL_TIE_MASK)
#define PIT_TCTRL_CHN_MASK                       0x4u
#define PIT_TCTRL_CHN_SHIFT                      2u
#define PIT_TCTRL_CHN_WIDTH                      1u
#define PIT_TCTRL_CHN(x)                         (((uint32_t)(((uint32_t)(x))<<PIT_TCTRL_CHN_SHIFT))&PIT_TCTRL_CHN_MASK)
/* TFLG Bit Fields */
#define PIT_TFLG_TIF_MASK                        0x1u
#define PIT_TFLG_TIF_SHIFT                       0u
#define PIT_TFLG_TIF_WIDTH                       1u
#define PIT_TFLG_TIF(x)                          (((uint32_t)(((uint32_t)(x))<<PIT_TFLG_TIF_SHIFT))&PIT_TFLG_TIF_MASK)

/*!
 * @}
 */ /* end of group PIT_Register_Masks */


/*!
 * @}
 */ /* end of group PIT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PLLDIG Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PLLDIG_Peripheral_Access_Layer PLLDIG Peripheral Access Layer
 * @{
 */


/** PLLDIG - Size of Registers Arrays */

/** PLLDIG - Register Layout Typedef */
typedef struct {
  __IO uint32_t PLL0CR;                            /**< PLLDIG PLL0 Control Register, offset: 0x0 */
  __IO uint32_t PLL0SR;                            /**< PLLDIG PLL0 Status Register, offset: 0x4 */
  __IO uint32_t PLL0DV;                            /**< PLLDIG PLL0 Divider Register, offset: 0x8 */
       uint8_t RESERVED_0[20];
  __IO uint32_t PLL1CR;                            /**< PLLDIG PLL1 Control Register, offset: 0x20 */
  __IO uint32_t PLL1SR;                            /**< PLLDIG PLL1 Status Register, offset: 0x24 */
  __IO uint32_t PLL1DV;                            /**< PLLDIG PLL1 Divider Register, offset: 0x28 */
  __IO uint32_t PLL1FM;                            /**< PLLDIG PLL1 Frequency Modulation Register, offset: 0x2C */
  __IO uint32_t PLL1FD;                            /**< PLLDIG PLL1 Fractional Divide Register, offset: 0x30 */
} PLLDIG_Type, *PLLDIG_MemMapPtr;

