neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the PLLDIG module. */
#define PLLDIG_INSTANCE_COUNT                    (1u)


/* PLLDIG - Peripheral instance base addresses */
/** Peripheral PLLDIG base address */
#define PLLDIG_BASE                              (0xFFE74000u)
/** Peripheral PLLDIG base pointer */
#define PLLDIG                                   ((PLLDIG_Type *)PLLDIG_BASE)
/** Array initializer of PLLDIG peripheral base addresses */
#define PLLDIG_BASE_ADDRS                        { PLLDIG_BASE }
/** Array initializer of PLLDIG peripheral base pointers */
#define PLLDIG_BASE_PTRS                         { PLLDIG }

/* ----------------------------------------------------------------------------
   -- PLLDIG Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PLLDIG_Register_Masks PLLDIG Register Masks
 * @{
 */

/* PLL0CR Bit Fields */
#define PLLDIG_PLL0CR_LOLIE_MASK                 0x8u
#define PLLDIG_PLL0CR_LOLIE_SHIFT                3u
#define PLLDIG_PLL0CR_LOLIE_WIDTH                1u
#define PLLDIG_PLL0CR_LOLIE(x)                   (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0CR_LOLIE_SHIFT))&PLLDIG_PLL0CR_LOLIE_MASK)
#define PLLDIG_PLL0CR_CLKCFG_MASK                0x300u
#define PLLDIG_PLL0CR_CLKCFG_SHIFT               8u
#define PLLDIG_PLL0CR_CLKCFG_WIDTH               2u
#define PLLDIG_PLL0CR_CLKCFG(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0CR_CLKCFG_SHIFT))&PLLDIG_PLL0CR_CLKCFG_MASK)
/* PLL0SR Bit Fields */
#define PLLDIG_PLL0SR_LOCK_MASK                  0x4u
#define PLLDIG_PLL0SR_LOCK_SHIFT                 2u
#define PLLDIG_PLL0SR_LOCK_WIDTH                 1u
#define PLLDIG_PLL0SR_LOCK(x)                    (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0SR_LOCK_SHIFT))&PLLDIG_PLL0SR_LOCK_MASK)
#define PLLDIG_PLL0SR_LOLF_MASK                  0x8u
#define PLLDIG_PLL0SR_LOLF_SHIFT                 3u
#define PLLDIG_PLL0SR_LOLF_WIDTH                 1u
#define PLLDIG_PLL0SR_LOLF(x)                    (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0SR_LOLF_SHIFT))&PLLDIG_PLL0SR_LOLF_MASK)
/* PLL0DV Bit Fields */
#define PLLDIG_PLL0DV_MFD_MASK                   0x7Fu
#define PLLDIG_PLL0DV_MFD_SHIFT                  0u
#define PLLDIG_PLL0DV_MFD_WIDTH                  7u
#define PLLDIG_PLL0DV_MFD(x)                     (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0DV_MFD_SHIFT))&PLLDIG_PLL0DV_MFD_MASK)
#define PLLDIG_PLL0DV_PREDIV_MASK                0x7000u
#define PLLDIG_PLL0DV_PREDIV_SHIFT               12u
#define PLLDIG_PLL0DV_PREDIV_WIDTH               3u
#define PLLDIG_PLL0DV_PREDIV(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0DV_PREDIV_SHIFT))&PLLDIG_PLL0DV_PREDIV_MASK)
#define PLLDIG_PLL0DV_RFDPHI_MASK                0x3F0000u
#define PLLDIG_PLL0DV_RFDPHI_SHIFT               16u
#define PLLDIG_PLL0DV_RFDPHI_WIDTH               6u
#define PLLDIG_PLL0DV_RFDPHI(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0DV_RFDPHI_SHIFT))&PLLDIG_PLL0DV_RFDPHI_MASK)
#define PLLDIG_PLL0DV_RFDPHI1_MASK               0x78000000u
#define PLLDIG_PLL0DV_RFDPHI1_SHIFT              27u
#define PLLDIG_PLL0DV_RFDPHI1_WIDTH              4u
#define PLLDIG_PLL0DV_RFDPHI1(x)                 (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL0DV_RFDPHI1_SHIFT))&PLLDIG_PLL0DV_RFDPHI1_MASK)
/* PLL1CR Bit Fields */
#define PLLDIG_PLL1CR_LOLIE_MASK                 0x8u
#define PLLDIG_PLL1CR_LOLIE_SHIFT                3u
#define PLLDIG_PLL1CR_LOLIE_WIDTH                1u
#define PLLDIG_PLL1CR_LOLIE(x)                   (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1CR_LOLIE_SHIFT))&PLLDIG_PLL1CR_LOLIE_MASK)
#define PLLDIG_PLL1CR_CLKCFG_MASK                0x300u
#define PLLDIG_PLL1CR_CLKCFG_SHIFT               8u
#define PLLDIG_PLL1CR_CLKCFG_WIDTH               2u
#define PLLDIG_PLL1CR_CLKCFG(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1CR_CLKCFG_SHIFT))&PLLDIG_PLL1CR_CLKCFG_MASK)
/* PLL1SR Bit Fields */
#define PLLDIG_PLL1SR_LOCK_MASK                  0x4u
#define PLLDIG_PLL1SR_LOCK_SHIFT                 2u
#define PLLDIG_PLL1SR_LOCK_WIDTH                 1u
#define PLLDIG_PLL1SR_LOCK(x)                    (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1SR_LOCK_SHIFT))&PLLDIG_PLL1SR_LOCK_MASK)
#define PLLDIG_PLL1SR_LOLF_MASK                  0x8u
#define PLLDIG_PLL1SR_LOLF_SHIFT                 3u
#define PLLDIG_PLL1SR_LOLF_WIDTH                 1u
#define PLLDIG_PLL1SR_LOLF(x)                    (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1SR_LOLF_SHIFT))&PLLDIG_PLL1SR_LOLF_MASK)
/* PLL1DV Bit Fields */
#define PLLDIG_PLL1DV_MFD_MASK                   0x7Fu
#define PLLDIG_PLL1DV_MFD_SHIFT                  0u
#define PLLDIG_PLL1DV_MFD_WIDTH                  7u
#define PLLDIG_PLL1DV_MFD(x)                     (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1DV_MFD_SHIFT))&PLLDIG_PLL1DV_MFD_MASK)
#define PLLDIG_PLL1DV_RFDPHI_MASK                0x3F0000u
#define PLLDIG_PLL1DV_RFDPHI_SHIFT               16u
#define PLLDIG_PLL1DV_RFDPHI_WIDTH               6u
#define PLLDIG_PLL1DV_RFDPHI(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1DV_RFDPHI_SHIFT))&PLLDIG_PLL1DV_RFDPHI_MASK)
/* PLL1FM Bit Fields */
#define PLLDIG_PLL1FM_INCSTP_MASK                0x7FFFu
#define PLLDIG_PLL1FM_INCSTP_SHIFT               0u
#define PLLDIG_PLL1FM_INCSTP_WIDTH               15u
#define PLLDIG_PLL1FM_INCSTP(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FM_INCSTP_SHIFT))&PLLDIG_PLL1FM_INCSTP_MASK)
#define PLLDIG_PLL1FM_MODPRD_MASK                0x1FFF0000u
#define PLLDIG_PLL1FM_MODPRD_SHIFT               16u
#define PLLDIG_PLL1FM_MODPRD_WIDTH               13u
#define PLLDIG_PLL1FM_MODPRD(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FM_MODPRD_SHIFT))&PLLDIG_PLL1FM_MODPRD_MASK)
#define PLLDIG_PLL1FM_MODSEL_MASK                0x20000000u
#define PLLDIG_PLL1FM_MODSEL_SHIFT               29u
#define PLLDIG_PLL1FM_MODSEL_WIDTH               1u
#define PLLDIG_PLL1FM_MODSEL(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FM_MODSEL_SHIFT))&PLLDIG_PLL1FM_MODSEL_MASK)
#define PLLDIG_PLL1FM_MODEN_MASK                 0x40000000u
#define PLLDIG_PLL1FM_MODEN_SHIFT                30u
#define PLLDIG_PLL1FM_MODEN_WIDTH                1u
#define PLLDIG_PLL1FM_MODEN(x)                   (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FM_MODEN_SHIFT))&PLLDIG_PLL1FM_MODEN_MASK)
/* PLL1FD Bit Fields */
#define PLLDIG_PLL1FD_FRCDIV_MASK                0xFFFu
#define PLLDIG_PLL1FD_FRCDIV_SHIFT               0u
#define PLLDIG_PLL1FD_FRCDIV_WIDTH               12u
#define PLLDIG_PLL1FD_FRCDIV(x)                  (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FD_FRCDIV_SHIFT))&PLLDIG_PLL1FD_FRCDIV_MASK)
#define PLLDIG_PLL1FD_DTHDIS0_MASK               0x10000u
#define PLLDIG_PLL1FD_DTHDIS0_SHIFT              16u
#define PLLDIG_PLL1FD_DTHDIS0_WIDTH              1u
#define PLLDIG_PLL1FD_DTHDIS0(x)                 (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FD_DTHDIS0_SHIFT))&PLLDIG_PLL1FD_DTHDIS0_MASK)
#define PLLDIG_PLL1FD_DTHDIS1_MASK               0x20000u
#define PLLDIG_PLL1FD_DTHDIS1_SHIFT              17u
#define PLLDIG_PLL1FD_DTHDIS1_WIDTH              1u
#define PLLDIG_PLL1FD_DTHDIS1(x)                 (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FD_DTHDIS1_SHIFT))&PLLDIG_PLL1FD_DTHDIS1_MASK)
#define PLLDIG_PLL1FD_FDEN_MASK                  0x40000000u
#define PLLDIG_PLL1FD_FDEN_SHIFT                 30u
#define PLLDIG_PLL1FD_FDEN_WIDTH                 1u
#define PLLDIG_PLL1FD_FDEN(x)                    (((uint32_t)(((uint32_t)(x))<<PLLDIG_PLL1FD_FDEN_SHIFT))&PLLDIG_PLL1FD_FDEN_MASK)

/*!
 * @}
 */ /* end of group PLLDIG_Register_Masks */


/*!
 * @}
 */ /* end of group PLLDIG_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Peripheral_Access_Layer PMC Peripheral Access Layer
 * @{
 */


