neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** PMC - Size of Registers Arrays */

/** PMC - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[136];
  __IO uint32_t TS_IER;                            /**< Temperature Sensor Interrupt Enable Register, offset: 0x88 */
  __IO uint32_t ESR_TD;                            /**< Temperature Event Status Register, offset: 0x8C */
  __IO uint32_t REE_TD;                            /**< Temperature Reset Event Enable register, offset: 0x90 */
  __IO uint32_t RES_TD;                            /**< Temperature Reset Event Selection Register, offset: 0x94 */
  __IO uint32_t CTL_TD;                            /**< Temperature Detector Configuration Register, offset: 0x98 */
       uint8_t RESERVED_1[8];
  __IO uint32_t TS_FIR;                            /**< Temperature Sensor Fault Injection Register, offset: 0xA4 */
       uint8_t RESERVED_2[12];
  __IO uint32_t SELF_TEST_UM_VD_REG;               /**< Voltage Detect User Mode Test Register, offset: 0xB4 */
  __IO uint32_t FIR;                               /**< FCCU Fault Injection Register, offset: 0xB8 */
  __IO uint32_t LVD_HVD_INTR_ENB;                  /**< LVD/HVD Interrupt Enable Control Register, offset: 0xBC */
  __IO uint32_t LVD_HVD_EVENT_STATUS;              /**< LVD/HVD Event Status Register, offset: 0xC0 */
  __IO uint32_t ADC_CS;                            /**< ADC Channel Select Register, offset: 0xC4 */
       uint8_t RESERVED_3[8];
  __IO uint32_t REE;                               /**< Reset Event Enable Register, offset: 0xD0 */
} PMC_Type, *PMC_MemMapPtr;

 /** Number of instances of the PMC module. */
#define PMC_INSTANCE_COUNT                       (1u)


/* PMC - Peripheral instance base addresses */
/** Peripheral PMC base address */
#define PMC_BASE                                 (0xC3FBC000u)
/** Peripheral PMC base pointer */
#define PMC                                      ((PMC_Type *)PMC_BASE)
/** Array initializer of PMC peripheral base addresses */
#define PMC_BASE_ADDRS                           { PMC_BASE }
/** Array initializer of PMC peripheral base pointers */
#define PMC_BASE_PTRS                            { PMC }

/* ----------------------------------------------------------------------------
   -- PMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Register_Masks PMC Register Masks
 * @{
 */

/* TS_IER Bit Fields */
#define PMC_TS_IER_TS0_0IE_MASK                  0x1u
#define PMC_TS_IER_TS0_0IE_SHIFT                 0u
#define PMC_TS_IER_TS0_0IE_WIDTH                 1u
#define PMC_TS_IER_TS0_0IE(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_TS_IER_TS0_0IE_SHIFT))&PMC_TS_IER_TS0_0IE_MASK)
#define PMC_TS_IER_TS0_2IE_MASK                  0x2u
#define PMC_TS_IER_TS0_2IE_SHIFT                 1u
#define PMC_TS_IER_TS0_2IE_WIDTH                 1u
#define PMC_TS_IER_TS0_2IE(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_TS_IER_TS0_2IE_SHIFT))&PMC_TS_IER_TS0_2IE_MASK)
#define PMC_TS_IER_TS1_0IE_MASK                  0x8u
#define PMC_TS_IER_TS1_0IE_SHIFT                 3u
#define PMC_TS_IER_TS1_0IE_WIDTH                 1u
#define PMC_TS_IER_TS1_0IE(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_TS_IER_TS1_0IE_SHIFT))&PMC_TS_IER_TS1_0IE_MASK)
#define PMC_TS_IER_TS1_2IE_MASK                  0x10u
#define PMC_TS_IER_TS1_2IE_SHIFT                 4u
#define PMC_TS_IER_TS1_2IE_WIDTH                 1u
#define PMC_TS_IER_TS1_2IE(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_TS_IER_TS1_2IE_SHIFT))&PMC_TS_IER_TS1_2IE_MASK)
#define PMC_TS_IER_TS_EN_MASK                    0x80000000u
#define PMC_TS_IER_TS_EN_SHIFT                   31u
#define PMC_TS_IER_TS_EN_WIDTH                   1u
#define PMC_TS_IER_TS_EN(x)                      (((uint32_t)(((uint32_t)(x))<<PMC_TS_IER_TS_EN_SHIFT))&PMC_TS_IER_TS_EN_MASK)
/* ESR_TD Bit Fields */
#define PMC_ESR_TD_TEMP0_0_MASK                  0x1u
#define PMC_ESR_TD_TEMP0_0_SHIFT                 0u
#define PMC_ESR_TD_TEMP0_0_WIDTH                 1u
#define PMC_ESR_TD_TEMP0_0(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_ESR_TD_TEMP0_0_SHIFT))&PMC_ESR_TD_TEMP0_0_MASK)
#define PMC_ESR_TD_TEMP0_2_MASK                  0x2u
#define PMC_ESR_TD_TEMP0_2_SHIFT                 1u
#define PMC_ESR_TD_TEMP0_2_WIDTH                 1u
#define PMC_ESR_TD_TEMP0_2(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_ESR_TD_TEMP0_2_SHIFT))&PMC_ESR_TD_TEMP0_2_MASK)
#define PMC_ESR_TD_TEMP1_0_MASK                  0x8u
#define PMC_ESR_TD_TEMP1_0_SHIFT                 3u
#define PMC_ESR_TD_TEMP1_0_WIDTH                 1u
#define PMC_ESR_TD_TEMP1_0(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_ESR_TD_TEMP1_0_SHIFT))&PMC_ESR_TD_TEMP1_0_MASK)
#define PMC_ESR_TD_TEMP1_2_MASK                  0x10u
#define PMC_ESR_TD_TEMP1_2_SHIFT                 4u
#define PMC_ESR_TD_TEMP1_2_WIDTH                 1u
#define PMC_ESR_TD_TEMP1_2(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_ESR_TD_TEMP1_2_SHIFT))&PMC_ESR_TD_TEMP1_2_MASK)
/* REE_TD Bit Fields */
#define PMC_REE_TD_TEMP0_0_MASK                  0x1u
#define PMC_REE_TD_TEMP0_0_SHIFT                 0u
#define PMC_REE_TD_TEMP0_0_WIDTH                 1u
#define PMC_REE_TD_TEMP0_0(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_REE_TD_TEMP0_0_SHIFT))&PMC_REE_TD_TEMP0_0_MASK)
#define PMC_REE_TD_TEMP0_2_MASK                  0x2u
#define PMC_REE_TD_TEMP0_2_SHIFT                 1u
#define PMC_REE_TD_TEMP0_2_WIDTH                 1u
#define PMC_REE_TD_TEMP0_2(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_REE_TD_TEMP0_2_SHIFT))&PMC_REE_TD_TEMP0_2_MASK)
#define PMC_REE_TD_TEMP1_0_MASK                  0x8u
#define PMC_REE_TD_TEMP1_0_SHIFT                 3u
#define PMC_REE_TD_TEMP1_0_WIDTH                 1u
#define PMC_REE_TD_TEMP1_0(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_REE_TD_TEMP1_0_SHIFT))&PMC_REE_TD_TEMP1_0_MASK)
#define PMC_REE_TD_TEMP1_2_MASK                  0x10u
#define PMC_REE_TD_TEMP1_2_SHIFT                 4u
#define PMC_REE_TD_TEMP1_2_WIDTH                 1u
#define PMC_REE_TD_TEMP1_2(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_REE_TD_TEMP1_2_SHIFT))&PMC_REE_TD_TEMP1_2_MASK)
/* RES_TD Bit Fields */
#define PMC_RES_TD_TEMP0_0_MASK                  0x1u
#define PMC_RES_TD_TEMP0_0_SHIFT                 0u
#define PMC_RES_TD_TEMP0_0_WIDTH                 1u
#define PMC_RES_TD_TEMP0_0(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_RES_TD_TEMP0_0_SHIFT))&PMC_RES_TD_TEMP0_0_MASK)
#define PMC_RES_TD_TEMP0_2_MASK                  0x2u
#define PMC_RES_TD_TEMP0_2_SHIFT                 1u
#define PMC_RES_TD_TEMP0_2_WIDTH                 1u
#define PMC_RES_TD_TEMP0_2(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_RES_TD_TEMP0_2_SHIFT))&PMC_RES_TD_TEMP0_2_MASK)
#define PMC_RES_TD_TEMP1_0_MASK                  0x8u
#define PMC_RES_TD_TEMP1_0_SHIFT                 3u
#define PMC_RES_TD_TEMP1_0_WIDTH                 1u
#define PMC_RES_TD_TEMP1_0(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_RES_TD_TEMP1_0_SHIFT))&PMC_RES_TD_TEMP1_0_MASK)
#define PMC_RES_TD_TEMP1_2_MASK                  0x10u
#define PMC_RES_TD_TEMP1_2_SHIFT                 4u
#define PMC_RES_TD_TEMP1_2_WIDTH                 1u
#define PMC_RES_TD_TEMP1_2(x)                    (((uint32_t)(((uint32_t)(x))<<PMC_RES_TD_TEMP1_2_SHIFT))&PMC_RES_TD_TEMP1_2_MASK)
/* CTL_TD Bit Fields */
#define PMC_CTL_TD_TS0_EN_MASK                   0x1u
#define PMC_CTL_TD_TS0_EN_SHIFT                  0u
#define PMC_CTL_TD_TS0_EN_WIDTH                  1u
#define PMC_CTL_TD_TS0_EN(x)                     (((uint32_t)(((uint32_t)(x))<<PMC_CTL_TD_TS0_EN_SHIFT))&PMC_CTL_TD_TS0_EN_MASK)
#define PMC_CTL_TD_TS1_EN_MASK                   0x100u
#define PMC_CTL_TD_TS1_EN_SHIFT                  8u
#define PMC_CTL_TD_TS1_EN_WIDTH                  1u
#define PMC_CTL_TD_TS1_EN(x)                     (((uint32_t)(((uint32_t)(x))<<PMC_CTL_TD_TS1_EN_SHIFT))&PMC_CTL_TD_TS1_EN_MASK)
/* TS_FIR Bit Fields */
#define PMC_TS_FIR_TSNS_FAULT_MASK               0x1u
#define PMC_TS_FIR_TSNS_FAULT_SHIFT              0u
#define PMC_TS_FIR_TSNS_FAULT_WIDTH              1u
#define PMC_TS_FIR_TSNS_FAULT(x)                 (((uint32_t)(((uint32_t)(x))<<PMC_TS_FIR_TSNS_FAULT_SHIFT))&PMC_TS_FIR_TSNS_FAULT_MASK)
/* SELF_TEST_UM_VD_REG Bit Fields */
#define PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_MASK  0x3Fu
#define PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_SHIFT 0u
#define PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_WIDTH 6u
#define PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL(x)    (((uint32_t)(((uint32_t)(x))<<PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_SHIFT))&PMC_SELF_TEST_UM_VD_REG_VD_ST_CTRL_MASK)
#define PMC_SELF_TEST_UM_VD_REG_ST_MODE_MASK     0xC0u
#define PMC_SELF_TEST_UM_VD_REG_ST_MODE_SHIFT    6u
#define PMC_SELF_TEST_UM_VD_REG_ST_MODE_WIDTH    2u
#define PMC_SELF_TEST_UM_VD_REG_ST_MODE(x)       (((uint32_t)(((uint32_t)(x))<<PMC_SELF_TEST_UM_VD_REG_ST_MODE_SHIFT))&PMC_SELF_TEST_UM_VD_REG_ST_MODE_MASK)
#define PMC_SELF_TEST_UM_VD_REG_ST_DONE_MASK     0x10000u
#define PMC_SELF_TEST_UM_VD_REG_ST_DONE_SHIFT    16u
#define PMC_SELF_TEST_UM_VD_REG_ST_DONE_WIDTH    1u
#define PMC_SELF_TEST_UM_VD_REG_ST_DONE(x)       (((uint32_t)(((uint32_t)(x))<<PMC_SELF_TEST_UM_VD_REG_ST_DONE_SHIFT))&PMC_SELF_TEST_UM_VD_REG_ST_DONE_MASK)
#define PMC_SELF_TEST_UM_VD_REG_ST_RESULT_MASK   0x20000u
#define PMC_SELF_TEST_UM_VD_REG_ST_RESULT_SHIFT  17u
#define PMC_SELF_TEST_UM_VD_REG_ST_RESULT_WIDTH  1u
#define PMC_SELF_TEST_UM_VD_REG_ST_RESULT(x)     (((uint32_t)(((uint32_t)(x))<<PMC_SELF_TEST_UM_VD_REG_ST_RESULT_SHIFT))&PMC_SELF_TEST_UM_VD_REG_ST_RESULT_MASK)
/* FIR Bit Fields */
#define PMC_FIR_LVD_FAULT_MASK                   0x1u
#define PMC_FIR_LVD_FAULT_SHIFT                  0u
#define PMC_FIR_LVD_FAULT_WIDTH                  1u
#define PMC_FIR_LVD_FAULT(x)                     (((uint32_t)(((uint32_t)(x))<<PMC_FIR_LVD_FAULT_SHIFT))&PMC_FIR_LVD_FAULT_MASK)
#define PMC_FIR_HVD_FAULT_MASK                   0x2u
#define PMC_FIR_HVD_FAULT_SHIFT                  1u
#define PMC_FIR_HVD_FAULT_WIDTH                  1u
#define PMC_FIR_HVD_FAULT(x)                     (((uint32_t)(((uint32_t)(x))<<PMC_FIR_HVD_FAULT_SHIFT))&PMC_FIR_HVD_FAULT_MASK)
#define PMC_FIR_STEST_FAULT_MASK                 0x8u
#define PMC_FIR_STEST_FAULT_SHIFT                3u
#define PMC_FIR_STEST_FAULT_WIDTH                1u
#define PMC_FIR_STEST_FAULT(x)                   (((uint32_t)(((uint32_t)(x))<<PMC_FIR_STEST_FAULT_SHIFT))&PMC_FIR_STEST_FAULT_MASK)
/* LVD_HVD_INTR_ENB Bit Fields */
#define PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_MASK  0x1u
#define PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_SHIFT 0u
#define PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_WIDTH 1u
#define PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD(x)    (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_SHIFT))&PMC_LVD_HVD_INTR_ENB_LVD_CORE_COLD_MASK)
#define PMC_LVD_HVD_INTR_ENB_HVD_CORE_MASK       0x4u
#define PMC_LVD_HVD_INTR_ENB_HVD_CORE_SHIFT      2u
#define PMC_LVD_HVD_INTR_ENB_HVD_CORE_WIDTH      1u
#define PMC_LVD_HVD_INTR_ENB_HVD_CORE(x)         (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_INTR_ENB_HVD_CORE_SHIFT))&PMC_LVD_HVD_INTR_ENB_HVD_CORE_MASK)
#define PMC_LVD_HVD_INTR_ENB_HVD_HV_MASK         0x8u
#define PMC_LVD_HVD_INTR_ENB_HVD_HV_SHIFT        3u
#define PMC_LVD_HVD_INTR_ENB_HVD_HV_WIDTH        1u
#define PMC_LVD_HVD_INTR_ENB_HVD_HV(x)           (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_INTR_ENB_HVD_HV_SHIFT))&PMC_LVD_HVD_INTR_ENB_HVD_HV_MASK)
#define PMC_LVD_HVD_INTR_ENB_HVD_FLASH_MASK      0x20u
#define PMC_LVD_HVD_INTR_ENB_HVD_FLASH_SHIFT     5u
#define PMC_LVD_HVD_INTR_ENB_HVD_FLASH_WIDTH     1u
#define PMC_LVD_HVD_INTR_ENB_HVD_FLASH(x)        (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_INTR_ENB_HVD_FLASH_SHIFT))&PMC_LVD_HVD_INTR_ENB_HVD_FLASH_MASK)
#define PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_MASK     0x80000000u
#define PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_SHIFT    31u
#define PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_WIDTH    1u
#define PMC_LVD_HVD_INTR_ENB_PMC_ENABLE(x)       (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_SHIFT))&PMC_LVD_HVD_INTR_ENB_PMC_ENABLE_MASK)
/* LVD_HVD_EVENT_STATUS Bit Fields */
#define PMC_LVD_HVD_EVENT_STATUS_LVD_CORE_COLD_MASK 0x1u
#define PMC_LVD_HVD_EVENT_STATUS_LVD_CORE_COLD_SHIFT 0u
#define PMC_LVD_HVD_EVENT_STATUS_LVD_CORE_COLD_WIDTH 1u
#define PMC_LVD_HVD_EVENT_STATUS_LVD_CORE_COLD(x) (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_EVENT_STATUS_LVD_CORE_COLD_SHIFT))&PMC_LVD_HVD_EVENT_STATUS_LVD_CORE_COLD_MASK)
#define PMC_LVD_HVD_EVENT_STATUS_HVD_CORE_MASK   0x4u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_CORE_SHIFT  2u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_CORE_WIDTH  1u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_CORE(x)     (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_EVENT_STATUS_HVD_CORE_SHIFT))&PMC_LVD_HVD_EVENT_STATUS_HVD_CORE_MASK)
#define PMC_LVD_HVD_EVENT_STATUS_HVD_HV_MASK     0x8u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_HV_SHIFT    3u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_HV_WIDTH    1u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_HV(x)       (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_EVENT_STATUS_HVD_HV_SHIFT))&PMC_LVD_HVD_EVENT_STATUS_HVD_HV_MASK)
#define PMC_LVD_HVD_EVENT_STATUS_HVD_FLASH_MASK  0x20u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_FLASH_SHIFT 5u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_FLASH_WIDTH 1u
#define PMC_LVD_HVD_EVENT_STATUS_HVD_FLASH(x)    (((uint32_t)(((uint32_t)(x))<<PMC_LVD_HVD_EVENT_STATUS_HVD_FLASH_SHIFT))&PMC_LVD_HVD_EVENT_STATUS_HVD_FLASH_MASK)
/* ADC_CS Bit Fields */
#define PMC_ADC_CS_ADC_CS_MASK                   0x3Fu
#define PMC_ADC_CS_ADC_CS_SHIFT                  0u
#define PMC_ADC_CS_ADC_CS_WIDTH                  6u
#define PMC_ADC_CS_ADC_CS(x)                     (((uint32_t)(((uint32_t)(x))<<PMC_ADC_CS_ADC_CS_SHIFT))&PMC_ADC_CS_ADC_CS_MASK)
#define PMC_ADC_CS_STND_BY_RAM_BR_DETCT_MASK     0x100u
#define PMC_ADC_CS_STND_BY_RAM_BR_DETCT_SHIFT    8u
#define PMC_ADC_CS_STND_BY_RAM_BR_DETCT_WIDTH    1u
#define PMC_ADC_CS_STND_BY_RAM_BR_DETCT(x)       (((uint32_t)(((uint32_t)(x))<<PMC_ADC_CS_STND_BY_RAM_BR_DETCT_SHIFT))&PMC_ADC_CS_STND_BY_RAM_BR_DETCT_MASK)
#define PMC_ADC_CS_STND_BY_RAM_BO_CLR_MASK       0x200u
#define PMC_ADC_CS_STND_BY_RAM_BO_CLR_SHIFT      9u
#define PMC_ADC_CS_STND_BY_RAM_BO_CLR_WIDTH      1u
#define PMC_ADC_CS_STND_BY_RAM_BO_CLR(x)         (((uint32_t)(((uint32_t)(x))<<PMC_ADC_CS_STND_BY_RAM_BO_CLR_SHIFT))&PMC_ADC_CS_STND_BY_RAM_BO_CLR_MASK)
/* REE Bit Fields */
#define PMC_REE_LVD_CORE_COLD_MASK               0x1u
#define PMC_REE_LVD_CORE_COLD_SHIFT              0u
#define PMC_REE_LVD_CORE_COLD_WIDTH              1u
#define PMC_REE_LVD_CORE_COLD(x)                 (((uint32_t)(((uint32_t)(x))<<PMC_REE_LVD_CORE_COLD_SHIFT))&PMC_REE_LVD_CORE_COLD_MASK)
#define PMC_REE_HVD_CORE_MASK                    0x4u
#define PMC_REE_HVD_CORE_SHIFT                   2u
#define PMC_REE_HVD_CORE_WIDTH                   1u
#define PMC_REE_HVD_CORE(x)                      (((uint32_t)(((uint32_t)(x))<<PMC_REE_HVD_CORE_SHIFT))&PMC_REE_HVD_CORE_MASK)
#define PMC_REE_HVD_HV_MASK                      0x8u
#define PMC_REE_HVD_HV_SHIFT                     3u
#define PMC_REE_HVD_HV_WIDTH                     1u
#define PMC_REE_HVD_HV(x)                        (((uint32_t)(((uint32_t)(x))<<PMC_REE_HVD_HV_SHIFT))&PMC_REE_HVD_HV_MASK)
#define PMC_REE_HVD_FLASH_MASK                   0x20u
#define PMC_REE_HVD_FLASH_SHIFT                  5u
#define PMC_REE_HVD_FLASH_WIDTH                  1u
#define PMC_REE_HVD_FLASH(x)                     (((uint32_t)(((uint32_t)(x))<<PMC_REE_HVD_FLASH_SHIFT))&PMC_REE_HVD_FLASH_MASK)

/*!
 * @}
 */ /* end of group PMC_Register_Masks */


/*!
 * @}
 */ /* end of group PMC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PRAMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PRAMC_Peripheral_Access_Layer PRAMC Peripheral Access Layer
 * @{
 */


