neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** PRAMC - Size of Registers Arrays */

/** PRAMC - Register Layout Typedef */
typedef struct {
  __IO uint32_t PRCR1;                             /**< Platform RAM Configuration Register 1, offset: 0x0 */
} PRAMC_Type, *PRAMC_MemMapPtr;

 /** Number of instances of the PRAMC module. */
#define PRAMC_INSTANCE_COUNT                     (2u)


/* PRAMC - Peripheral instance base addresses */
/** Peripheral PRAMC_0 base address */
#define PRAMC_0_BASE                             (0xFFF1C000u)
/** Peripheral PRAMC_0 base pointer */
#define PRAMC_0                                  ((PRAMC_Type *)PRAMC_0_BASE)
/** Peripheral PRAMC_1 base address */
#define PRAMC_1_BASE                             (0xFFF20000u)
/** Peripheral PRAMC_1 base pointer */
#define PRAMC_1                                  ((PRAMC_Type *)PRAMC_1_BASE)
/** Array initializer of PRAMC peripheral base addresses */
#define PRAMC_BASE_ADDRS                         { PRAMC_0_BASE, PRAMC_1_BASE }
/** Array initializer of PRAMC peripheral base pointers */
#define PRAMC_BASE_PTRS                          { PRAMC_0, PRAMC_1 }

/* ----------------------------------------------------------------------------
   -- PRAMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PRAMC_Register_Masks PRAMC Register Masks
 * @{
 */

/* PRCR1 Bit Fields */
#define PRAMC_PRCR1_FT_DIS_MASK                  0x1u
#define PRAMC_PRCR1_FT_DIS_SHIFT                 0u
#define PRAMC_PRCR1_FT_DIS_WIDTH                 1u
#define PRAMC_PRCR1_FT_DIS(x)                    (((uint32_t)(((uint32_t)(x))<<PRAMC_PRCR1_FT_DIS_SHIFT))&PRAMC_PRCR1_FT_DIS_MASK)
#define PRAMC_PRCR1_P0_BO_DIS_MASK               0x40u
#define PRAMC_PRCR1_P0_BO_DIS_SHIFT              6u
#define PRAMC_PRCR1_P0_BO_DIS_WIDTH              1u
#define PRAMC_PRCR1_P0_BO_DIS(x)                 (((uint32_t)(((uint32_t)(x))<<PRAMC_PRCR1_P0_BO_DIS_SHIFT))&PRAMC_PRCR1_P0_BO_DIS_MASK)

/*!
 * @}
 */ /* end of group PRAMC_Register_Masks */


/*!
 * @}
 */ /* end of group PRAMC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- PSI5 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PSI5_Peripheral_Access_Layer PSI5 Peripheral Access Layer
 * @{
 */


/** PSI5 - Size of Registers Arrays */
#define PSI5_CH0_PMR_COUNT                       32u
#define PSI5_CH0_SFR_COUNT                       6u
#define PSI5_CH0_SFCR_COUNT                      6u

/** PSI5 - Register Layout Typedef */
typedef struct {
  __IO uint16_t GCR;                               /**< Global Control Register, offset: 0x0 */
       uint8_t RESERVED_0[6];
  __IO uint32_t CH0_PCCR;                          /**< PSI5 Channel Control Register, offset: 0x8 */
  __IO uint32_t CH0_DCR;                           /**< DMA Control Register, offset: 0xC */
  __IO uint32_t CH0_DSR;                           /**< DMA Status Register, offset: 0x10 */
  __IO uint32_t CH0_GICR;                          /**< General Interrupt Control Register, offset: 0x14 */
  __IO uint32_t CH0_NDICR;                         /**< New Data Interrupt Control Register, offset: 0x18 */
  __IO uint32_t CH0_OWICR;                         /**< Overwrite Interrupt Control Register, offset: 0x1C */
  __IO uint32_t CH0_EICR;                          /**< Error Interrupt Control Register, offset: 0x20 */
  __IO uint32_t CH0_GISR;                          /**< General Interrupt Status Register, offset: 0x24 */
  __I  uint32_t CH0_DPMR;                          /**< DMA PSI5 Message Register, offset: 0x28 */
  __I  uint32_t CH0_DSFR;                          /**< DMA SMC Frame Register, offset: 0x2C */
  __I  uint32_t CH0_DDSR;                          /**< DMA Diagnostic Status Register, offset: 0x30 */
  __I  uint32_t CH0_PMRRL;                         /**< PSI5 Message Receive Register Low, offset: 0x34 */
  __I  uint32_t CH0_PMRRH;                         /**< PSI5 Message Receive Register High, offset: 0x38 */
  struct {                                         /* offset: 0x3C, array step: 0x8 */
    __IO uint32_t CH0_PMRL;                          /**< PSI5 Message Register Low i, array offset: 0x3C, array step: 0x8 */
    __IO uint32_t CH0_PMRH;                          /**< PSI5 Message Register High i, array offset: 0x40, array step: 0x8 */
  } CH0_PMR[PSI5_CH0_PMR_COUNT];
  __IO uint32_t CH0_SFR[PSI5_CH0_SFR_COUNT];       /**< SMC Frame Register n, array offset: 0x13C, array step: 0x4 */
  __IO uint32_t CH0_NDSR;                          /**< New Data Status Register, offset: 0x154 */
  __IO uint32_t CH0_OWSR;                          /**< Overwrite Status Register, offset: 0x158 */
  __IO uint32_t CH0_EISR;                          /**< Error Indication Status Register, offset: 0x15C */
  __O  uint32_t CH0_SNDSR;                         /**< Set New Data Status Register, offset: 0x160 */
  __O  uint32_t CH0_SOWSR;                         /**< Set Overwrite Status Register, offset: 0x164 */
  __O  uint32_t CH0_SEISR;                         /**< Set Error Status Register, offset: 0x168 */
  __IO uint32_t CH0_SSESR;                         /**< Set SMC Error Status Register, offset: 0x16C */
  __I  uint32_t CH0_STSRR;                         /**< Sync Time Stamp Read Register, offset: 0x170 */
  __I  uint32_t CH0_DTSRR;                         /**< Data Time Stamp Read Register, offset: 0x174 */
  __IO uint32_t CH0_SFCR[PSI5_CH0_SFCR_COUNT];     /**< Slot n Frame Configuration Register, array offset: 0x178, array step: 0x4 */
  __IO uint16_t CH0_S1SBR;                         /**< Slot 1 Start Boundary Register, offset: 0x190 */
  __IO uint16_t CH0_S2SBR;                         /**< Slot 2 Start Boundary Register, offset: 0x192 */
  __IO uint16_t CH0_S3SBR;                         /**< Slot 3 Start Boundary Register, offset: 0x194 */
  __IO uint16_t CH0_S4SBR;                         /**< Slot 4 Start Boundary Register, offset: 0x196 */
  __IO uint16_t CH0_S5SBR;                         /**< Slot 5 Start Boundary Register, offset: 0x198 */
  __IO uint16_t CH0_S6SBR;                         /**< Slot 6 Start Boundary Register, offset: 0x19A */
  __IO uint32_t CH0_SnEBR;                         /**< Slot n End Boundary Register, offset: 0x19C */
  __IO uint16_t CH0_DOBCR;                         /**< Data Output Block Configuration Register, offset: 0x1A0 */
  __IO uint16_t CH0_MDDIS_OFF;                     /**< Manchestor Decoder Disable Offset, offset: 0x1A2 */
  __IO uint16_t CH0_PW0D;                          /**< Pulse Width for Data Bit Value 0, offset: 0x1A4 */
  __IO uint16_t CH0_PW1D;                          /**< Pulse Width for Data Bit Value 1, offset: 0x1A6 */
  __IO uint16_t CH0_CTPR;                          /**< Counter Target Pulse Register, offset: 0x1A8 */
  __IO uint16_t CH0_CIPR;                          /**< Counter Initialize Pulse Register, offset: 0x1AA */
  __IO uint32_t CH0_DPRL;                          /**< Data Preparation Register Low, offset: 0x1AC */
  __I  uint32_t CH0_DPRH;                          /**< Data Preparation Register High, offset: 0x1B0 */
  __IO uint32_t CH0_DBRL;                          /**< Data Buffer Register Low, offset: 0x1B4 */
  __IO uint32_t CH0_DBRH;                          /**< Data Buffer Register High, offset: 0x1B8 */
  __IO uint32_t CH0_DSRL;                          /**< Data Shift Register Low, offset: 0x1BC */
  __IO uint32_t CH0_DSRH;                          /**< Data Shift Register High, offset: 0x1C0 */
} PSI5_Type, *PSI5_MemMapPtr;

 /** Number of instances of the PSI5 module. */
#define PSI5_INSTANCE_COUNT                      (2u)


/* PSI5 - Peripheral instance base addresses */
/** Peripheral PSI5_0 base address */
#define PSI5_0_BASE                              (0xFFE3C000u)
/** Peripheral PSI5_0 base pointer */
#define PSI5_0                                   ((PSI5_Type *)PSI5_0_BASE)
/** Peripheral PSI5_1 base address */
#define PSI5_1_BASE                              (0xC3E14000u)
/** Peripheral PSI5_1 base pointer */
#define PSI5_1                                   ((PSI5_Type *)PSI5_1_BASE)
/** Array initializer of PSI5 peripheral base addresses */
#define PSI5_BASE_ADDRS                          { PSI5_0_BASE, PSI5_1_BASE }
/** Array initializer of PSI5 peripheral base pointers */
#define PSI5_BASE_PTRS                           { PSI5_0, PSI5_1 }

/* ----------------------------------------------------------------------------
   -- PSI5 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PSI5_Register_Masks PSI5 Register Masks
 * @{
 */

