neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* GCR Bit Fields */
#define PSI5_GCR_GLOBAL_DISABLE_REQ_MASK         0x1u
#define PSI5_GCR_GLOBAL_DISABLE_REQ_SHIFT        0u
#define PSI5_GCR_GLOBAL_DISABLE_REQ_WIDTH        1u
#define PSI5_GCR_GLOBAL_DISABLE_REQ(x)           (((uint16_t)(((uint16_t)(x))<<PSI5_GCR_GLOBAL_DISABLE_REQ_SHIFT))&PSI5_GCR_GLOBAL_DISABLE_REQ_MASK)
#define PSI5_GCR_CTC_GED_MASK                    0x2u
#define PSI5_GCR_CTC_GED_SHIFT                   1u
#define PSI5_GCR_CTC_GED_WIDTH                   1u
#define PSI5_GCR_CTC_GED(x)                      (((uint16_t)(((uint16_t)(x))<<PSI5_GCR_CTC_GED_SHIFT))&PSI5_GCR_CTC_GED_MASK)
/* CH0_PCCR Bit Fields */
#define PSI5_CH0_PCCR_PSI5_CH_EN_MASK            0x1u
#define PSI5_CH0_PCCR_PSI5_CH_EN_SHIFT           0u
#define PSI5_CH0_PCCR_PSI5_CH_EN_WIDTH           1u
#define PSI5_CH0_PCCR_PSI5_CH_EN(x)              (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_PSI5_CH_EN_SHIFT))&PSI5_CH0_PCCR_PSI5_CH_EN_MASK)
#define PSI5_CH0_PCCR_PSI5_CH_CONFIG_MASK        0x2u
#define PSI5_CH0_PCCR_PSI5_CH_CONFIG_SHIFT       1u
#define PSI5_CH0_PCCR_PSI5_CH_CONFIG_WIDTH       1u
#define PSI5_CH0_PCCR_PSI5_CH_CONFIG(x)          (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_PSI5_CH_CONFIG_SHIFT))&PSI5_CH0_PCCR_PSI5_CH_CONFIG_MASK)
#define PSI5_CH0_PCCR_MODE_MASK                  0x4u
#define PSI5_CH0_PCCR_MODE_SHIFT                 2u
#define PSI5_CH0_PCCR_MODE_WIDTH                 1u
#define PSI5_CH0_PCCR_MODE(x)                    (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_MODE_SHIFT))&PSI5_CH0_PCCR_MODE_MASK)
#define PSI5_CH0_PCCR_BIT_RATE_MASK              0x8u
#define PSI5_CH0_PCCR_BIT_RATE_SHIFT             3u
#define PSI5_CH0_PCCR_BIT_RATE_WIDTH             1u
#define PSI5_CH0_PCCR_BIT_RATE(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_BIT_RATE_SHIFT))&PSI5_CH0_PCCR_BIT_RATE_MASK)
#define PSI5_CH0_PCCR_FAST_CLR_PSI5_MASK         0x10u
#define PSI5_CH0_PCCR_FAST_CLR_PSI5_SHIFT        4u
#define PSI5_CH0_PCCR_FAST_CLR_PSI5_WIDTH        1u
#define PSI5_CH0_PCCR_FAST_CLR_PSI5(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_FAST_CLR_PSI5_SHIFT))&PSI5_CH0_PCCR_FAST_CLR_PSI5_MASK)
#define PSI5_CH0_PCCR_FAST_CLR_SMC_MASK          0x20u
#define PSI5_CH0_PCCR_FAST_CLR_SMC_SHIFT         5u
#define PSI5_CH0_PCCR_FAST_CLR_SMC_WIDTH         1u
#define PSI5_CH0_PCCR_FAST_CLR_SMC(x)            (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_FAST_CLR_SMC_SHIFT))&PSI5_CH0_PCCR_FAST_CLR_SMC_MASK)
#define PSI5_CH0_PCCR_SP_TS_CLK_SEL_MASK         0x100u
#define PSI5_CH0_PCCR_SP_TS_CLK_SEL_SHIFT        8u
#define PSI5_CH0_PCCR_SP_TS_CLK_SEL_WIDTH        1u
#define PSI5_CH0_PCCR_SP_TS_CLK_SEL(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_SP_TS_CLK_SEL_SHIFT))&PSI5_CH0_PCCR_SP_TS_CLK_SEL_MASK)
#define PSI5_CH0_PCCR_DEBUG_FREEZE_CTRL_MASK     0x200u
#define PSI5_CH0_PCCR_DEBUG_FREEZE_CTRL_SHIFT    9u
#define PSI5_CH0_PCCR_DEBUG_FREEZE_CTRL_WIDTH    1u
#define PSI5_CH0_PCCR_DEBUG_FREEZE_CTRL(x)       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_DEBUG_FREEZE_CTRL_SHIFT))&PSI5_CH0_PCCR_DEBUG_FREEZE_CTRL_MASK)
#define PSI5_CH0_PCCR_DEBUG_EN_MASK              0x400u
#define PSI5_CH0_PCCR_DEBUG_EN_SHIFT             10u
#define PSI5_CH0_PCCR_DEBUG_EN_WIDTH             1u
#define PSI5_CH0_PCCR_DEBUG_EN(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_DEBUG_EN_SHIFT))&PSI5_CH0_PCCR_DEBUG_EN_MASK)
#define PSI5_CH0_PCCR_GTM_RESET_ASYNC_EN_MASK    0x4000u
#define PSI5_CH0_PCCR_GTM_RESET_ASYNC_EN_SHIFT   14u
#define PSI5_CH0_PCCR_GTM_RESET_ASYNC_EN_WIDTH   1u
#define PSI5_CH0_PCCR_GTM_RESET_ASYNC_EN(x)      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_GTM_RESET_ASYNC_EN_SHIFT))&PSI5_CH0_PCCR_GTM_RESET_ASYNC_EN_MASK)
#define PSI5_CH0_PCCR_ERROR_SELECT0_MASK         0x10000u
#define PSI5_CH0_PCCR_ERROR_SELECT0_SHIFT        16u
#define PSI5_CH0_PCCR_ERROR_SELECT0_WIDTH        1u
#define PSI5_CH0_PCCR_ERROR_SELECT0(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_ERROR_SELECT0_SHIFT))&PSI5_CH0_PCCR_ERROR_SELECT0_MASK)
#define PSI5_CH0_PCCR_ERROR_SELECT1_MASK         0x20000u
#define PSI5_CH0_PCCR_ERROR_SELECT1_SHIFT        17u
#define PSI5_CH0_PCCR_ERROR_SELECT1_WIDTH        1u
#define PSI5_CH0_PCCR_ERROR_SELECT1(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_ERROR_SELECT1_SHIFT))&PSI5_CH0_PCCR_ERROR_SELECT1_MASK)
#define PSI5_CH0_PCCR_ERROR_SELECT2_MASK         0x40000u
#define PSI5_CH0_PCCR_ERROR_SELECT2_SHIFT        18u
#define PSI5_CH0_PCCR_ERROR_SELECT2_WIDTH        1u
#define PSI5_CH0_PCCR_ERROR_SELECT2(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_ERROR_SELECT2_SHIFT))&PSI5_CH0_PCCR_ERROR_SELECT2_MASK)
#define PSI5_CH0_PCCR_ERROR_SELECT3_MASK         0x80000u
#define PSI5_CH0_PCCR_ERROR_SELECT3_SHIFT        19u
#define PSI5_CH0_PCCR_ERROR_SELECT3_WIDTH        1u
#define PSI5_CH0_PCCR_ERROR_SELECT3(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_ERROR_SELECT3_SHIFT))&PSI5_CH0_PCCR_ERROR_SELECT3_MASK)
#define PSI5_CH0_PCCR_ERROR_SELECT4_MASK         0x100000u
#define PSI5_CH0_PCCR_ERROR_SELECT4_SHIFT        20u
#define PSI5_CH0_PCCR_ERROR_SELECT4_WIDTH        1u
#define PSI5_CH0_PCCR_ERROR_SELECT4(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_ERROR_SELECT4_SHIFT))&PSI5_CH0_PCCR_ERROR_SELECT4_MASK)
#define PSI5_CH0_PCCR_MEM_DEPTH_MASK             0x1F000000u
#define PSI5_CH0_PCCR_MEM_DEPTH_SHIFT            24u
#define PSI5_CH0_PCCR_MEM_DEPTH_WIDTH            5u
#define PSI5_CH0_PCCR_MEM_DEPTH(x)               (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_MEM_DEPTH_SHIFT))&PSI5_CH0_PCCR_MEM_DEPTH_MASK)
#define PSI5_CH0_PCCR_CTC_ED_MASK                0x40000000u
#define PSI5_CH0_PCCR_CTC_ED_SHIFT               30u
#define PSI5_CH0_PCCR_CTC_ED_WIDTH               1u
#define PSI5_CH0_PCCR_CTC_ED(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_CTC_ED_SHIFT))&PSI5_CH0_PCCR_CTC_ED_MASK)
#define PSI5_CH0_PCCR_CTC_GED_SEL_MASK           0x80000000u
#define PSI5_CH0_PCCR_CTC_GED_SEL_SHIFT          31u
#define PSI5_CH0_PCCR_CTC_GED_SEL_WIDTH          1u
#define PSI5_CH0_PCCR_CTC_GED_SEL(x)             (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PCCR_CTC_GED_SEL_SHIFT))&PSI5_CH0_PCCR_CTC_GED_SEL_MASK)
/* CH0_DCR Bit Fields */
#define PSI5_CH0_DCR_DMA_PM_DS_CONFIG_MASK       0x3u
#define PSI5_CH0_DCR_DMA_PM_DS_CONFIG_SHIFT      0u
#define PSI5_CH0_DCR_DMA_PM_DS_CONFIG_WIDTH      2u
#define PSI5_CH0_DCR_DMA_PM_DS_CONFIG(x)         (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_DMA_PM_DS_CONFIG_SHIFT))&PSI5_CH0_DCR_DMA_PM_DS_CONFIG_MASK)
#define PSI5_CH0_DCR_DMA_EN_SF_MASK              0x4u
#define PSI5_CH0_DCR_DMA_EN_SF_SHIFT             2u
#define PSI5_CH0_DCR_DMA_EN_SF_WIDTH             1u
#define PSI5_CH0_DCR_DMA_EN_SF(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_DMA_EN_SF_SHIFT))&PSI5_CH0_DCR_DMA_EN_SF_MASK)
#define PSI5_CH0_DCR_IE_DMA_PM_DS_UF_MASK        0x100u
#define PSI5_CH0_DCR_IE_DMA_PM_DS_UF_SHIFT       8u
#define PSI5_CH0_DCR_IE_DMA_PM_DS_UF_WIDTH       1u
#define PSI5_CH0_DCR_IE_DMA_PM_DS_UF(x)          (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_IE_DMA_PM_DS_UF_SHIFT))&PSI5_CH0_DCR_IE_DMA_PM_DS_UF_MASK)
#define PSI5_CH0_DCR_IE_DMA_SFUF_MASK            0x400u
#define PSI5_CH0_DCR_IE_DMA_SFUF_SHIFT           10u
#define PSI5_CH0_DCR_IE_DMA_SFUF_WIDTH           1u
#define PSI5_CH0_DCR_IE_DMA_SFUF(x)              (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_IE_DMA_SFUF_SHIFT))&PSI5_CH0_DCR_IE_DMA_SFUF_MASK)
#define PSI5_CH0_DCR_IE_DMA_PM_DS_FIFO_FULL_MASK 0x800u
#define PSI5_CH0_DCR_IE_DMA_PM_DS_FIFO_FULL_SHIFT 11u
#define PSI5_CH0_DCR_IE_DMA_PM_DS_FIFO_FULL_WIDTH 1u
#define PSI5_CH0_DCR_IE_DMA_PM_DS_FIFO_FULL(x)   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_IE_DMA_PM_DS_FIFO_FULL_SHIFT))&PSI5_CH0_DCR_IE_DMA_PM_DS_FIFO_FULL_MASK)
#define PSI5_CH0_DCR_IE_DMA_TF_PM_DS_MASK        0x20000u
#define PSI5_CH0_DCR_IE_DMA_TF_PM_DS_SHIFT       17u
#define PSI5_CH0_DCR_IE_DMA_TF_PM_DS_WIDTH       1u
#define PSI5_CH0_DCR_IE_DMA_TF_PM_DS(x)          (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_IE_DMA_TF_PM_DS_SHIFT))&PSI5_CH0_DCR_IE_DMA_TF_PM_DS_MASK)
#define PSI5_CH0_DCR_IE_DMA_TF_SF_MASK           0x40000u
#define PSI5_CH0_DCR_IE_DMA_TF_SF_SHIFT          18u
#define PSI5_CH0_DCR_IE_DMA_TF_SF_WIDTH          1u
#define PSI5_CH0_DCR_IE_DMA_TF_SF(x)             (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_IE_DMA_TF_SF_SHIFT))&PSI5_CH0_DCR_IE_DMA_TF_SF_MASK)
#define PSI5_CH0_DCR_DMA_PM_DS_WM_MASK           0x1F000000u
#define PSI5_CH0_DCR_DMA_PM_DS_WM_SHIFT          24u
#define PSI5_CH0_DCR_DMA_PM_DS_WM_WIDTH          5u
#define PSI5_CH0_DCR_DMA_PM_DS_WM(x)             (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DCR_DMA_PM_DS_WM_SHIFT))&PSI5_CH0_DCR_DMA_PM_DS_WM_MASK)
/* CH0_DSR Bit Fields */
#define PSI5_CH0_DSR_IS_DMA_PM_DS_UF_MASK        0x100u
#define PSI5_CH0_DSR_IS_DMA_PM_DS_UF_SHIFT       8u
#define PSI5_CH0_DSR_IS_DMA_PM_DS_UF_WIDTH       1u
#define PSI5_CH0_DSR_IS_DMA_PM_DS_UF(x)          (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSR_IS_DMA_PM_DS_UF_SHIFT))&PSI5_CH0_DSR_IS_DMA_PM_DS_UF_MASK)
#define PSI5_CH0_DSR_IS_DMA_SFUF_MASK            0x400u
#define PSI5_CH0_DSR_IS_DMA_SFUF_SHIFT           10u
#define PSI5_CH0_DSR_IS_DMA_SFUF_WIDTH           1u
#define PSI5_CH0_DSR_IS_DMA_SFUF(x)              (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSR_IS_DMA_SFUF_SHIFT))&PSI5_CH0_DSR_IS_DMA_SFUF_MASK)
#define PSI5_CH0_DSR_IS_DMA_PM_DS_FIFO_FULL_MASK 0x800u
#define PSI5_CH0_DSR_IS_DMA_PM_DS_FIFO_FULL_SHIFT 11u
#define PSI5_CH0_DSR_IS_DMA_PM_DS_FIFO_FULL_WIDTH 1u
#define PSI5_CH0_DSR_IS_DMA_PM_DS_FIFO_FULL(x)   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSR_IS_DMA_PM_DS_FIFO_FULL_SHIFT))&PSI5_CH0_DSR_IS_DMA_PM_DS_FIFO_FULL_MASK)
#define PSI5_CH0_DSR_IS_DMA_TF_PM_DS_MASK        0x20000u
#define PSI5_CH0_DSR_IS_DMA_TF_PM_DS_SHIFT       17u
#define PSI5_CH0_DSR_IS_DMA_TF_PM_DS_WIDTH       1u
#define PSI5_CH0_DSR_IS_DMA_TF_PM_DS(x)          (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSR_IS_DMA_TF_PM_DS_SHIFT))&PSI5_CH0_DSR_IS_DMA_TF_PM_DS_MASK)
#define PSI5_CH0_DSR_IS_DMA_TF_SF_MASK           0x40000u
#define PSI5_CH0_DSR_IS_DMA_TF_SF_SHIFT          18u
#define PSI5_CH0_DSR_IS_DMA_TF_SF_WIDTH          1u
#define PSI5_CH0_DSR_IS_DMA_TF_SF(x)             (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSR_IS_DMA_TF_SF_SHIFT))&PSI5_CH0_DSR_IS_DMA_TF_SF_MASK)
/* CH0_GICR Bit Fields */
#define PSI5_CH0_GICR_IE_PRR_MASK                0x10000u
#define PSI5_CH0_GICR_IE_PRR_SHIFT               16u
#define PSI5_CH0_GICR_IE_PRR_WIDTH               1u
#define PSI5_CH0_GICR_IE_PRR(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_PRR_SHIFT))&PSI5_CH0_GICR_IE_PRR_MASK)
#define PSI5_CH0_GICR_IE_BRR_MASK                0x20000u
#define PSI5_CH0_GICR_IE_BRR_SHIFT               17u
#define PSI5_CH0_GICR_IE_BRR_WIDTH               1u
#define PSI5_CH0_GICR_IE_BRR(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_BRR_SHIFT))&PSI5_CH0_GICR_IE_BRR_MASK)
#define PSI5_CH0_GICR_IE_DSRR_MASK               0x40000u
#define PSI5_CH0_GICR_IE_DSRR_SHIFT              18u
#define PSI5_CH0_GICR_IE_DSRR_WIDTH              1u
#define PSI5_CH0_GICR_IE_DSRR(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_DSRR_SHIFT))&PSI5_CH0_GICR_IE_DSRR_MASK)
#define PSI5_CH0_GICR_IE_PROW_MASK               0x80000u
#define PSI5_CH0_GICR_IE_PROW_SHIFT              19u
#define PSI5_CH0_GICR_IE_PROW_WIDTH              1u
#define PSI5_CH0_GICR_IE_PROW(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_PROW_SHIFT))&PSI5_CH0_GICR_IE_PROW_MASK)
#define PSI5_CH0_GICR_IE_BROW_MASK               0x100000u
#define PSI5_CH0_GICR_IE_BROW_SHIFT              20u
#define PSI5_CH0_GICR_IE_BROW_WIDTH              1u
#define PSI5_CH0_GICR_IE_BROW(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_BROW_SHIFT))&PSI5_CH0_GICR_IE_BROW_MASK)
#define PSI5_CH0_GICR_IE_DSROW_MASK              0x200000u
#define PSI5_CH0_GICR_IE_DSROW_SHIFT             21u
#define PSI5_CH0_GICR_IE_DSROW_WIDTH             1u
#define PSI5_CH0_GICR_IE_DSROW(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_DSROW_SHIFT))&PSI5_CH0_GICR_IE_DSROW_MASK)
#define PSI5_CH0_GICR_IE_DTS_MASK                0x400000u
#define PSI5_CH0_GICR_IE_DTS_SHIFT               22u
#define PSI5_CH0_GICR_IE_DTS_WIDTH               1u
#define PSI5_CH0_GICR_IE_DTS(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_DTS_SHIFT))&PSI5_CH0_GICR_IE_DTS_MASK)
#define PSI5_CH0_GICR_IE_STS_MASK                0x800000u
#define PSI5_CH0_GICR_IE_STS_SHIFT               23u
#define PSI5_CH0_GICR_IE_STS_WIDTH               1u
#define PSI5_CH0_GICR_IE_STS(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GICR_IE_STS_SHIFT))&PSI5_CH0_GICR_IE_STS_MASK)
/* CH0_NDICR Bit Fields */
#define PSI5_CH0_NDICR_IE_ND_MASK                0xFFFFFFFFu
#define PSI5_CH0_NDICR_IE_ND_SHIFT               0u
#define PSI5_CH0_NDICR_IE_ND_WIDTH               32u
#define PSI5_CH0_NDICR_IE_ND(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_NDICR_IE_ND_SHIFT))&PSI5_CH0_NDICR_IE_ND_MASK)
/* CH0_OWICR Bit Fields */
#define PSI5_CH0_OWICR_IE_OW_MASK                0xFFFFFFFFu
#define PSI5_CH0_OWICR_IE_OW_SHIFT               0u
#define PSI5_CH0_OWICR_IE_OW_WIDTH               32u
#define PSI5_CH0_OWICR_IE_OW(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_OWICR_IE_OW_SHIFT))&PSI5_CH0_OWICR_IE_OW_MASK)
/* CH0_EICR Bit Fields */
#define PSI5_CH0_EICR_IE_ERROR_MASK              0xFFFFFFFFu
#define PSI5_CH0_EICR_IE_ERROR_SHIFT             0u
#define PSI5_CH0_EICR_IE_ERROR_WIDTH             32u
#define PSI5_CH0_EICR_IE_ERROR(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_EICR_IE_ERROR_SHIFT))&PSI5_CH0_EICR_IE_ERROR_MASK)
/* CH0_GISR Bit Fields */
#define PSI5_CH0_GISR_IS_NVSM_MASK               0x3Fu
#define PSI5_CH0_GISR_IS_NVSM_SHIFT              0u
#define PSI5_CH0_GISR_IS_NVSM_WIDTH              6u
#define PSI5_CH0_GISR_IS_NVSM(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_NVSM_SHIFT))&PSI5_CH0_GISR_IS_NVSM_MASK)
#define PSI5_CH0_GISR_IS_OWSM_MASK               0x3F00u
#define PSI5_CH0_GISR_IS_OWSM_SHIFT              8u
#define PSI5_CH0_GISR_IS_OWSM_WIDTH              6u
#define PSI5_CH0_GISR_IS_OWSM(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_OWSM_SHIFT))&PSI5_CH0_GISR_IS_OWSM_MASK)
#define PSI5_CH0_GISR_DPR_RDY_MASK               0x10000u
#define PSI5_CH0_GISR_DPR_RDY_SHIFT              16u
#define PSI5_CH0_GISR_DPR_RDY_WIDTH              1u
#define PSI5_CH0_GISR_DPR_RDY(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_DPR_RDY_SHIFT))&PSI5_CH0_GISR_DPR_RDY_MASK)
#define PSI5_CH0_GISR_DBR_RDY_MASK               0x20000u
#define PSI5_CH0_GISR_DBR_RDY_SHIFT              17u
#define PSI5_CH0_GISR_DBR_RDY_WIDTH              1u
#define PSI5_CH0_GISR_DBR_RDY(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_DBR_RDY_SHIFT))&PSI5_CH0_GISR_DBR_RDY_MASK)
#define PSI5_CH0_GISR_DSR_RDY_MASK               0x40000u
#define PSI5_CH0_GISR_DSR_RDY_SHIFT              18u
#define PSI5_CH0_GISR_DSR_RDY_WIDTH              1u
#define PSI5_CH0_GISR_DSR_RDY(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_DSR_RDY_SHIFT))&PSI5_CH0_GISR_DSR_RDY_MASK)
#define PSI5_CH0_GISR_IS_PROW_MASK               0x80000u
#define PSI5_CH0_GISR_IS_PROW_SHIFT              19u
#define PSI5_CH0_GISR_IS_PROW_WIDTH              1u
#define PSI5_CH0_GISR_IS_PROW(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_PROW_SHIFT))&PSI5_CH0_GISR_IS_PROW_MASK)
#define PSI5_CH0_GISR_IS_BROW_MASK               0x100000u
#define PSI5_CH0_GISR_IS_BROW_SHIFT              20u
#define PSI5_CH0_GISR_IS_BROW_WIDTH              1u
#define PSI5_CH0_GISR_IS_BROW(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_BROW_SHIFT))&PSI5_CH0_GISR_IS_BROW_MASK)
#define PSI5_CH0_GISR_IS_DSROW_MASK              0x200000u
#define PSI5_CH0_GISR_IS_DSROW_SHIFT             21u
#define PSI5_CH0_GISR_IS_DSROW_WIDTH             1u
#define PSI5_CH0_GISR_IS_DSROW(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_DSROW_SHIFT))&PSI5_CH0_GISR_IS_DSROW_MASK)
#define PSI5_CH0_GISR_IS_DTS_MASK                0x400000u
#define PSI5_CH0_GISR_IS_DTS_SHIFT               22u
#define PSI5_CH0_GISR_IS_DTS_WIDTH               1u
#define PSI5_CH0_GISR_IS_DTS(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_DTS_SHIFT))&PSI5_CH0_GISR_IS_DTS_MASK)
#define PSI5_CH0_GISR_IS_STS_MASK                0x800000u
#define PSI5_CH0_GISR_IS_STS_SHIFT               23u
#define PSI5_CH0_GISR_IS_STS_WIDTH               1u
#define PSI5_CH0_GISR_IS_STS(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_STS_SHIFT))&PSI5_CH0_GISR_IS_STS_MASK)
#define PSI5_CH0_GISR_IS_CESM_MASK               0x3F000000u
#define PSI5_CH0_GISR_IS_CESM_SHIFT              24u
#define PSI5_CH0_GISR_IS_CESM_WIDTH              6u
#define PSI5_CH0_GISR_IS_CESM(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_CESM_SHIFT))&PSI5_CH0_GISR_IS_CESM_MASK)
#define PSI5_CH0_GISR_IS_DB_FR_MASK              0x80000000u
#define PSI5_CH0_GISR_IS_DB_FR_SHIFT             31u
#define PSI5_CH0_GISR_IS_DB_FR_WIDTH             1u
#define PSI5_CH0_GISR_IS_DB_FR(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_GISR_IS_DB_FR_SHIFT))&PSI5_CH0_GISR_IS_DB_FR_MASK)
/* CH0_DPMR Bit Fields */
#define PSI5_CH0_DPMR_PSI5_RXDATA_MASK           0xFFFFFFFFu
#define PSI5_CH0_DPMR_PSI5_RXDATA_SHIFT          0u
#define PSI5_CH0_DPMR_PSI5_RXDATA_WIDTH          32u
#define PSI5_CH0_DPMR_PSI5_RXDATA(x)             (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DPMR_PSI5_RXDATA_SHIFT))&PSI5_CH0_DPMR_PSI5_RXDATA_MASK)
/* CH0_DSFR Bit Fields */
#define PSI5_CH0_DSFR_SMC_RXDATA_MASK            0xFFFFFFFFu
#define PSI5_CH0_DSFR_SMC_RXDATA_SHIFT           0u
#define PSI5_CH0_DSFR_SMC_RXDATA_WIDTH           32u
#define PSI5_CH0_DSFR_SMC_RXDATA(x)              (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSFR_SMC_RXDATA_SHIFT))&PSI5_CH0_DSFR_SMC_RXDATA_MASK)
/* CH0_DDSR Bit Fields */
#define PSI5_CH0_DDSR_DDS_MASK                   0xFFFFFFFFu
#define PSI5_CH0_DDSR_DDS_SHIFT                  0u
#define PSI5_CH0_DDSR_DDS_WIDTH                  32u
#define PSI5_CH0_DDSR_DDS(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DDSR_DDS_SHIFT))&PSI5_CH0_DDSR_DDS_MASK)
/* CH0_PMRRL Bit Fields */
#define PSI5_CH0_PMRRL_C_MASK                    0x1u
#define PSI5_CH0_PMRRL_C_SHIFT                   0u
#define PSI5_CH0_PMRRL_C_WIDTH                   1u
#define PSI5_CH0_PMRRL_C(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRL_C_SHIFT))&PSI5_CH0_PMRRL_C_MASK)
#define PSI5_CH0_PMRRL_CRC_MASK                  0xEu
#define PSI5_CH0_PMRRL_CRC_SHIFT                 1u
#define PSI5_CH0_PMRRL_CRC_WIDTH                 3u
#define PSI5_CH0_PMRRL_CRC(x)                    (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRL_CRC_SHIFT))&PSI5_CH0_PMRRL_CRC_MASK)
#define PSI5_CH0_PMRRL_DATA_REGION_MASK          0xFFFFFFF0u
#define PSI5_CH0_PMRRL_DATA_REGION_SHIFT         4u
#define PSI5_CH0_PMRRL_DATA_REGION_WIDTH         28u
#define PSI5_CH0_PMRRL_DATA_REGION(x)            (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRL_DATA_REGION_SHIFT))&PSI5_CH0_PMRRL_DATA_REGION_MASK)
/* CH0_PMRRH Bit Fields */
#define PSI5_CH0_PMRRH_TimeStampValue_MASK       0xFFFFFFu
#define PSI5_CH0_PMRRH_TimeStampValue_SHIFT      0u
#define PSI5_CH0_PMRRH_TimeStampValue_WIDTH      24u
#define PSI5_CH0_PMRRH_TimeStampValue(x)         (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRH_TimeStampValue_SHIFT))&PSI5_CH0_PMRRH_TimeStampValue_MASK)
#define PSI5_CH0_PMRRH_SlotCounter_MASK          0x7000000u
#define PSI5_CH0_PMRRH_SlotCounter_SHIFT         24u
#define PSI5_CH0_PMRRH_SlotCounter_WIDTH         3u
#define PSI5_CH0_PMRRH_SlotCounter(x)            (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRH_SlotCounter_SHIFT))&PSI5_CH0_PMRRH_SlotCounter_MASK)
#define PSI5_CH0_PMRRH_T_MASK                    0x8000000u
#define PSI5_CH0_PMRRH_T_SHIFT                   27u
#define PSI5_CH0_PMRRH_T_WIDTH                   1u
#define PSI5_CH0_PMRRH_T(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRH_T_SHIFT))&PSI5_CH0_PMRRH_T_MASK)
#define PSI5_CH0_PMRRH_E_MASK                    0x10000000u
#define PSI5_CH0_PMRRH_E_SHIFT                   28u
#define PSI5_CH0_PMRRH_E_WIDTH                   1u
#define PSI5_CH0_PMRRH_E(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRH_E_SHIFT))&PSI5_CH0_PMRRH_E_MASK)
#define PSI5_CH0_PMRRH_EM_MASK                   0x20000000u
#define PSI5_CH0_PMRRH_EM_SHIFT                  29u
#define PSI5_CH0_PMRRH_EM_WIDTH                  1u
#define PSI5_CH0_PMRRH_EM(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRH_EM_SHIFT))&PSI5_CH0_PMRRH_EM_MASK)
#define PSI5_CH0_PMRRH_F_MASK                    0x40000000u
#define PSI5_CH0_PMRRH_F_SHIFT                   30u
#define PSI5_CH0_PMRRH_F_WIDTH                   1u
#define PSI5_CH0_PMRRH_F(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRRH_F_SHIFT))&PSI5_CH0_PMRRH_F_MASK)
/* CH0_PMRL Bit Fields */
#define PSI5_CH0_PMRL_C_MASK                     0x1u
#define PSI5_CH0_PMRL_C_SHIFT                    0u
#define PSI5_CH0_PMRL_C_WIDTH                    1u
#define PSI5_CH0_PMRL_C(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRL_C_SHIFT))&PSI5_CH0_PMRL_C_MASK)
#define PSI5_CH0_PMRL_CRCP_MASK                  0xEu
#define PSI5_CH0_PMRL_CRCP_SHIFT                 1u
#define PSI5_CH0_PMRL_CRCP_WIDTH                 3u
#define PSI5_CH0_PMRL_CRCP(x)                    (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRL_CRCP_SHIFT))&PSI5_CH0_PMRL_CRCP_MASK)
#define PSI5_CH0_PMRL_DATA_REGION_MASK           0xFFFFFFF0u
#define PSI5_CH0_PMRL_DATA_REGION_SHIFT          4u
#define PSI5_CH0_PMRL_DATA_REGION_WIDTH          28u
#define PSI5_CH0_PMRL_DATA_REGION(x)             (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRL_DATA_REGION_SHIFT))&PSI5_CH0_PMRL_DATA_REGION_MASK)
/* CH0_PMRH Bit Fields */
#define PSI5_CH0_PMRH_TimeStampValue_MASK        0xFFFFFFu
#define PSI5_CH0_PMRH_TimeStampValue_SHIFT       0u
#define PSI5_CH0_PMRH_TimeStampValue_WIDTH       24u
#define PSI5_CH0_PMRH_TimeStampValue(x)          (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_TimeStampValue_SHIFT))&PSI5_CH0_PMRH_TimeStampValue_MASK)
#define PSI5_CH0_PMRH_Slot_Counter_MASK          0x7000000u
#define PSI5_CH0_PMRH_Slot_Counter_SHIFT         24u
#define PSI5_CH0_PMRH_Slot_Counter_WIDTH         3u
#define PSI5_CH0_PMRH_Slot_Counter(x)            (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_Slot_Counter_SHIFT))&PSI5_CH0_PMRH_Slot_Counter_MASK)
#define PSI5_CH0_PMRH_T_MASK                     0x8000000u
#define PSI5_CH0_PMRH_T_SHIFT                    27u
#define PSI5_CH0_PMRH_T_WIDTH                    1u
#define PSI5_CH0_PMRH_T(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_T_SHIFT))&PSI5_CH0_PMRH_T_MASK)
#define PSI5_CH0_PMRH_E_MASK                     0x10000000u
#define PSI5_CH0_PMRH_E_SHIFT                    28u
#define PSI5_CH0_PMRH_E_WIDTH                    1u
#define PSI5_CH0_PMRH_E(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_E_SHIFT))&PSI5_CH0_PMRH_E_MASK)
#define PSI5_CH0_PMRH_EM_MASK                    0x20000000u
#define PSI5_CH0_PMRH_EM_SHIFT                   29u
#define PSI5_CH0_PMRH_EM_WIDTH                   1u
#define PSI5_CH0_PMRH_EM(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_EM_SHIFT))&PSI5_CH0_PMRH_EM_MASK)
#define PSI5_CH0_PMRH_F_MASK                     0x40000000u
#define PSI5_CH0_PMRH_F_SHIFT                    30u
#define PSI5_CH0_PMRH_F_WIDTH                    1u
#define PSI5_CH0_PMRH_F(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_F_SHIFT))&PSI5_CH0_PMRH_F_MASK)
#define PSI5_CH0_PMRH_O_MASK                     0x80000000u
#define PSI5_CH0_PMRH_O_SHIFT                    31u
#define PSI5_CH0_PMRH_O_WIDTH                    1u
