neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define PSI5_CH0_PMRH_O(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_PMRH_O_SHIFT))&PSI5_CH0_PMRH_O_MASK)
/* CH0_SFR Bit Fields */
#define PSI5_CH0_SFR_DATA_MASK                   0xFFFu
#define PSI5_CH0_SFR_DATA_SHIFT                  0u
#define PSI5_CH0_SFR_DATA_WIDTH                  12u
#define PSI5_CH0_SFR_DATA(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_DATA_SHIFT))&PSI5_CH0_SFR_DATA_MASK)
#define PSI5_CH0_SFR_IDDATA_MASK                 0xF000u
#define PSI5_CH0_SFR_IDDATA_SHIFT                12u
#define PSI5_CH0_SFR_IDDATA_WIDTH                4u
#define PSI5_CH0_SFR_IDDATA(x)                   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_IDDATA_SHIFT))&PSI5_CH0_SFR_IDDATA_MASK)
#define PSI5_CH0_SFR_ID_MASK                     0xF0000u
#define PSI5_CH0_SFR_ID_SHIFT                    16u
#define PSI5_CH0_SFR_ID_WIDTH                    4u
#define PSI5_CH0_SFR_ID(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_ID_SHIFT))&PSI5_CH0_SFR_ID_MASK)
#define PSI5_CH0_SFR_C_MASK                      0x100000u
#define PSI5_CH0_SFR_C_SHIFT                     20u
#define PSI5_CH0_SFR_C_WIDTH                     1u
#define PSI5_CH0_SFR_C(x)                        (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_C_SHIFT))&PSI5_CH0_SFR_C_MASK)
#define PSI5_CH0_SFR_CRC_MASK                    0x7E00000u
#define PSI5_CH0_SFR_CRC_SHIFT                   21u
#define PSI5_CH0_SFR_CRC_WIDTH                   6u
#define PSI5_CH0_SFR_CRC(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_CRC_SHIFT))&PSI5_CH0_SFR_CRC_MASK)
#define PSI5_CH0_SFR_OW_MASK                     0x8000000u
#define PSI5_CH0_SFR_OW_SHIFT                    27u
#define PSI5_CH0_SFR_OW_WIDTH                    1u
#define PSI5_CH0_SFR_OW(x)                       (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_OW_SHIFT))&PSI5_CH0_SFR_OW_MASK)
#define PSI5_CH0_SFR_CER_MASK                    0x10000000u
#define PSI5_CH0_SFR_CER_SHIFT                   28u
#define PSI5_CH0_SFR_CER_WIDTH                   1u
#define PSI5_CH0_SFR_CER(x)                      (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_CER_SHIFT))&PSI5_CH0_SFR_CER_MASK)
#define PSI5_CH0_SFR_SLOT_NO_MASK                0xE0000000u
#define PSI5_CH0_SFR_SLOT_NO_SHIFT               29u
#define PSI5_CH0_SFR_SLOT_NO_WIDTH               3u
#define PSI5_CH0_SFR_SLOT_NO(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFR_SLOT_NO_SHIFT))&PSI5_CH0_SFR_SLOT_NO_MASK)
/* CH0_NDSR Bit Fields */
#define PSI5_CH0_NDSR_NDS_MASK                   0xFFFFFFFFu
#define PSI5_CH0_NDSR_NDS_SHIFT                  0u
#define PSI5_CH0_NDSR_NDS_WIDTH                  32u
#define PSI5_CH0_NDSR_NDS(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_NDSR_NDS_SHIFT))&PSI5_CH0_NDSR_NDS_MASK)
/* CH0_OWSR Bit Fields */
#define PSI5_CH0_OWSR_OWS_MASK                   0xFFFFFFFFu
#define PSI5_CH0_OWSR_OWS_SHIFT                  0u
#define PSI5_CH0_OWSR_OWS_WIDTH                  32u
#define PSI5_CH0_OWSR_OWS(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_OWSR_OWS_SHIFT))&PSI5_CH0_OWSR_OWS_MASK)
/* CH0_EISR Bit Fields */
#define PSI5_CH0_EISR_ERROR_MASK                 0xFFFFFFFFu
#define PSI5_CH0_EISR_ERROR_SHIFT                0u
#define PSI5_CH0_EISR_ERROR_WIDTH                32u
#define PSI5_CH0_EISR_ERROR(x)                   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_EISR_ERROR_SHIFT))&PSI5_CH0_EISR_ERROR_MASK)
/* CH0_SNDSR Bit Fields */
#define PSI5_CH0_SNDSR_SNDS_MASK                 0xFFFFFFFFu
#define PSI5_CH0_SNDSR_SNDS_SHIFT                0u
#define PSI5_CH0_SNDSR_SNDS_WIDTH                32u
#define PSI5_CH0_SNDSR_SNDS(x)                   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SNDSR_SNDS_SHIFT))&PSI5_CH0_SNDSR_SNDS_MASK)
/* CH0_SOWSR Bit Fields */
#define PSI5_CH0_SOWSR_SOWS_MASK                 0xFFFFFFFFu
#define PSI5_CH0_SOWSR_SOWS_SHIFT                0u
#define PSI5_CH0_SOWSR_SOWS_WIDTH                32u
#define PSI5_CH0_SOWSR_SOWS(x)                   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SOWSR_SOWS_SHIFT))&PSI5_CH0_SOWSR_SOWS_MASK)
/* CH0_SEISR Bit Fields */
#define PSI5_CH0_SEISR_SERROR_MASK               0xFFFFFFFFu
#define PSI5_CH0_SEISR_SERROR_SHIFT              0u
#define PSI5_CH0_SEISR_SERROR_WIDTH              32u
#define PSI5_CH0_SEISR_SERROR(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SEISR_SERROR_SHIFT))&PSI5_CH0_SEISR_SERROR_MASK)
/* CH0_SSESR Bit Fields */
#define PSI5_CH0_SSESR_SNVSM_MASK                0x3Fu
#define PSI5_CH0_SSESR_SNVSM_SHIFT               0u
#define PSI5_CH0_SSESR_SNVSM_WIDTH               6u
#define PSI5_CH0_SSESR_SNVSM(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SSESR_SNVSM_SHIFT))&PSI5_CH0_SSESR_SNVSM_MASK)
#define PSI5_CH0_SSESR_SOWSM_MASK                0x3F00u
#define PSI5_CH0_SSESR_SOWSM_SHIFT               8u
#define PSI5_CH0_SSESR_SOWSM_WIDTH               6u
#define PSI5_CH0_SSESR_SOWSM(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SSESR_SOWSM_SHIFT))&PSI5_CH0_SSESR_SOWSM_MASK)
#define PSI5_CH0_SSESR_SCESM_MASK                0x3F000000u
#define PSI5_CH0_SSESR_SCESM_SHIFT               24u
#define PSI5_CH0_SSESR_SCESM_WIDTH               6u
#define PSI5_CH0_SSESR_SCESM(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SSESR_SCESM_SHIFT))&PSI5_CH0_SSESR_SCESM_MASK)
/* CH0_STSRR Bit Fields */
#define PSI5_CH0_STSRR_STSV_MASK                 0xFFFFFFu
#define PSI5_CH0_STSRR_STSV_SHIFT                0u
#define PSI5_CH0_STSRR_STSV_WIDTH                24u
#define PSI5_CH0_STSRR_STSV(x)                   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_STSRR_STSV_SHIFT))&PSI5_CH0_STSRR_STSV_MASK)
/* CH0_DTSRR Bit Fields */
#define PSI5_CH0_DTSRR_DTSV_MASK                 0xFFFFFFu
#define PSI5_CH0_DTSRR_DTSV_SHIFT                0u
#define PSI5_CH0_DTSRR_DTSV_WIDTH                24u
#define PSI5_CH0_DTSRR_DTSV(x)                   (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DTSRR_DTSV_SHIFT))&PSI5_CH0_DTSRR_DTSV_MASK)
#define PSI5_CH0_DTSRR_SLOT_COUNTER_MASK         0x7000000u
#define PSI5_CH0_DTSRR_SLOT_COUNTER_SHIFT        24u
#define PSI5_CH0_DTSRR_SLOT_COUNTER_WIDTH        3u
#define PSI5_CH0_DTSRR_SLOT_COUNTER(x)           (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DTSRR_SLOT_COUNTER_SHIFT))&PSI5_CH0_DTSRR_SLOT_COUNTER_MASK)
/* CH0_SFCR Bit Fields */
#define PSI5_CH0_SFCR_CRCP_MASK                  0x1u
#define PSI5_CH0_SFCR_CRCP_SHIFT                 0u
#define PSI5_CH0_SFCR_CRCP_WIDTH                 1u
#define PSI5_CH0_SFCR_CRCP(x)                    (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFCR_CRCP_SHIFT))&PSI5_CH0_SFCR_CRCP_MASK)
#define PSI5_CH0_SFCR_DRL_MASK                   0x3Eu
#define PSI5_CH0_SFCR_DRL_SHIFT                  1u
#define PSI5_CH0_SFCR_DRL_WIDTH                  5u
#define PSI5_CH0_SFCR_DRL(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFCR_DRL_SHIFT))&PSI5_CH0_SFCR_DRL_MASK)
#define PSI5_CH0_SFCR_SMCL_MASK                  0x8000u
#define PSI5_CH0_SFCR_SMCL_SHIFT                 15u
#define PSI5_CH0_SFCR_SMCL_WIDTH                 1u
#define PSI5_CH0_SFCR_SMCL(x)                    (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFCR_SMCL_SHIFT))&PSI5_CH0_SFCR_SMCL_MASK)
#define PSI5_CH0_SFCR_TS_CAPT_MASK               0x20000u
#define PSI5_CH0_SFCR_TS_CAPT_SHIFT              17u
#define PSI5_CH0_SFCR_TS_CAPT_WIDTH              1u
#define PSI5_CH0_SFCR_TS_CAPT(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFCR_TS_CAPT_SHIFT))&PSI5_CH0_SFCR_TS_CAPT_MASK)
#define PSI5_CH0_SFCR_SLOT_EN_MASK               0x40000u
#define PSI5_CH0_SFCR_SLOT_EN_SHIFT              18u
#define PSI5_CH0_SFCR_SLOT_EN_WIDTH              1u
#define PSI5_CH0_SFCR_SLOT_EN(x)                 (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SFCR_SLOT_EN_SHIFT))&PSI5_CH0_SFCR_SLOT_EN_MASK)
/* CH0_S1SBR Bit Fields */
#define PSI5_CH0_S1SBR_S1SBT_MASK                0x7FFFu
#define PSI5_CH0_S1SBR_S1SBT_SHIFT               0u
#define PSI5_CH0_S1SBR_S1SBT_WIDTH               15u
#define PSI5_CH0_S1SBR_S1SBT(x)                  (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_S1SBR_S1SBT_SHIFT))&PSI5_CH0_S1SBR_S1SBT_MASK)
/* CH0_S2SBR Bit Fields */
#define PSI5_CH0_S2SBR_S2SBT_MASK                0x7FFFu
#define PSI5_CH0_S2SBR_S2SBT_SHIFT               0u
#define PSI5_CH0_S2SBR_S2SBT_WIDTH               15u
#define PSI5_CH0_S2SBR_S2SBT(x)                  (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_S2SBR_S2SBT_SHIFT))&PSI5_CH0_S2SBR_S2SBT_MASK)
/* CH0_S3SBR Bit Fields */
#define PSI5_CH0_S3SBR_S3SBT_MASK                0x7FFFu
#define PSI5_CH0_S3SBR_S3SBT_SHIFT               0u
#define PSI5_CH0_S3SBR_S3SBT_WIDTH               15u
#define PSI5_CH0_S3SBR_S3SBT(x)                  (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_S3SBR_S3SBT_SHIFT))&PSI5_CH0_S3SBR_S3SBT_MASK)
/* CH0_S4SBR Bit Fields */
#define PSI5_CH0_S4SBR_S4SBT_MASK                0x7FFFu
#define PSI5_CH0_S4SBR_S4SBT_SHIFT               0u
#define PSI5_CH0_S4SBR_S4SBT_WIDTH               15u
#define PSI5_CH0_S4SBR_S4SBT(x)                  (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_S4SBR_S4SBT_SHIFT))&PSI5_CH0_S4SBR_S4SBT_MASK)
/* CH0_S5SBR Bit Fields */
#define PSI5_CH0_S5SBR_S5SBT_MASK                0x7FFFu
#define PSI5_CH0_S5SBR_S5SBT_SHIFT               0u
#define PSI5_CH0_S5SBR_S5SBT_WIDTH               15u
#define PSI5_CH0_S5SBR_S5SBT(x)                  (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_S5SBR_S5SBT_SHIFT))&PSI5_CH0_S5SBR_S5SBT_MASK)
/* CH0_S6SBR Bit Fields */
#define PSI5_CH0_S6SBR_S6SBT_MASK                0x7FFFu
#define PSI5_CH0_S6SBR_S6SBT_SHIFT               0u
#define PSI5_CH0_S6SBR_S6SBT_WIDTH               15u
#define PSI5_CH0_S6SBR_S6SBT(x)                  (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_S6SBR_S6SBT_SHIFT))&PSI5_CH0_S6SBR_S6SBT_MASK)
/* CH0_SnEBR Bit Fields */
#define PSI5_CH0_SnEBR_SnEBT_MASK                0x7FFFu
#define PSI5_CH0_SnEBR_SnEBT_SHIFT               0u
#define PSI5_CH0_SnEBR_SnEBT_WIDTH               15u
#define PSI5_CH0_SnEBR_SnEBT(x)                  (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SnEBR_SnEBT_SHIFT))&PSI5_CH0_SnEBR_SnEBT_MASK)
#define PSI5_CH0_SnEBR_SLOT_NO_MASK              0x70000u
#define PSI5_CH0_SnEBR_SLOT_NO_SHIFT             16u
#define PSI5_CH0_SnEBR_SLOT_NO_WIDTH             3u
#define PSI5_CH0_SnEBR_SLOT_NO(x)                (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_SnEBR_SLOT_NO_SHIFT))&PSI5_CH0_SnEBR_SLOT_NO_MASK)
/* CH0_DOBCR Bit Fields */
#define PSI5_CH0_DOBCR_SW_READY_MASK             0x1u
#define PSI5_CH0_DOBCR_SW_READY_SHIFT            0u
#define PSI5_CH0_DOBCR_SW_READY_WIDTH            1u
#define PSI5_CH0_DOBCR_SW_READY(x)               (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_SW_READY_SHIFT))&PSI5_CH0_DOBCR_SW_READY_MASK)
#define PSI5_CH0_DOBCR_OP_SEL_MASK               0x2u
#define PSI5_CH0_DOBCR_OP_SEL_SHIFT              1u
#define PSI5_CH0_DOBCR_OP_SEL_WIDTH              1u
#define PSI5_CH0_DOBCR_OP_SEL(x)                 (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_OP_SEL_SHIFT))&PSI5_CH0_DOBCR_OP_SEL_MASK)
#define PSI5_CH0_DOBCR_SP_PULSE_SEL_MASK         0x4u
#define PSI5_CH0_DOBCR_SP_PULSE_SEL_SHIFT        2u
#define PSI5_CH0_DOBCR_SP_PULSE_SEL_WIDTH        1u
#define PSI5_CH0_DOBCR_SP_PULSE_SEL(x)           (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_SP_PULSE_SEL_SHIFT))&PSI5_CH0_DOBCR_SP_PULSE_SEL_MASK)
#define PSI5_CH0_DOBCR_GTM_TRIG_SEL_MASK         0x8u
#define PSI5_CH0_DOBCR_GTM_TRIG_SEL_SHIFT        3u
#define PSI5_CH0_DOBCR_GTM_TRIG_SEL_WIDTH        1u
#define PSI5_CH0_DOBCR_GTM_TRIG_SEL(x)           (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_GTM_TRIG_SEL_SHIFT))&PSI5_CH0_DOBCR_GTM_TRIG_SEL_MASK)
#define PSI5_CH0_DOBCR_DEFAULT_SYNC_MASK         0x10u
#define PSI5_CH0_DOBCR_DEFAULT_SYNC_SHIFT        4u
#define PSI5_CH0_DOBCR_DEFAULT_SYNC_WIDTH        1u
#define PSI5_CH0_DOBCR_DEFAULT_SYNC(x)           (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_DEFAULT_SYNC_SHIFT))&PSI5_CH0_DOBCR_DEFAULT_SYNC_MASK)
#define PSI5_CH0_DOBCR_CMD_TYPE_MASK             0xE0u
#define PSI5_CH0_DOBCR_CMD_TYPE_SHIFT            5u
#define PSI5_CH0_DOBCR_CMD_TYPE_WIDTH            3u
#define PSI5_CH0_DOBCR_CMD_TYPE(x)               (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_CMD_TYPE_SHIFT))&PSI5_CH0_DOBCR_CMD_TYPE_MASK)
#define PSI5_CH0_DOBCR_DSR_RST_MASK              0x100u
#define PSI5_CH0_DOBCR_DSR_RST_SHIFT             8u
#define PSI5_CH0_DOBCR_DSR_RST_WIDTH             1u
#define PSI5_CH0_DOBCR_DSR_RST(x)                (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_DSR_RST_SHIFT))&PSI5_CH0_DOBCR_DSR_RST_MASK)
#define PSI5_CH0_DOBCR_DBR_RST_MASK              0x200u
#define PSI5_CH0_DOBCR_DBR_RST_SHIFT             9u
#define PSI5_CH0_DOBCR_DBR_RST_WIDTH             1u
#define PSI5_CH0_DOBCR_DBR_RST(x)                (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_DBR_RST_SHIFT))&PSI5_CH0_DOBCR_DBR_RST_MASK)
#define PSI5_CH0_DOBCR_DATA_LENGTH_MASK          0xFC00u
#define PSI5_CH0_DOBCR_DATA_LENGTH_SHIFT         10u
#define PSI5_CH0_DOBCR_DATA_LENGTH_WIDTH         6u
#define PSI5_CH0_DOBCR_DATA_LENGTH(x)            (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_DOBCR_DATA_LENGTH_SHIFT))&PSI5_CH0_DOBCR_DATA_LENGTH_MASK)
/* CH0_MDDIS_OFF Bit Fields */
#define PSI5_CH0_MDDIS_OFF_MDDIS_OFF_MASK        0x7Fu
#define PSI5_CH0_MDDIS_OFF_MDDIS_OFF_SHIFT       0u
#define PSI5_CH0_MDDIS_OFF_MDDIS_OFF_WIDTH       7u
#define PSI5_CH0_MDDIS_OFF_MDDIS_OFF(x)          (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_MDDIS_OFF_MDDIS_OFF_SHIFT))&PSI5_CH0_MDDIS_OFF_MDDIS_OFF_MASK)
/* CH0_PW0D Bit Fields */
#define PSI5_CH0_PW0D_Pulse_Width0_MASK          0x7Fu
#define PSI5_CH0_PW0D_Pulse_Width0_SHIFT         0u
#define PSI5_CH0_PW0D_Pulse_Width0_WIDTH         7u
#define PSI5_CH0_PW0D_Pulse_Width0(x)            (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_PW0D_Pulse_Width0_SHIFT))&PSI5_CH0_PW0D_Pulse_Width0_MASK)
/* CH0_PW1D Bit Fields */
#define PSI5_CH0_PW1D_Pulse_Width1_MASK          0x7Fu
#define PSI5_CH0_PW1D_Pulse_Width1_SHIFT         0u
#define PSI5_CH0_PW1D_Pulse_Width1_WIDTH         7u
#define PSI5_CH0_PW1D_Pulse_Width1(x)            (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_PW1D_Pulse_Width1_SHIFT))&PSI5_CH0_PW1D_Pulse_Width1_MASK)
/* CH0_CTPR Bit Fields */
#define PSI5_CH0_CTPR_CTPR_MASK                  0xFFFFu
#define PSI5_CH0_CTPR_CTPR_SHIFT                 0u
#define PSI5_CH0_CTPR_CTPR_WIDTH                 16u
#define PSI5_CH0_CTPR_CTPR(x)                    (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_CTPR_CTPR_SHIFT))&PSI5_CH0_CTPR_CTPR_MASK)
/* CH0_CIPR Bit Fields */
#define PSI5_CH0_CIPR_CIPR_MASK                  0xFFFFu
#define PSI5_CH0_CIPR_CIPR_SHIFT                 0u
#define PSI5_CH0_CIPR_CIPR_WIDTH                 16u
#define PSI5_CH0_CIPR_CIPR(x)                    (((uint16_t)(((uint16_t)(x))<<PSI5_CH0_CIPR_CIPR_SHIFT))&PSI5_CH0_CIPR_CIPR_MASK)
/* CH0_DPRL Bit Fields */
#define PSI5_CH0_DPRL_DPR_MASK                   0xFFFFFFu
#define PSI5_CH0_DPRL_DPR_SHIFT                  0u
#define PSI5_CH0_DPRL_DPR_WIDTH                  24u
#define PSI5_CH0_DPRL_DPR(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DPRL_DPR_SHIFT))&PSI5_CH0_DPRL_DPR_MASK)
/* CH0_DBRL Bit Fields */
#define PSI5_CH0_DBRL_DBR_MASK                   0xFFFFFFFFu
#define PSI5_CH0_DBRL_DBR_SHIFT                  0u
#define PSI5_CH0_DBRL_DBR_WIDTH                  32u
#define PSI5_CH0_DBRL_DBR(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DBRL_DBR_SHIFT))&PSI5_CH0_DBRL_DBR_MASK)
/* CH0_DBRH Bit Fields */
#define PSI5_CH0_DBRH_DBR_MASK                   0xFFFFFFFFu
#define PSI5_CH0_DBRH_DBR_SHIFT                  0u
#define PSI5_CH0_DBRH_DBR_WIDTH                  32u
#define PSI5_CH0_DBRH_DBR(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DBRH_DBR_SHIFT))&PSI5_CH0_DBRH_DBR_MASK)
/* CH0_DSRL Bit Fields */
#define PSI5_CH0_DSRL_DSR_MASK                   0xFFFFFFFFu
#define PSI5_CH0_DSRL_DSR_SHIFT                  0u
#define PSI5_CH0_DSRL_DSR_WIDTH                  32u
#define PSI5_CH0_DSRL_DSR(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSRL_DSR_SHIFT))&PSI5_CH0_DSRL_DSR_MASK)
/* CH0_DSRH Bit Fields */
#define PSI5_CH0_DSRH_DSR_MASK                   0xFFFFFFFFu
#define PSI5_CH0_DSRH_DSR_SHIFT                  0u
#define PSI5_CH0_DSRH_DSR_WIDTH                  32u
#define PSI5_CH0_DSRH_DSR(x)                     (((uint32_t)(((uint32_t)(x))<<PSI5_CH0_DSRH_DSR_SHIFT))&PSI5_CH0_DSRH_DSR_MASK)

/*!
 * @}
 */ /* end of group PSI5_Register_Masks */


/*!
 * @}
 */ /* end of group PSI5_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- REACM2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup REACM2_Peripheral_Access_Layer REACM2 Peripheral Access Layer
 * @{
 */


/** REACM2 - Size of Registers Arrays */
#define REACM2_CHxR_COUNT                        10u
#define REACM2_STBK_COUNT                        5u
#define REACM2_HOTBK_COUNT                       5u
#define REACM2_THBK_COUNT                        32u
#define REACM2_MWBK_COUNT                        32u

