neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** REACM2 - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  __IO uint32_t TCR;                               /**< Timer Configuration, offset: 0x4 */
  __IO uint32_t THRR;                              /**< Threshold Router Register, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t SINR;                              /**< ADC Sensor Input Register, offset: 0x10 */
  __IO uint32_t PCR;                               /**< Period Generator Configuration Register, offset: 0x14 */
  __IO uint32_t PSCR;                              /**< Period Shift Delay Configuration Register, offset: 0x18 */
       uint8_t RESERVED_1[4];
  __I  uint32_t GEFR;                              /**< Global Error Flag Register, offset: 0x20 */
       uint8_t RESERVED_2[220];
  struct {                                         /* offset: 0x100, array step: 0x10 */
    __IO uint32_t CHCR;                              /**< Channel n Configuration Register, array offset: 0x100, array step: 0x10 */
    __IO uint32_t CHSR;                              /**< Channel n Status Register, array offset: 0x104, array step: 0x10 */
    __IO uint32_t CHRR;                              /**< Channel n Router Register, array offset: 0x108, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } CHxR[REACM2_CHxR_COUNT];
       uint8_t RESERVED_3[352];
  __IO uint32_t STBK[REACM2_STBK_COUNT];           /**< Shared Timer Bank, array offset: 0x300, array step: 0x4 */
       uint8_t RESERVED_4[108];
  __IO uint32_t HOTBK[REACM2_HOTBK_COUNT];         /**< Hold Timer Bank, array offset: 0x380, array step: 0x4 */
       uint8_t RESERVED_5[108];
  __IO uint32_t THBK[REACM2_THBK_COUNT];           /**< Threshold Bank, array offset: 0x400, array step: 0x4 */
       uint8_t RESERVED_6[384];
  __IO uint32_t ADCMAX;                            /**< ADC Result Maximum Limit Check, offset: 0x600 */
       uint8_t RESERVED_7[124];
  __IO uint32_t RANGE_PWD;                         /**< Modulation Range Pulse Width, offset: 0x680 */
       uint8_t RESERVED_8[60];
  __IO uint32_t MIN_PWD;                           /**< Modulation Minimum Pulse Width, offset: 0x6C0 */
       uint8_t RESERVED_9[60];
  __IO uint32_t MWBK[REACM2_MWBK_COUNT];           /**< Modulation Control Word Bank, array offset: 0x700, array step: 0x4 */
} REACM2_Type, *REACM2_MemMapPtr;

 /** Number of instances of the REACM2 module. */
#define REACM2_INSTANCE_COUNT                    (1u)


/* REACM2 - Peripheral instance base addresses */
/** Peripheral REACM2 base address */
#define REACM2_BASE                              (0xFFE04000u)
/** Peripheral REACM2 base pointer */
#define REACM2                                   ((REACM2_Type *)REACM2_BASE)
/** Array initializer of REACM2 peripheral base addresses */
#define REACM2_BASE_ADDRS                        { REACM2_BASE }
/** Array initializer of REACM2 peripheral base pointers */
#define REACM2_BASE_PTRS                         { REACM2 }

/* ----------------------------------------------------------------------------
   -- REACM2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup REACM2_Register_Masks REACM2 Register Masks
 * @{
 */

/* MCR Bit Fields */
#define REACM2_MCR_OVREN_MASK                    0x800000u
#define REACM2_MCR_OVREN_SHIFT                   23u
#define REACM2_MCR_OVREN_WIDTH                   1u
#define REACM2_MCR_OVREN(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_OVREN_SHIFT))&REACM2_MCR_OVREN_MASK)
#define REACM2_MCR_GIEN_MASK                     0x1000000u
#define REACM2_MCR_GIEN_SHIFT                    24u
#define REACM2_MCR_GIEN_WIDTH                    1u
#define REACM2_MCR_GIEN(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_GIEN_SHIFT))&REACM2_MCR_GIEN_MASK)
#define REACM2_MCR_HPREN_MASK                    0x2000000u
#define REACM2_MCR_HPREN_SHIFT                   25u
#define REACM2_MCR_HPREN_WIDTH                   1u
#define REACM2_MCR_HPREN(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_HPREN_SHIFT))&REACM2_MCR_HPREN_MASK)
#define REACM2_MCR_TPREN_MASK                    0x4000000u
#define REACM2_MCR_TPREN_SHIFT                   26u
#define REACM2_MCR_TPREN_WIDTH                   1u
#define REACM2_MCR_TPREN(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_TPREN_SHIFT))&REACM2_MCR_TPREN_MASK)
#define REACM2_MCR_FREN_MASK                     0x8000000u
#define REACM2_MCR_FREN_SHIFT                    27u
#define REACM2_MCR_FREN_WIDTH                    1u
#define REACM2_MCR_FREN(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_FREN_SHIFT))&REACM2_MCR_FREN_MASK)
#define REACM2_MCR_FRZ_MASK                      0x20000000u
#define REACM2_MCR_FRZ_SHIFT                     29u
#define REACM2_MCR_FRZ_WIDTH                     1u
#define REACM2_MCR_FRZ(x)                        (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_FRZ_SHIFT))&REACM2_MCR_FRZ_MASK)
#define REACM2_MCR_MDIS_MASK                     0x40000000u
#define REACM2_MCR_MDIS_SHIFT                    30u
#define REACM2_MCR_MDIS_WIDTH                    1u
#define REACM2_MCR_MDIS(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_MDIS_SHIFT))&REACM2_MCR_MDIS_MASK)
#define REACM2_MCR_OVRC_MASK                     0x80000000u
#define REACM2_MCR_OVRC_SHIFT                    31u
#define REACM2_MCR_OVRC_WIDTH                    1u
#define REACM2_MCR_OVRC(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_MCR_OVRC_SHIFT))&REACM2_MCR_OVRC_MASK)
/* TCR Bit Fields */
#define REACM2_TCR_TPRE_MASK                     0xFFu
#define REACM2_TCR_TPRE_SHIFT                    0u
#define REACM2_TCR_TPRE_WIDTH                    8u
#define REACM2_TCR_TPRE(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_TCR_TPRE_SHIFT))&REACM2_TCR_TPRE_MASK)
#define REACM2_TCR_HPRE_MASK                     0xFFF0000u
#define REACM2_TCR_HPRE_SHIFT                    16u
#define REACM2_TCR_HPRE_WIDTH                    12u
#define REACM2_TCR_HPRE(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_TCR_HPRE_SHIFT))&REACM2_TCR_HPRE_MASK)
/* THRR Bit Fields */
#define REACM2_THRR_THRADC0_MASK                 0xFu
#define REACM2_THRR_THRADC0_SHIFT                0u
#define REACM2_THRR_THRADC0_WIDTH                4u
#define REACM2_THRR_THRADC0(x)                   (((uint32_t)(((uint32_t)(x))<<REACM2_THRR_THRADC0_SHIFT))&REACM2_THRR_THRADC0_MASK)
#define REACM2_THRR_THRADC1_MASK                 0xF00u
#define REACM2_THRR_THRADC1_SHIFT                8u
#define REACM2_THRR_THRADC1_WIDTH                4u
#define REACM2_THRR_THRADC1(x)                   (((uint32_t)(((uint32_t)(x))<<REACM2_THRR_THRADC1_SHIFT))&REACM2_THRR_THRADC1_MASK)
#define REACM2_THRR_WREN0_MASK                   0x1000000u
#define REACM2_THRR_WREN0_SHIFT                  24u
#define REACM2_THRR_WREN0_WIDTH                  1u
#define REACM2_THRR_WREN0(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_THRR_WREN0_SHIFT))&REACM2_THRR_WREN0_MASK)
#define REACM2_THRR_WREN1_MASK                   0x2000000u
#define REACM2_THRR_WREN1_SHIFT                  25u
#define REACM2_THRR_WREN1_WIDTH                  1u
#define REACM2_THRR_WREN1(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_THRR_WREN1_SHIFT))&REACM2_THRR_WREN1_MASK)
/* SINR Bit Fields */
#define REACM2_SINR_ADC_RESULT_MASK              0xFFFFu
#define REACM2_SINR_ADC_RESULT_SHIFT             0u
#define REACM2_SINR_ADC_RESULT_WIDTH             16u
#define REACM2_SINR_ADC_RESULT(x)                (((uint32_t)(((uint32_t)(x))<<REACM2_SINR_ADC_RESULT_SHIFT))&REACM2_SINR_ADC_RESULT_MASK)
#define REACM2_SINR_ADC_TAG_MASK                 0xF0000u
#define REACM2_SINR_ADC_TAG_SHIFT                16u
#define REACM2_SINR_ADC_TAG_WIDTH                4u
#define REACM2_SINR_ADC_TAG(x)                   (((uint32_t)(((uint32_t)(x))<<REACM2_SINR_ADC_TAG_SHIFT))&REACM2_SINR_ADC_TAG_MASK)
/* PCR Bit Fields */
#define REACM2_PCR_PER_MASK                      0xFFFFu
#define REACM2_PCR_PER_SHIFT                     0u
#define REACM2_PCR_PER_WIDTH                     16u
#define REACM2_PCR_PER(x)                        (((uint32_t)(((uint32_t)(x))<<REACM2_PCR_PER_SHIFT))&REACM2_PCR_PER_MASK)
#define REACM2_PCR_PERPRESC_MASK                 0xFF0000u
#define REACM2_PCR_PERPRESC_SHIFT                16u
#define REACM2_PCR_PERPRESC_WIDTH                8u
#define REACM2_PCR_PERPRESC(x)                   (((uint32_t)(((uint32_t)(x))<<REACM2_PCR_PERPRESC_SHIFT))&REACM2_PCR_PERPRESC_MASK)
/* PSCR Bit Fields */
#define REACM2_PSCR_DLY_MASK                     0xFFFFu
#define REACM2_PSCR_DLY_SHIFT                    0u
#define REACM2_PSCR_DLY_WIDTH                    16u
#define REACM2_PSCR_DLY(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_PSCR_DLY_SHIFT))&REACM2_PSCR_DLY_MASK)
/* GEFR Bit Fields */
#define REACM2_GEFR_EF0_MASK                     0x1u
#define REACM2_GEFR_EF0_SHIFT                    0u
#define REACM2_GEFR_EF0_WIDTH                    1u
#define REACM2_GEFR_EF0(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF0_SHIFT))&REACM2_GEFR_EF0_MASK)
#define REACM2_GEFR_EF1_MASK                     0x2u
#define REACM2_GEFR_EF1_SHIFT                    1u
#define REACM2_GEFR_EF1_WIDTH                    1u
#define REACM2_GEFR_EF1(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF1_SHIFT))&REACM2_GEFR_EF1_MASK)
#define REACM2_GEFR_EF2_MASK                     0x4u
#define REACM2_GEFR_EF2_SHIFT                    2u
#define REACM2_GEFR_EF2_WIDTH                    1u
#define REACM2_GEFR_EF2(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF2_SHIFT))&REACM2_GEFR_EF2_MASK)
#define REACM2_GEFR_EF3_MASK                     0x8u
#define REACM2_GEFR_EF3_SHIFT                    3u
#define REACM2_GEFR_EF3_WIDTH                    1u
#define REACM2_GEFR_EF3(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF3_SHIFT))&REACM2_GEFR_EF3_MASK)
#define REACM2_GEFR_EF4_MASK                     0x10u
#define REACM2_GEFR_EF4_SHIFT                    4u
#define REACM2_GEFR_EF4_WIDTH                    1u
#define REACM2_GEFR_EF4(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF4_SHIFT))&REACM2_GEFR_EF4_MASK)
#define REACM2_GEFR_EF5_MASK                     0x20u
#define REACM2_GEFR_EF5_SHIFT                    5u
#define REACM2_GEFR_EF5_WIDTH                    1u
#define REACM2_GEFR_EF5(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF5_SHIFT))&REACM2_GEFR_EF5_MASK)
#define REACM2_GEFR_EF6_MASK                     0x40u
#define REACM2_GEFR_EF6_SHIFT                    6u
#define REACM2_GEFR_EF6_WIDTH                    1u
#define REACM2_GEFR_EF6(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF6_SHIFT))&REACM2_GEFR_EF6_MASK)
#define REACM2_GEFR_EF7_MASK                     0x80u
#define REACM2_GEFR_EF7_SHIFT                    7u
#define REACM2_GEFR_EF7_WIDTH                    1u
#define REACM2_GEFR_EF7(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF7_SHIFT))&REACM2_GEFR_EF7_MASK)
#define REACM2_GEFR_EF8_MASK                     0x100u
#define REACM2_GEFR_EF8_SHIFT                    8u
#define REACM2_GEFR_EF8_WIDTH                    1u
#define REACM2_GEFR_EF8(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF8_SHIFT))&REACM2_GEFR_EF8_MASK)
#define REACM2_GEFR_EF9_MASK                     0x200u
#define REACM2_GEFR_EF9_SHIFT                    9u
#define REACM2_GEFR_EF9_WIDTH                    1u
#define REACM2_GEFR_EF9(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_EF9_SHIFT))&REACM2_GEFR_EF9_MASK)
#define REACM2_GEFR_OVR_MASK                     0x80000000u
#define REACM2_GEFR_OVR_SHIFT                    31u
#define REACM2_GEFR_OVR_WIDTH                    1u
#define REACM2_GEFR_OVR(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_GEFR_OVR_SHIFT))&REACM2_GEFR_OVR_MASK)
/* CHCR Bit Fields */
#define REACM2_CHCR_MODULATION_ADDR_MASK         0x1Fu
#define REACM2_CHCR_MODULATION_ADDR_SHIFT        0u
#define REACM2_CHCR_MODULATION_ADDR_WIDTH        5u
#define REACM2_CHCR_MODULATION_ADDR(x)           (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_MODULATION_ADDR_SHIFT))&REACM2_CHCR_MODULATION_ADDR_MASK)
#define REACM2_CHCR_BSB_MASK                     0x700u
#define REACM2_CHCR_BSB_SHIFT                    8u
#define REACM2_CHCR_BSB_WIDTH                    3u
#define REACM2_CHCR_BSB(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_BSB_SHIFT))&REACM2_CHCR_BSB_MASK)
#define REACM2_CHCR_DOFF_MASK                    0x70000u
#define REACM2_CHCR_DOFF_SHIFT                   16u
#define REACM2_CHCR_DOFF_WIDTH                   3u
#define REACM2_CHCR_DOFF(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_DOFF_SHIFT))&REACM2_CHCR_DOFF_MASK)
#define REACM2_CHCR_SDCM_MASK                    0x100000u
#define REACM2_CHCR_SDCM_SHIFT                   20u
#define REACM2_CHCR_SDCM_WIDTH                   1u
#define REACM2_CHCR_SDCM(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_SDCM_SHIFT))&REACM2_CHCR_SDCM_MASK)
#define REACM2_CHCR_CHOFF_MASK                   0x200000u
#define REACM2_CHCR_CHOFF_SHIFT                  21u
#define REACM2_CHCR_CHOFF_WIDTH                  1u
#define REACM2_CHCR_CHOFF(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_CHOFF_SHIFT))&REACM2_CHCR_CHOFF_MASK)
#define REACM2_CHCR_RAEREN_MASK                  0x800000u
#define REACM2_CHCR_RAEREN_SHIFT                 23u
#define REACM2_CHCR_RAEREN_WIDTH                 1u
#define REACM2_CHCR_RAEREN(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_RAEREN_SHIFT))&REACM2_CHCR_RAEREN_MASK)
#define REACM2_CHCR_SQEREN_MASK                  0x1000000u
#define REACM2_CHCR_SQEREN_SHIFT                 24u
#define REACM2_CHCR_SQEREN_WIDTH                 1u
#define REACM2_CHCR_SQEREN(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_SQEREN_SHIFT))&REACM2_CHCR_SQEREN_MASK)
#define REACM2_CHCR_TAEREN_MASK                  0x2000000u
#define REACM2_CHCR_TAEREN_SHIFT                 25u
#define REACM2_CHCR_TAEREN_WIDTH                 1u
#define REACM2_CHCR_TAEREN(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_TAEREN_SHIFT))&REACM2_CHCR_TAEREN_MASK)
#define REACM2_CHCR_SCDFEN_MASK                  0x4000000u
#define REACM2_CHCR_SCDFEN_SHIFT                 26u
#define REACM2_CHCR_SCDFEN_WIDTH                 1u
#define REACM2_CHCR_SCDFEN(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_SCDFEN_SHIFT))&REACM2_CHCR_SCDFEN_MASK)
#define REACM2_CHCR_OCDFEN_MASK                  0x8000000u
#define REACM2_CHCR_OCDFEN_SHIFT                 27u
#define REACM2_CHCR_OCDFEN_WIDTH                 1u
#define REACM2_CHCR_OCDFEN(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_OCDFEN_SHIFT))&REACM2_CHCR_OCDFEN_MASK)
#define REACM2_CHCR_MAXLEN_MASK                  0x10000000u
#define REACM2_CHCR_MAXLEN_SHIFT                 28u
#define REACM2_CHCR_MAXLEN_WIDTH                 1u
#define REACM2_CHCR_MAXLEN(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_MAXLEN_SHIFT))&REACM2_CHCR_MAXLEN_MASK)
#define REACM2_CHCR_SWMC_MASK                    0x20000000u
#define REACM2_CHCR_SWMC_SHIFT                   29u
#define REACM2_CHCR_SWMC_WIDTH                   1u
#define REACM2_CHCR_SWMC(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_SWMC_SHIFT))&REACM2_CHCR_SWMC_MASK)
#define REACM2_CHCR_CHEN_MASK                    0xC0000000u
#define REACM2_CHCR_CHEN_SHIFT                   30u
#define REACM2_CHCR_CHEN_WIDTH                   2u
#define REACM2_CHCR_CHEN(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHCR_CHEN_SHIFT))&REACM2_CHCR_CHEN_MASK)
/* CHSR Bit Fields */
#define REACM2_CHSR_MODULATION_POINTER_MASK      0x3Fu
#define REACM2_CHSR_MODULATION_POINTER_SHIFT     0u
#define REACM2_CHSR_MODULATION_POINTER_WIDTH     6u
#define REACM2_CHSR_MODULATION_POINTER(x)        (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_MODULATION_POINTER_SHIFT))&REACM2_CHSR_MODULATION_POINTER_MASK)
#define REACM2_CHSR_RAERC_MASK                   0x80u
#define REACM2_CHSR_RAERC_SHIFT                  7u
#define REACM2_CHSR_RAERC_WIDTH                  1u
#define REACM2_CHSR_RAERC(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_RAERC_SHIFT))&REACM2_CHSR_RAERC_MASK)
#define REACM2_CHSR_SQERC_MASK                   0x100u
#define REACM2_CHSR_SQERC_SHIFT                  8u
#define REACM2_CHSR_SQERC_WIDTH                  1u
#define REACM2_CHSR_SQERC(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_SQERC_SHIFT))&REACM2_CHSR_SQERC_MASK)
#define REACM2_CHSR_TAERC_MASK                   0x200u
#define REACM2_CHSR_TAERC_SHIFT                  9u
#define REACM2_CHSR_TAERC_WIDTH                  1u
#define REACM2_CHSR_TAERC(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_TAERC_SHIFT))&REACM2_CHSR_TAERC_MASK)
#define REACM2_CHSR_SCDFC_MASK                   0x400u
#define REACM2_CHSR_SCDFC_SHIFT                  10u
#define REACM2_CHSR_SCDFC_WIDTH                  1u
#define REACM2_CHSR_SCDFC(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_SCDFC_SHIFT))&REACM2_CHSR_SCDFC_MASK)
#define REACM2_CHSR_OCDFC_MASK                   0x800u
#define REACM2_CHSR_OCDFC_SHIFT                  11u
#define REACM2_CHSR_OCDFC_WIDTH                  1u
#define REACM2_CHSR_OCDFC(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_OCDFC_SHIFT))&REACM2_CHSR_OCDFC_MASK)
#define REACM2_CHSR_MAXLC_MASK                   0x1000u
#define REACM2_CHSR_MAXLC_SHIFT                  12u
#define REACM2_CHSR_MAXLC_WIDTH                  1u
#define REACM2_CHSR_MAXLC(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_MAXLC_SHIFT))&REACM2_CHSR_MAXLC_MASK)
#define REACM2_CHSR_CHOUT_MASK                   0x700000u
#define REACM2_CHSR_CHOUT_SHIFT                  20u
#define REACM2_CHSR_CHOUT_WIDTH                  3u
#define REACM2_CHSR_CHOUT(x)                     (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_CHOUT_SHIFT))&REACM2_CHSR_CHOUT_MASK)
#define REACM2_CHSR_RAER_MASK                    0x800000u
#define REACM2_CHSR_RAER_SHIFT                   23u
#define REACM2_CHSR_RAER_WIDTH                   1u
#define REACM2_CHSR_RAER(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_RAER_SHIFT))&REACM2_CHSR_RAER_MASK)
#define REACM2_CHSR_SQER_MASK                    0x1000000u
#define REACM2_CHSR_SQER_SHIFT                   24u
#define REACM2_CHSR_SQER_WIDTH                   1u
#define REACM2_CHSR_SQER(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_SQER_SHIFT))&REACM2_CHSR_SQER_MASK)
#define REACM2_CHSR_TAER_MASK                    0x2000000u
#define REACM2_CHSR_TAER_SHIFT                   25u
#define REACM2_CHSR_TAER_WIDTH                   1u
#define REACM2_CHSR_TAER(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_TAER_SHIFT))&REACM2_CHSR_TAER_MASK)
#define REACM2_CHSR_SCDF_MASK                    0x4000000u
#define REACM2_CHSR_SCDF_SHIFT                   26u
#define REACM2_CHSR_SCDF_WIDTH                   1u
#define REACM2_CHSR_SCDF(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_SCDF_SHIFT))&REACM2_CHSR_SCDF_MASK)
#define REACM2_CHSR_OCDF_MASK                    0x8000000u
#define REACM2_CHSR_OCDF_SHIFT                   27u
#define REACM2_CHSR_OCDF_WIDTH                   1u
#define REACM2_CHSR_OCDF(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_OCDF_SHIFT))&REACM2_CHSR_OCDF_MASK)
#define REACM2_CHSR_MAXL_MASK                    0x10000000u
#define REACM2_CHSR_MAXL_SHIFT                   28u
#define REACM2_CHSR_MAXL_WIDTH                   1u
#define REACM2_CHSR_MAXL(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_MAXL_SHIFT))&REACM2_CHSR_MAXL_MASK)
#define REACM2_CHSR_MODACT_MASK                  0x20000000u
#define REACM2_CHSR_MODACT_SHIFT                 29u
#define REACM2_CHSR_MODACT_WIDTH                 1u
#define REACM2_CHSR_MODACT(x)                    (((uint32_t)(((uint32_t)(x))<<REACM2_CHSR_MODACT_SHIFT))&REACM2_CHSR_MODACT_MASK)
/* CHRR Bit Fields */
#define REACM2_CHRR_CHIR_MASK                    0xFu
#define REACM2_CHRR_CHIR_SHIFT                   0u
#define REACM2_CHRR_CHIR_WIDTH                   4u
#define REACM2_CHRR_CHIR(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHRR_CHIR_SHIFT))&REACM2_CHRR_CHIR_MASK)
#define REACM2_CHRR_ADCR_MASK                    0xF0000u
#define REACM2_CHRR_ADCR_SHIFT                   16u
#define REACM2_CHRR_ADCR_WIDTH                   4u
#define REACM2_CHRR_ADCR(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_CHRR_ADCR_SHIFT))&REACM2_CHRR_ADCR_MASK)
/* STBK Bit Fields */
#define REACM2_STBK_SHARED_TIMER_MASK            0xFFFFu
#define REACM2_STBK_SHARED_TIMER_SHIFT           0u
#define REACM2_STBK_SHARED_TIMER_WIDTH           16u
#define REACM2_STBK_SHARED_TIMER(x)              (((uint32_t)(((uint32_t)(x))<<REACM2_STBK_SHARED_TIMER_SHIFT))&REACM2_STBK_SHARED_TIMER_MASK)
/* HOTBK Bit Fields */
#define REACM2_HOTBK_HOLD_TIM_MASK               0xFFFu
#define REACM2_HOTBK_HOLD_TIM_SHIFT              0u
#define REACM2_HOTBK_HOLD_TIM_WIDTH              12u
#define REACM2_HOTBK_HOLD_TIM(x)                 (((uint32_t)(((uint32_t)(x))<<REACM2_HOTBK_HOLD_TIM_SHIFT))&REACM2_HOTBK_HOLD_TIM_MASK)
/* THBK Bit Fields */
#define REACM2_THBK_THRESHOLD_VALUE_MASK         0xFFFFu
#define REACM2_THBK_THRESHOLD_VALUE_SHIFT        0u
#define REACM2_THBK_THRESHOLD_VALUE_WIDTH        16u
#define REACM2_THBK_THRESHOLD_VALUE(x)           (((uint32_t)(((uint32_t)(x))<<REACM2_THBK_THRESHOLD_VALUE_SHIFT))&REACM2_THBK_THRESHOLD_VALUE_MASK)
/* ADCMAX Bit Fields */
#define REACM2_ADCMAX_ADC_MAX_LIMIT_MASK         0xFFFFu
#define REACM2_ADCMAX_ADC_MAX_LIMIT_SHIFT        0u
#define REACM2_ADCMAX_ADC_MAX_LIMIT_WIDTH        16u
#define REACM2_ADCMAX_ADC_MAX_LIMIT(x)           (((uint32_t)(((uint32_t)(x))<<REACM2_ADCMAX_ADC_MAX_LIMIT_SHIFT))&REACM2_ADCMAX_ADC_MAX_LIMIT_MASK)
/* RANGE_PWD Bit Fields */
#define REACM2_RANGE_PWD_RANGE_PWD_MASK          0xFFFu
#define REACM2_RANGE_PWD_RANGE_PWD_SHIFT         0u
#define REACM2_RANGE_PWD_RANGE_PWD_WIDTH         12u
#define REACM2_RANGE_PWD_RANGE_PWD(x)            (((uint32_t)(((uint32_t)(x))<<REACM2_RANGE_PWD_RANGE_PWD_SHIFT))&REACM2_RANGE_PWD_RANGE_PWD_MASK)
/* MIN_PWD Bit Fields */
#define REACM2_MIN_PWD_MIN_PWD_MASK              0xFFFu
#define REACM2_MIN_PWD_MIN_PWD_SHIFT             0u
#define REACM2_MIN_PWD_MIN_PWD_WIDTH             12u
#define REACM2_MIN_PWD_MIN_PWD(x)                (((uint32_t)(((uint32_t)(x))<<REACM2_MIN_PWD_MIN_PWD_SHIFT))&REACM2_MIN_PWD_MIN_PWD_MASK)
/* MWBK Bit Fields */
#define REACM2_MWBK_HDOFFTPT_MASK                0x7u
#define REACM2_MWBK_HDOFFTPT_SHIFT               0u
#define REACM2_MWBK_HDOFFTPT_WIDTH               3u
#define REACM2_MWBK_HDOFFTPT(x)                  (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_HDOFFTPT_SHIFT))&REACM2_MWBK_HDOFFTPT_MASK)
#define REACM2_MWBK_STPT_MASK                    0xE0u
#define REACM2_MWBK_STPT_SHIFT                   5u
#define REACM2_MWBK_STPT_WIDTH                   3u
#define REACM2_MWBK_STPT(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_STPT_SHIFT))&REACM2_MWBK_STPT_MASK)
#define REACM2_MWBK_THRESPT_MASK                 0x3E00u
#define REACM2_MWBK_THRESPT_SHIFT                9u
#define REACM2_MWBK_THRESPT_WIDTH                5u
#define REACM2_MWBK_THRESPT(x)                   (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_THRESPT_SHIFT))&REACM2_MWBK_THRESPT_MASK)
#define REACM2_MWBK_LOD_MASK                     0x70000u
#define REACM2_MWBK_LOD_SHIFT                    16u
