neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define REACM2_MWBK_LOD_WIDTH                    3u
#define REACM2_MWBK_LOD(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_LOD_SHIFT))&REACM2_MWBK_LOD_MASK)
#define REACM2_MWBK_HOD_MASK                     0x700000u
#define REACM2_MWBK_HOD_SHIFT                    20u
#define REACM2_MWBK_HOD_WIDTH                    3u
#define REACM2_MWBK_HOD(x)                       (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_HOD_SHIFT))&REACM2_MWBK_HOD_MASK)
#define REACM2_MWBK_SM_MASK                      0x3000000u
#define REACM2_MWBK_SM_SHIFT                     24u
#define REACM2_MWBK_SM_WIDTH                     2u
#define REACM2_MWBK_SM(x)                        (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_SM_SHIFT))&REACM2_MWBK_SM_MASK)
#define REACM2_MWBK_MM_MASK                      0x18000000u
#define REACM2_MWBK_MM_SHIFT                     27u
#define REACM2_MWBK_MM_WIDTH                     2u
#define REACM2_MWBK_MM(x)                        (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_MM_SHIFT))&REACM2_MWBK_MM_MASK)
#define REACM2_MWBK_IOSS_MASK                    0x40000000u
#define REACM2_MWBK_IOSS_SHIFT                   30u
#define REACM2_MWBK_IOSS_WIDTH                   1u
#define REACM2_MWBK_IOSS(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_IOSS_SHIFT))&REACM2_MWBK_IOSS_MASK)
#define REACM2_MWBK_LOOP_MASK                    0x80000000u
#define REACM2_MWBK_LOOP_SHIFT                   31u
#define REACM2_MWBK_LOOP_WIDTH                   1u
#define REACM2_MWBK_LOOP(x)                      (((uint32_t)(((uint32_t)(x))<<REACM2_MWBK_LOOP_SHIFT))&REACM2_MWBK_LOOP_MASK)

/*!
 * @}
 */ /* end of group REACM2_Register_Masks */


/*!
 * @}
 */ /* end of group REACM2_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SDADC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDADC_Peripheral_Access_Layer SDADC Peripheral Access Layer
 * @{
 */


/** SDADC - Size of Registers Arrays */

/** SDADC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration Register, offset: 0x0 */
  __IO uint32_t CSR;                               /**< Channel Selection Register, offset: 0x4 */
  __IO uint32_t RKR;                               /**< Reset Key Register, offset: 0x8 */
  __IO uint32_t SFR;                               /**< Status Flag Register, offset: 0xC */
  __IO uint32_t RSER;                              /**< Request Select and Enable Register, offset: 0x10 */
  __IO uint32_t OSDR;                              /**< Output Settling Delay Register, offset: 0x14 */
  __IO uint32_t FCR;                               /**< FIFO Control Register, offset: 0x18 */
  __IO uint32_t STKR;                              /**< Software Trigger Key Register, offset: 0x1C */
  __I  uint32_t CDR;                               /**< Converted Data Register, offset: 0x20 */
  __IO uint32_t WTHHLR;                            /**< WDG Threshold Register, offset: 0x24 */
} SDADC_Type, *SDADC_MemMapPtr;

 /** Number of instances of the SDADC module. */
#define SDADC_INSTANCE_COUNT                     (4u)


/* SDADC - Peripheral instance base addresses */
/** Peripheral SDADC_1 base address */
#define SDADC_1_BASE                             (0xFFE44000u)
/** Peripheral SDADC_1 base pointer */
#define SDADC_1                                  ((SDADC_Type *)SDADC_1_BASE)
/** Peripheral SDADC_2 base address */
#define SDADC_2_BASE                             (0xC3E44000u)
/** Peripheral SDADC_2 base pointer */
#define SDADC_2                                  ((SDADC_Type *)SDADC_2_BASE)
/** Peripheral SDADC_3 base address */
#define SDADC_3_BASE                             (0xFFE48000u)
/** Peripheral SDADC_3 base pointer */
#define SDADC_3                                  ((SDADC_Type *)SDADC_3_BASE)
/** Peripheral SDADC_4 base address */
#define SDADC_4_BASE                             (0xC3E48000u)
/** Peripheral SDADC_4 base pointer */
#define SDADC_4                                  ((SDADC_Type *)SDADC_4_BASE)
/** Array initializer of SDADC peripheral base addresses */
#define SDADC_BASE_ADDRS                         { 0u, SDADC_1_BASE, SDADC_2_BASE, SDADC_3_BASE, SDADC_4_BASE }
/** Array initializer of SDADC peripheral base pointers */
#define SDADC_BASE_PTRS                          { SDADC_1, SDADC_2, SDADC_3, SDADC_4 }
/** Interrupt vectors for the SDADC peripheral type */
#define SDADC_IRQS                               { SDADC1234_IRQn, SDADC1234_IRQn, SDADC1234_IRQn, SDADC1234_IRQn }
/* ----------------------------------------------------------------------------
   -- SDADC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDADC_Register_Masks SDADC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define SDADC_MCR_EN_MASK                        0x1u
#define SDADC_MCR_EN_SHIFT                       0u
#define SDADC_MCR_EN_WIDTH                       1u
#define SDADC_MCR_EN(x)                          (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_EN_SHIFT))&SDADC_MCR_EN_MASK)
#define SDADC_MCR_MODE_MASK                      0x2u
#define SDADC_MCR_MODE_SHIFT                     1u
#define SDADC_MCR_MODE_WIDTH                     1u
#define SDADC_MCR_MODE(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_MODE_SHIFT))&SDADC_MCR_MODE_MASK)
#define SDADC_MCR_GECEN_MASK                     0x4u
#define SDADC_MCR_GECEN_SHIFT                    2u
#define SDADC_MCR_GECEN_WIDTH                    1u
#define SDADC_MCR_GECEN(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_GECEN_SHIFT))&SDADC_MCR_GECEN_MASK)
#define SDADC_MCR_WRMODE_MASK                    0x8u
#define SDADC_MCR_WRMODE_SHIFT                   3u
#define SDADC_MCR_WRMODE_WIDTH                   1u
#define SDADC_MCR_WRMODE(x)                      (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_WRMODE_SHIFT))&SDADC_MCR_WRMODE_MASK)
#define SDADC_MCR_VCOMSEL_MASK                   0x10u
#define SDADC_MCR_VCOMSEL_SHIFT                  4u
#define SDADC_MCR_VCOMSEL_WIDTH                  1u
#define SDADC_MCR_VCOMSEL(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_VCOMSEL_SHIFT))&SDADC_MCR_VCOMSEL_MASK)
#define SDADC_MCR_FRZ_MASK                       0x80u
#define SDADC_MCR_FRZ_SHIFT                      7u
#define SDADC_MCR_FRZ_WIDTH                      1u
#define SDADC_MCR_FRZ(x)                         (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_FRZ_SHIFT))&SDADC_MCR_FRZ_MASK)
#define SDADC_MCR_TRIGSEL_MASK                   0xF00u
#define SDADC_MCR_TRIGSEL_SHIFT                  8u
#define SDADC_MCR_TRIGSEL_WIDTH                  4u
#define SDADC_MCR_TRIGSEL(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_TRIGSEL_SHIFT))&SDADC_MCR_TRIGSEL_MASK)
#define SDADC_MCR_TRIGEN_MASK                    0x1000u
#define SDADC_MCR_TRIGEN_SHIFT                   12u
#define SDADC_MCR_TRIGEN_WIDTH                   1u
#define SDADC_MCR_TRIGEN(x)                      (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_TRIGEN_SHIFT))&SDADC_MCR_TRIGEN_MASK)
#define SDADC_MCR_TRIGEDSEL_MASK                 0x6000u
#define SDADC_MCR_TRIGEDSEL_SHIFT                13u
#define SDADC_MCR_TRIGEDSEL_WIDTH                2u
#define SDADC_MCR_TRIGEDSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_TRIGEDSEL_SHIFT))&SDADC_MCR_TRIGEDSEL_MASK)
#define SDADC_MCR_WDGEN_MASK                     0x8000u
#define SDADC_MCR_WDGEN_SHIFT                    15u
#define SDADC_MCR_WDGEN_WIDTH                    1u
#define SDADC_MCR_WDGEN(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_WDGEN_SHIFT))&SDADC_MCR_WDGEN_MASK)
#define SDADC_MCR_HPFEN_MASK                     0x10000u
#define SDADC_MCR_HPFEN_SHIFT                    16u
#define SDADC_MCR_HPFEN_WIDTH                    1u
#define SDADC_MCR_HPFEN(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_HPFEN_SHIFT))&SDADC_MCR_HPFEN_MASK)
#define SDADC_MCR_PGAN_MASK                      0x700000u
#define SDADC_MCR_PGAN_SHIFT                     20u
#define SDADC_MCR_PGAN_WIDTH                     3u
#define SDADC_MCR_PGAN(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_PGAN_SHIFT))&SDADC_MCR_PGAN_MASK)
#define SDADC_MCR_PDR_MASK                       0x1F000000u
#define SDADC_MCR_PDR_SHIFT                      24u
#define SDADC_MCR_PDR_WIDTH                      5u
#define SDADC_MCR_PDR(x)                         (((uint32_t)(((uint32_t)(x))<<SDADC_MCR_PDR_SHIFT))&SDADC_MCR_PDR_MASK)
/* CSR Bit Fields */
#define SDADC_CSR_ANCHSEL_MASK                   0x7u
#define SDADC_CSR_ANCHSEL_SHIFT                  0u
#define SDADC_CSR_ANCHSEL_WIDTH                  3u
#define SDADC_CSR_ANCHSEL(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_CSR_ANCHSEL_SHIFT))&SDADC_CSR_ANCHSEL_MASK)
#define SDADC_CSR_ANCHSEL_WRAP_MASK              0x700u
#define SDADC_CSR_ANCHSEL_WRAP_SHIFT             8u
#define SDADC_CSR_ANCHSEL_WRAP_WIDTH             3u
#define SDADC_CSR_ANCHSEL_WRAP(x)                (((uint32_t)(((uint32_t)(x))<<SDADC_CSR_ANCHSEL_WRAP_SHIFT))&SDADC_CSR_ANCHSEL_WRAP_MASK)
#define SDADC_CSR_BIASEN_MASK                    0xFF0000u
#define SDADC_CSR_BIASEN_SHIFT                   16u
#define SDADC_CSR_BIASEN_WIDTH                   8u
#define SDADC_CSR_BIASEN(x)                      (((uint32_t)(((uint32_t)(x))<<SDADC_CSR_BIASEN_SHIFT))&SDADC_CSR_BIASEN_MASK)
/* RKR Bit Fields */
#define SDADC_RKR_RESET_KEY_MASK                 0xFFFFu
#define SDADC_RKR_RESET_KEY_SHIFT                0u
#define SDADC_RKR_RESET_KEY_WIDTH                16u
#define SDADC_RKR_RESET_KEY(x)                   (((uint32_t)(((uint32_t)(x))<<SDADC_RKR_RESET_KEY_SHIFT))&SDADC_RKR_RESET_KEY_MASK)
/* SFR Bit Fields */
#define SDADC_SFR_DFFF_MASK                      0x1u
#define SDADC_SFR_DFFF_SHIFT                     0u
#define SDADC_SFR_DFFF_WIDTH                     1u
#define SDADC_SFR_DFFF(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_DFFF_SHIFT))&SDADC_SFR_DFFF_MASK)
#define SDADC_SFR_DFORF_MASK                     0x2u
#define SDADC_SFR_DFORF_SHIFT                    1u
#define SDADC_SFR_DFORF_WIDTH                    1u
#define SDADC_SFR_DFORF(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_DFORF_SHIFT))&SDADC_SFR_DFORF_MASK)
#define SDADC_SFR_CDVF_MASK                      0x4u
#define SDADC_SFR_CDVF_SHIFT                     2u
#define SDADC_SFR_CDVF_WIDTH                     1u
#define SDADC_SFR_CDVF(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_CDVF_SHIFT))&SDADC_SFR_CDVF_MASK)
#define SDADC_SFR_WTHL_MASK                      0x8u
#define SDADC_SFR_WTHL_SHIFT                     3u
#define SDADC_SFR_WTHL_WIDTH                     1u
#define SDADC_SFR_WTHL(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_WTHL_SHIFT))&SDADC_SFR_WTHL_MASK)
#define SDADC_SFR_WTHH_MASK                      0x10u
#define SDADC_SFR_WTHH_SHIFT                     4u
#define SDADC_SFR_WTHH_WIDTH                     1u
#define SDADC_SFR_WTHH(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_WTHH_SHIFT))&SDADC_SFR_WTHH_MASK)
#define SDADC_SFR_DFEF_MASK                      0x100u
#define SDADC_SFR_DFEF_SHIFT                     8u
#define SDADC_SFR_DFEF_WIDTH                     1u
#define SDADC_SFR_DFEF(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_DFEF_SHIFT))&SDADC_SFR_DFEF_MASK)
#define SDADC_SFR_ANCHSEL_CNT_MASK               0x70000u
#define SDADC_SFR_ANCHSEL_CNT_SHIFT              16u
#define SDADC_SFR_ANCHSEL_CNT_WIDTH              3u
#define SDADC_SFR_ANCHSEL_CNT(x)                 (((uint32_t)(((uint32_t)(x))<<SDADC_SFR_ANCHSEL_CNT_SHIFT))&SDADC_SFR_ANCHSEL_CNT_MASK)
/* RSER Bit Fields */
#define SDADC_RSER_DFFDIRE_MASK                  0x1u
#define SDADC_RSER_DFFDIRE_SHIFT                 0u
#define SDADC_RSER_DFFDIRE_WIDTH                 1u
#define SDADC_RSER_DFFDIRE(x)                    (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_DFFDIRE_SHIFT))&SDADC_RSER_DFFDIRE_MASK)
#define SDADC_RSER_DFORIE_MASK                   0x2u
#define SDADC_RSER_DFORIE_SHIFT                  1u
#define SDADC_RSER_DFORIE_WIDTH                  1u
#define SDADC_RSER_DFORIE(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_DFORIE_SHIFT))&SDADC_RSER_DFORIE_MASK)
#define SDADC_RSER_CDVEE_MASK                    0x4u
#define SDADC_RSER_CDVEE_SHIFT                   2u
#define SDADC_RSER_CDVEE_WIDTH                   1u
#define SDADC_RSER_CDVEE(x)                      (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_CDVEE_SHIFT))&SDADC_RSER_CDVEE_MASK)
#define SDADC_RSER_WTHDIRE_MASK                  0x8u
#define SDADC_RSER_WTHDIRE_SHIFT                 3u
#define SDADC_RSER_WTHDIRE_WIDTH                 1u
#define SDADC_RSER_WTHDIRE(x)                    (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_WTHDIRE_SHIFT))&SDADC_RSER_WTHDIRE_MASK)
#define SDADC_RSER_GDIGE_MASK                    0x8000u
#define SDADC_RSER_GDIGE_SHIFT                   15u
#define SDADC_RSER_GDIGE_WIDTH                   1u
#define SDADC_RSER_GDIGE(x)                      (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_GDIGE_SHIFT))&SDADC_RSER_GDIGE_MASK)
#define SDADC_RSER_DFFDIRS_MASK                  0x10000u
#define SDADC_RSER_DFFDIRS_SHIFT                 16u
#define SDADC_RSER_DFFDIRS_WIDTH                 1u
#define SDADC_RSER_DFFDIRS(x)                    (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_DFFDIRS_SHIFT))&SDADC_RSER_DFFDIRS_MASK)
#define SDADC_RSER_WTHDIRS_MASK                  0x20000u
#define SDADC_RSER_WTHDIRS_SHIFT                 17u
#define SDADC_RSER_WTHDIRS_WIDTH                 1u
#define SDADC_RSER_WTHDIRS(x)                    (((uint32_t)(((uint32_t)(x))<<SDADC_RSER_WTHDIRS_SHIFT))&SDADC_RSER_WTHDIRS_MASK)
/* OSDR Bit Fields */
#define SDADC_OSDR_OSD_MASK                      0xFFu
#define SDADC_OSDR_OSD_SHIFT                     0u
#define SDADC_OSDR_OSD_WIDTH                     8u
#define SDADC_OSDR_OSD(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_OSDR_OSD_SHIFT))&SDADC_OSDR_OSD_MASK)
/* FCR Bit Fields */
#define SDADC_FCR_FE_MASK                        0x1u
#define SDADC_FCR_FE_SHIFT                       0u
#define SDADC_FCR_FE_WIDTH                       1u
#define SDADC_FCR_FE(x)                          (((uint32_t)(((uint32_t)(x))<<SDADC_FCR_FE_SHIFT))&SDADC_FCR_FE_MASK)
#define SDADC_FCR_FSIZE_MASK                     0x6u
#define SDADC_FCR_FSIZE_SHIFT                    1u
#define SDADC_FCR_FSIZE_WIDTH                    2u
#define SDADC_FCR_FSIZE(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_FCR_FSIZE_SHIFT))&SDADC_FCR_FSIZE_MASK)
#define SDADC_FCR_FOWEN_MASK                     0x8u
#define SDADC_FCR_FOWEN_SHIFT                    3u
#define SDADC_FCR_FOWEN_WIDTH                    1u
#define SDADC_FCR_FOWEN(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_FCR_FOWEN_SHIFT))&SDADC_FCR_FOWEN_MASK)
#define SDADC_FCR_FTHLD_MASK                     0xF00u
#define SDADC_FCR_FTHLD_SHIFT                    8u
#define SDADC_FCR_FTHLD_WIDTH                    4u
#define SDADC_FCR_FTHLD(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_FCR_FTHLD_SHIFT))&SDADC_FCR_FTHLD_MASK)
#define SDADC_FCR_FRST_MASK                      0x10000u
#define SDADC_FCR_FRST_SHIFT                     16u
#define SDADC_FCR_FRST_WIDTH                     1u
#define SDADC_FCR_FRST(x)                        (((uint32_t)(((uint32_t)(x))<<SDADC_FCR_FRST_SHIFT))&SDADC_FCR_FRST_MASK)
/* STKR Bit Fields */
#define SDADC_STKR_ST_KEY_MASK                   0xFFFFu
#define SDADC_STKR_ST_KEY_SHIFT                  0u
#define SDADC_STKR_ST_KEY_WIDTH                  16u
#define SDADC_STKR_ST_KEY(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_STKR_ST_KEY_SHIFT))&SDADC_STKR_ST_KEY_MASK)
/* CDR Bit Fields */
#define SDADC_CDR_CDATA_MASK                     0xFFFFu
#define SDADC_CDR_CDATA_SHIFT                    0u
#define SDADC_CDR_CDATA_WIDTH                    16u
#define SDADC_CDR_CDATA(x)                       (((uint32_t)(((uint32_t)(x))<<SDADC_CDR_CDATA_SHIFT))&SDADC_CDR_CDATA_MASK)
/* WTHHLR Bit Fields */
#define SDADC_WTHHLR_THRL_MASK                   0xFFFFu
#define SDADC_WTHHLR_THRL_SHIFT                  0u
#define SDADC_WTHHLR_THRL_WIDTH                  16u
#define SDADC_WTHHLR_THRL(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_WTHHLR_THRL_SHIFT))&SDADC_WTHHLR_THRL_MASK)
#define SDADC_WTHHLR_THRH_MASK                   0xFFFF0000u
#define SDADC_WTHHLR_THRH_SHIFT                  16u
#define SDADC_WTHHLR_THRH_WIDTH                  16u
#define SDADC_WTHHLR_THRH(x)                     (((uint32_t)(((uint32_t)(x))<<SDADC_WTHHLR_THRH_SHIFT))&SDADC_WTHHLR_THRH_MASK)

/*!
 * @}
 */ /* end of group SDADC_Register_Masks */


/*!
 * @}
 */ /* end of group SDADC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SEMA42 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMA42_Peripheral_Access_Layer SEMA42 Peripheral Access Layer
 * @{
 */


/** SEMA42 - Size of Registers Arrays */
#define SEMA42_GATE_COUNT                        16u
#define SEMA42_CPINE_COUNT                       2u
#define SEMA42_CPNTF_COUNT                       2u

/** SEMA42 - Register Layout Typedef */
typedef struct {
  __IO uint8_t GATE[SEMA42_GATE_COUNT];            /**< Semaphores Gate 0 Register..Semaphores Gate 15 Register, array offset: 0x0, array step: 0x1 */
       uint8_t RESERVED_0[48];
  struct {                                         /* offset: 0x40, array step: 0x8 */
    __IO uint16_t CPINE;                             /**< Semaphores Processor n IRQ Notification Enable, array offset: 0x40, array step: 0x8 */
         uint8_t RESERVED_0[6];
  } CPINE[SEMA42_CPINE_COUNT];
       uint8_t RESERVED_1[48];
  struct {                                         /* offset: 0x80, array step: 0x8 */
    __IO uint16_t CPNTF;                             /**< Semaphores Processor n IRQ Notification, array offset: 0x80, array step: 0x8 */
         uint8_t RESERVED_0[6];
  } CPNTF[SEMA42_CPNTF_COUNT];
       uint8_t RESERVED_2[112];
  union {                                          /* offset: 0x100 */
    __I  uint16_t R;                                 /**< Reset Gate Read, offset: 0x100 */
    __O  uint16_t W;                                 /**< Reset Gate Write, offset: 0x100 */
  } RSTGT;
       uint8_t RESERVED_3[2];
  __IO uint16_t RSTNTF;                            /**< Semaphores (Secure) Reset IRQ Notification, offset: 0x104 */
} SEMA42_Type, *SEMA42_MemMapPtr;

 /** Number of instances of the SEMA42 module. */
#define SEMA42_INSTANCE_COUNT                    (1u)


/* SEMA42 - Peripheral instance base addresses */
/** Peripheral SEMA42 base address */
#define SEMA42_BASE                              (0xFFF24000u)
/** Peripheral SEMA42 base pointer */
#define SEMA42                                   ((SEMA42_Type *)SEMA42_BASE)
/** Array initializer of SEMA42 peripheral base addresses */
#define SEMA42_BASE_ADDRS                        { SEMA42_BASE }
/** Array initializer of SEMA42 peripheral base pointers */
#define SEMA42_BASE_PTRS                         { SEMA42 }

/* ----------------------------------------------------------------------------
   -- SEMA42 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SEMA42_Register_Masks SEMA42 Register Masks
 * @{
 */

