neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* GATE Bit Fields */
#define SEMA42_GATE_GTFSM_MASK                   0x3u
#define SEMA42_GATE_GTFSM_SHIFT                  0u
#define SEMA42_GATE_GTFSM_WIDTH                  2u
#define SEMA42_GATE_GTFSM(x)                     (((uint8_t)(((uint8_t)(x))<<SEMA42_GATE_GTFSM_SHIFT))&SEMA42_GATE_GTFSM_MASK)
/* CPINE Bit Fields */
#define SEMA42_CPINE_INE15_MASK                  0x1u
#define SEMA42_CPINE_INE15_SHIFT                 0u
#define SEMA42_CPINE_INE15_WIDTH                 1u
#define SEMA42_CPINE_INE15(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE15_SHIFT))&SEMA42_CPINE_INE15_MASK)
#define SEMA42_CPINE_INE14_MASK                  0x2u
#define SEMA42_CPINE_INE14_SHIFT                 1u
#define SEMA42_CPINE_INE14_WIDTH                 1u
#define SEMA42_CPINE_INE14(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE14_SHIFT))&SEMA42_CPINE_INE14_MASK)
#define SEMA42_CPINE_INE13_MASK                  0x4u
#define SEMA42_CPINE_INE13_SHIFT                 2u
#define SEMA42_CPINE_INE13_WIDTH                 1u
#define SEMA42_CPINE_INE13(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE13_SHIFT))&SEMA42_CPINE_INE13_MASK)
#define SEMA42_CPINE_INE12_MASK                  0x8u
#define SEMA42_CPINE_INE12_SHIFT                 3u
#define SEMA42_CPINE_INE12_WIDTH                 1u
#define SEMA42_CPINE_INE12(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE12_SHIFT))&SEMA42_CPINE_INE12_MASK)
#define SEMA42_CPINE_INE11_MASK                  0x10u
#define SEMA42_CPINE_INE11_SHIFT                 4u
#define SEMA42_CPINE_INE11_WIDTH                 1u
#define SEMA42_CPINE_INE11(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE11_SHIFT))&SEMA42_CPINE_INE11_MASK)
#define SEMA42_CPINE_INE10_MASK                  0x20u
#define SEMA42_CPINE_INE10_SHIFT                 5u
#define SEMA42_CPINE_INE10_WIDTH                 1u
#define SEMA42_CPINE_INE10(x)                    (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE10_SHIFT))&SEMA42_CPINE_INE10_MASK)
#define SEMA42_CPINE_INE9_MASK                   0x40u
#define SEMA42_CPINE_INE9_SHIFT                  6u
#define SEMA42_CPINE_INE9_WIDTH                  1u
#define SEMA42_CPINE_INE9(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE9_SHIFT))&SEMA42_CPINE_INE9_MASK)
#define SEMA42_CPINE_INE8_MASK                   0x80u
#define SEMA42_CPINE_INE8_SHIFT                  7u
#define SEMA42_CPINE_INE8_WIDTH                  1u
#define SEMA42_CPINE_INE8(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE8_SHIFT))&SEMA42_CPINE_INE8_MASK)
#define SEMA42_CPINE_INE7_MASK                   0x100u
#define SEMA42_CPINE_INE7_SHIFT                  8u
#define SEMA42_CPINE_INE7_WIDTH                  1u
#define SEMA42_CPINE_INE7(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE7_SHIFT))&SEMA42_CPINE_INE7_MASK)
#define SEMA42_CPINE_INE6_MASK                   0x200u
#define SEMA42_CPINE_INE6_SHIFT                  9u
#define SEMA42_CPINE_INE6_WIDTH                  1u
#define SEMA42_CPINE_INE6(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE6_SHIFT))&SEMA42_CPINE_INE6_MASK)
#define SEMA42_CPINE_INE5_MASK                   0x400u
#define SEMA42_CPINE_INE5_SHIFT                  10u
#define SEMA42_CPINE_INE5_WIDTH                  1u
#define SEMA42_CPINE_INE5(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE5_SHIFT))&SEMA42_CPINE_INE5_MASK)
#define SEMA42_CPINE_INE4_MASK                   0x800u
#define SEMA42_CPINE_INE4_SHIFT                  11u
#define SEMA42_CPINE_INE4_WIDTH                  1u
#define SEMA42_CPINE_INE4(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE4_SHIFT))&SEMA42_CPINE_INE4_MASK)
#define SEMA42_CPINE_INE3_MASK                   0x1000u
#define SEMA42_CPINE_INE3_SHIFT                  12u
#define SEMA42_CPINE_INE3_WIDTH                  1u
#define SEMA42_CPINE_INE3(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE3_SHIFT))&SEMA42_CPINE_INE3_MASK)
#define SEMA42_CPINE_INE2_MASK                   0x2000u
#define SEMA42_CPINE_INE2_SHIFT                  13u
#define SEMA42_CPINE_INE2_WIDTH                  1u
#define SEMA42_CPINE_INE2(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE2_SHIFT))&SEMA42_CPINE_INE2_MASK)
#define SEMA42_CPINE_INE1_MASK                   0x4000u
#define SEMA42_CPINE_INE1_SHIFT                  14u
#define SEMA42_CPINE_INE1_WIDTH                  1u
#define SEMA42_CPINE_INE1(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE1_SHIFT))&SEMA42_CPINE_INE1_MASK)
#define SEMA42_CPINE_INE0_MASK                   0x8000u
#define SEMA42_CPINE_INE0_SHIFT                  15u
#define SEMA42_CPINE_INE0_WIDTH                  1u
#define SEMA42_CPINE_INE0(x)                     (((uint16_t)(((uint16_t)(x))<<SEMA42_CPINE_INE0_SHIFT))&SEMA42_CPINE_INE0_MASK)
/* CPNTF Bit Fields */
#define SEMA42_CPNTF_GNn_MASK                    0xFFFFu
#define SEMA42_CPNTF_GNn_SHIFT                   0u
#define SEMA42_CPNTF_GNn_WIDTH                   16u
#define SEMA42_CPNTF_GNn(x)                      (((uint16_t)(((uint16_t)(x))<<SEMA42_CPNTF_GNn_SHIFT))&SEMA42_CPNTF_GNn_MASK)
/* RSTGT_R Bit Fields */
#define SEMA42_RSTGT_R_RSTGTN_MASK               0xFFu
#define SEMA42_RSTGT_R_RSTGTN_SHIFT              0u
#define SEMA42_RSTGT_R_RSTGTN_WIDTH              8u
#define SEMA42_RSTGT_R_RSTGTN(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_R_RSTGTN_SHIFT))&SEMA42_RSTGT_R_RSTGTN_MASK)
#define SEMA42_RSTGT_R_RSTGMS_MASK               0x700u
#define SEMA42_RSTGT_R_RSTGMS_SHIFT              8u
#define SEMA42_RSTGT_R_RSTGMS_WIDTH              3u
#define SEMA42_RSTGT_R_RSTGMS(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_R_RSTGMS_SHIFT))&SEMA42_RSTGT_R_RSTGMS_MASK)
#define SEMA42_RSTGT_R_RSTGSM_MASK               0x3000u
#define SEMA42_RSTGT_R_RSTGSM_SHIFT              12u
#define SEMA42_RSTGT_R_RSTGSM_WIDTH              2u
#define SEMA42_RSTGT_R_RSTGSM(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_R_RSTGSM_SHIFT))&SEMA42_RSTGT_R_RSTGSM_MASK)
/* RSTGT_W Bit Fields */
#define SEMA42_RSTGT_W_RSTGTN_MASK               0xFFu
#define SEMA42_RSTGT_W_RSTGTN_SHIFT              0u
#define SEMA42_RSTGT_W_RSTGTN_WIDTH              8u
#define SEMA42_RSTGT_W_RSTGTN(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_W_RSTGTN_SHIFT))&SEMA42_RSTGT_W_RSTGTN_MASK)
#define SEMA42_RSTGT_W_RSTGDP_MASK               0xFF00u
#define SEMA42_RSTGT_W_RSTGDP_SHIFT              8u
#define SEMA42_RSTGT_W_RSTGDP_WIDTH              8u
#define SEMA42_RSTGT_W_RSTGDP(x)                 (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTGT_W_RSTGDP_SHIFT))&SEMA42_RSTGT_W_RSTGDP_MASK)
/* RSTNTF Bit Fields */
#define SEMA42_RSTNTF_RSTNTN_MASK                0xFFu
#define SEMA42_RSTNTF_RSTNTN_SHIFT               0u
#define SEMA42_RSTNTF_RSTNTN_WIDTH               8u
#define SEMA42_RSTNTF_RSTNTN(x)                  (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTNTF_RSTNTN_SHIFT))&SEMA42_RSTNTF_RSTNTN_MASK)
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_MASK  0xFF00u
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_SHIFT 8u
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_WIDTH 8u
#define SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP(x)    (((uint16_t)(((uint16_t)(x))<<SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_SHIFT))&SEMA42_RSTNTF_RSTNSM_RSTNMS_RSTNDP_MASK)

/*!
 * @}
 */ /* end of group SEMA42_Register_Masks */


/*!
 * @}
 */ /* end of group SEMA42_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SIPI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIPI_Peripheral_Access_Layer SIPI Peripheral Access Layer
 * @{
 */


/** SIPI - Size of Registers Arrays */
#define SIPI_CDR2__COUNT                         8u

/** SIPI - Register Layout Typedef */
typedef struct {
  __IO uint32_t CCR0;                              /**< SIPI Channel Control Register 0, offset: 0x0 */
  __IO uint32_t CSR0;                              /**< SIPI Channel Status Register 0, offset: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t CIR0;                              /**< SIPI Channel Interrupt Register 0, offset: 0xC */
  __IO uint32_t CTOR0;                             /**< SIPI Channel Timeout Register 0, offset: 0x10 */
  __I  uint32_t CCRC0;                             /**< SIPI Channel CRC Register 0, offset: 0x14 */
  __IO uint32_t CAR0;                              /**< SIPI Channel Address Register 0, offset: 0x18 */
  __IO uint32_t CDR0;                              /**< SIPI Channel Data Register 0, offset: 0x1C */
  __IO uint32_t CCR1;                              /**< SIPI Channel Control Register 1, offset: 0x20 */
  __IO uint32_t CSR1;                              /**< SIPI Channel Status Register 1, offset: 0x24 */
       uint8_t RESERVED_1[4];
  __IO uint32_t CIR1;                              /**< SIPI Channel Interrupt Register 1, offset: 0x2C */
  __IO uint32_t CTOR1;                             /**< SIPI Channel Timeout Register 1, offset: 0x30 */
  __I  uint32_t CCRC1;                             /**< SIPI Channel CRC Register 1, offset: 0x34 */
  __IO uint32_t CAR1;                              /**< SIPI Channel Address Register 1, offset: 0x38 */
  __IO uint32_t CDR1;                              /**< SIPI Channel Data Register 1, offset: 0x3C */
  __IO uint32_t CCR2;                              /**< SIPI Channel Control Register 2, offset: 0x40 */
  __IO uint32_t CSR2;                              /**< SIPI Channel Status Register 2, offset: 0x44 */
       uint8_t RESERVED_2[4];
  __IO uint32_t CIR2;                              /**< SIPI Channel Interrupt Register 2, offset: 0x4C */
  __IO uint32_t CTOR2;                             /**< SIPI Channel Timeout Register 2, offset: 0x50 */
  __I  uint32_t CCRC2;                             /**< SIPI Channel CRC Register 2, offset: 0x54 */
  __IO uint32_t CAR2;                              /**< SIPI Channel Address Register 2, offset: 0x58 */
  __IO uint32_t CDR2[SIPI_CDR2__COUNT];            /**< SIPI Channel Data Register 2, array offset: 0x5C, array step: 0x4 */
  __IO uint32_t CCR3;                              /**< SIPI Channel Control Register 3, offset: 0x7C */
  __IO uint32_t CSR3;                              /**< SIPI Channel Status Register 3, offset: 0x80 */
       uint8_t RESERVED_3[4];
  __IO uint32_t CIR3;                              /**< SIPI Channel Interrupt Register 3, offset: 0x88 */
  __IO uint32_t CTOR3;                             /**< SIPI Channel Timeout Register 3, offset: 0x8C */
  __I  uint32_t CCRC3;                             /**< SIPI Channel CRC Register 3, offset: 0x90 */
  __IO uint32_t CAR3;                              /**< SIPI Channel Address Register 3, offset: 0x94 */
  __IO uint32_t CDR3;                              /**< SIPI Channel Data Register 3, offset: 0x98 */
  __IO uint32_t MCR;                               /**< SIPI Module Configuration Register, offset: 0x9C */
  __IO uint32_t SR;                                /**< SIPI Status Register, offset: 0xA0 */
  __IO uint32_t MAXCR;                             /**< SIPI Max Count Register, offset: 0xA4 */
  __IO uint32_t ARR;                               /**< SIPI Address Reload Register, offset: 0xA8 */
  __IO uint32_t ACR;                               /**< SIPI Address Count Register, offset: 0xAC */
  __IO uint32_t ERR;                               /**< SIPI Error Register, offset: 0xB0 */
} SIPI_Type, *SIPI_MemMapPtr;

