neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the SIPI module. */
#define SIPI_INSTANCE_COUNT                      (1u)


/* SIPI - Peripheral instance base addresses */
/** Peripheral SIPI base address */
#define SIPI_BASE                                (0xFFE6C000u)
/** Peripheral SIPI base pointer */
#define SIPI                                     ((SIPI_Type *)SIPI_BASE)
/** Array initializer of SIPI peripheral base addresses */
#define SIPI_BASE_ADDRS                          { SIPI_BASE }
/** Array initializer of SIPI peripheral base pointers */
#define SIPI_BASE_PTRS                           { SIPI }

/* ----------------------------------------------------------------------------
   -- SIPI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIPI_Register_Masks SIPI Register Masks
 * @{
 */

/* CCR0 Bit Fields */
#define SIPI_CCR0_DEN_MASK                       0x1u
#define SIPI_CCR0_DEN_SHIFT                      0u
#define SIPI_CCR0_DEN_WIDTH                      1u
#define SIPI_CCR0_DEN(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_DEN_SHIFT))&SIPI_CCR0_DEN_MASK)
#define SIPI_CCR0_WRT_MASK                       0x2u
#define SIPI_CCR0_WRT_SHIFT                      1u
#define SIPI_CCR0_WRT_WIDTH                      1u
#define SIPI_CCR0_WRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_WRT_SHIFT))&SIPI_CCR0_WRT_MASK)
#define SIPI_CCR0_RRT_MASK                       0x4u
#define SIPI_CCR0_RRT_SHIFT                      2u
#define SIPI_CCR0_RRT_WIDTH                      1u
#define SIPI_CCR0_RRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_RRT_SHIFT))&SIPI_CCR0_RRT_MASK)
#define SIPI_CCR0_IDT_MASK                       0x8u
#define SIPI_CCR0_IDT_SHIFT                      3u
#define SIPI_CCR0_IDT_WIDTH                      1u
#define SIPI_CCR0_IDT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_IDT_SHIFT))&SIPI_CCR0_IDT_MASK)
#define SIPI_CCR0_ST_MASK                        0x10u
#define SIPI_CCR0_ST_SHIFT                       4u
#define SIPI_CCR0_ST_WIDTH                       1u
#define SIPI_CCR0_ST(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_ST_SHIFT))&SIPI_CCR0_ST_MASK)
#define SIPI_CCR0_CHEN_MASK                      0x20u
#define SIPI_CCR0_CHEN_SHIFT                     5u
#define SIPI_CCR0_CHEN_WIDTH                     1u
#define SIPI_CCR0_CHEN(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_CHEN_SHIFT))&SIPI_CCR0_CHEN_MASK)
#define SIPI_CCR0_WL_MASK                        0xC0u
#define SIPI_CCR0_WL_SHIFT                       6u
#define SIPI_CCR0_WL_WIDTH                       2u
#define SIPI_CCR0_WL(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_WL_SHIFT))&SIPI_CCR0_WL_MASK)
#define SIPI_CCR0_TC_MASK                        0x10000u
#define SIPI_CCR0_TC_SHIFT                       16u
#define SIPI_CCR0_TC_WIDTH                       1u
#define SIPI_CCR0_TC(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR0_TC_SHIFT))&SIPI_CCR0_TC_MASK)
/* CSR0 Bit Fields */
#define SIPI_CSR0_CB_MASK                        0x4u
#define SIPI_CSR0_CB_SHIFT                       2u
#define SIPI_CSR0_CB_WIDTH                       1u
#define SIPI_CSR0_CB(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CSR0_CB_SHIFT))&SIPI_CSR0_CB_MASK)
#define SIPI_CSR0_ACKR_MASK                      0x8u
#define SIPI_CSR0_ACKR_SHIFT                     3u
#define SIPI_CSR0_ACKR_WIDTH                     1u
#define SIPI_CSR0_ACKR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CSR0_ACKR_SHIFT))&SIPI_CSR0_ACKR_MASK)
#define SIPI_CSR0_TID_MASK                       0x70u
#define SIPI_CSR0_TID_SHIFT                      4u
#define SIPI_CSR0_TID_WIDTH                      3u
#define SIPI_CSR0_TID(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR0_TID_SHIFT))&SIPI_CSR0_TID_MASK)
#define SIPI_CSR0_RAR_MASK                       0x80u
#define SIPI_CSR0_RAR_SHIFT                      7u
#define SIPI_CSR0_RAR_WIDTH                      1u
#define SIPI_CSR0_RAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR0_RAR_SHIFT))&SIPI_CSR0_RAR_MASK)
/* CIR0 Bit Fields */
#define SIPI_CIR0_ACKIE_MASK                     0x1u
#define SIPI_CIR0_ACKIE_SHIFT                    0u
#define SIPI_CIR0_ACKIE_WIDTH                    1u
#define SIPI_CIR0_ACKIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR0_ACKIE_SHIFT))&SIPI_CIR0_ACKIE_MASK)
#define SIPI_CIR0_TIDIE_MASK                     0x2u
#define SIPI_CIR0_TIDIE_SHIFT                    1u
#define SIPI_CIR0_TIDIE_WIDTH                    1u
#define SIPI_CIR0_TIDIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR0_TIDIE_SHIFT))&SIPI_CIR0_TIDIE_MASK)
#define SIPI_CIR0_TOIE_MASK                      0x4u
#define SIPI_CIR0_TOIE_SHIFT                     2u
#define SIPI_CIR0_TOIE_WIDTH                     1u
#define SIPI_CIR0_TOIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR0_TOIE_SHIFT))&SIPI_CIR0_TOIE_MASK)
#define SIPI_CIR0_TCIE_MASK                      0x8u
#define SIPI_CIR0_TCIE_SHIFT                     3u
#define SIPI_CIR0_TCIE_WIDTH                     1u
#define SIPI_CIR0_TCIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR0_TCIE_SHIFT))&SIPI_CIR0_TCIE_MASK)
#define SIPI_CIR0_RAIE_MASK                      0x10u
#define SIPI_CIR0_RAIE_SHIFT                     4u
#define SIPI_CIR0_RAIE_WIDTH                     1u
#define SIPI_CIR0_RAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR0_RAIE_SHIFT))&SIPI_CIR0_RAIE_MASK)
#define SIPI_CIR0_WAIE_MASK                      0x20u
#define SIPI_CIR0_WAIE_SHIFT                     5u
#define SIPI_CIR0_WAIE_WIDTH                     1u
#define SIPI_CIR0_WAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR0_WAIE_SHIFT))&SIPI_CIR0_WAIE_MASK)
/* CTOR0 Bit Fields */
#define SIPI_CTOR0_TOR_MASK                      0xFFu
#define SIPI_CTOR0_TOR_SHIFT                     0u
#define SIPI_CTOR0_TOR_WIDTH                     8u
#define SIPI_CTOR0_TOR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CTOR0_TOR_SHIFT))&SIPI_CTOR0_TOR_MASK)
/* CCRC0 Bit Fields */
#define SIPI_CCRC0_CRCT_MASK                     0xFFFFu
#define SIPI_CCRC0_CRCT_SHIFT                    0u
#define SIPI_CCRC0_CRCT_WIDTH                    16u
#define SIPI_CCRC0_CRCT(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC0_CRCT_SHIFT))&SIPI_CCRC0_CRCT_MASK)
#define SIPI_CCRC0_CRCI_MASK                     0xFFFF0000u
#define SIPI_CCRC0_CRCI_SHIFT                    16u
#define SIPI_CCRC0_CRCI_WIDTH                    16u
#define SIPI_CCRC0_CRCI(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC0_CRCI_SHIFT))&SIPI_CCRC0_CRCI_MASK)
/* CAR0 Bit Fields */
#define SIPI_CAR0_CAR_MASK                       0xFFFFFFFFu
#define SIPI_CAR0_CAR_SHIFT                      0u
#define SIPI_CAR0_CAR_WIDTH                      32u
#define SIPI_CAR0_CAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CAR0_CAR_SHIFT))&SIPI_CAR0_CAR_MASK)
/* CDR0 Bit Fields */
#define SIPI_CDR0_CDR_MASK                       0xFFFFFFFFu
#define SIPI_CDR0_CDR_SHIFT                      0u
#define SIPI_CDR0_CDR_WIDTH                      32u
#define SIPI_CDR0_CDR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CDR0_CDR_SHIFT))&SIPI_CDR0_CDR_MASK)
/* CCR1 Bit Fields */
#define SIPI_CCR1_DEN_MASK                       0x1u
#define SIPI_CCR1_DEN_SHIFT                      0u
#define SIPI_CCR1_DEN_WIDTH                      1u
#define SIPI_CCR1_DEN(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_DEN_SHIFT))&SIPI_CCR1_DEN_MASK)
#define SIPI_CCR1_WRT_MASK                       0x2u
#define SIPI_CCR1_WRT_SHIFT                      1u
#define SIPI_CCR1_WRT_WIDTH                      1u
#define SIPI_CCR1_WRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_WRT_SHIFT))&SIPI_CCR1_WRT_MASK)
#define SIPI_CCR1_RRT_MASK                       0x4u
#define SIPI_CCR1_RRT_SHIFT                      2u
#define SIPI_CCR1_RRT_WIDTH                      1u
#define SIPI_CCR1_RRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_RRT_SHIFT))&SIPI_CCR1_RRT_MASK)
#define SIPI_CCR1_IDT_MASK                       0x8u
#define SIPI_CCR1_IDT_SHIFT                      3u
#define SIPI_CCR1_IDT_WIDTH                      1u
#define SIPI_CCR1_IDT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_IDT_SHIFT))&SIPI_CCR1_IDT_MASK)
#define SIPI_CCR1_ST_MASK                        0x10u
#define SIPI_CCR1_ST_SHIFT                       4u
#define SIPI_CCR1_ST_WIDTH                       1u
#define SIPI_CCR1_ST(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_ST_SHIFT))&SIPI_CCR1_ST_MASK)
#define SIPI_CCR1_CHEN_MASK                      0x20u
#define SIPI_CCR1_CHEN_SHIFT                     5u
#define SIPI_CCR1_CHEN_WIDTH                     1u
#define SIPI_CCR1_CHEN(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_CHEN_SHIFT))&SIPI_CCR1_CHEN_MASK)
#define SIPI_CCR1_WL_MASK                        0xC0u
#define SIPI_CCR1_WL_SHIFT                       6u
#define SIPI_CCR1_WL_WIDTH                       2u
#define SIPI_CCR1_WL(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_WL_SHIFT))&SIPI_CCR1_WL_MASK)
#define SIPI_CCR1_TC_MASK                        0x10000u
#define SIPI_CCR1_TC_SHIFT                       16u
#define SIPI_CCR1_TC_WIDTH                       1u
#define SIPI_CCR1_TC(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR1_TC_SHIFT))&SIPI_CCR1_TC_MASK)
/* CSR1 Bit Fields */
#define SIPI_CSR1_CB_MASK                        0x4u
#define SIPI_CSR1_CB_SHIFT                       2u
#define SIPI_CSR1_CB_WIDTH                       1u
#define SIPI_CSR1_CB(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CSR1_CB_SHIFT))&SIPI_CSR1_CB_MASK)
#define SIPI_CSR1_ACKR_MASK                      0x8u
#define SIPI_CSR1_ACKR_SHIFT                     3u
#define SIPI_CSR1_ACKR_WIDTH                     1u
#define SIPI_CSR1_ACKR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CSR1_ACKR_SHIFT))&SIPI_CSR1_ACKR_MASK)
#define SIPI_CSR1_TID_MASK                       0x70u
#define SIPI_CSR1_TID_SHIFT                      4u
#define SIPI_CSR1_TID_WIDTH                      3u
#define SIPI_CSR1_TID(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR1_TID_SHIFT))&SIPI_CSR1_TID_MASK)
#define SIPI_CSR1_RAR_MASK                       0x80u
#define SIPI_CSR1_RAR_SHIFT                      7u
#define SIPI_CSR1_RAR_WIDTH                      1u
#define SIPI_CSR1_RAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR1_RAR_SHIFT))&SIPI_CSR1_RAR_MASK)
/* CIR1 Bit Fields */
#define SIPI_CIR1_ACKIE_MASK                     0x1u
#define SIPI_CIR1_ACKIE_SHIFT                    0u
#define SIPI_CIR1_ACKIE_WIDTH                    1u
#define SIPI_CIR1_ACKIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR1_ACKIE_SHIFT))&SIPI_CIR1_ACKIE_MASK)
#define SIPI_CIR1_TIDIE_MASK                     0x2u
#define SIPI_CIR1_TIDIE_SHIFT                    1u
#define SIPI_CIR1_TIDIE_WIDTH                    1u
#define SIPI_CIR1_TIDIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR1_TIDIE_SHIFT))&SIPI_CIR1_TIDIE_MASK)
#define SIPI_CIR1_TOIE_MASK                      0x4u
#define SIPI_CIR1_TOIE_SHIFT                     2u
#define SIPI_CIR1_TOIE_WIDTH                     1u
#define SIPI_CIR1_TOIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR1_TOIE_SHIFT))&SIPI_CIR1_TOIE_MASK)
#define SIPI_CIR1_TCIE_MASK                      0x8u
#define SIPI_CIR1_TCIE_SHIFT                     3u
#define SIPI_CIR1_TCIE_WIDTH                     1u
#define SIPI_CIR1_TCIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR1_TCIE_SHIFT))&SIPI_CIR1_TCIE_MASK)
#define SIPI_CIR1_RAIE_MASK                      0x10u
#define SIPI_CIR1_RAIE_SHIFT                     4u
#define SIPI_CIR1_RAIE_WIDTH                     1u
#define SIPI_CIR1_RAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR1_RAIE_SHIFT))&SIPI_CIR1_RAIE_MASK)
#define SIPI_CIR1_WAIE_MASK                      0x20u
#define SIPI_CIR1_WAIE_SHIFT                     5u
#define SIPI_CIR1_WAIE_WIDTH                     1u
#define SIPI_CIR1_WAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR1_WAIE_SHIFT))&SIPI_CIR1_WAIE_MASK)
/* CTOR1 Bit Fields */
#define SIPI_CTOR1_TOR_MASK                      0xFFu
#define SIPI_CTOR1_TOR_SHIFT                     0u
#define SIPI_CTOR1_TOR_WIDTH                     8u
#define SIPI_CTOR1_TOR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CTOR1_TOR_SHIFT))&SIPI_CTOR1_TOR_MASK)
/* CCRC1 Bit Fields */
#define SIPI_CCRC1_CRCT_MASK                     0xFFFFu
#define SIPI_CCRC1_CRCT_SHIFT                    0u
#define SIPI_CCRC1_CRCT_WIDTH                    16u
#define SIPI_CCRC1_CRCT(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC1_CRCT_SHIFT))&SIPI_CCRC1_CRCT_MASK)
#define SIPI_CCRC1_CRCI_MASK                     0xFFFF0000u
#define SIPI_CCRC1_CRCI_SHIFT                    16u
#define SIPI_CCRC1_CRCI_WIDTH                    16u
#define SIPI_CCRC1_CRCI(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC1_CRCI_SHIFT))&SIPI_CCRC1_CRCI_MASK)
/* CAR1 Bit Fields */
#define SIPI_CAR1_CAR_MASK                       0xFFFFFFFFu
#define SIPI_CAR1_CAR_SHIFT                      0u
#define SIPI_CAR1_CAR_WIDTH                      32u
#define SIPI_CAR1_CAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CAR1_CAR_SHIFT))&SIPI_CAR1_CAR_MASK)
/* CDR1 Bit Fields */
#define SIPI_CDR1_CDR_MASK                       0xFFFFFFFFu
#define SIPI_CDR1_CDR_SHIFT                      0u
#define SIPI_CDR1_CDR_WIDTH                      32u
#define SIPI_CDR1_CDR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CDR1_CDR_SHIFT))&SIPI_CDR1_CDR_MASK)
/* CCR2 Bit Fields */
#define SIPI_CCR2_DEN_MASK                       0x1u
#define SIPI_CCR2_DEN_SHIFT                      0u
#define SIPI_CCR2_DEN_WIDTH                      1u
#define SIPI_CCR2_DEN(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_DEN_SHIFT))&SIPI_CCR2_DEN_MASK)
#define SIPI_CCR2_WRT_MASK                       0x2u
#define SIPI_CCR2_WRT_SHIFT                      1u
#define SIPI_CCR2_WRT_WIDTH                      1u
#define SIPI_CCR2_WRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_WRT_SHIFT))&SIPI_CCR2_WRT_MASK)
#define SIPI_CCR2_RRT_MASK                       0x4u
#define SIPI_CCR2_RRT_SHIFT                      2u
#define SIPI_CCR2_RRT_WIDTH                      1u
#define SIPI_CCR2_RRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_RRT_SHIFT))&SIPI_CCR2_RRT_MASK)
#define SIPI_CCR2_IDT_MASK                       0x8u
#define SIPI_CCR2_IDT_SHIFT                      3u
#define SIPI_CCR2_IDT_WIDTH                      1u
#define SIPI_CCR2_IDT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_IDT_SHIFT))&SIPI_CCR2_IDT_MASK)
#define SIPI_CCR2_ST_MASK                        0x10u
#define SIPI_CCR2_ST_SHIFT                       4u
#define SIPI_CCR2_ST_WIDTH                       1u
#define SIPI_CCR2_ST(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_ST_SHIFT))&SIPI_CCR2_ST_MASK)
#define SIPI_CCR2_CHEN_MASK                      0x20u
#define SIPI_CCR2_CHEN_SHIFT                     5u
#define SIPI_CCR2_CHEN_WIDTH                     1u
#define SIPI_CCR2_CHEN(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_CHEN_SHIFT))&SIPI_CCR2_CHEN_MASK)
#define SIPI_CCR2_WL_MASK                        0xC0u
#define SIPI_CCR2_WL_SHIFT                       6u
#define SIPI_CCR2_WL_WIDTH                       2u
#define SIPI_CCR2_WL(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_WL_SHIFT))&SIPI_CCR2_WL_MASK)
#define SIPI_CCR2_TC_MASK                        0x10000u
#define SIPI_CCR2_TC_SHIFT                       16u
#define SIPI_CCR2_TC_WIDTH                       1u
#define SIPI_CCR2_TC(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR2_TC_SHIFT))&SIPI_CCR2_TC_MASK)
/* CSR2 Bit Fields */
#define SIPI_CSR2_CB_MASK                        0x4u
#define SIPI_CSR2_CB_SHIFT                       2u
#define SIPI_CSR2_CB_WIDTH                       1u
#define SIPI_CSR2_CB(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CSR2_CB_SHIFT))&SIPI_CSR2_CB_MASK)
#define SIPI_CSR2_ACKR_MASK                      0x8u
#define SIPI_CSR2_ACKR_SHIFT                     3u
#define SIPI_CSR2_ACKR_WIDTH                     1u
#define SIPI_CSR2_ACKR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CSR2_ACKR_SHIFT))&SIPI_CSR2_ACKR_MASK)
#define SIPI_CSR2_TID_MASK                       0x70u
#define SIPI_CSR2_TID_SHIFT                      4u
#define SIPI_CSR2_TID_WIDTH                      3u
#define SIPI_CSR2_TID(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR2_TID_SHIFT))&SIPI_CSR2_TID_MASK)
#define SIPI_CSR2_RAR_MASK                       0x80u
#define SIPI_CSR2_RAR_SHIFT                      7u
#define SIPI_CSR2_RAR_WIDTH                      1u
#define SIPI_CSR2_RAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR2_RAR_SHIFT))&SIPI_CSR2_RAR_MASK)
/* CIR2 Bit Fields */
#define SIPI_CIR2_ACKIE_MASK                     0x1u
#define SIPI_CIR2_ACKIE_SHIFT                    0u
#define SIPI_CIR2_ACKIE_WIDTH                    1u
#define SIPI_CIR2_ACKIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR2_ACKIE_SHIFT))&SIPI_CIR2_ACKIE_MASK)
#define SIPI_CIR2_TIDIE_MASK                     0x2u
#define SIPI_CIR2_TIDIE_SHIFT                    1u
#define SIPI_CIR2_TIDIE_WIDTH                    1u
#define SIPI_CIR2_TIDIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR2_TIDIE_SHIFT))&SIPI_CIR2_TIDIE_MASK)
#define SIPI_CIR2_TOIE_MASK                      0x4u
#define SIPI_CIR2_TOIE_SHIFT                     2u
#define SIPI_CIR2_TOIE_WIDTH                     1u
#define SIPI_CIR2_TOIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR2_TOIE_SHIFT))&SIPI_CIR2_TOIE_MASK)
#define SIPI_CIR2_TCIE_MASK                      0x8u
#define SIPI_CIR2_TCIE_SHIFT                     3u
#define SIPI_CIR2_TCIE_WIDTH                     1u
#define SIPI_CIR2_TCIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR2_TCIE_SHIFT))&SIPI_CIR2_TCIE_MASK)
#define SIPI_CIR2_RAIE_MASK                      0x10u
#define SIPI_CIR2_RAIE_SHIFT                     4u
#define SIPI_CIR2_RAIE_WIDTH                     1u
#define SIPI_CIR2_RAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR2_RAIE_SHIFT))&SIPI_CIR2_RAIE_MASK)
#define SIPI_CIR2_WAIE_MASK                      0x20u
#define SIPI_CIR2_WAIE_SHIFT                     5u
#define SIPI_CIR2_WAIE_WIDTH                     1u
#define SIPI_CIR2_WAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR2_WAIE_SHIFT))&SIPI_CIR2_WAIE_MASK)
/* CTOR2 Bit Fields */
#define SIPI_CTOR2_TOR_MASK                      0xFFu
#define SIPI_CTOR2_TOR_SHIFT                     0u
#define SIPI_CTOR2_TOR_WIDTH                     8u
#define SIPI_CTOR2_TOR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CTOR2_TOR_SHIFT))&SIPI_CTOR2_TOR_MASK)
/* CCRC2 Bit Fields */
#define SIPI_CCRC2_CRCT_MASK                     0xFFFFu
#define SIPI_CCRC2_CRCT_SHIFT                    0u
#define SIPI_CCRC2_CRCT_WIDTH                    16u
#define SIPI_CCRC2_CRCT(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC2_CRCT_SHIFT))&SIPI_CCRC2_CRCT_MASK)
#define SIPI_CCRC2_CRCI_MASK                     0xFFFF0000u
#define SIPI_CCRC2_CRCI_SHIFT                    16u
#define SIPI_CCRC2_CRCI_WIDTH                    16u
#define SIPI_CCRC2_CRCI(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC2_CRCI_SHIFT))&SIPI_CCRC2_CRCI_MASK)
/* CAR2 Bit Fields */
#define SIPI_CAR2_CAR_MASK                       0xFFFFFFFFu
#define SIPI_CAR2_CAR_SHIFT                      0u
#define SIPI_CAR2_CAR_WIDTH                      32u
#define SIPI_CAR2_CAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CAR2_CAR_SHIFT))&SIPI_CAR2_CAR_MASK)
/* CDR2_ Bit Fields */
#define SIPI_CDR2__CDR2_MASK                     0xFFFFFFFFu
#define SIPI_CDR2__CDR2_SHIFT                    0u
#define SIPI_CDR2__CDR2_WIDTH                    32u
#define SIPI_CDR2__CDR2(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CDR2__CDR2_SHIFT))&SIPI_CDR2__CDR2_MASK)
/* CCR3 Bit Fields */
#define SIPI_CCR3_DEN_MASK                       0x1u
#define SIPI_CCR3_DEN_SHIFT                      0u
#define SIPI_CCR3_DEN_WIDTH                      1u
#define SIPI_CCR3_DEN(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_DEN_SHIFT))&SIPI_CCR3_DEN_MASK)
#define SIPI_CCR3_WRT_MASK                       0x2u
#define SIPI_CCR3_WRT_SHIFT                      1u
#define SIPI_CCR3_WRT_WIDTH                      1u
#define SIPI_CCR3_WRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_WRT_SHIFT))&SIPI_CCR3_WRT_MASK)
#define SIPI_CCR3_RRT_MASK                       0x4u
#define SIPI_CCR3_RRT_SHIFT                      2u
#define SIPI_CCR3_RRT_WIDTH                      1u
#define SIPI_CCR3_RRT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_RRT_SHIFT))&SIPI_CCR3_RRT_MASK)
#define SIPI_CCR3_IDT_MASK                       0x8u
#define SIPI_CCR3_IDT_SHIFT                      3u
#define SIPI_CCR3_IDT_WIDTH                      1u
#define SIPI_CCR3_IDT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_IDT_SHIFT))&SIPI_CCR3_IDT_MASK)
#define SIPI_CCR3_ST_MASK                        0x10u
#define SIPI_CCR3_ST_SHIFT                       4u
#define SIPI_CCR3_ST_WIDTH                       1u
#define SIPI_CCR3_ST(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_ST_SHIFT))&SIPI_CCR3_ST_MASK)
#define SIPI_CCR3_CHEN_MASK                      0x20u
#define SIPI_CCR3_CHEN_SHIFT                     5u
#define SIPI_CCR3_CHEN_WIDTH                     1u
#define SIPI_CCR3_CHEN(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_CHEN_SHIFT))&SIPI_CCR3_CHEN_MASK)
#define SIPI_CCR3_WL_MASK                        0xC0u
#define SIPI_CCR3_WL_SHIFT                       6u
#define SIPI_CCR3_WL_WIDTH                       2u
#define SIPI_CCR3_WL(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_WL_SHIFT))&SIPI_CCR3_WL_MASK)
#define SIPI_CCR3_TC_MASK                        0x10000u
#define SIPI_CCR3_TC_SHIFT                       16u
#define SIPI_CCR3_TC_WIDTH                       1u
#define SIPI_CCR3_TC(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CCR3_TC_SHIFT))&SIPI_CCR3_TC_MASK)
/* CSR3 Bit Fields */
#define SIPI_CSR3_CB_MASK                        0x4u
#define SIPI_CSR3_CB_SHIFT                       2u
#define SIPI_CSR3_CB_WIDTH                       1u
#define SIPI_CSR3_CB(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_CSR3_CB_SHIFT))&SIPI_CSR3_CB_MASK)
#define SIPI_CSR3_ACKR_MASK                      0x8u
#define SIPI_CSR3_ACKR_SHIFT                     3u
#define SIPI_CSR3_ACKR_WIDTH                     1u
#define SIPI_CSR3_ACKR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CSR3_ACKR_SHIFT))&SIPI_CSR3_ACKR_MASK)
#define SIPI_CSR3_TID_MASK                       0x70u
#define SIPI_CSR3_TID_SHIFT                      4u
#define SIPI_CSR3_TID_WIDTH                      3u
#define SIPI_CSR3_TID(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR3_TID_SHIFT))&SIPI_CSR3_TID_MASK)
#define SIPI_CSR3_RAR_MASK                       0x80u
