neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIPI_CSR3_RAR_SHIFT                      7u
#define SIPI_CSR3_RAR_WIDTH                      1u
#define SIPI_CSR3_RAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CSR3_RAR_SHIFT))&SIPI_CSR3_RAR_MASK)
/* CIR3 Bit Fields */
#define SIPI_CIR3_ACKIE_MASK                     0x1u
#define SIPI_CIR3_ACKIE_SHIFT                    0u
#define SIPI_CIR3_ACKIE_WIDTH                    1u
#define SIPI_CIR3_ACKIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR3_ACKIE_SHIFT))&SIPI_CIR3_ACKIE_MASK)
#define SIPI_CIR3_TIDIE_MASK                     0x2u
#define SIPI_CIR3_TIDIE_SHIFT                    1u
#define SIPI_CIR3_TIDIE_WIDTH                    1u
#define SIPI_CIR3_TIDIE(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CIR3_TIDIE_SHIFT))&SIPI_CIR3_TIDIE_MASK)
#define SIPI_CIR3_TOIE_MASK                      0x4u
#define SIPI_CIR3_TOIE_SHIFT                     2u
#define SIPI_CIR3_TOIE_WIDTH                     1u
#define SIPI_CIR3_TOIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR3_TOIE_SHIFT))&SIPI_CIR3_TOIE_MASK)
#define SIPI_CIR3_TCIE_MASK                      0x8u
#define SIPI_CIR3_TCIE_SHIFT                     3u
#define SIPI_CIR3_TCIE_WIDTH                     1u
#define SIPI_CIR3_TCIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR3_TCIE_SHIFT))&SIPI_CIR3_TCIE_MASK)
#define SIPI_CIR3_RAIE_MASK                      0x10u
#define SIPI_CIR3_RAIE_SHIFT                     4u
#define SIPI_CIR3_RAIE_WIDTH                     1u
#define SIPI_CIR3_RAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR3_RAIE_SHIFT))&SIPI_CIR3_RAIE_MASK)
#define SIPI_CIR3_WAIE_MASK                      0x20u
#define SIPI_CIR3_WAIE_SHIFT                     5u
#define SIPI_CIR3_WAIE_WIDTH                     1u
#define SIPI_CIR3_WAIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CIR3_WAIE_SHIFT))&SIPI_CIR3_WAIE_MASK)
/* CTOR3 Bit Fields */
#define SIPI_CTOR3_TOR_MASK                      0xFFu
#define SIPI_CTOR3_TOR_SHIFT                     0u
#define SIPI_CTOR3_TOR_WIDTH                     8u
#define SIPI_CTOR3_TOR(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_CTOR3_TOR_SHIFT))&SIPI_CTOR3_TOR_MASK)
/* CCRC3 Bit Fields */
#define SIPI_CCRC3_CRCT_MASK                     0xFFFFu
#define SIPI_CCRC3_CRCT_SHIFT                    0u
#define SIPI_CCRC3_CRCT_WIDTH                    16u
#define SIPI_CCRC3_CRCT(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC3_CRCT_SHIFT))&SIPI_CCRC3_CRCT_MASK)
#define SIPI_CCRC3_CRCI_MASK                     0xFFFF0000u
#define SIPI_CCRC3_CRCI_SHIFT                    16u
#define SIPI_CCRC3_CRCI_WIDTH                    16u
#define SIPI_CCRC3_CRCI(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_CCRC3_CRCI_SHIFT))&SIPI_CCRC3_CRCI_MASK)
/* CAR3 Bit Fields */
#define SIPI_CAR3_CAR_MASK                       0xFFFFFFFFu
#define SIPI_CAR3_CAR_SHIFT                      0u
#define SIPI_CAR3_CAR_WIDTH                      32u
#define SIPI_CAR3_CAR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CAR3_CAR_SHIFT))&SIPI_CAR3_CAR_MASK)
/* CDR3 Bit Fields */
#define SIPI_CDR3_CDR_MASK                       0xFFFFFFFFu
#define SIPI_CDR3_CDR_SHIFT                      0u
#define SIPI_CDR3_CDR_WIDTH                      32u
#define SIPI_CDR3_CDR(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_CDR3_CDR_SHIFT))&SIPI_CDR3_CDR_MASK)
/* MCR Bit Fields */
#define SIPI_MCR_SR_MASK                         0x1u
#define SIPI_MCR_SR_SHIFT                        0u
#define SIPI_MCR_SR_WIDTH                        1u
#define SIPI_MCR_SR(x)                           (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_SR_SHIFT))&SIPI_MCR_SR_MASK)
#define SIPI_MCR_MOEN_MASK                       0x2u
#define SIPI_MCR_MOEN_SHIFT                      1u
#define SIPI_MCR_MOEN_WIDTH                      1u
#define SIPI_MCR_MOEN(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_MOEN_SHIFT))&SIPI_MCR_MOEN_MASK)
#define SIPI_MCR_INIT_MASK                       0x4u
#define SIPI_MCR_INIT_SHIFT                      2u
#define SIPI_MCR_INIT_WIDTH                      1u
#define SIPI_MCR_INIT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_INIT_SHIFT))&SIPI_MCR_INIT_MASK)
#define SIPI_MCR_TEN_MASK                        0x8u
#define SIPI_MCR_TEN_SHIFT                       3u
#define SIPI_MCR_TEN_WIDTH                       1u
#define SIPI_MCR_TEN(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_TEN_SHIFT))&SIPI_MCR_TEN_MASK)
#define SIPI_MCR_CHNSB_MASK                      0x10u
#define SIPI_MCR_CHNSB_SHIFT                     4u
#define SIPI_MCR_CHNSB_WIDTH                     1u
#define SIPI_MCR_CHNSB(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_CHNSB_SHIFT))&SIPI_MCR_CHNSB_MASK)
#define SIPI_MCR_MCRIE_MASK                      0x200u
#define SIPI_MCR_MCRIE_SHIFT                     9u
#define SIPI_MCR_MCRIE_WIDTH                     1u
#define SIPI_MCR_MCRIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_MCRIE_SHIFT))&SIPI_MCR_MCRIE_MASK)
#define SIPI_MCR_CRCIE_MASK                      0x400u
#define SIPI_MCR_CRCIE_SHIFT                     10u
#define SIPI_MCR_CRCIE_WIDTH                     1u
#define SIPI_MCR_CRCIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_CRCIE_SHIFT))&SIPI_MCR_CRCIE_MASK)
#define SIPI_MCR_AID_MASK                        0xC000u
#define SIPI_MCR_AID_SHIFT                       14u
#define SIPI_MCR_AID_WIDTH                       2u
#define SIPI_MCR_AID(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_AID_SHIFT))&SIPI_MCR_AID_MASK)
#define SIPI_MCR_PRSCLR_MASK                     0x7FF0000u
#define SIPI_MCR_PRSCLR_SHIFT                    16u
#define SIPI_MCR_PRSCLR_WIDTH                    11u
#define SIPI_MCR_PRSCLR(x)                       (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_PRSCLR_SHIFT))&SIPI_MCR_PRSCLR_MASK)
#define SIPI_MCR_HALT_MASK                       0x20000000u
#define SIPI_MCR_HALT_SHIFT                      29u
#define SIPI_MCR_HALT_WIDTH                      1u
#define SIPI_MCR_HALT(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_HALT_SHIFT))&SIPI_MCR_HALT_MASK)
#define SIPI_MCR_FRZ_MASK                        0x80000000u
#define SIPI_MCR_FRZ_SHIFT                       31u
#define SIPI_MCR_FRZ_WIDTH                       1u
#define SIPI_MCR_FRZ(x)                          (((uint32_t)(((uint32_t)(x))<<SIPI_MCR_FRZ_SHIFT))&SIPI_MCR_FRZ_MASK)
/* SR Bit Fields */
#define SIPI_SR_STATE_MASK                       0xFu
#define SIPI_SR_STATE_SHIFT                      0u
#define SIPI_SR_STATE_WIDTH                      4u
#define SIPI_SR_STATE(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_SR_STATE_SHIFT))&SIPI_SR_STATE_MASK)
#define SIPI_SR_TE_MASK                          0xF0u
#define SIPI_SR_TE_SHIFT                         4u
#define SIPI_SR_TE_WIDTH                         4u
#define SIPI_SR_TE(x)                            (((uint32_t)(((uint32_t)(x))<<SIPI_SR_TE_SHIFT))&SIPI_SR_TE_MASK)
#define SIPI_SR_MCR_MASK                         0x200u
#define SIPI_SR_MCR_SHIFT                        9u
#define SIPI_SR_MCR_WIDTH                        1u
#define SIPI_SR_MCR(x)                           (((uint32_t)(((uint32_t)(x))<<SIPI_SR_MCR_SHIFT))&SIPI_SR_MCR_MASK)
#define SIPI_SR_GCRCE_MASK                       0x400u
#define SIPI_SR_GCRCE_SHIFT                      10u
#define SIPI_SR_GCRCE_WIDTH                      1u
#define SIPI_SR_GCRCE(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_SR_GCRCE_SHIFT))&SIPI_SR_GCRCE_MASK)
#define SIPI_SR_FRZACK_MASK                      0x80000000u
#define SIPI_SR_FRZACK_SHIFT                     31u
#define SIPI_SR_FRZACK_WIDTH                     1u
#define SIPI_SR_FRZACK(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_SR_FRZACK_SHIFT))&SIPI_SR_FRZACK_MASK)
/* MAXCR Bit Fields */
#define SIPI_MAXCR_MXCNT_MASK                    0xFFFFFFFCu
#define SIPI_MAXCR_MXCNT_SHIFT                   2u
#define SIPI_MAXCR_MXCNT_WIDTH                   30u
#define SIPI_MAXCR_MXCNT(x)                      (((uint32_t)(((uint32_t)(x))<<SIPI_MAXCR_MXCNT_SHIFT))&SIPI_MAXCR_MXCNT_MASK)
/* ARR Bit Fields */
#define SIPI_ARR_ADRLD_MASK                      0xFFFFFFFCu
#define SIPI_ARR_ADRLD_SHIFT                     2u
#define SIPI_ARR_ADRLD_WIDTH                     30u
#define SIPI_ARR_ADRLD(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ARR_ADRLD_SHIFT))&SIPI_ARR_ADRLD_MASK)
/* ACR Bit Fields */
#define SIPI_ACR_ADCNT_MASK                      0xFFFFFFFCu
#define SIPI_ACR_ADCNT_SHIFT                     2u
#define SIPI_ACR_ADCNT_WIDTH                     30u
#define SIPI_ACR_ADCNT(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ACR_ADCNT_SHIFT))&SIPI_ACR_ADCNT_MASK)
/* ERR Bit Fields */
#define SIPI_ERR_ACKE0_MASK                      0x1u
#define SIPI_ERR_ACKE0_SHIFT                     0u
#define SIPI_ERR_ACKE0_WIDTH                     1u
#define SIPI_ERR_ACKE0(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_ACKE0_SHIFT))&SIPI_ERR_ACKE0_MASK)
#define SIPI_ERR_TIDE0_MASK                      0x2u
#define SIPI_ERR_TIDE0_SHIFT                     1u
#define SIPI_ERR_TIDE0_WIDTH                     1u
#define SIPI_ERR_TIDE0(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TIDE0_SHIFT))&SIPI_ERR_TIDE0_MASK)
#define SIPI_ERR_TOE0_MASK                       0x4u
#define SIPI_ERR_TOE0_SHIFT                      2u
#define SIPI_ERR_TOE0_WIDTH                      1u
#define SIPI_ERR_TOE0(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TOE0_SHIFT))&SIPI_ERR_TOE0_MASK)
#define SIPI_ERR_ACKE1_MASK                      0x100u
#define SIPI_ERR_ACKE1_SHIFT                     8u
#define SIPI_ERR_ACKE1_WIDTH                     1u
#define SIPI_ERR_ACKE1(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_ACKE1_SHIFT))&SIPI_ERR_ACKE1_MASK)
#define SIPI_ERR_TIDE1_MASK                      0x200u
#define SIPI_ERR_TIDE1_SHIFT                     9u
#define SIPI_ERR_TIDE1_WIDTH                     1u
#define SIPI_ERR_TIDE1(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TIDE1_SHIFT))&SIPI_ERR_TIDE1_MASK)
#define SIPI_ERR_TOE1_MASK                       0x400u
#define SIPI_ERR_TOE1_SHIFT                      10u
#define SIPI_ERR_TOE1_WIDTH                      1u
#define SIPI_ERR_TOE1(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TOE1_SHIFT))&SIPI_ERR_TOE1_MASK)
#define SIPI_ERR_ACKE2_MASK                      0x10000u
#define SIPI_ERR_ACKE2_SHIFT                     16u
#define SIPI_ERR_ACKE2_WIDTH                     1u
#define SIPI_ERR_ACKE2(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_ACKE2_SHIFT))&SIPI_ERR_ACKE2_MASK)
#define SIPI_ERR_TIDE2_MASK                      0x20000u
#define SIPI_ERR_TIDE2_SHIFT                     17u
#define SIPI_ERR_TIDE2_WIDTH                     1u
#define SIPI_ERR_TIDE2(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TIDE2_SHIFT))&SIPI_ERR_TIDE2_MASK)
#define SIPI_ERR_TOE2_MASK                       0x40000u
#define SIPI_ERR_TOE2_SHIFT                      18u
#define SIPI_ERR_TOE2_WIDTH                      1u
#define SIPI_ERR_TOE2(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TOE2_SHIFT))&SIPI_ERR_TOE2_MASK)
#define SIPI_ERR_ACKE3_MASK                      0x1000000u
#define SIPI_ERR_ACKE3_SHIFT                     24u
#define SIPI_ERR_ACKE3_WIDTH                     1u
#define SIPI_ERR_ACKE3(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_ACKE3_SHIFT))&SIPI_ERR_ACKE3_MASK)
#define SIPI_ERR_TIDE3_MASK                      0x2000000u
#define SIPI_ERR_TIDE3_SHIFT                     25u
#define SIPI_ERR_TIDE3_WIDTH                     1u
#define SIPI_ERR_TIDE3(x)                        (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TIDE3_SHIFT))&SIPI_ERR_TIDE3_MASK)
#define SIPI_ERR_TOE3_MASK                       0x4000000u
#define SIPI_ERR_TOE3_SHIFT                      26u
#define SIPI_ERR_TOE3_WIDTH                      1u
#define SIPI_ERR_TOE3(x)                         (((uint32_t)(((uint32_t)(x))<<SIPI_ERR_TOE3_SHIFT))&SIPI_ERR_TOE3_MASK)

/*!
 * @}
 */ /* end of group SIPI_Register_Masks */


/*!
 * @}
 */ /* end of group SIPI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SIU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_Peripheral_Access_Layer SIU Peripheral Access Layer
 * @{
 */


/** SIU - Size of Registers Arrays */
#define SIU_PCR_COUNT                            512u
#define SIU_GPDO_COUNT                           512u
#define SIU_GPDIL_COUNT                          256u
#define SIU_TBG_CR_A_COUNT                       6u
#define SIU_TBG_CR_B_COUNT                       6u
#define SIU_PGPDO_COUNT                          16u
#define SIU_PGPDI_COUNT                          16u
#define SIU_MPGPDO_COUNT                         32u
#define SIU_DSPIx_COUNT                          4u
#define SIU_GPDI_COUNT                           512u

