neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** SIU - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __I  uint32_t MIDR;                              /**< MCU Identification Register, offset: 0x4 */
       uint8_t RESERVED_1[4];
  __IO uint32_t RSR;                               /**< Reset Status Register, offset: 0xC */
  __IO uint32_t SRCR;                              /**< System Reset Control Register, offset: 0x10 */
  __IO uint32_t EISR;                              /**< External IRQ Status Register, offset: 0x14 */
  __IO uint32_t DIRER;                             /**< DMA/Interrupt Request Enable Register, offset: 0x18 */
  __IO uint32_t DIRSR;                             /**< DMA/Interrupt Request Select Register, offset: 0x1C */
  __IO uint32_t OSR;                               /**< Overrun Status Register, offset: 0x20 */
  __IO uint32_t ORER;                              /**< Overrun Request Enable Register, offset: 0x24 */
  __IO uint32_t IREER;                             /**< IRQ Rising-Edge Event Enable Register, offset: 0x28 */
  __IO uint32_t IFEER;                             /**< IRQ Falling-Edge Event Enable Register, offset: 0x2C */
  __IO uint32_t IDFR;                              /**< IRQ Digital Filter Register, offset: 0x30 */
  __I  uint32_t IFIR;                              /**< IRQ Filtered Input Register, offset: 0x34 */
       uint8_t RESERVED_2[8];
  __IO uint16_t PCR[SIU_PCR_COUNT];                /**< Pad Configuration Register, array offset: 0x40, array step: 0x2 */
       uint8_t RESERVED_3[448];
  __IO uint8_t GPDO[SIU_GPDO_COUNT];               /**< GPIO Pin Data Output Register, array offset: 0x600, array step: 0x1 */
  __I  uint8_t GPDIL[SIU_GPDIL_COUNT];             /**< GPIO Pin Data Input Register (legacy), array offset: 0x800, array step: 0x1 */
       uint8_t RESERVED_4[4];
  __IO uint32_t EIISR;                             /**< External IRQ Input Select Register, offset: 0x904 */
  __IO uint32_t DISR;                              /**< DSPI Input Select Register, offset: 0x908 */
       uint8_t RESERVED_5[4];
  __IO uint32_t ISEL4;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x910 */
  __IO uint32_t ISEL5;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x914 */
  __IO uint32_t ISEL6;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x918 */
  __IO uint32_t ISEL7;                             /**< eQADC Command FIFO Trigger Source Registers, offset: 0x91C */
  __IO uint32_t ISEL8;                             /**< eTPU_A Input Select Register, offset: 0x920 */
  __IO uint32_t ISEL9;                             /**< eQADC Advance Trigger Source Register, offset: 0x924 */
  __IO uint32_t DECFIL1;                           /**< Decimation Filter Register 1, offset: 0x928 */
  __IO uint32_t DECFIL2;                           /**< Decimation Filter Register 2, offset: 0x92C */
  __IO uint32_t DECFIL3;                           /**< Decimation Filter Register 3, offset: 0x930 */
  __IO uint32_t DECFIL4;                           /**< Decimation Filter Register 4, offset: 0x934 */
  __IO uint32_t DECFIL5;                           /**< Decimation Filter Register 5, offset: 0x938 */
  __IO uint32_t REACTSR;                           /**< Reaction Module Trigger Selection Register, offset: 0x93C */
  __IO uint32_t SDGATE_SEL;                        /**< Sigma-Delta Gate Selection Register, offset: 0x940 */
  __IO uint32_t SDETPUA;                           /**< Sigma-Delta to eTPU_A Connection Configuration Register, offset: 0x944 */
  __IO uint32_t SDETPUB;                           /**< Sigma-Delta to eTPU_B Connection Configuration Register, offset: 0x948 */
  __IO uint32_t SDETPUC;                           /**< Sigma-Delta to eTPU_C Connection Configuration Register, offset: 0x94C */
  __IO uint32_t TBG_CR_A[SIU_TBG_CR_A_COUNT];      /**< Trigger Burst Generator Control Registers for eQADC_A, array offset: 0x950, array step: 0x4 */
  __IO uint32_t TBG_CR_B[SIU_TBG_CR_B_COUNT];      /**< Trigger Burst Generator Control Registers for eQADC_B, array offset: 0x968, array step: 0x4 */
       uint8_t RESERVED_6[4];
  __IO uint32_t ECCR;                              /**< External Clock Control Register, offset: 0x984 */
       uint8_t RESERVED_7[24];
  __IO uint32_t SYSDIV;                            /**< System Clock Register, offset: 0x9A0 */
  __IO uint32_t HLT1;                              /**< Halt Register 1, offset: 0x9A4 */
  __I  uint32_t HLTACK1;                           /**< Halt Acknowledge Register 1, offset: 0x9A8 */
  __IO uint32_t RSTVEC0;                           /**< Core0 Reset Vector Register, offset: 0x9AC */
  __IO uint32_t RSTVEC1;                           /**< Core1 Reset Vector Register, offset: 0x9B0 */
  __IO uint32_t C0PID;                             /**< Core0 PID mapping control register, offset: 0x9B4 */
  __IO uint32_t C1PID;                             /**< Core1 PID mapping control register, offset: 0x9B8 */
  __IO uint32_t HLT2;                              /**< Halt Register 2, offset: 0x9BC */
  __I  uint32_t HLTACK2;                           /**< Halt Acknowledge Register 2, offset: 0x9C0 */
  __IO uint32_t SDCLKCFG;                          /**< Sigma-Delta Clock Configuration Register, offset: 0x9C4 */
  __IO uint32_t LFCLKCFG;                          /**< LFAST Clock Configuration Register, offset: 0x9C8 */
  __IO uint32_t PSCLKCFG;                          /**< PSI5 Clock Configuration Register, offset: 0x9CC */
  __IO uint32_t RCR;                               /**< Reset Configuration Register, offset: 0x9D0 */
  __I  uint32_t LOCKSTEP;                          /**< Lock-Step Status Register, offset: 0x9D4 */
  __IO uint32_t PCSER;                             /**< Progressive Clock Switch Interrupt Enable Register, offset: 0x9D8 */
  __IO uint32_t PCSIFR;                            /**< Progressive Clock Switch Interrupt Flag Register, offset: 0x9DC */
  __IO uint32_t FECCR;                             /**< Fast Ethernet Controller Control Register, offset: 0x9E0 */
  __IO uint32_t ECCEIR;                            /**< ECC Error Injection Register, offset: 0x9E4 */
       uint8_t RESERVED_8[536];
  __IO uint32_t PGPDO[SIU_PGPDO_COUNT];            /**< Parallel GPIO Pin Data Output Registers, array offset: 0xC00, array step: 0x4 */
  __I  uint32_t PGPDI[SIU_PGPDI_COUNT];            /**< Parallel GPIO Pin Data Input Registers, array offset: 0xC40, array step: 0x4 */
  __O  uint32_t MPGPDO[SIU_MPGPDO_COUNT];          /**< Masked Parallel GPIO Pin Data Output Registers, array offset: 0xC80, array step: 0x4 */
  struct {                                         /* offset: 0xD00, array step: 0x8 */
    __IO uint32_t DSPIH;                             /**< Mask-Output High Register, array offset: 0xD00, array step: 0x8 */
    __IO uint32_t DSPIL;                             /**< Mask-Output Low Register, array offset: 0xD04, array step: 0x8 */
  } DSPIx[SIU_DSPIx_COUNT];
       uint8_t RESERVED_9[32];
  __IO uint32_t ETPUBA;                            /**< Serialized Output Signal Selection Register for DSPI_A, offset: 0xD40 */
  __IO uint32_t EMIOSA;                            /**< Serialized Output Signal Selection Register for DSPI_A, offset: 0xD44 */
  __IO uint32_t DSPIAHLA;                          /**< Serialized Output Signal Selection Register for DSPI_A, offset: 0xD48 */
       uint8_t RESERVED_10[4];
  __IO uint32_t ETPUAB;                            /**< Serialized Output Signal Selection Register for DSPI_B, offset: 0xD50 */
  __IO uint32_t EMIOSB;                            /**< Serialized Output Signal Selection Register for DSPI_B, offset: 0xD54 */
  __IO uint32_t DSPIBHLB;                          /**< Serialized Output Signal Selection Register for DSPI_B, offset: 0xD58 */
       uint8_t RESERVED_11[4];
  __IO uint32_t ETPUAC;                            /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD60 */
  __IO uint32_t EMIOSC;                            /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD64 */
  __IO uint32_t DSPICHLC;                          /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD68 */
  __IO uint32_t ETPUBC;                            /**< Serialized Output Signal Selection Register for DSPI_C, offset: 0xD6C */
  __IO uint32_t ETPUBD;                            /**< Serialized Output Signal Selection Register for DSPI_D, offset: 0xD70 */
  __IO uint32_t EMIOSD;                            /**< Serialized Output Signal Selection Register for DSPI_D, offset: 0xD74 */
  __IO uint32_t DSPIDHLD;                          /**< Serialized Output Signal Selection Register for DSPI_D, offset: 0xD78 */
       uint8_t RESERVED_12[132];
  __I  uint8_t GPDI[SIU_GPDI_COUNT];               /**< GPIO Pin Data Input Register, array offset: 0xE00, array step: 0x1 */
       uint8_t RESERVED_13[512];
  __IO uint32_t IMUX0;                             /**< Input Multiplexing Register0, offset: 0x1200 */
  __IO uint32_t IMUX1;                             /**< Input Multiplexing Register1, offset: 0x1204 */
  __IO uint32_t IMUX2;                             /**< Input Multiplexing Register2, offset: 0x1208 */
  __IO uint32_t IMUX3;                             /**< Input Multiplexing Register3, offset: 0x120C */
  __IO uint32_t IMUX4;                             /**< Input Multiplexing Register4, offset: 0x1210 */
  __IO uint32_t IMUX5;                             /**< Input Multiplexing Register5, offset: 0x1214 */
       uint8_t RESERVED_14[4];
  __IO uint32_t IMUX7;                             /**< Input Multiplexing Register7, offset: 0x121C */
       uint8_t RESERVED_15[8];
  __IO uint32_t IMUX10;                            /**< Input Multiplexing Register10, offset: 0x1228 */
       uint8_t RESERVED_16[4];
  __IO uint32_t IMUX12;                            /**< Input Multiplexing Register12, offset: 0x1230 */
} SIU_Type, *SIU_MemMapPtr;

 /** Number of instances of the SIU module. */
#define SIU_INSTANCE_COUNT                       (1u)


/* SIU - Peripheral instance base addresses */
/** Peripheral SIU base address */
#define SIU_BASE                                 (0xC3F90000u)
/** Peripheral SIU base pointer */
#define SIU                                      ((SIU_Type *)SIU_BASE)
/** Array initializer of SIU peripheral base addresses */
#define SIU_BASE_ADDRS                           { SIU_BASE }
/** Array initializer of SIU peripheral base pointers */
#define SIU_BASE_PTRS                            { SIU }

/* ----------------------------------------------------------------------------
   -- SIU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_Register_Masks SIU Register Masks
 * @{
 */

