neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* MIDR Bit Fields */
#define SIU_MIDR_MASKNUM_MINOR_MASK              0xFu
#define SIU_MIDR_MASKNUM_MINOR_SHIFT             0u
#define SIU_MIDR_MASKNUM_MINOR_WIDTH             4u
#define SIU_MIDR_MASKNUM_MINOR(x)                (((uint32_t)(((uint32_t)(x))<<SIU_MIDR_MASKNUM_MINOR_SHIFT))&SIU_MIDR_MASKNUM_MINOR_MASK)
#define SIU_MIDR_MASKNUM_MAJOR_MASK              0xF0u
#define SIU_MIDR_MASKNUM_MAJOR_SHIFT             4u
#define SIU_MIDR_MASKNUM_MAJOR_WIDTH             4u
#define SIU_MIDR_MASKNUM_MAJOR(x)                (((uint32_t)(((uint32_t)(x))<<SIU_MIDR_MASKNUM_MAJOR_SHIFT))&SIU_MIDR_MASKNUM_MAJOR_MASK)
#define SIU_MIDR_PKG_MASK                        0xF000u
#define SIU_MIDR_PKG_SHIFT                       12u
#define SIU_MIDR_PKG_WIDTH                       4u
#define SIU_MIDR_PKG(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_MIDR_PKG_SHIFT))&SIU_MIDR_PKG_MASK)
#define SIU_MIDR_PARTNUM_MASK                    0xFFFF0000u
#define SIU_MIDR_PARTNUM_SHIFT                   16u
#define SIU_MIDR_PARTNUM_WIDTH                   16u
#define SIU_MIDR_PARTNUM(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MIDR_PARTNUM_SHIFT))&SIU_MIDR_PARTNUM_MASK)
/* RSR Bit Fields */
#define SIU_RSR_RGF_MASK                         0x1u
#define SIU_RSR_RGF_SHIFT                        0u
#define SIU_RSR_RGF_WIDTH                        1u
#define SIU_RSR_RGF(x)                           (((uint32_t)(((uint32_t)(x))<<SIU_RSR_RGF_SHIFT))&SIU_RSR_RGF_MASK)
#define SIU_RSR_BOOTCFG_MASK                     0x6u
#define SIU_RSR_BOOTCFG_SHIFT                    1u
#define SIU_RSR_BOOTCFG_WIDTH                    2u
#define SIU_RSR_BOOTCFG(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_RSR_BOOTCFG_SHIFT))&SIU_RSR_BOOTCFG_MASK)
#define SIU_RSR_ABR_MASK                         0x8u
#define SIU_RSR_ABR_SHIFT                        3u
#define SIU_RSR_ABR_WIDTH                        1u
#define SIU_RSR_ABR(x)                           (((uint32_t)(((uint32_t)(x))<<SIU_RSR_ABR_SHIFT))&SIU_RSR_ABR_MASK)
#define SIU_RSR_XOSCHIGH_MASK                    0x10u
#define SIU_RSR_XOSCHIGH_SHIFT                   4u
#define SIU_RSR_XOSCHIGH_WIDTH                   1u
#define SIU_RSR_XOSCHIGH(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_RSR_XOSCHIGH_SHIFT))&SIU_RSR_XOSCHIGH_MASK)
#define SIU_RSR_XOSC_MASK                        0x80u
#define SIU_RSR_XOSC_SHIFT                       7u
#define SIU_RSR_XOSC_WIDTH                       1u
#define SIU_RSR_XOSC(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_RSR_XOSC_SHIFT))&SIU_RSR_XOSC_MASK)
#define SIU_RSR_WKPCFG_MASK                      0x8000u
#define SIU_RSR_WKPCFG_SHIFT                     15u
#define SIU_RSR_WKPCFG_WIDTH                     1u
#define SIU_RSR_WKPCFG(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_RSR_WKPCFG_SHIFT))&SIU_RSR_WKPCFG_MASK)
#define SIU_RSR_SERF_MASK                        0x10000u
#define SIU_RSR_SERF_SHIFT                       16u
#define SIU_RSR_SERF_WIDTH                       1u
#define SIU_RSR_SERF(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_RSR_SERF_SHIFT))&SIU_RSR_SERF_MASK)
#define SIU_RSR_SSRS_MASK                        0x20000u
#define SIU_RSR_SSRS_SHIFT                       17u
#define SIU_RSR_SSRS_WIDTH                       1u
#define SIU_RSR_SSRS(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_RSR_SSRS_SHIFT))&SIU_RSR_SSRS_MASK)
#define SIU_RSR_STCURS_MASK                      0x40000u
#define SIU_RSR_STCURS_SHIFT                     18u
#define SIU_RSR_STCURS_WIDTH                     1u
#define SIU_RSR_STCURS(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_RSR_STCURS_SHIFT))&SIU_RSR_STCURS_MASK)
#define SIU_RSR_FCCURS_MASK                      0x80000u
#define SIU_RSR_FCCURS_SHIFT                     19u
#define SIU_RSR_FCCURS_WIDTH                     1u
#define SIU_RSR_FCCURS(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_RSR_FCCURS_SHIFT))&SIU_RSR_FCCURS_MASK)
#define SIU_RSR_FOSURS_MASK                      0x100000u
#define SIU_RSR_FOSURS_SHIFT                     20u
#define SIU_RSR_FOSURS_WIDTH                     1u
#define SIU_RSR_FOSURS(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_RSR_FOSURS_SHIFT))&SIU_RSR_FOSURS_MASK)
#define SIU_RSR_CPURS_MASK                       0x400000u
#define SIU_RSR_CPURS_SHIFT                      22u
#define SIU_RSR_CPURS_WIDTH                      1u
#define SIU_RSR_CPURS(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_RSR_CPURS_SHIFT))&SIU_RSR_CPURS_MASK)
#define SIU_RSR_ERS_MASK                         0x40000000u
#define SIU_RSR_ERS_SHIFT                        30u
#define SIU_RSR_ERS_WIDTH                        1u
#define SIU_RSR_ERS(x)                           (((uint32_t)(((uint32_t)(x))<<SIU_RSR_ERS_SHIFT))&SIU_RSR_ERS_MASK)
#define SIU_RSR_PORS_MASK                        0x80000000u
#define SIU_RSR_PORS_SHIFT                       31u
#define SIU_RSR_PORS_WIDTH                       1u
#define SIU_RSR_PORS(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_RSR_PORS_SHIFT))&SIU_RSR_PORS_MASK)
/* SRCR Bit Fields */
#define SIU_SRCR_SER_MASK                        0x40000000u
#define SIU_SRCR_SER_SHIFT                       30u
#define SIU_SRCR_SER_WIDTH                       1u
#define SIU_SRCR_SER(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_SRCR_SER_SHIFT))&SIU_SRCR_SER_MASK)
#define SIU_SRCR_SSR_MASK                        0x80000000u
#define SIU_SRCR_SSR_SHIFT                       31u
#define SIU_SRCR_SSR_WIDTH                       1u
#define SIU_SRCR_SSR(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_SRCR_SSR_SHIFT))&SIU_SRCR_SSR_MASK)
/* EISR Bit Fields */
#define SIU_EISR_EIF0_MASK                       0x1u
#define SIU_EISR_EIF0_SHIFT                      0u
#define SIU_EISR_EIF0_WIDTH                      1u
#define SIU_EISR_EIF0(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF0_SHIFT))&SIU_EISR_EIF0_MASK)
#define SIU_EISR_EIF1_MASK                       0x2u
#define SIU_EISR_EIF1_SHIFT                      1u
#define SIU_EISR_EIF1_WIDTH                      1u
#define SIU_EISR_EIF1(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF1_SHIFT))&SIU_EISR_EIF1_MASK)
#define SIU_EISR_EIF2_MASK                       0x4u
#define SIU_EISR_EIF2_SHIFT                      2u
#define SIU_EISR_EIF2_WIDTH                      1u
#define SIU_EISR_EIF2(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF2_SHIFT))&SIU_EISR_EIF2_MASK)
#define SIU_EISR_EIF3_MASK                       0x8u
#define SIU_EISR_EIF3_SHIFT                      3u
#define SIU_EISR_EIF3_WIDTH                      1u
#define SIU_EISR_EIF3(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF3_SHIFT))&SIU_EISR_EIF3_MASK)
#define SIU_EISR_EIF4_MASK                       0x10u
#define SIU_EISR_EIF4_SHIFT                      4u
#define SIU_EISR_EIF4_WIDTH                      1u
#define SIU_EISR_EIF4(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF4_SHIFT))&SIU_EISR_EIF4_MASK)
#define SIU_EISR_EIF5_MASK                       0x20u
#define SIU_EISR_EIF5_SHIFT                      5u
#define SIU_EISR_EIF5_WIDTH                      1u
#define SIU_EISR_EIF5(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF5_SHIFT))&SIU_EISR_EIF5_MASK)
#define SIU_EISR_EIF6_MASK                       0x40u
#define SIU_EISR_EIF6_SHIFT                      6u
#define SIU_EISR_EIF6_WIDTH                      1u
#define SIU_EISR_EIF6(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF6_SHIFT))&SIU_EISR_EIF6_MASK)
#define SIU_EISR_EIF7_MASK                       0x80u
#define SIU_EISR_EIF7_SHIFT                      7u
#define SIU_EISR_EIF7_WIDTH                      1u
#define SIU_EISR_EIF7(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF7_SHIFT))&SIU_EISR_EIF7_MASK)
#define SIU_EISR_EIF8_MASK                       0x100u
#define SIU_EISR_EIF8_SHIFT                      8u
#define SIU_EISR_EIF8_WIDTH                      1u
#define SIU_EISR_EIF8(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF8_SHIFT))&SIU_EISR_EIF8_MASK)
#define SIU_EISR_EIF9_MASK                       0x200u
#define SIU_EISR_EIF9_SHIFT                      9u
#define SIU_EISR_EIF9_WIDTH                      1u
#define SIU_EISR_EIF9(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF9_SHIFT))&SIU_EISR_EIF9_MASK)
#define SIU_EISR_EIF10_MASK                      0x400u
#define SIU_EISR_EIF10_SHIFT                     10u
#define SIU_EISR_EIF10_WIDTH                     1u
#define SIU_EISR_EIF10(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF10_SHIFT))&SIU_EISR_EIF10_MASK)
#define SIU_EISR_EIF11_MASK                      0x800u
#define SIU_EISR_EIF11_SHIFT                     11u
#define SIU_EISR_EIF11_WIDTH                     1u
#define SIU_EISR_EIF11(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF11_SHIFT))&SIU_EISR_EIF11_MASK)
#define SIU_EISR_EIF12_MASK                      0x1000u
#define SIU_EISR_EIF12_SHIFT                     12u
#define SIU_EISR_EIF12_WIDTH                     1u
#define SIU_EISR_EIF12(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF12_SHIFT))&SIU_EISR_EIF12_MASK)
#define SIU_EISR_EIF13_MASK                      0x2000u
#define SIU_EISR_EIF13_SHIFT                     13u
#define SIU_EISR_EIF13_WIDTH                     1u
#define SIU_EISR_EIF13(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF13_SHIFT))&SIU_EISR_EIF13_MASK)
#define SIU_EISR_EIF14_MASK                      0x4000u
#define SIU_EISR_EIF14_SHIFT                     14u
#define SIU_EISR_EIF14_WIDTH                     1u
#define SIU_EISR_EIF14(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF14_SHIFT))&SIU_EISR_EIF14_MASK)
#define SIU_EISR_EIF15_MASK                      0x8000u
#define SIU_EISR_EIF15_SHIFT                     15u
#define SIU_EISR_EIF15_WIDTH                     1u
#define SIU_EISR_EIF15(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_EISR_EIF15_SHIFT))&SIU_EISR_EIF15_MASK)
#define SIU_EISR_NMI1_MASK                       0x40000000u
#define SIU_EISR_NMI1_SHIFT                      30u
#define SIU_EISR_NMI1_WIDTH                      1u
#define SIU_EISR_NMI1(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_NMI1_SHIFT))&SIU_EISR_NMI1_MASK)
#define SIU_EISR_NMI0_MASK                       0x80000000u
#define SIU_EISR_NMI0_SHIFT                      31u
#define SIU_EISR_NMI0_WIDTH                      1u
#define SIU_EISR_NMI0(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_EISR_NMI0_SHIFT))&SIU_EISR_NMI0_MASK)
/* DIRER Bit Fields */
#define SIU_DIRER_EIRE0_MASK                     0x1u
#define SIU_DIRER_EIRE0_SHIFT                    0u
#define SIU_DIRER_EIRE0_WIDTH                    1u
#define SIU_DIRER_EIRE0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE0_SHIFT))&SIU_DIRER_EIRE0_MASK)
#define SIU_DIRER_EIRE1_MASK                     0x2u
#define SIU_DIRER_EIRE1_SHIFT                    1u
#define SIU_DIRER_EIRE1_WIDTH                    1u
#define SIU_DIRER_EIRE1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE1_SHIFT))&SIU_DIRER_EIRE1_MASK)
#define SIU_DIRER_EIRE2_MASK                     0x4u
#define SIU_DIRER_EIRE2_SHIFT                    2u
#define SIU_DIRER_EIRE2_WIDTH                    1u
#define SIU_DIRER_EIRE2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE2_SHIFT))&SIU_DIRER_EIRE2_MASK)
#define SIU_DIRER_EIRE3_MASK                     0x8u
#define SIU_DIRER_EIRE3_SHIFT                    3u
#define SIU_DIRER_EIRE3_WIDTH                    1u
#define SIU_DIRER_EIRE3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE3_SHIFT))&SIU_DIRER_EIRE3_MASK)
#define SIU_DIRER_EIRE4_MASK                     0x10u
#define SIU_DIRER_EIRE4_SHIFT                    4u
#define SIU_DIRER_EIRE4_WIDTH                    1u
#define SIU_DIRER_EIRE4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE4_SHIFT))&SIU_DIRER_EIRE4_MASK)
#define SIU_DIRER_EIRE5_MASK                     0x20u
#define SIU_DIRER_EIRE5_SHIFT                    5u
#define SIU_DIRER_EIRE5_WIDTH                    1u
#define SIU_DIRER_EIRE5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE5_SHIFT))&SIU_DIRER_EIRE5_MASK)
#define SIU_DIRER_EIRE6_MASK                     0x40u
#define SIU_DIRER_EIRE6_SHIFT                    6u
#define SIU_DIRER_EIRE6_WIDTH                    1u
#define SIU_DIRER_EIRE6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE6_SHIFT))&SIU_DIRER_EIRE6_MASK)
#define SIU_DIRER_EIRE7_MASK                     0x80u
#define SIU_DIRER_EIRE7_SHIFT                    7u
#define SIU_DIRER_EIRE7_WIDTH                    1u
#define SIU_DIRER_EIRE7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE7_SHIFT))&SIU_DIRER_EIRE7_MASK)
#define SIU_DIRER_EIRE8_MASK                     0x100u
#define SIU_DIRER_EIRE8_SHIFT                    8u
#define SIU_DIRER_EIRE8_WIDTH                    1u
#define SIU_DIRER_EIRE8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE8_SHIFT))&SIU_DIRER_EIRE8_MASK)
#define SIU_DIRER_EIRE9_MASK                     0x200u
#define SIU_DIRER_EIRE9_SHIFT                    9u
#define SIU_DIRER_EIRE9_WIDTH                    1u
#define SIU_DIRER_EIRE9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE9_SHIFT))&SIU_DIRER_EIRE9_MASK)
#define SIU_DIRER_EIRE10_MASK                    0x400u
#define SIU_DIRER_EIRE10_SHIFT                   10u
#define SIU_DIRER_EIRE10_WIDTH                   1u
#define SIU_DIRER_EIRE10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE10_SHIFT))&SIU_DIRER_EIRE10_MASK)
#define SIU_DIRER_EIRE11_MASK                    0x800u
#define SIU_DIRER_EIRE11_SHIFT                   11u
#define SIU_DIRER_EIRE11_WIDTH                   1u
#define SIU_DIRER_EIRE11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE11_SHIFT))&SIU_DIRER_EIRE11_MASK)
#define SIU_DIRER_EIRE12_MASK                    0x1000u
#define SIU_DIRER_EIRE12_SHIFT                   12u
#define SIU_DIRER_EIRE12_WIDTH                   1u
#define SIU_DIRER_EIRE12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE12_SHIFT))&SIU_DIRER_EIRE12_MASK)
#define SIU_DIRER_EIRE13_MASK                    0x2000u
#define SIU_DIRER_EIRE13_SHIFT                   13u
#define SIU_DIRER_EIRE13_WIDTH                   1u
#define SIU_DIRER_EIRE13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE13_SHIFT))&SIU_DIRER_EIRE13_MASK)
#define SIU_DIRER_EIRE14_MASK                    0x4000u
#define SIU_DIRER_EIRE14_SHIFT                   14u
#define SIU_DIRER_EIRE14_WIDTH                   1u
#define SIU_DIRER_EIRE14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE14_SHIFT))&SIU_DIRER_EIRE14_MASK)
#define SIU_DIRER_EIRE15_MASK                    0x8000u
#define SIU_DIRER_EIRE15_SHIFT                   15u
#define SIU_DIRER_EIRE15_WIDTH                   1u
#define SIU_DIRER_EIRE15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_EIRE15_SHIFT))&SIU_DIRER_EIRE15_MASK)
#define SIU_DIRER_NMISEL1_MASK                   0x400000u
#define SIU_DIRER_NMISEL1_SHIFT                  22u
#define SIU_DIRER_NMISEL1_WIDTH                  1u
#define SIU_DIRER_NMISEL1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_NMISEL1_SHIFT))&SIU_DIRER_NMISEL1_MASK)
#define SIU_DIRER_NMISEL0_MASK                   0x800000u
#define SIU_DIRER_NMISEL0_SHIFT                  23u
#define SIU_DIRER_NMISEL0_WIDTH                  1u
#define SIU_DIRER_NMISEL0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_NMISEL0_SHIFT))&SIU_DIRER_NMISEL0_MASK)
#define SIU_DIRER_NMISEL7_MASK                   0x40000000u
#define SIU_DIRER_NMISEL7_SHIFT                  30u
#define SIU_DIRER_NMISEL7_WIDTH                  1u
#define SIU_DIRER_NMISEL7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_NMISEL7_SHIFT))&SIU_DIRER_NMISEL7_MASK)
#define SIU_DIRER_NMISEL8_MASK                   0x80000000u
#define SIU_DIRER_NMISEL8_SHIFT                  31u
#define SIU_DIRER_NMISEL8_WIDTH                  1u
#define SIU_DIRER_NMISEL8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DIRER_NMISEL8_SHIFT))&SIU_DIRER_NMISEL8_MASK)
/* DIRSR Bit Fields */
#define SIU_DIRSR_DIRS0_MASK                     0x1u
#define SIU_DIRSR_DIRS0_SHIFT                    0u
#define SIU_DIRSR_DIRS0_WIDTH                    1u
#define SIU_DIRSR_DIRS0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRSR_DIRS0_SHIFT))&SIU_DIRSR_DIRS0_MASK)
#define SIU_DIRSR_DIRS1_MASK                     0x2u
#define SIU_DIRSR_DIRS1_SHIFT                    1u
#define SIU_DIRSR_DIRS1_WIDTH                    1u
#define SIU_DIRSR_DIRS1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRSR_DIRS1_SHIFT))&SIU_DIRSR_DIRS1_MASK)
#define SIU_DIRSR_DIRS2_MASK                     0x4u
#define SIU_DIRSR_DIRS2_SHIFT                    2u
#define SIU_DIRSR_DIRS2_WIDTH                    1u
#define SIU_DIRSR_DIRS2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRSR_DIRS2_SHIFT))&SIU_DIRSR_DIRS2_MASK)
#define SIU_DIRSR_DIRS3_MASK                     0x8u
#define SIU_DIRSR_DIRS3_SHIFT                    3u
#define SIU_DIRSR_DIRS3_WIDTH                    1u
#define SIU_DIRSR_DIRS3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DIRSR_DIRS3_SHIFT))&SIU_DIRSR_DIRS3_MASK)
/* OSR Bit Fields */
#define SIU_OSR_OVF0_MASK                        0x1u
#define SIU_OSR_OVF0_SHIFT                       0u
#define SIU_OSR_OVF0_WIDTH                       1u
#define SIU_OSR_OVF0(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF0_SHIFT))&SIU_OSR_OVF0_MASK)
#define SIU_OSR_OVF1_MASK                        0x2u
#define SIU_OSR_OVF1_SHIFT                       1u
#define SIU_OSR_OVF1_WIDTH                       1u
#define SIU_OSR_OVF1(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF1_SHIFT))&SIU_OSR_OVF1_MASK)
#define SIU_OSR_OVF2_MASK                        0x4u
#define SIU_OSR_OVF2_SHIFT                       2u
#define SIU_OSR_OVF2_WIDTH                       1u
#define SIU_OSR_OVF2(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF2_SHIFT))&SIU_OSR_OVF2_MASK)
#define SIU_OSR_OVF3_MASK                        0x8u
#define SIU_OSR_OVF3_SHIFT                       3u
#define SIU_OSR_OVF3_WIDTH                       1u
#define SIU_OSR_OVF3(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF3_SHIFT))&SIU_OSR_OVF3_MASK)
#define SIU_OSR_OVF4_MASK                        0x10u
#define SIU_OSR_OVF4_SHIFT                       4u
#define SIU_OSR_OVF4_WIDTH                       1u
#define SIU_OSR_OVF4(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF4_SHIFT))&SIU_OSR_OVF4_MASK)
#define SIU_OSR_OVF5_MASK                        0x20u
#define SIU_OSR_OVF5_SHIFT                       5u
#define SIU_OSR_OVF5_WIDTH                       1u
#define SIU_OSR_OVF5(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF5_SHIFT))&SIU_OSR_OVF5_MASK)
#define SIU_OSR_OVF6_MASK                        0x40u
#define SIU_OSR_OVF6_SHIFT                       6u
#define SIU_OSR_OVF6_WIDTH                       1u
#define SIU_OSR_OVF6(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF6_SHIFT))&SIU_OSR_OVF6_MASK)
#define SIU_OSR_OVF7_MASK                        0x80u
#define SIU_OSR_OVF7_SHIFT                       7u
#define SIU_OSR_OVF7_WIDTH                       1u
#define SIU_OSR_OVF7(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF7_SHIFT))&SIU_OSR_OVF7_MASK)
#define SIU_OSR_OVF8_MASK                        0x100u
#define SIU_OSR_OVF8_SHIFT                       8u
#define SIU_OSR_OVF8_WIDTH                       1u
#define SIU_OSR_OVF8(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF8_SHIFT))&SIU_OSR_OVF8_MASK)
#define SIU_OSR_OVF9_MASK                        0x200u
#define SIU_OSR_OVF9_SHIFT                       9u
#define SIU_OSR_OVF9_WIDTH                       1u
#define SIU_OSR_OVF9(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF9_SHIFT))&SIU_OSR_OVF9_MASK)
#define SIU_OSR_OVF10_MASK                       0x400u
#define SIU_OSR_OVF10_SHIFT                      10u
#define SIU_OSR_OVF10_WIDTH                      1u
#define SIU_OSR_OVF10(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF10_SHIFT))&SIU_OSR_OVF10_MASK)
#define SIU_OSR_OVF11_MASK                       0x800u
#define SIU_OSR_OVF11_SHIFT                      11u
#define SIU_OSR_OVF11_WIDTH                      1u
#define SIU_OSR_OVF11(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF11_SHIFT))&SIU_OSR_OVF11_MASK)
#define SIU_OSR_OVF12_MASK                       0x1000u
#define SIU_OSR_OVF12_SHIFT                      12u
#define SIU_OSR_OVF12_WIDTH                      1u
#define SIU_OSR_OVF12(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF12_SHIFT))&SIU_OSR_OVF12_MASK)
#define SIU_OSR_OVF13_MASK                       0x2000u
#define SIU_OSR_OVF13_SHIFT                      13u
#define SIU_OSR_OVF13_WIDTH                      1u
#define SIU_OSR_OVF13(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF13_SHIFT))&SIU_OSR_OVF13_MASK)
#define SIU_OSR_OVF14_MASK                       0x4000u
#define SIU_OSR_OVF14_SHIFT                      14u
#define SIU_OSR_OVF14_WIDTH                      1u
#define SIU_OSR_OVF14(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF14_SHIFT))&SIU_OSR_OVF14_MASK)
#define SIU_OSR_OVF15_MASK                       0x8000u
#define SIU_OSR_OVF15_SHIFT                      15u
#define SIU_OSR_OVF15_WIDTH                      1u
#define SIU_OSR_OVF15(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_OSR_OVF15_SHIFT))&SIU_OSR_OVF15_MASK)
/* ORER Bit Fields */
#define SIU_ORER_ORE0_MASK                       0x1u
#define SIU_ORER_ORE0_SHIFT                      0u
#define SIU_ORER_ORE0_WIDTH                      1u
#define SIU_ORER_ORE0(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE0_SHIFT))&SIU_ORER_ORE0_MASK)
#define SIU_ORER_ORE1_MASK                       0x2u
#define SIU_ORER_ORE1_SHIFT                      1u
#define SIU_ORER_ORE1_WIDTH                      1u
#define SIU_ORER_ORE1(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE1_SHIFT))&SIU_ORER_ORE1_MASK)
#define SIU_ORER_ORE2_MASK                       0x4u
#define SIU_ORER_ORE2_SHIFT                      2u
#define SIU_ORER_ORE2_WIDTH                      1u
#define SIU_ORER_ORE2(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE2_SHIFT))&SIU_ORER_ORE2_MASK)
#define SIU_ORER_ORE3_MASK                       0x8u
#define SIU_ORER_ORE3_SHIFT                      3u
#define SIU_ORER_ORE3_WIDTH                      1u
#define SIU_ORER_ORE3(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE3_SHIFT))&SIU_ORER_ORE3_MASK)
#define SIU_ORER_ORE4_MASK                       0x10u
#define SIU_ORER_ORE4_SHIFT                      4u
#define SIU_ORER_ORE4_WIDTH                      1u
#define SIU_ORER_ORE4(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE4_SHIFT))&SIU_ORER_ORE4_MASK)
#define SIU_ORER_ORE5_MASK                       0x20u
#define SIU_ORER_ORE5_SHIFT                      5u
#define SIU_ORER_ORE5_WIDTH                      1u
#define SIU_ORER_ORE5(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE5_SHIFT))&SIU_ORER_ORE5_MASK)
