neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_ORER_ORE6_MASK                       0x40u
#define SIU_ORER_ORE6_SHIFT                      6u
#define SIU_ORER_ORE6_WIDTH                      1u
#define SIU_ORER_ORE6(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE6_SHIFT))&SIU_ORER_ORE6_MASK)
#define SIU_ORER_ORE7_MASK                       0x80u
#define SIU_ORER_ORE7_SHIFT                      7u
#define SIU_ORER_ORE7_WIDTH                      1u
#define SIU_ORER_ORE7(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE7_SHIFT))&SIU_ORER_ORE7_MASK)
#define SIU_ORER_ORE8_MASK                       0x100u
#define SIU_ORER_ORE8_SHIFT                      8u
#define SIU_ORER_ORE8_WIDTH                      1u
#define SIU_ORER_ORE8(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE8_SHIFT))&SIU_ORER_ORE8_MASK)
#define SIU_ORER_ORE9_MASK                       0x200u
#define SIU_ORER_ORE9_SHIFT                      9u
#define SIU_ORER_ORE9_WIDTH                      1u
#define SIU_ORER_ORE9(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE9_SHIFT))&SIU_ORER_ORE9_MASK)
#define SIU_ORER_ORE10_MASK                      0x400u
#define SIU_ORER_ORE10_SHIFT                     10u
#define SIU_ORER_ORE10_WIDTH                     1u
#define SIU_ORER_ORE10(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE10_SHIFT))&SIU_ORER_ORE10_MASK)
#define SIU_ORER_ORE11_MASK                      0x800u
#define SIU_ORER_ORE11_SHIFT                     11u
#define SIU_ORER_ORE11_WIDTH                     1u
#define SIU_ORER_ORE11(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE11_SHIFT))&SIU_ORER_ORE11_MASK)
#define SIU_ORER_ORE12_MASK                      0x1000u
#define SIU_ORER_ORE12_SHIFT                     12u
#define SIU_ORER_ORE12_WIDTH                     1u
#define SIU_ORER_ORE12(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE12_SHIFT))&SIU_ORER_ORE12_MASK)
#define SIU_ORER_ORE13_MASK                      0x2000u
#define SIU_ORER_ORE13_SHIFT                     13u
#define SIU_ORER_ORE13_WIDTH                     1u
#define SIU_ORER_ORE13(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE13_SHIFT))&SIU_ORER_ORE13_MASK)
#define SIU_ORER_ORE14_MASK                      0x4000u
#define SIU_ORER_ORE14_SHIFT                     14u
#define SIU_ORER_ORE14_WIDTH                     1u
#define SIU_ORER_ORE14(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE14_SHIFT))&SIU_ORER_ORE14_MASK)
#define SIU_ORER_ORE15_MASK                      0x8000u
#define SIU_ORER_ORE15_SHIFT                     15u
#define SIU_ORER_ORE15_WIDTH                     1u
#define SIU_ORER_ORE15(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_ORER_ORE15_SHIFT))&SIU_ORER_ORE15_MASK)
/* IREER Bit Fields */
#define SIU_IREER_IREE0_MASK                     0x1u
#define SIU_IREER_IREE0_SHIFT                    0u
#define SIU_IREER_IREE0_WIDTH                    1u
#define SIU_IREER_IREE0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE0_SHIFT))&SIU_IREER_IREE0_MASK)
#define SIU_IREER_IREE1_MASK                     0x2u
#define SIU_IREER_IREE1_SHIFT                    1u
#define SIU_IREER_IREE1_WIDTH                    1u
#define SIU_IREER_IREE1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE1_SHIFT))&SIU_IREER_IREE1_MASK)
#define SIU_IREER_IREE2_MASK                     0x4u
#define SIU_IREER_IREE2_SHIFT                    2u
#define SIU_IREER_IREE2_WIDTH                    1u
#define SIU_IREER_IREE2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE2_SHIFT))&SIU_IREER_IREE2_MASK)
#define SIU_IREER_IREE3_MASK                     0x8u
#define SIU_IREER_IREE3_SHIFT                    3u
#define SIU_IREER_IREE3_WIDTH                    1u
#define SIU_IREER_IREE3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE3_SHIFT))&SIU_IREER_IREE3_MASK)
#define SIU_IREER_IREE4_MASK                     0x10u
#define SIU_IREER_IREE4_SHIFT                    4u
#define SIU_IREER_IREE4_WIDTH                    1u
#define SIU_IREER_IREE4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE4_SHIFT))&SIU_IREER_IREE4_MASK)
#define SIU_IREER_IREE5_MASK                     0x20u
#define SIU_IREER_IREE5_SHIFT                    5u
#define SIU_IREER_IREE5_WIDTH                    1u
#define SIU_IREER_IREE5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE5_SHIFT))&SIU_IREER_IREE5_MASK)
#define SIU_IREER_IREE6_MASK                     0x40u
#define SIU_IREER_IREE6_SHIFT                    6u
#define SIU_IREER_IREE6_WIDTH                    1u
#define SIU_IREER_IREE6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE6_SHIFT))&SIU_IREER_IREE6_MASK)
#define SIU_IREER_IREE7_MASK                     0x80u
#define SIU_IREER_IREE7_SHIFT                    7u
#define SIU_IREER_IREE7_WIDTH                    1u
#define SIU_IREER_IREE7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE7_SHIFT))&SIU_IREER_IREE7_MASK)
#define SIU_IREER_IREE8_MASK                     0x100u
#define SIU_IREER_IREE8_SHIFT                    8u
#define SIU_IREER_IREE8_WIDTH                    1u
#define SIU_IREER_IREE8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE8_SHIFT))&SIU_IREER_IREE8_MASK)
#define SIU_IREER_IREE9_MASK                     0x200u
#define SIU_IREER_IREE9_SHIFT                    9u
#define SIU_IREER_IREE9_WIDTH                    1u
#define SIU_IREER_IREE9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE9_SHIFT))&SIU_IREER_IREE9_MASK)
#define SIU_IREER_IREE10_MASK                    0x400u
#define SIU_IREER_IREE10_SHIFT                   10u
#define SIU_IREER_IREE10_WIDTH                   1u
#define SIU_IREER_IREE10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE10_SHIFT))&SIU_IREER_IREE10_MASK)
#define SIU_IREER_IREE11_MASK                    0x800u
#define SIU_IREER_IREE11_SHIFT                   11u
#define SIU_IREER_IREE11_WIDTH                   1u
#define SIU_IREER_IREE11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE11_SHIFT))&SIU_IREER_IREE11_MASK)
#define SIU_IREER_IREE12_MASK                    0x1000u
#define SIU_IREER_IREE12_SHIFT                   12u
#define SIU_IREER_IREE12_WIDTH                   1u
#define SIU_IREER_IREE12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE12_SHIFT))&SIU_IREER_IREE12_MASK)
#define SIU_IREER_IREE13_MASK                    0x2000u
#define SIU_IREER_IREE13_SHIFT                   13u
#define SIU_IREER_IREE13_WIDTH                   1u
#define SIU_IREER_IREE13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE13_SHIFT))&SIU_IREER_IREE13_MASK)
#define SIU_IREER_IREE14_MASK                    0x4000u
#define SIU_IREER_IREE14_SHIFT                   14u
#define SIU_IREER_IREE14_WIDTH                   1u
#define SIU_IREER_IREE14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE14_SHIFT))&SIU_IREER_IREE14_MASK)
#define SIU_IREER_IREE15_MASK                    0x8000u
#define SIU_IREER_IREE15_SHIFT                   15u
#define SIU_IREER_IREE15_WIDTH                   1u
#define SIU_IREER_IREE15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE15_SHIFT))&SIU_IREER_IREE15_MASK)
#define SIU_IREER_IREE_NMI7_MASK                 0x40000000u
#define SIU_IREER_IREE_NMI7_SHIFT                30u
#define SIU_IREER_IREE_NMI7_WIDTH                1u
#define SIU_IREER_IREE_NMI7(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE_NMI7_SHIFT))&SIU_IREER_IREE_NMI7_MASK)
#define SIU_IREER_IREE_NMI8_MASK                 0x80000000u
#define SIU_IREER_IREE_NMI8_SHIFT                31u
#define SIU_IREER_IREE_NMI8_WIDTH                1u
#define SIU_IREER_IREE_NMI8(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IREER_IREE_NMI8_SHIFT))&SIU_IREER_IREE_NMI8_MASK)
/* IFEER Bit Fields */
#define SIU_IFEER_IFEEN0_MASK                    0x1u
#define SIU_IFEER_IFEEN0_SHIFT                   0u
#define SIU_IFEER_IFEEN0_WIDTH                   1u
#define SIU_IFEER_IFEEN0(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN0_SHIFT))&SIU_IFEER_IFEEN0_MASK)
#define SIU_IFEER_IFEEN1_MASK                    0x2u
#define SIU_IFEER_IFEEN1_SHIFT                   1u
#define SIU_IFEER_IFEEN1_WIDTH                   1u
#define SIU_IFEER_IFEEN1(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN1_SHIFT))&SIU_IFEER_IFEEN1_MASK)
#define SIU_IFEER_IFEEN2_MASK                    0x4u
#define SIU_IFEER_IFEEN2_SHIFT                   2u
#define SIU_IFEER_IFEEN2_WIDTH                   1u
#define SIU_IFEER_IFEEN2(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN2_SHIFT))&SIU_IFEER_IFEEN2_MASK)
#define SIU_IFEER_IFEEN3_MASK                    0x8u
#define SIU_IFEER_IFEEN3_SHIFT                   3u
#define SIU_IFEER_IFEEN3_WIDTH                   1u
#define SIU_IFEER_IFEEN3(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN3_SHIFT))&SIU_IFEER_IFEEN3_MASK)
#define SIU_IFEER_IFEEN4_MASK                    0x10u
#define SIU_IFEER_IFEEN4_SHIFT                   4u
#define SIU_IFEER_IFEEN4_WIDTH                   1u
#define SIU_IFEER_IFEEN4(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN4_SHIFT))&SIU_IFEER_IFEEN4_MASK)
#define SIU_IFEER_IFEEN5_MASK                    0x20u
#define SIU_IFEER_IFEEN5_SHIFT                   5u
#define SIU_IFEER_IFEEN5_WIDTH                   1u
#define SIU_IFEER_IFEEN5(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN5_SHIFT))&SIU_IFEER_IFEEN5_MASK)
#define SIU_IFEER_IFEEN6_MASK                    0x40u
#define SIU_IFEER_IFEEN6_SHIFT                   6u
#define SIU_IFEER_IFEEN6_WIDTH                   1u
#define SIU_IFEER_IFEEN6(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN6_SHIFT))&SIU_IFEER_IFEEN6_MASK)
#define SIU_IFEER_IFEEN7_MASK                    0x80u
#define SIU_IFEER_IFEEN7_SHIFT                   7u
#define SIU_IFEER_IFEEN7_WIDTH                   1u
#define SIU_IFEER_IFEEN7(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN7_SHIFT))&SIU_IFEER_IFEEN7_MASK)
#define SIU_IFEER_IFEEN8_MASK                    0x100u
#define SIU_IFEER_IFEEN8_SHIFT                   8u
#define SIU_IFEER_IFEEN8_WIDTH                   1u
#define SIU_IFEER_IFEEN8(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN8_SHIFT))&SIU_IFEER_IFEEN8_MASK)
#define SIU_IFEER_IFEEN9_MASK                    0x200u
#define SIU_IFEER_IFEEN9_SHIFT                   9u
#define SIU_IFEER_IFEEN9_WIDTH                   1u
#define SIU_IFEER_IFEEN9(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN9_SHIFT))&SIU_IFEER_IFEEN9_MASK)
#define SIU_IFEER_IFEEN10_MASK                   0x400u
#define SIU_IFEER_IFEEN10_SHIFT                  10u
#define SIU_IFEER_IFEEN10_WIDTH                  1u
#define SIU_IFEER_IFEEN10(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN10_SHIFT))&SIU_IFEER_IFEEN10_MASK)
#define SIU_IFEER_IFEEN11_MASK                   0x800u
#define SIU_IFEER_IFEEN11_SHIFT                  11u
#define SIU_IFEER_IFEEN11_WIDTH                  1u
#define SIU_IFEER_IFEEN11(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN11_SHIFT))&SIU_IFEER_IFEEN11_MASK)
#define SIU_IFEER_IFEEN12_MASK                   0x1000u
#define SIU_IFEER_IFEEN12_SHIFT                  12u
#define SIU_IFEER_IFEEN12_WIDTH                  1u
#define SIU_IFEER_IFEEN12(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN12_SHIFT))&SIU_IFEER_IFEEN12_MASK)
#define SIU_IFEER_IFEEN13_MASK                   0x2000u
#define SIU_IFEER_IFEEN13_SHIFT                  13u
#define SIU_IFEER_IFEEN13_WIDTH                  1u
#define SIU_IFEER_IFEEN13(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN13_SHIFT))&SIU_IFEER_IFEEN13_MASK)
#define SIU_IFEER_IFEEN14_MASK                   0x4000u
#define SIU_IFEER_IFEEN14_SHIFT                  14u
#define SIU_IFEER_IFEEN14_WIDTH                  1u
#define SIU_IFEER_IFEEN14(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN14_SHIFT))&SIU_IFEER_IFEEN14_MASK)
#define SIU_IFEER_IFEEN15_MASK                   0x8000u
#define SIU_IFEER_IFEEN15_SHIFT                  15u
#define SIU_IFEER_IFEEN15_WIDTH                  1u
#define SIU_IFEER_IFEEN15(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEEN15_SHIFT))&SIU_IFEER_IFEEN15_MASK)
#define SIU_IFEER_IFEE_NMI7_MASK                 0x40000000u
#define SIU_IFEER_IFEE_NMI7_SHIFT                30u
#define SIU_IFEER_IFEE_NMI7_WIDTH                1u
#define SIU_IFEER_IFEE_NMI7(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEE_NMI7_SHIFT))&SIU_IFEER_IFEE_NMI7_MASK)
#define SIU_IFEER_IFEE_NMI8_MASK                 0x80000000u
#define SIU_IFEER_IFEE_NMI8_SHIFT                31u
#define SIU_IFEER_IFEE_NMI8_WIDTH                1u
#define SIU_IFEER_IFEE_NMI8(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IFEER_IFEE_NMI8_SHIFT))&SIU_IFEER_IFEE_NMI8_MASK)
/* IDFR Bit Fields */
#define SIU_IDFR_DFL_MASK                        0xFu
#define SIU_IDFR_DFL_SHIFT                       0u
#define SIU_IDFR_DFL_WIDTH                       4u
#define SIU_IDFR_DFL(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_IDFR_DFL_SHIFT))&SIU_IDFR_DFL_MASK)
/* IFIR Bit Fields */
#define SIU_IFIR_IFI0_MASK                       0x1u
#define SIU_IFIR_IFI0_SHIFT                      0u
#define SIU_IFIR_IFI0_WIDTH                      1u
#define SIU_IFIR_IFI0(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI0_SHIFT))&SIU_IFIR_IFI0_MASK)
#define SIU_IFIR_IFI1_MASK                       0x2u
#define SIU_IFIR_IFI1_SHIFT                      1u
#define SIU_IFIR_IFI1_WIDTH                      1u
#define SIU_IFIR_IFI1(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI1_SHIFT))&SIU_IFIR_IFI1_MASK)
#define SIU_IFIR_IFI2_MASK                       0x4u
#define SIU_IFIR_IFI2_SHIFT                      2u
#define SIU_IFIR_IFI2_WIDTH                      1u
#define SIU_IFIR_IFI2(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI2_SHIFT))&SIU_IFIR_IFI2_MASK)
#define SIU_IFIR_IFI3_MASK                       0x8u
#define SIU_IFIR_IFI3_SHIFT                      3u
#define SIU_IFIR_IFI3_WIDTH                      1u
#define SIU_IFIR_IFI3(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI3_SHIFT))&SIU_IFIR_IFI3_MASK)
#define SIU_IFIR_IFI4_MASK                       0x10u
#define SIU_IFIR_IFI4_SHIFT                      4u
#define SIU_IFIR_IFI4_WIDTH                      1u
#define SIU_IFIR_IFI4(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI4_SHIFT))&SIU_IFIR_IFI4_MASK)
#define SIU_IFIR_IFI5_MASK                       0x20u
#define SIU_IFIR_IFI5_SHIFT                      5u
#define SIU_IFIR_IFI5_WIDTH                      1u
#define SIU_IFIR_IFI5(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI5_SHIFT))&SIU_IFIR_IFI5_MASK)
#define SIU_IFIR_IFI6_MASK                       0x40u
#define SIU_IFIR_IFI6_SHIFT                      6u
#define SIU_IFIR_IFI6_WIDTH                      1u
#define SIU_IFIR_IFI6(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI6_SHIFT))&SIU_IFIR_IFI6_MASK)
#define SIU_IFIR_IFI7_MASK                       0x80u
#define SIU_IFIR_IFI7_SHIFT                      7u
#define SIU_IFIR_IFI7_WIDTH                      1u
#define SIU_IFIR_IFI7(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI7_SHIFT))&SIU_IFIR_IFI7_MASK)
#define SIU_IFIR_IFI8_MASK                       0x100u
#define SIU_IFIR_IFI8_SHIFT                      8u
#define SIU_IFIR_IFI8_WIDTH                      1u
#define SIU_IFIR_IFI8(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI8_SHIFT))&SIU_IFIR_IFI8_MASK)
#define SIU_IFIR_IFI9_MASK                       0x200u
#define SIU_IFIR_IFI9_SHIFT                      9u
#define SIU_IFIR_IFI9_WIDTH                      1u
#define SIU_IFIR_IFI9(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI9_SHIFT))&SIU_IFIR_IFI9_MASK)
#define SIU_IFIR_IFI10_MASK                      0x400u
#define SIU_IFIR_IFI10_SHIFT                     10u
#define SIU_IFIR_IFI10_WIDTH                     1u
#define SIU_IFIR_IFI10(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI10_SHIFT))&SIU_IFIR_IFI10_MASK)
#define SIU_IFIR_IFI11_MASK                      0x800u
#define SIU_IFIR_IFI11_SHIFT                     11u
#define SIU_IFIR_IFI11_WIDTH                     1u
#define SIU_IFIR_IFI11(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI11_SHIFT))&SIU_IFIR_IFI11_MASK)
#define SIU_IFIR_IFI12_MASK                      0x1000u
#define SIU_IFIR_IFI12_SHIFT                     12u
#define SIU_IFIR_IFI12_WIDTH                     1u
#define SIU_IFIR_IFI12(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI12_SHIFT))&SIU_IFIR_IFI12_MASK)
#define SIU_IFIR_IFI13_MASK                      0x2000u
#define SIU_IFIR_IFI13_SHIFT                     13u
#define SIU_IFIR_IFI13_WIDTH                     1u
#define SIU_IFIR_IFI13(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI13_SHIFT))&SIU_IFIR_IFI13_MASK)
#define SIU_IFIR_IFI14_MASK                      0x4000u
#define SIU_IFIR_IFI14_SHIFT                     14u
#define SIU_IFIR_IFI14_WIDTH                     1u
#define SIU_IFIR_IFI14(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI14_SHIFT))&SIU_IFIR_IFI14_MASK)
#define SIU_IFIR_IFI15_MASK                      0x8000u
#define SIU_IFIR_IFI15_SHIFT                     15u
#define SIU_IFIR_IFI15_WIDTH                     1u
#define SIU_IFIR_IFI15(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI15_SHIFT))&SIU_IFIR_IFI15_MASK)
#define SIU_IFIR_IFI_NMI7_MASK                   0x40000000u
#define SIU_IFIR_IFI_NMI7_SHIFT                  30u
#define SIU_IFIR_IFI_NMI7_WIDTH                  1u
#define SIU_IFIR_IFI_NMI7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI_NMI7_SHIFT))&SIU_IFIR_IFI_NMI7_MASK)
#define SIU_IFIR_IFI_NMI8_MASK                   0x80000000u
#define SIU_IFIR_IFI_NMI8_SHIFT                  31u
#define SIU_IFIR_IFI_NMI8_WIDTH                  1u
#define SIU_IFIR_IFI_NMI8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IFIR_IFI_NMI8_SHIFT))&SIU_IFIR_IFI_NMI8_MASK)
/* PCR Bit Fields */
#define SIU_PCR_WPS_MASK                         0x1u
#define SIU_PCR_WPS_SHIFT                        0u
#define SIU_PCR_WPS_WIDTH                        1u
#define SIU_PCR_WPS(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_WPS_SHIFT))&SIU_PCR_WPS_MASK)
#define SIU_PCR_WPE_MASK                         0x2u
#define SIU_PCR_WPE_SHIFT                        1u
#define SIU_PCR_WPE_WIDTH                        1u
#define SIU_PCR_WPE(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_WPE_SHIFT))&SIU_PCR_WPE_MASK)
#define SIU_PCR_SRC_MASK                         0xCu
#define SIU_PCR_SRC_SHIFT                        2u
#define SIU_PCR_SRC_WIDTH                        2u
#define SIU_PCR_SRC(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_SRC_SHIFT))&SIU_PCR_SRC_MASK)
#define SIU_PCR_HYS_MASK                         0x10u
#define SIU_PCR_HYS_SHIFT                        4u
#define SIU_PCR_HYS_WIDTH                        1u
#define SIU_PCR_HYS(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_HYS_SHIFT))&SIU_PCR_HYS_MASK)
#define SIU_PCR_ODE_MASK                         0x20u
#define SIU_PCR_ODE_SHIFT                        5u
#define SIU_PCR_ODE_WIDTH                        1u
#define SIU_PCR_ODE(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_ODE_SHIFT))&SIU_PCR_ODE_MASK)
#define SIU_PCR_DSC_MASK                         0xC0u
#define SIU_PCR_DSC_SHIFT                        6u
#define SIU_PCR_DSC_WIDTH                        2u
#define SIU_PCR_DSC(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_DSC_SHIFT))&SIU_PCR_DSC_MASK)
#define SIU_PCR_IBE_MASK                         0x100u
#define SIU_PCR_IBE_SHIFT                        8u
#define SIU_PCR_IBE_WIDTH                        1u
#define SIU_PCR_IBE(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_IBE_SHIFT))&SIU_PCR_IBE_MASK)
#define SIU_PCR_OBE_MASK                         0x200u
#define SIU_PCR_OBE_SHIFT                        9u
#define SIU_PCR_OBE_WIDTH                        1u
#define SIU_PCR_OBE(x)                           (((uint16_t)(((uint16_t)(x))<<SIU_PCR_OBE_SHIFT))&SIU_PCR_OBE_MASK)
#define SIU_PCR_PA_MASK                          0x1C00u
#define SIU_PCR_PA_SHIFT                         10u
#define SIU_PCR_PA_WIDTH                         3u
#define SIU_PCR_PA(x)                            (((uint16_t)(((uint16_t)(x))<<SIU_PCR_PA_SHIFT))&SIU_PCR_PA_MASK)
/* GPDO Bit Fields */
#define SIU_GPDO_PDOn_MASK                       0x1u
#define SIU_GPDO_PDOn_SHIFT                      0u
#define SIU_GPDO_PDOn_WIDTH                      1u
#define SIU_GPDO_PDOn(x)                         (((uint8_t)(((uint8_t)(x))<<SIU_GPDO_PDOn_SHIFT))&SIU_GPDO_PDOn_MASK)
/* GPDIL Bit Fields */
#define SIU_GPDIL_PDIn_MASK                      0x1u
#define SIU_GPDIL_PDIn_SHIFT                     0u
#define SIU_GPDIL_PDIn_WIDTH                     1u
#define SIU_GPDIL_PDIn(x)                        (((uint8_t)(((uint8_t)(x))<<SIU_GPDIL_PDIn_SHIFT))&SIU_GPDIL_PDIn_MASK)
/* EIISR Bit Fields */
#define SIU_EIISR_ESEL0_MASK                     0x3u
#define SIU_EIISR_ESEL0_SHIFT                    0u
#define SIU_EIISR_ESEL0_WIDTH                    2u
#define SIU_EIISR_ESEL0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL0_SHIFT))&SIU_EIISR_ESEL0_MASK)
#define SIU_EIISR_ESEL1_MASK                     0xCu
#define SIU_EIISR_ESEL1_SHIFT                    2u
#define SIU_EIISR_ESEL1_WIDTH                    2u
#define SIU_EIISR_ESEL1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL1_SHIFT))&SIU_EIISR_ESEL1_MASK)
#define SIU_EIISR_ESEL2_MASK                     0x30u
#define SIU_EIISR_ESEL2_SHIFT                    4u
#define SIU_EIISR_ESEL2_WIDTH                    2u
#define SIU_EIISR_ESEL2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL2_SHIFT))&SIU_EIISR_ESEL2_MASK)
#define SIU_EIISR_ESEL3_MASK                     0xC0u
#define SIU_EIISR_ESEL3_SHIFT                    6u
#define SIU_EIISR_ESEL3_WIDTH                    2u
#define SIU_EIISR_ESEL3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL3_SHIFT))&SIU_EIISR_ESEL3_MASK)
#define SIU_EIISR_ESEL4_MASK                     0x300u
#define SIU_EIISR_ESEL4_SHIFT                    8u
#define SIU_EIISR_ESEL4_WIDTH                    2u
#define SIU_EIISR_ESEL4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL4_SHIFT))&SIU_EIISR_ESEL4_MASK)
#define SIU_EIISR_ESEL5_MASK                     0xC00u
#define SIU_EIISR_ESEL5_SHIFT                    10u
#define SIU_EIISR_ESEL5_WIDTH                    2u
#define SIU_EIISR_ESEL5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL5_SHIFT))&SIU_EIISR_ESEL5_MASK)
#define SIU_EIISR_ESEL6_MASK                     0x3000u
#define SIU_EIISR_ESEL6_SHIFT                    12u
#define SIU_EIISR_ESEL6_WIDTH                    2u
#define SIU_EIISR_ESEL6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL6_SHIFT))&SIU_EIISR_ESEL6_MASK)
#define SIU_EIISR_ESEL7_MASK                     0xC000u
#define SIU_EIISR_ESEL7_SHIFT                    14u
#define SIU_EIISR_ESEL7_WIDTH                    2u
