neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_EIISR_ESEL7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL7_SHIFT))&SIU_EIISR_ESEL7_MASK)
#define SIU_EIISR_ESEL8_MASK                     0x30000u
#define SIU_EIISR_ESEL8_SHIFT                    16u
#define SIU_EIISR_ESEL8_WIDTH                    2u
#define SIU_EIISR_ESEL8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL8_SHIFT))&SIU_EIISR_ESEL8_MASK)
#define SIU_EIISR_ESEL9_MASK                     0xC0000u
#define SIU_EIISR_ESEL9_SHIFT                    18u
#define SIU_EIISR_ESEL9_WIDTH                    2u
#define SIU_EIISR_ESEL9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL9_SHIFT))&SIU_EIISR_ESEL9_MASK)
#define SIU_EIISR_ESEL10_MASK                    0x300000u
#define SIU_EIISR_ESEL10_SHIFT                   20u
#define SIU_EIISR_ESEL10_WIDTH                   2u
#define SIU_EIISR_ESEL10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL10_SHIFT))&SIU_EIISR_ESEL10_MASK)
#define SIU_EIISR_ESEL11_MASK                    0xC00000u
#define SIU_EIISR_ESEL11_SHIFT                   22u
#define SIU_EIISR_ESEL11_WIDTH                   2u
#define SIU_EIISR_ESEL11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL11_SHIFT))&SIU_EIISR_ESEL11_MASK)
#define SIU_EIISR_ESEL12_MASK                    0x3000000u
#define SIU_EIISR_ESEL12_SHIFT                   24u
#define SIU_EIISR_ESEL12_WIDTH                   2u
#define SIU_EIISR_ESEL12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL12_SHIFT))&SIU_EIISR_ESEL12_MASK)
#define SIU_EIISR_ESEL13_MASK                    0xC000000u
#define SIU_EIISR_ESEL13_SHIFT                   26u
#define SIU_EIISR_ESEL13_WIDTH                   2u
#define SIU_EIISR_ESEL13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL13_SHIFT))&SIU_EIISR_ESEL13_MASK)
#define SIU_EIISR_ESEL14_MASK                    0x30000000u
#define SIU_EIISR_ESEL14_SHIFT                   28u
#define SIU_EIISR_ESEL14_WIDTH                   2u
#define SIU_EIISR_ESEL14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL14_SHIFT))&SIU_EIISR_ESEL14_MASK)
#define SIU_EIISR_ESEL15_MASK                    0xC0000000u
#define SIU_EIISR_ESEL15_SHIFT                   30u
#define SIU_EIISR_ESEL15_WIDTH                   2u
#define SIU_EIISR_ESEL15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_EIISR_ESEL15_SHIFT))&SIU_EIISR_ESEL15_MASK)
/* DISR Bit Fields */
#define SIU_DISR_SCKSELD_MASK                    0xCu
#define SIU_DISR_SCKSELD_SHIFT                   2u
#define SIU_DISR_SCKSELD_WIDTH                   2u
#define SIU_DISR_SCKSELD(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SCKSELD_SHIFT))&SIU_DISR_SCKSELD_MASK)
#define SIU_DISR_SSSELD_MASK                     0x30u
#define SIU_DISR_SSSELD_SHIFT                    4u
#define SIU_DISR_SSSELD_WIDTH                    2u
#define SIU_DISR_SSSELD(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SSSELD_SHIFT))&SIU_DISR_SSSELD_MASK)
#define SIU_DISR_SINSELD_MASK                    0xC0u
#define SIU_DISR_SINSELD_SHIFT                   6u
#define SIU_DISR_SINSELD_WIDTH                   2u
#define SIU_DISR_SINSELD(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SINSELD_SHIFT))&SIU_DISR_SINSELD_MASK)
#define SIU_DISR_SCKSELC_MASK                    0xC00u
#define SIU_DISR_SCKSELC_SHIFT                   10u
#define SIU_DISR_SCKSELC_WIDTH                   2u
#define SIU_DISR_SCKSELC(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SCKSELC_SHIFT))&SIU_DISR_SCKSELC_MASK)
#define SIU_DISR_SSSELC_MASK                     0x3000u
#define SIU_DISR_SSSELC_SHIFT                    12u
#define SIU_DISR_SSSELC_WIDTH                    2u
#define SIU_DISR_SSSELC(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SSSELC_SHIFT))&SIU_DISR_SSSELC_MASK)
#define SIU_DISR_SINSELC_MASK                    0xC000u
#define SIU_DISR_SINSELC_SHIFT                   14u
#define SIU_DISR_SINSELC_WIDTH                   2u
#define SIU_DISR_SINSELC(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SINSELC_SHIFT))&SIU_DISR_SINSELC_MASK)
#define SIU_DISR_SCKSELB_MASK                    0xC0000u
#define SIU_DISR_SCKSELB_SHIFT                   18u
#define SIU_DISR_SCKSELB_WIDTH                   2u
#define SIU_DISR_SCKSELB(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SCKSELB_SHIFT))&SIU_DISR_SCKSELB_MASK)
#define SIU_DISR_SSSELB_MASK                     0x300000u
#define SIU_DISR_SSSELB_SHIFT                    20u
#define SIU_DISR_SSSELB_WIDTH                    2u
#define SIU_DISR_SSSELB(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SSSELB_SHIFT))&SIU_DISR_SSSELB_MASK)
#define SIU_DISR_SINSELB_MASK                    0xC00000u
#define SIU_DISR_SINSELB_SHIFT                   22u
#define SIU_DISR_SINSELB_WIDTH                   2u
#define SIU_DISR_SINSELB(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SINSELB_SHIFT))&SIU_DISR_SINSELB_MASK)
#define SIU_DISR_SCKSELA_MASK                    0xC000000u
#define SIU_DISR_SCKSELA_SHIFT                   26u
#define SIU_DISR_SCKSELA_WIDTH                   2u
#define SIU_DISR_SCKSELA(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SCKSELA_SHIFT))&SIU_DISR_SCKSELA_MASK)
#define SIU_DISR_SSSELA_MASK                     0x30000000u
#define SIU_DISR_SSSELA_SHIFT                    28u
#define SIU_DISR_SSSELA_WIDTH                    2u
#define SIU_DISR_SSSELA(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SSSELA_SHIFT))&SIU_DISR_SSSELA_MASK)
#define SIU_DISR_SINSELA_MASK                    0xC0000000u
#define SIU_DISR_SINSELA_SHIFT                   30u
#define SIU_DISR_SINSELA_WIDTH                   2u
#define SIU_DISR_SINSELA(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DISR_SINSELA_SHIFT))&SIU_DISR_SINSELA_MASK)
/* ISEL4 Bit Fields */
#define SIU_ISEL4_CTSEL2_A_MASK                  0x7Fu
#define SIU_ISEL4_CTSEL2_A_SHIFT                 0u
#define SIU_ISEL4_CTSEL2_A_WIDTH                 7u
#define SIU_ISEL4_CTSEL2_A(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL4_CTSEL2_A_SHIFT))&SIU_ISEL4_CTSEL2_A_MASK)
#define SIU_ISEL4_CTSEL3_A_MASK                  0x7F00u
#define SIU_ISEL4_CTSEL3_A_SHIFT                 8u
#define SIU_ISEL4_CTSEL3_A_WIDTH                 7u
#define SIU_ISEL4_CTSEL3_A(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL4_CTSEL3_A_SHIFT))&SIU_ISEL4_CTSEL3_A_MASK)
#define SIU_ISEL4_CTSEL4_A_MASK                  0x7F0000u
#define SIU_ISEL4_CTSEL4_A_SHIFT                 16u
#define SIU_ISEL4_CTSEL4_A_WIDTH                 7u
#define SIU_ISEL4_CTSEL4_A(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL4_CTSEL4_A_SHIFT))&SIU_ISEL4_CTSEL4_A_MASK)
#define SIU_ISEL4_CTSEL5_A_MASK                  0x7F000000u
#define SIU_ISEL4_CTSEL5_A_SHIFT                 24u
#define SIU_ISEL4_CTSEL5_A_WIDTH                 7u
#define SIU_ISEL4_CTSEL5_A(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL4_CTSEL5_A_SHIFT))&SIU_ISEL4_CTSEL5_A_MASK)
/* ISEL5 Bit Fields */
#define SIU_ISEL5_CTSEL0_A_MASK                  0x7F0000u
#define SIU_ISEL5_CTSEL0_A_SHIFT                 16u
#define SIU_ISEL5_CTSEL0_A_WIDTH                 7u
#define SIU_ISEL5_CTSEL0_A(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL5_CTSEL0_A_SHIFT))&SIU_ISEL5_CTSEL0_A_MASK)
#define SIU_ISEL5_CTSEL1_A_MASK                  0x7F000000u
#define SIU_ISEL5_CTSEL1_A_SHIFT                 24u
#define SIU_ISEL5_CTSEL1_A_WIDTH                 7u
#define SIU_ISEL5_CTSEL1_A(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL5_CTSEL1_A_SHIFT))&SIU_ISEL5_CTSEL1_A_MASK)
/* ISEL6 Bit Fields */
#define SIU_ISEL6_CTSEL2_B_MASK                  0x7Fu
#define SIU_ISEL6_CTSEL2_B_SHIFT                 0u
#define SIU_ISEL6_CTSEL2_B_WIDTH                 7u
#define SIU_ISEL6_CTSEL2_B(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL6_CTSEL2_B_SHIFT))&SIU_ISEL6_CTSEL2_B_MASK)
#define SIU_ISEL6_CTSEL3_B_MASK                  0x7F00u
#define SIU_ISEL6_CTSEL3_B_SHIFT                 8u
#define SIU_ISEL6_CTSEL3_B_WIDTH                 7u
#define SIU_ISEL6_CTSEL3_B(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL6_CTSEL3_B_SHIFT))&SIU_ISEL6_CTSEL3_B_MASK)
#define SIU_ISEL6_CTSEL4_B_MASK                  0x7F0000u
#define SIU_ISEL6_CTSEL4_B_SHIFT                 16u
#define SIU_ISEL6_CTSEL4_B_WIDTH                 7u
#define SIU_ISEL6_CTSEL4_B(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL6_CTSEL4_B_SHIFT))&SIU_ISEL6_CTSEL4_B_MASK)
#define SIU_ISEL6_CTSEL5_B_MASK                  0x7F000000u
#define SIU_ISEL6_CTSEL5_B_SHIFT                 24u
#define SIU_ISEL6_CTSEL5_B_WIDTH                 7u
#define SIU_ISEL6_CTSEL5_B(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL6_CTSEL5_B_SHIFT))&SIU_ISEL6_CTSEL5_B_MASK)
/* ISEL7 Bit Fields */
#define SIU_ISEL7_CTSEL0_B_MASK                  0x7F0000u
#define SIU_ISEL7_CTSEL0_B_SHIFT                 16u
#define SIU_ISEL7_CTSEL0_B_WIDTH                 7u
#define SIU_ISEL7_CTSEL0_B(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL7_CTSEL0_B_SHIFT))&SIU_ISEL7_CTSEL0_B_MASK)
#define SIU_ISEL7_CTSEL1_B_MASK                  0x7F000000u
#define SIU_ISEL7_CTSEL1_B_SHIFT                 24u
#define SIU_ISEL7_CTSEL1_B_WIDTH                 7u
#define SIU_ISEL7_CTSEL1_B(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ISEL7_CTSEL1_B_SHIFT))&SIU_ISEL7_CTSEL1_B_MASK)
/* ISEL8 Bit Fields */
#define SIU_ISEL8_ETPU24_MASK                    0x1u
#define SIU_ISEL8_ETPU24_SHIFT                   0u
#define SIU_ISEL8_ETPU24_WIDTH                   1u
#define SIU_ISEL8_ETPU24(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_ISEL8_ETPU24_SHIFT))&SIU_ISEL8_ETPU24_MASK)
#define SIU_ISEL8_ETPU25_MASK                    0x10u
#define SIU_ISEL8_ETPU25_SHIFT                   4u
#define SIU_ISEL8_ETPU25_WIDTH                   1u
#define SIU_ISEL8_ETPU25(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_ISEL8_ETPU25_SHIFT))&SIU_ISEL8_ETPU25_MASK)
#define SIU_ISEL8_ETPU26_MASK                    0x100u
#define SIU_ISEL8_ETPU26_SHIFT                   8u
#define SIU_ISEL8_ETPU26_WIDTH                   1u
#define SIU_ISEL8_ETPU26(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_ISEL8_ETPU26_SHIFT))&SIU_ISEL8_ETPU26_MASK)
#define SIU_ISEL8_ETPU27_MASK                    0x1000u
#define SIU_ISEL8_ETPU27_SHIFT                   12u
#define SIU_ISEL8_ETPU27_WIDTH                   1u
#define SIU_ISEL8_ETPU27(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_ISEL8_ETPU27_SHIFT))&SIU_ISEL8_ETPU27_MASK)
#define SIU_ISEL8_ETPU28_MASK                    0x10000u
#define SIU_ISEL8_ETPU28_SHIFT                   16u
#define SIU_ISEL8_ETPU28_WIDTH                   1u
#define SIU_ISEL8_ETPU28(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_ISEL8_ETPU28_SHIFT))&SIU_ISEL8_ETPU28_MASK)
#define SIU_ISEL8_ETPU29_MASK                    0x100000u
#define SIU_ISEL8_ETPU29_SHIFT                   20u
#define SIU_ISEL8_ETPU29_WIDTH                   1u
#define SIU_ISEL8_ETPU29(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_ISEL8_ETPU29_SHIFT))&SIU_ISEL8_ETPU29_MASK)
/* ISEL9 Bit Fields */
#define SIU_ISEL9_EETSEL0ADV_B_MASK              0x1Fu
#define SIU_ISEL9_EETSEL0ADV_B_SHIFT             0u
#define SIU_ISEL9_EETSEL0ADV_B_WIDTH             5u
#define SIU_ISEL9_EETSEL0ADV_B(x)                (((uint32_t)(((uint32_t)(x))<<SIU_ISEL9_EETSEL0ADV_B_SHIFT))&SIU_ISEL9_EETSEL0ADV_B_MASK)
#define SIU_ISEL9_EETSEL0ADV_A_MASK              0x1F0000u
#define SIU_ISEL9_EETSEL0ADV_A_SHIFT             16u
#define SIU_ISEL9_EETSEL0ADV_A_WIDTH             5u
#define SIU_ISEL9_EETSEL0ADV_A(x)                (((uint32_t)(((uint32_t)(x))<<SIU_ISEL9_EETSEL0ADV_A_SHIFT))&SIU_ISEL9_EETSEL0ADV_A_MASK)
/* DECFIL1 Bit Fields */
#define SIU_DECFIL1_ZSELA_MASK                   0xFu
#define SIU_DECFIL1_ZSELA_SHIFT                  0u
#define SIU_DECFIL1_ZSELA_WIDTH                  4u
#define SIU_DECFIL1_ZSELA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_ZSELA_SHIFT))&SIU_DECFIL1_ZSELA_MASK)
#define SIU_DECFIL1_HSELA_MASK                   0xF0u
#define SIU_DECFIL1_HSELA_SHIFT                  4u
#define SIU_DECFIL1_HSELA_WIDTH                  4u
#define SIU_DECFIL1_HSELA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_HSELA_SHIFT))&SIU_DECFIL1_HSELA_MASK)
#define SIU_DECFIL1_ZSELB_MASK                   0xF00u
#define SIU_DECFIL1_ZSELB_SHIFT                  8u
#define SIU_DECFIL1_ZSELB_WIDTH                  4u
#define SIU_DECFIL1_ZSELB(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_ZSELB_SHIFT))&SIU_DECFIL1_ZSELB_MASK)
#define SIU_DECFIL1_HSELB_MASK                   0xF000u
#define SIU_DECFIL1_HSELB_SHIFT                  12u
#define SIU_DECFIL1_HSELB_WIDTH                  4u
#define SIU_DECFIL1_HSELB(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_HSELB_SHIFT))&SIU_DECFIL1_HSELB_MASK)
#define SIU_DECFIL1_ZSELC_MASK                   0xF0000u
#define SIU_DECFIL1_ZSELC_SHIFT                  16u
#define SIU_DECFIL1_ZSELC_WIDTH                  4u
#define SIU_DECFIL1_ZSELC(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_ZSELC_SHIFT))&SIU_DECFIL1_ZSELC_MASK)
#define SIU_DECFIL1_HSELC_MASK                   0xF00000u
#define SIU_DECFIL1_HSELC_SHIFT                  20u
#define SIU_DECFIL1_HSELC_WIDTH                  4u
#define SIU_DECFIL1_HSELC(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_HSELC_SHIFT))&SIU_DECFIL1_HSELC_MASK)
#define SIU_DECFIL1_ZSELD_MASK                   0xF000000u
#define SIU_DECFIL1_ZSELD_SHIFT                  24u
#define SIU_DECFIL1_ZSELD_WIDTH                  4u
#define SIU_DECFIL1_ZSELD(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_ZSELD_SHIFT))&SIU_DECFIL1_ZSELD_MASK)
#define SIU_DECFIL1_HSELD_MASK                   0xF0000000u
#define SIU_DECFIL1_HSELD_SHIFT                  28u
#define SIU_DECFIL1_HSELD_WIDTH                  4u
#define SIU_DECFIL1_HSELD(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL1_HSELD_SHIFT))&SIU_DECFIL1_HSELD_MASK)
/* DECFIL2 Bit Fields */
#define SIU_DECFIL2_ZSELE_MASK                   0xFu
#define SIU_DECFIL2_ZSELE_SHIFT                  0u
#define SIU_DECFIL2_ZSELE_WIDTH                  4u
#define SIU_DECFIL2_ZSELE(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_ZSELE_SHIFT))&SIU_DECFIL2_ZSELE_MASK)
#define SIU_DECFIL2_HSELE_MASK                   0xF0u
#define SIU_DECFIL2_HSELE_SHIFT                  4u
#define SIU_DECFIL2_HSELE_WIDTH                  4u
#define SIU_DECFIL2_HSELE(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_HSELE_SHIFT))&SIU_DECFIL2_HSELE_MASK)
#define SIU_DECFIL2_ZSELF_MASK                   0xF00u
#define SIU_DECFIL2_ZSELF_SHIFT                  8u
#define SIU_DECFIL2_ZSELF_WIDTH                  4u
#define SIU_DECFIL2_ZSELF(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_ZSELF_SHIFT))&SIU_DECFIL2_ZSELF_MASK)
#define SIU_DECFIL2_HSELF_MASK                   0xF000u
#define SIU_DECFIL2_HSELF_SHIFT                  12u
#define SIU_DECFIL2_HSELF_WIDTH                  4u
#define SIU_DECFIL2_HSELF(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_HSELF_SHIFT))&SIU_DECFIL2_HSELF_MASK)
#define SIU_DECFIL2_ZSELG_MASK                   0xF0000u
#define SIU_DECFIL2_ZSELG_SHIFT                  16u
#define SIU_DECFIL2_ZSELG_WIDTH                  4u
#define SIU_DECFIL2_ZSELG(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_ZSELG_SHIFT))&SIU_DECFIL2_ZSELG_MASK)
#define SIU_DECFIL2_HSELG_MASK                   0xF00000u
#define SIU_DECFIL2_HSELG_SHIFT                  20u
#define SIU_DECFIL2_HSELG_WIDTH                  4u
#define SIU_DECFIL2_HSELG(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_HSELG_SHIFT))&SIU_DECFIL2_HSELG_MASK)
#define SIU_DECFIL2_ZSELH_MASK                   0xF000000u
#define SIU_DECFIL2_ZSELH_SHIFT                  24u
#define SIU_DECFIL2_ZSELH_WIDTH                  4u
#define SIU_DECFIL2_ZSELH(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_ZSELH_SHIFT))&SIU_DECFIL2_ZSELH_MASK)
#define SIU_DECFIL2_HSELH_MASK                   0xF0000000u
#define SIU_DECFIL2_HSELH_SHIFT                  28u
#define SIU_DECFIL2_HSELH_WIDTH                  4u
#define SIU_DECFIL2_HSELH(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL2_HSELH_SHIFT))&SIU_DECFIL2_HSELH_MASK)
/* DECFIL3 Bit Fields */
#define SIU_DECFIL3_ZSELI_MASK                   0xFu
#define SIU_DECFIL3_ZSELI_SHIFT                  0u
#define SIU_DECFIL3_ZSELI_WIDTH                  4u
#define SIU_DECFIL3_ZSELI(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_ZSELI_SHIFT))&SIU_DECFIL3_ZSELI_MASK)
#define SIU_DECFIL3_HSELI_MASK                   0xF0u
#define SIU_DECFIL3_HSELI_SHIFT                  4u
#define SIU_DECFIL3_HSELI_WIDTH                  4u
#define SIU_DECFIL3_HSELI(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_HSELI_SHIFT))&SIU_DECFIL3_HSELI_MASK)
#define SIU_DECFIL3_ZSELJ_MASK                   0xF00u
#define SIU_DECFIL3_ZSELJ_SHIFT                  8u
#define SIU_DECFIL3_ZSELJ_WIDTH                  4u
#define SIU_DECFIL3_ZSELJ(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_ZSELJ_SHIFT))&SIU_DECFIL3_ZSELJ_MASK)
#define SIU_DECFIL3_HSELJ_MASK                   0xF000u
#define SIU_DECFIL3_HSELJ_SHIFT                  12u
#define SIU_DECFIL3_HSELJ_WIDTH                  4u
#define SIU_DECFIL3_HSELJ(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_HSELJ_SHIFT))&SIU_DECFIL3_HSELJ_MASK)
#define SIU_DECFIL3_ZSELK_MASK                   0xF0000u
#define SIU_DECFIL3_ZSELK_SHIFT                  16u
#define SIU_DECFIL3_ZSELK_WIDTH                  4u
#define SIU_DECFIL3_ZSELK(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_ZSELK_SHIFT))&SIU_DECFIL3_ZSELK_MASK)
#define SIU_DECFIL3_HSELK_MASK                   0xF00000u
#define SIU_DECFIL3_HSELK_SHIFT                  20u
#define SIU_DECFIL3_HSELK_WIDTH                  4u
#define SIU_DECFIL3_HSELK(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_HSELK_SHIFT))&SIU_DECFIL3_HSELK_MASK)
#define SIU_DECFIL3_ZSELL_MASK                   0xF000000u
#define SIU_DECFIL3_ZSELL_SHIFT                  24u
#define SIU_DECFIL3_ZSELL_WIDTH                  4u
#define SIU_DECFIL3_ZSELL(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_ZSELL_SHIFT))&SIU_DECFIL3_ZSELL_MASK)
#define SIU_DECFIL3_HSELL_MASK                   0xF0000000u
#define SIU_DECFIL3_HSELL_SHIFT                  28u
#define SIU_DECFIL3_HSELL_WIDTH                  4u
#define SIU_DECFIL3_HSELL(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL3_HSELL_SHIFT))&SIU_DECFIL3_HSELL_MASK)
/* DECFIL4 Bit Fields */
#define SIU_DECFIL4_TRIG_SRCA_MASK               0xFu
#define SIU_DECFIL4_TRIG_SRCA_SHIFT              0u
#define SIU_DECFIL4_TRIG_SRCA_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCA(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCA_SHIFT))&SIU_DECFIL4_TRIG_SRCA_MASK)
#define SIU_DECFIL4_TRIG_SRCB_MASK               0xF0u
#define SIU_DECFIL4_TRIG_SRCB_SHIFT              4u
#define SIU_DECFIL4_TRIG_SRCB_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCB(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCB_SHIFT))&SIU_DECFIL4_TRIG_SRCB_MASK)
#define SIU_DECFIL4_TRIG_SRCC_MASK               0xF00u
#define SIU_DECFIL4_TRIG_SRCC_SHIFT              8u
#define SIU_DECFIL4_TRIG_SRCC_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCC(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCC_SHIFT))&SIU_DECFIL4_TRIG_SRCC_MASK)
#define SIU_DECFIL4_TRIG_SRCD_MASK               0xF000u
#define SIU_DECFIL4_TRIG_SRCD_SHIFT              12u
#define SIU_DECFIL4_TRIG_SRCD_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCD(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCD_SHIFT))&SIU_DECFIL4_TRIG_SRCD_MASK)
#define SIU_DECFIL4_TRIG_SRCE_MASK               0xF0000u
#define SIU_DECFIL4_TRIG_SRCE_SHIFT              16u
#define SIU_DECFIL4_TRIG_SRCE_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCE(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCE_SHIFT))&SIU_DECFIL4_TRIG_SRCE_MASK)
#define SIU_DECFIL4_TRIG_SRCF_MASK               0xF00000u
#define SIU_DECFIL4_TRIG_SRCF_SHIFT              20u
#define SIU_DECFIL4_TRIG_SRCF_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCF(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCF_SHIFT))&SIU_DECFIL4_TRIG_SRCF_MASK)
#define SIU_DECFIL4_TRIG_SRCG_MASK               0xF000000u
#define SIU_DECFIL4_TRIG_SRCG_SHIFT              24u
#define SIU_DECFIL4_TRIG_SRCG_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCG(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCG_SHIFT))&SIU_DECFIL4_TRIG_SRCG_MASK)
#define SIU_DECFIL4_TRIG_SRCH_MASK               0xF0000000u
#define SIU_DECFIL4_TRIG_SRCH_SHIFT              28u
#define SIU_DECFIL4_TRIG_SRCH_WIDTH              4u
#define SIU_DECFIL4_TRIG_SRCH(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL4_TRIG_SRCH_SHIFT))&SIU_DECFIL4_TRIG_SRCH_MASK)
/* DECFIL5 Bit Fields */
#define SIU_DECFIL5_TRIG_SRCI_MASK               0xF0000u
#define SIU_DECFIL5_TRIG_SRCI_SHIFT              16u
#define SIU_DECFIL5_TRIG_SRCI_WIDTH              4u
#define SIU_DECFIL5_TRIG_SRCI(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL5_TRIG_SRCI_SHIFT))&SIU_DECFIL5_TRIG_SRCI_MASK)
#define SIU_DECFIL5_TRIG_SRCJ_MASK               0xF00000u
#define SIU_DECFIL5_TRIG_SRCJ_SHIFT              20u
#define SIU_DECFIL5_TRIG_SRCJ_WIDTH              4u
#define SIU_DECFIL5_TRIG_SRCJ(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL5_TRIG_SRCJ_SHIFT))&SIU_DECFIL5_TRIG_SRCJ_MASK)
#define SIU_DECFIL5_TRIG_SRCK_MASK               0xF000000u
#define SIU_DECFIL5_TRIG_SRCK_SHIFT              24u
#define SIU_DECFIL5_TRIG_SRCK_WIDTH              4u
#define SIU_DECFIL5_TRIG_SRCK(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL5_TRIG_SRCK_SHIFT))&SIU_DECFIL5_TRIG_SRCK_MASK)
#define SIU_DECFIL5_TRIG_SRCL_MASK               0xF0000000u
#define SIU_DECFIL5_TRIG_SRCL_SHIFT              28u
#define SIU_DECFIL5_TRIG_SRCL_WIDTH              4u
#define SIU_DECFIL5_TRIG_SRCL(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DECFIL5_TRIG_SRCL_SHIFT))&SIU_DECFIL5_TRIG_SRCL_MASK)
/* REACTSR Bit Fields */
#define SIU_REACTSR_TS0_MASK                     0x3u
#define SIU_REACTSR_TS0_SHIFT                    0u
#define SIU_REACTSR_TS0_WIDTH                    2u
#define SIU_REACTSR_TS0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS0_SHIFT))&SIU_REACTSR_TS0_MASK)
#define SIU_REACTSR_TS1_MASK                     0xCu
#define SIU_REACTSR_TS1_SHIFT                    2u
#define SIU_REACTSR_TS1_WIDTH                    2u
#define SIU_REACTSR_TS1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS1_SHIFT))&SIU_REACTSR_TS1_MASK)
#define SIU_REACTSR_TS2_MASK                     0x30u
#define SIU_REACTSR_TS2_SHIFT                    4u
#define SIU_REACTSR_TS2_WIDTH                    2u
#define SIU_REACTSR_TS2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS2_SHIFT))&SIU_REACTSR_TS2_MASK)
#define SIU_REACTSR_TS3_MASK                     0xC0u
#define SIU_REACTSR_TS3_SHIFT                    6u
#define SIU_REACTSR_TS3_WIDTH                    2u
#define SIU_REACTSR_TS3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS3_SHIFT))&SIU_REACTSR_TS3_MASK)
#define SIU_REACTSR_TS4_MASK                     0x300u
#define SIU_REACTSR_TS4_SHIFT                    8u
#define SIU_REACTSR_TS4_WIDTH                    2u
