neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_REACTSR_TS4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS4_SHIFT))&SIU_REACTSR_TS4_MASK)
#define SIU_REACTSR_TS5_MASK                     0xC00u
#define SIU_REACTSR_TS5_SHIFT                    10u
#define SIU_REACTSR_TS5_WIDTH                    2u
#define SIU_REACTSR_TS5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS5_SHIFT))&SIU_REACTSR_TS5_MASK)
#define SIU_REACTSR_TS6_MASK                     0x3000u
#define SIU_REACTSR_TS6_SHIFT                    12u
#define SIU_REACTSR_TS6_WIDTH                    2u
#define SIU_REACTSR_TS6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS6_SHIFT))&SIU_REACTSR_TS6_MASK)
#define SIU_REACTSR_TS7_MASK                     0xC000u
#define SIU_REACTSR_TS7_SHIFT                    14u
#define SIU_REACTSR_TS7_WIDTH                    2u
#define SIU_REACTSR_TS7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS7_SHIFT))&SIU_REACTSR_TS7_MASK)
#define SIU_REACTSR_TS8_MASK                     0x30000u
#define SIU_REACTSR_TS8_SHIFT                    16u
#define SIU_REACTSR_TS8_WIDTH                    2u
#define SIU_REACTSR_TS8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS8_SHIFT))&SIU_REACTSR_TS8_MASK)
#define SIU_REACTSR_TS9_MASK                     0xC0000u
#define SIU_REACTSR_TS9_SHIFT                    18u
#define SIU_REACTSR_TS9_WIDTH                    2u
#define SIU_REACTSR_TS9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS9_SHIFT))&SIU_REACTSR_TS9_MASK)
#define SIU_REACTSR_TS10_MASK                    0x300000u
#define SIU_REACTSR_TS10_SHIFT                   20u
#define SIU_REACTSR_TS10_WIDTH                   2u
#define SIU_REACTSR_TS10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS10_SHIFT))&SIU_REACTSR_TS10_MASK)
#define SIU_REACTSR_TS11_MASK                    0xC00000u
#define SIU_REACTSR_TS11_SHIFT                   22u
#define SIU_REACTSR_TS11_WIDTH                   2u
#define SIU_REACTSR_TS11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS11_SHIFT))&SIU_REACTSR_TS11_MASK)
#define SIU_REACTSR_TS12_MASK                    0x3000000u
#define SIU_REACTSR_TS12_SHIFT                   24u
#define SIU_REACTSR_TS12_WIDTH                   2u
#define SIU_REACTSR_TS12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS12_SHIFT))&SIU_REACTSR_TS12_MASK)
#define SIU_REACTSR_TS13_MASK                    0xC000000u
#define SIU_REACTSR_TS13_SHIFT                   26u
#define SIU_REACTSR_TS13_WIDTH                   2u
#define SIU_REACTSR_TS13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS13_SHIFT))&SIU_REACTSR_TS13_MASK)
#define SIU_REACTSR_TS14_MASK                    0x30000000u
#define SIU_REACTSR_TS14_SHIFT                   28u
#define SIU_REACTSR_TS14_WIDTH                   2u
#define SIU_REACTSR_TS14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS14_SHIFT))&SIU_REACTSR_TS14_MASK)
#define SIU_REACTSR_TS15_MASK                    0xC0000000u
#define SIU_REACTSR_TS15_SHIFT                   30u
#define SIU_REACTSR_TS15_WIDTH                   2u
#define SIU_REACTSR_TS15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_REACTSR_TS15_SHIFT))&SIU_REACTSR_TS15_MASK)
/* SDGATE_SEL Bit Fields */
#define SIU_SDGATE_SEL_SD_A_GATE_SEL_MASK        0xFu
#define SIU_SDGATE_SEL_SD_A_GATE_SEL_SHIFT       0u
#define SIU_SDGATE_SEL_SD_A_GATE_SEL_WIDTH       4u
#define SIU_SDGATE_SEL_SD_A_GATE_SEL(x)          (((uint32_t)(((uint32_t)(x))<<SIU_SDGATE_SEL_SD_A_GATE_SEL_SHIFT))&SIU_SDGATE_SEL_SD_A_GATE_SEL_MASK)
#define SIU_SDGATE_SEL_SD_B_GATE_SEL_MASK        0xF0u
#define SIU_SDGATE_SEL_SD_B_GATE_SEL_SHIFT       4u
#define SIU_SDGATE_SEL_SD_B_GATE_SEL_WIDTH       4u
#define SIU_SDGATE_SEL_SD_B_GATE_SEL(x)          (((uint32_t)(((uint32_t)(x))<<SIU_SDGATE_SEL_SD_B_GATE_SEL_SHIFT))&SIU_SDGATE_SEL_SD_B_GATE_SEL_MASK)
#define SIU_SDGATE_SEL_SD_C_GATE_SEL_MASK        0xF00u
#define SIU_SDGATE_SEL_SD_C_GATE_SEL_SHIFT       8u
#define SIU_SDGATE_SEL_SD_C_GATE_SEL_WIDTH       4u
#define SIU_SDGATE_SEL_SD_C_GATE_SEL(x)          (((uint32_t)(((uint32_t)(x))<<SIU_SDGATE_SEL_SD_C_GATE_SEL_SHIFT))&SIU_SDGATE_SEL_SD_C_GATE_SEL_MASK)
#define SIU_SDGATE_SEL_SD_D_GATE_SEL_MASK        0xF000u
#define SIU_SDGATE_SEL_SD_D_GATE_SEL_SHIFT       12u
#define SIU_SDGATE_SEL_SD_D_GATE_SEL_WIDTH       4u
#define SIU_SDGATE_SEL_SD_D_GATE_SEL(x)          (((uint32_t)(((uint32_t)(x))<<SIU_SDGATE_SEL_SD_D_GATE_SEL_SHIFT))&SIU_SDGATE_SEL_SD_D_GATE_SEL_MASK)
/* SDETPUA Bit Fields */
#define SIU_SDETPUA_CH30_MASK                    0x2u
#define SIU_SDETPUA_CH30_SHIFT                   1u
#define SIU_SDETPUA_CH30_WIDTH                   1u
#define SIU_SDETPUA_CH30(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH30_SHIFT))&SIU_SDETPUA_CH30_MASK)
#define SIU_SDETPUA_CH19_MASK                    0x1000u
#define SIU_SDETPUA_CH19_SHIFT                   12u
#define SIU_SDETPUA_CH19_WIDTH                   1u
#define SIU_SDETPUA_CH19(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH19_SHIFT))&SIU_SDETPUA_CH19_MASK)
#define SIU_SDETPUA_CH17_MASK                    0x4000u
#define SIU_SDETPUA_CH17_SHIFT                   14u
#define SIU_SDETPUA_CH17_WIDTH                   1u
#define SIU_SDETPUA_CH17(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH17_SHIFT))&SIU_SDETPUA_CH17_MASK)
#define SIU_SDETPUA_CH16_MASK                    0x8000u
#define SIU_SDETPUA_CH16_SHIFT                   15u
#define SIU_SDETPUA_CH16_WIDTH                   1u
#define SIU_SDETPUA_CH16(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH16_SHIFT))&SIU_SDETPUA_CH16_MASK)
#define SIU_SDETPUA_CH15_MASK                    0x10000u
#define SIU_SDETPUA_CH15_SHIFT                   16u
#define SIU_SDETPUA_CH15_WIDTH                   1u
#define SIU_SDETPUA_CH15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH15_SHIFT))&SIU_SDETPUA_CH15_MASK)
#define SIU_SDETPUA_CH14_MASK                    0x20000u
#define SIU_SDETPUA_CH14_SHIFT                   17u
#define SIU_SDETPUA_CH14_WIDTH                   1u
#define SIU_SDETPUA_CH14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH14_SHIFT))&SIU_SDETPUA_CH14_MASK)
#define SIU_SDETPUA_CH12_MASK                    0x80000u
#define SIU_SDETPUA_CH12_SHIFT                   19u
#define SIU_SDETPUA_CH12_WIDTH                   1u
#define SIU_SDETPUA_CH12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH12_SHIFT))&SIU_SDETPUA_CH12_MASK)
#define SIU_SDETPUA_CH11_MASK                    0x100000u
#define SIU_SDETPUA_CH11_SHIFT                   20u
#define SIU_SDETPUA_CH11_WIDTH                   1u
#define SIU_SDETPUA_CH11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH11_SHIFT))&SIU_SDETPUA_CH11_MASK)
#define SIU_SDETPUA_CH10_MASK                    0x200000u
#define SIU_SDETPUA_CH10_SHIFT                   21u
#define SIU_SDETPUA_CH10_WIDTH                   1u
#define SIU_SDETPUA_CH10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH10_SHIFT))&SIU_SDETPUA_CH10_MASK)
#define SIU_SDETPUA_CH9_MASK                     0x400000u
#define SIU_SDETPUA_CH9_SHIFT                    22u
#define SIU_SDETPUA_CH9_WIDTH                    1u
#define SIU_SDETPUA_CH9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH9_SHIFT))&SIU_SDETPUA_CH9_MASK)
#define SIU_SDETPUA_CH7_MASK                     0x1000000u
#define SIU_SDETPUA_CH7_SHIFT                    24u
#define SIU_SDETPUA_CH7_WIDTH                    1u
#define SIU_SDETPUA_CH7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH7_SHIFT))&SIU_SDETPUA_CH7_MASK)
#define SIU_SDETPUA_CH6_MASK                     0x2000000u
#define SIU_SDETPUA_CH6_SHIFT                    25u
#define SIU_SDETPUA_CH6_WIDTH                    1u
#define SIU_SDETPUA_CH6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH6_SHIFT))&SIU_SDETPUA_CH6_MASK)
#define SIU_SDETPUA_CH5_MASK                     0x4000000u
#define SIU_SDETPUA_CH5_SHIFT                    26u
#define SIU_SDETPUA_CH5_WIDTH                    1u
#define SIU_SDETPUA_CH5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH5_SHIFT))&SIU_SDETPUA_CH5_MASK)
#define SIU_SDETPUA_CH4_MASK                     0x8000000u
#define SIU_SDETPUA_CH4_SHIFT                    27u
#define SIU_SDETPUA_CH4_WIDTH                    1u
#define SIU_SDETPUA_CH4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH4_SHIFT))&SIU_SDETPUA_CH4_MASK)
#define SIU_SDETPUA_CH2_MASK                     0x20000000u
#define SIU_SDETPUA_CH2_SHIFT                    29u
#define SIU_SDETPUA_CH2_WIDTH                    1u
#define SIU_SDETPUA_CH2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH2_SHIFT))&SIU_SDETPUA_CH2_MASK)
#define SIU_SDETPUA_CH1_MASK                     0x40000000u
#define SIU_SDETPUA_CH1_SHIFT                    30u
#define SIU_SDETPUA_CH1_WIDTH                    1u
#define SIU_SDETPUA_CH1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUA_CH1_SHIFT))&SIU_SDETPUA_CH1_MASK)
/* SDETPUB Bit Fields */
#define SIU_SDETPUB_CH30_MASK                    0x2u
#define SIU_SDETPUB_CH30_SHIFT                   1u
#define SIU_SDETPUB_CH30_WIDTH                   1u
#define SIU_SDETPUB_CH30(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH30_SHIFT))&SIU_SDETPUB_CH30_MASK)
#define SIU_SDETPUB_CH19_MASK                    0x1000u
#define SIU_SDETPUB_CH19_SHIFT                   12u
#define SIU_SDETPUB_CH19_WIDTH                   1u
#define SIU_SDETPUB_CH19(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH19_SHIFT))&SIU_SDETPUB_CH19_MASK)
#define SIU_SDETPUB_CH17_MASK                    0x4000u
#define SIU_SDETPUB_CH17_SHIFT                   14u
#define SIU_SDETPUB_CH17_WIDTH                   1u
#define SIU_SDETPUB_CH17(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH17_SHIFT))&SIU_SDETPUB_CH17_MASK)
#define SIU_SDETPUB_CH16_MASK                    0x8000u
#define SIU_SDETPUB_CH16_SHIFT                   15u
#define SIU_SDETPUB_CH16_WIDTH                   1u
#define SIU_SDETPUB_CH16(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH16_SHIFT))&SIU_SDETPUB_CH16_MASK)
#define SIU_SDETPUB_CH15_MASK                    0x10000u
#define SIU_SDETPUB_CH15_SHIFT                   16u
#define SIU_SDETPUB_CH15_WIDTH                   1u
#define SIU_SDETPUB_CH15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH15_SHIFT))&SIU_SDETPUB_CH15_MASK)
#define SIU_SDETPUB_CH14_MASK                    0x20000u
#define SIU_SDETPUB_CH14_SHIFT                   17u
#define SIU_SDETPUB_CH14_WIDTH                   1u
#define SIU_SDETPUB_CH14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH14_SHIFT))&SIU_SDETPUB_CH14_MASK)
#define SIU_SDETPUB_CH12_MASK                    0x80000u
#define SIU_SDETPUB_CH12_SHIFT                   19u
#define SIU_SDETPUB_CH12_WIDTH                   1u
#define SIU_SDETPUB_CH12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH12_SHIFT))&SIU_SDETPUB_CH12_MASK)
#define SIU_SDETPUB_CH11_MASK                    0x100000u
#define SIU_SDETPUB_CH11_SHIFT                   20u
#define SIU_SDETPUB_CH11_WIDTH                   1u
#define SIU_SDETPUB_CH11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH11_SHIFT))&SIU_SDETPUB_CH11_MASK)
#define SIU_SDETPUB_CH10_MASK                    0x200000u
#define SIU_SDETPUB_CH10_SHIFT                   21u
#define SIU_SDETPUB_CH10_WIDTH                   1u
#define SIU_SDETPUB_CH10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH10_SHIFT))&SIU_SDETPUB_CH10_MASK)
#define SIU_SDETPUB_CH9_MASK                     0x400000u
#define SIU_SDETPUB_CH9_SHIFT                    22u
#define SIU_SDETPUB_CH9_WIDTH                    1u
#define SIU_SDETPUB_CH9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH9_SHIFT))&SIU_SDETPUB_CH9_MASK)
#define SIU_SDETPUB_CH7_MASK                     0x1000000u
#define SIU_SDETPUB_CH7_SHIFT                    24u
#define SIU_SDETPUB_CH7_WIDTH                    1u
#define SIU_SDETPUB_CH7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH7_SHIFT))&SIU_SDETPUB_CH7_MASK)
#define SIU_SDETPUB_CH6_MASK                     0x2000000u
#define SIU_SDETPUB_CH6_SHIFT                    25u
#define SIU_SDETPUB_CH6_WIDTH                    1u
#define SIU_SDETPUB_CH6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH6_SHIFT))&SIU_SDETPUB_CH6_MASK)
#define SIU_SDETPUB_CH5_MASK                     0x4000000u
#define SIU_SDETPUB_CH5_SHIFT                    26u
#define SIU_SDETPUB_CH5_WIDTH                    1u
#define SIU_SDETPUB_CH5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH5_SHIFT))&SIU_SDETPUB_CH5_MASK)
#define SIU_SDETPUB_CH4_MASK                     0x8000000u
#define SIU_SDETPUB_CH4_SHIFT                    27u
#define SIU_SDETPUB_CH4_WIDTH                    1u
#define SIU_SDETPUB_CH4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH4_SHIFT))&SIU_SDETPUB_CH4_MASK)
#define SIU_SDETPUB_CH2_MASK                     0x20000000u
#define SIU_SDETPUB_CH2_SHIFT                    29u
#define SIU_SDETPUB_CH2_WIDTH                    1u
#define SIU_SDETPUB_CH2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH2_SHIFT))&SIU_SDETPUB_CH2_MASK)
#define SIU_SDETPUB_CH1_MASK                     0x40000000u
#define SIU_SDETPUB_CH1_SHIFT                    30u
#define SIU_SDETPUB_CH1_WIDTH                    1u
#define SIU_SDETPUB_CH1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUB_CH1_SHIFT))&SIU_SDETPUB_CH1_MASK)
/* SDETPUC Bit Fields */
#define SIU_SDETPUC_CH30_MASK                    0x2u
#define SIU_SDETPUC_CH30_SHIFT                   1u
#define SIU_SDETPUC_CH30_WIDTH                   1u
#define SIU_SDETPUC_CH30(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH30_SHIFT))&SIU_SDETPUC_CH30_MASK)
#define SIU_SDETPUC_CH29_MASK                    0x4u
#define SIU_SDETPUC_CH29_SHIFT                   2u
#define SIU_SDETPUC_CH29_WIDTH                   1u
#define SIU_SDETPUC_CH29(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH29_SHIFT))&SIU_SDETPUC_CH29_MASK)
#define SIU_SDETPUC_CH28_MASK                    0x8u
#define SIU_SDETPUC_CH28_SHIFT                   3u
#define SIU_SDETPUC_CH28_WIDTH                   1u
#define SIU_SDETPUC_CH28(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH28_SHIFT))&SIU_SDETPUC_CH28_MASK)
#define SIU_SDETPUC_CH27_MASK                    0x10u
#define SIU_SDETPUC_CH27_SHIFT                   4u
#define SIU_SDETPUC_CH27_WIDTH                   1u
#define SIU_SDETPUC_CH27(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH27_SHIFT))&SIU_SDETPUC_CH27_MASK)
#define SIU_SDETPUC_CH25_MASK                    0x40u
#define SIU_SDETPUC_CH25_SHIFT                   6u
#define SIU_SDETPUC_CH25_WIDTH                   1u
#define SIU_SDETPUC_CH25(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH25_SHIFT))&SIU_SDETPUC_CH25_MASK)
#define SIU_SDETPUC_CH14_MASK                    0x20000u
#define SIU_SDETPUC_CH14_SHIFT                   17u
#define SIU_SDETPUC_CH14_WIDTH                   1u
#define SIU_SDETPUC_CH14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH14_SHIFT))&SIU_SDETPUC_CH14_MASK)
#define SIU_SDETPUC_CH13_MASK                    0x40000u
#define SIU_SDETPUC_CH13_SHIFT                   18u
#define SIU_SDETPUC_CH13_WIDTH                   1u
#define SIU_SDETPUC_CH13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH13_SHIFT))&SIU_SDETPUC_CH13_MASK)
#define SIU_SDETPUC_CH12_MASK                    0x80000u
#define SIU_SDETPUC_CH12_SHIFT                   19u
#define SIU_SDETPUC_CH12_WIDTH                   1u
#define SIU_SDETPUC_CH12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH12_SHIFT))&SIU_SDETPUC_CH12_MASK)
#define SIU_SDETPUC_CH10_MASK                    0x200000u
#define SIU_SDETPUC_CH10_SHIFT                   21u
#define SIU_SDETPUC_CH10_WIDTH                   1u
#define SIU_SDETPUC_CH10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH10_SHIFT))&SIU_SDETPUC_CH10_MASK)
#define SIU_SDETPUC_CH9_MASK                     0x400000u
#define SIU_SDETPUC_CH9_SHIFT                    22u
#define SIU_SDETPUC_CH9_WIDTH                    1u
#define SIU_SDETPUC_CH9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH9_SHIFT))&SIU_SDETPUC_CH9_MASK)
#define SIU_SDETPUC_CH8_MASK                     0x800000u
#define SIU_SDETPUC_CH8_SHIFT                    23u
#define SIU_SDETPUC_CH8_WIDTH                    1u
#define SIU_SDETPUC_CH8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH8_SHIFT))&SIU_SDETPUC_CH8_MASK)
#define SIU_SDETPUC_CH7_MASK                     0x1000000u
#define SIU_SDETPUC_CH7_SHIFT                    24u
#define SIU_SDETPUC_CH7_WIDTH                    1u
#define SIU_SDETPUC_CH7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH7_SHIFT))&SIU_SDETPUC_CH7_MASK)
#define SIU_SDETPUC_CH5_MASK                     0x4000000u
#define SIU_SDETPUC_CH5_SHIFT                    26u
#define SIU_SDETPUC_CH5_WIDTH                    1u
#define SIU_SDETPUC_CH5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH5_SHIFT))&SIU_SDETPUC_CH5_MASK)
#define SIU_SDETPUC_CH4_MASK                     0x8000000u
#define SIU_SDETPUC_CH4_SHIFT                    27u
#define SIU_SDETPUC_CH4_WIDTH                    1u
#define SIU_SDETPUC_CH4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH4_SHIFT))&SIU_SDETPUC_CH4_MASK)
#define SIU_SDETPUC_CH3_MASK                     0x10000000u
#define SIU_SDETPUC_CH3_SHIFT                    28u
#define SIU_SDETPUC_CH3_WIDTH                    1u
#define SIU_SDETPUC_CH3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH3_SHIFT))&SIU_SDETPUC_CH3_MASK)
#define SIU_SDETPUC_CH2_MASK                     0x20000000u
#define SIU_SDETPUC_CH2_SHIFT                    29u
#define SIU_SDETPUC_CH2_WIDTH                    1u
#define SIU_SDETPUC_CH2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_SDETPUC_CH2_SHIFT))&SIU_SDETPUC_CH2_MASK)
/* TBG_CR_A Bit Fields */
#define SIU_TBG_CR_A_TRIGPER_MASK                0xFFFFFFu
#define SIU_TBG_CR_A_TRIGPER_SHIFT               0u
#define SIU_TBG_CR_A_TRIGPER_WIDTH               24u
#define SIU_TBG_CR_A_TRIGPER(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_TBG_CR_A_TRIGPER_SHIFT))&SIU_TBG_CR_A_TRIGPER_MASK)
#define SIU_TBG_CR_A_CLKSEL_MASK                 0xC000000u
#define SIU_TBG_CR_A_CLKSEL_SHIFT                26u
#define SIU_TBG_CR_A_CLKSEL_WIDTH                2u
#define SIU_TBG_CR_A_CLKSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_TBG_CR_A_CLKSEL_SHIFT))&SIU_TBG_CR_A_CLKSEL_MASK)
#define SIU_TBG_CR_A_GEN_MASK                    0x80000000u
#define SIU_TBG_CR_A_GEN_SHIFT                   31u
#define SIU_TBG_CR_A_GEN_WIDTH                   1u
#define SIU_TBG_CR_A_GEN(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_TBG_CR_A_GEN_SHIFT))&SIU_TBG_CR_A_GEN_MASK)
/* TBG_CR_B Bit Fields */
#define SIU_TBG_CR_B_TRIGPER_MASK                0xFFFFFFu
#define SIU_TBG_CR_B_TRIGPER_SHIFT               0u
#define SIU_TBG_CR_B_TRIGPER_WIDTH               24u
#define SIU_TBG_CR_B_TRIGPER(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_TBG_CR_B_TRIGPER_SHIFT))&SIU_TBG_CR_B_TRIGPER_MASK)
#define SIU_TBG_CR_B_CLKSEL_MASK                 0xC000000u
#define SIU_TBG_CR_B_CLKSEL_SHIFT                26u
#define SIU_TBG_CR_B_CLKSEL_WIDTH                2u
#define SIU_TBG_CR_B_CLKSEL(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_TBG_CR_B_CLKSEL_SHIFT))&SIU_TBG_CR_B_CLKSEL_MASK)
#define SIU_TBG_CR_B_GEN_MASK                    0x80000000u
#define SIU_TBG_CR_B_GEN_SHIFT                   31u
#define SIU_TBG_CR_B_GEN_WIDTH                   1u
#define SIU_TBG_CR_B_GEN(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_TBG_CR_B_GEN_SHIFT))&SIU_TBG_CR_B_GEN_MASK)
/* ECCR Bit Fields */
#define SIU_ECCR_EBDF_MASK                       0x3u
#define SIU_ECCR_EBDF_SHIFT                      0u
#define SIU_ECCR_EBDF_WIDTH                      2u
#define SIU_ECCR_EBDF(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ECCR_EBDF_SHIFT))&SIU_ECCR_EBDF_MASK)
#define SIU_ECCR_EBTS_MASK                       0x8u
#define SIU_ECCR_EBTS_SHIFT                      3u
#define SIU_ECCR_EBTS_WIDTH                      1u
#define SIU_ECCR_EBTS(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ECCR_EBTS_SHIFT))&SIU_ECCR_EBTS_MASK)
#define SIU_ECCR_ECCS_MASK                       0x80u
#define SIU_ECCR_ECCS_SHIFT                      7u
#define SIU_ECCR_ECCS_WIDTH                      1u
#define SIU_ECCR_ECCS(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_ECCR_ECCS_SHIFT))&SIU_ECCR_ECCS_MASK)
#define SIU_ECCR_ENGDIV_MASK                     0xFF00u
#define SIU_ECCR_ENGDIV_SHIFT                    8u
#define SIU_ECCR_ENGDIV_WIDTH                    8u
#define SIU_ECCR_ENGDIV(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_ECCR_ENGDIV_SHIFT))&SIU_ECCR_ENGDIV_MASK)
/* SYSDIV Bit Fields */
#define SIU_SYSDIV_PCSEN_MASK                    0x1u
#define SIU_SYSDIV_PCSEN_SHIFT                   0u
#define SIU_SYSDIV_PCSEN_WIDTH                   1u
#define SIU_SYSDIV_PCSEN(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_PCSEN_SHIFT))&SIU_SYSDIV_PCSEN_MASK)
#define SIU_SYSDIV_SYSCLKDIV_MASK                0x1Cu
#define SIU_SYSDIV_SYSCLKDIV_SHIFT               2u
#define SIU_SYSDIV_SYSCLKDIV_WIDTH               3u
#define SIU_SYSDIV_SYSCLKDIV(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_SYSCLKDIV_SHIFT))&SIU_SYSDIV_SYSCLKDIV_MASK)
#define SIU_SYSDIV_ETPUDIV_MASK                  0x100u
#define SIU_SYSDIV_ETPUDIV_SHIFT                 8u
#define SIU_SYSDIV_ETPUDIV_WIDTH                 1u
#define SIU_SYSDIV_ETPUDIV(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_ETPUDIV_SHIFT))&SIU_SYSDIV_ETPUDIV_MASK)
#define SIU_SYSDIV_SYSCLKSEL_MASK                0x3000u
#define SIU_SYSDIV_SYSCLKSEL_SHIFT               12u
#define SIU_SYSDIV_SYSCLKSEL_WIDTH               2u
#define SIU_SYSDIV_SYSCLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_SYSCLKSEL_SHIFT))&SIU_SYSDIV_SYSCLKSEL_MASK)
#define SIU_SYSDIV_MCANSEL_MASK                  0x8000u
#define SIU_SYSDIV_MCANSEL_SHIFT                 15u
#define SIU_SYSDIV_MCANSEL_WIDTH                 1u
#define SIU_SYSDIV_MCANSEL(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_MCANSEL_SHIFT))&SIU_SYSDIV_MCANSEL_MASK)
#define SIU_SYSDIV_PERDIV_MASK                   0x30000u
#define SIU_SYSDIV_PERDIV_SHIFT                  16u
#define SIU_SYSDIV_PERDIV_WIDTH                  2u
#define SIU_SYSDIV_PERDIV(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_PERDIV_SHIFT))&SIU_SYSDIV_PERDIV_MASK)
#define SIU_SYSDIV_FMPERDIV_MASK                 0x300000u
#define SIU_SYSDIV_FMPERDIV_SHIFT                20u
#define SIU_SYSDIV_FMPERDIV_WIDTH                2u
#define SIU_SYSDIV_FMPERDIV(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_FMPERDIV_SHIFT))&SIU_SYSDIV_FMPERDIV_MASK)
#define SIU_SYSDIV_PERCLKSEL_MASK                0x1000000u
#define SIU_SYSDIV_PERCLKSEL_SHIFT               24u
#define SIU_SYSDIV_PERCLKSEL_WIDTH               1u
#define SIU_SYSDIV_PERCLKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_PERCLKSEL_SHIFT))&SIU_SYSDIV_PERCLKSEL_MASK)
#define SIU_SYSDIV_PLL1SEL_MASK                  0x4000000u
