neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_SYSDIV_PLL1SEL_SHIFT                 26u
#define SIU_SYSDIV_PLL1SEL_WIDTH                 1u
#define SIU_SYSDIV_PLL1SEL(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_PLL1SEL_SHIFT))&SIU_SYSDIV_PLL1SEL_MASK)
#define SIU_SYSDIV_PLL0SEL_MASK                  0x10000000u
#define SIU_SYSDIV_PLL0SEL_SHIFT                 28u
#define SIU_SYSDIV_PLL0SEL_WIDTH                 1u
#define SIU_SYSDIV_PLL0SEL(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_PLL0SEL_SHIFT))&SIU_SYSDIV_PLL0SEL_MASK)
#define SIU_SYSDIV_LCK_MASK                      0x80000000u
#define SIU_SYSDIV_LCK_SHIFT                     31u
#define SIU_SYSDIV_LCK_WIDTH                     1u
#define SIU_SYSDIV_LCK(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_SYSDIV_LCK_SHIFT))&SIU_SYSDIV_LCK_MASK)
/* HLT1 Bit Fields */
#define SIU_HLT1_ESCIA_MASK                      0x1u
#define SIU_HLT1_ESCIA_SHIFT                     0u
#define SIU_HLT1_ESCIA_WIDTH                     1u
#define SIU_HLT1_ESCIA(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ESCIA_SHIFT))&SIU_HLT1_ESCIA_MASK)
#define SIU_HLT1_ESCIB_MASK                      0x2u
#define SIU_HLT1_ESCIB_SHIFT                     1u
#define SIU_HLT1_ESCIB_WIDTH                     1u
#define SIU_HLT1_ESCIB(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ESCIB_SHIFT))&SIU_HLT1_ESCIB_MASK)
#define SIU_HLT1_ESCIC_MASK                      0x4u
#define SIU_HLT1_ESCIC_SHIFT                     2u
#define SIU_HLT1_ESCIC_WIDTH                     1u
#define SIU_HLT1_ESCIC(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ESCIC_SHIFT))&SIU_HLT1_ESCIC_MASK)
#define SIU_HLT1_ESCID_MASK                      0x8u
#define SIU_HLT1_ESCID_SHIFT                     3u
#define SIU_HLT1_ESCID_WIDTH                     1u
#define SIU_HLT1_ESCID(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ESCID_SHIFT))&SIU_HLT1_ESCID_MASK)
#define SIU_HLT1_ESCIE_MASK                      0x10u
#define SIU_HLT1_ESCIE_SHIFT                     4u
#define SIU_HLT1_ESCIE_WIDTH                     1u
#define SIU_HLT1_ESCIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ESCIE_SHIFT))&SIU_HLT1_ESCIE_MASK)
#define SIU_HLT1_ESCIF_MASK                      0x20u
#define SIU_HLT1_ESCIF_SHIFT                     5u
#define SIU_HLT1_ESCIF_WIDTH                     1u
#define SIU_HLT1_ESCIF(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ESCIF_SHIFT))&SIU_HLT1_ESCIF_MASK)
#define SIU_HLT1_DSPIE_MASK                      0x80u
#define SIU_HLT1_DSPIE_SHIFT                     7u
#define SIU_HLT1_DSPIE_WIDTH                     1u
#define SIU_HLT1_DSPIE(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_DSPIE_SHIFT))&SIU_HLT1_DSPIE_MASK)
#define SIU_HLT1_DSPIA_MASK                      0x100u
#define SIU_HLT1_DSPIA_SHIFT                     8u
#define SIU_HLT1_DSPIA_WIDTH                     1u
#define SIU_HLT1_DSPIA(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_DSPIA_SHIFT))&SIU_HLT1_DSPIA_MASK)
#define SIU_HLT1_DSPIB_MASK                      0x200u
#define SIU_HLT1_DSPIB_SHIFT                     9u
#define SIU_HLT1_DSPIB_WIDTH                     1u
#define SIU_HLT1_DSPIB(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_DSPIB_SHIFT))&SIU_HLT1_DSPIB_MASK)
#define SIU_HLT1_DSPIC_MASK                      0x400u
#define SIU_HLT1_DSPIC_SHIFT                     10u
#define SIU_HLT1_DSPIC_WIDTH                     1u
#define SIU_HLT1_DSPIC(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_DSPIC_SHIFT))&SIU_HLT1_DSPIC_MASK)
#define SIU_HLT1_DSPID_MASK                      0x800u
#define SIU_HLT1_DSPID_SHIFT                     11u
#define SIU_HLT1_DSPID_WIDTH                     1u
#define SIU_HLT1_DSPID(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_DSPID_SHIFT))&SIU_HLT1_DSPID_MASK)
#define SIU_HLT1_FLEXCANA_MASK                   0x1000u
#define SIU_HLT1_FLEXCANA_SHIFT                  12u
#define SIU_HLT1_FLEXCANA_WIDTH                  1u
#define SIU_HLT1_FLEXCANA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_FLEXCANA_SHIFT))&SIU_HLT1_FLEXCANA_MASK)
#define SIU_HLT1_FLEXCANB_MASK                   0x2000u
#define SIU_HLT1_FLEXCANB_SHIFT                  13u
#define SIU_HLT1_FLEXCANB_WIDTH                  1u
#define SIU_HLT1_FLEXCANB(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_FLEXCANB_SHIFT))&SIU_HLT1_FLEXCANB_MASK)
#define SIU_HLT1_FLEXCANC_MASK                   0x4000u
#define SIU_HLT1_FLEXCANC_SHIFT                  14u
#define SIU_HLT1_FLEXCANC_WIDTH                  1u
#define SIU_HLT1_FLEXCANC(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_FLEXCANC_SHIFT))&SIU_HLT1_FLEXCANC_MASK)
#define SIU_HLT1_FLEXCAND_MASK                   0x8000u
#define SIU_HLT1_FLEXCAND_SHIFT                  15u
#define SIU_HLT1_FLEXCAND_WIDTH                  1u
#define SIU_HLT1_FLEXCAND(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_FLEXCAND_SHIFT))&SIU_HLT1_FLEXCAND_MASK)
#define SIU_HLT1_PIT_MASK                        0x40000u
#define SIU_HLT1_PIT_SHIFT                       18u
#define SIU_HLT1_PIT_WIDTH                       1u
#define SIU_HLT1_PIT(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_PIT_SHIFT))&SIU_HLT1_PIT_MASK)
#define SIU_HLT1_EMIOS1_MASK                     0x80000u
#define SIU_HLT1_EMIOS1_SHIFT                    19u
#define SIU_HLT1_EMIOS1_WIDTH                    1u
#define SIU_HLT1_EMIOS1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_EMIOS1_SHIFT))&SIU_HLT1_EMIOS1_MASK)
#define SIU_HLT1_DECFIL_MASK                     0x100000u
#define SIU_HLT1_DECFIL_SHIFT                    20u
#define SIU_HLT1_DECFIL_WIDTH                    1u
#define SIU_HLT1_DECFIL(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_DECFIL_SHIFT))&SIU_HLT1_DECFIL_MASK)
#define SIU_HLT1_EMIOS0_MASK                     0x200000u
#define SIU_HLT1_EMIOS0_SHIFT                    21u
#define SIU_HLT1_EMIOS0_WIDTH                    1u
#define SIU_HLT1_EMIOS0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_EMIOS0_SHIFT))&SIU_HLT1_EMIOS0_MASK)
#define SIU_HLT1_EQADCA_MASK                     0x400000u
#define SIU_HLT1_EQADCA_SHIFT                    22u
#define SIU_HLT1_EQADCA_WIDTH                    1u
#define SIU_HLT1_EQADCA(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_EQADCA_SHIFT))&SIU_HLT1_EQADCA_MASK)
#define SIU_HLT1_EQADCB_MASK                     0x800000u
#define SIU_HLT1_EQADCB_SHIFT                    23u
#define SIU_HLT1_EQADCB_WIDTH                    1u
#define SIU_HLT1_EQADCB(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_EQADCB_SHIFT))&SIU_HLT1_EQADCB_MASK)
#define SIU_HLT1_EBI_MASK                        0x1000000u
#define SIU_HLT1_EBI_SHIFT                       24u
#define SIU_HLT1_EBI_WIDTH                       1u
#define SIU_HLT1_EBI(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_EBI_SHIFT))&SIU_HLT1_EBI_MASK)
#define SIU_HLT1_NPC_MASK                        0x2000000u
#define SIU_HLT1_NPC_SHIFT                       25u
#define SIU_HLT1_NPC_WIDTH                       1u
#define SIU_HLT1_NPC(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_NPC_SHIFT))&SIU_HLT1_NPC_MASK)
#define SIU_HLT1_ETPUA_MASK                      0x4000000u
#define SIU_HLT1_ETPUA_SHIFT                     26u
#define SIU_HLT1_ETPUA_WIDTH                     1u
#define SIU_HLT1_ETPUA(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ETPUA_SHIFT))&SIU_HLT1_ETPUA_MASK)
#define SIU_HLT1_ETPUC_MASK                      0x8000000u
#define SIU_HLT1_ETPUC_SHIFT                     27u
#define SIU_HLT1_ETPUC_WIDTH                     1u
#define SIU_HLT1_ETPUC(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_ETPUC_SHIFT))&SIU_HLT1_ETPUC_MASK)
#define SIU_HLT1_CSE_MASK                        0x10000000u
#define SIU_HLT1_CSE_SHIFT                       28u
#define SIU_HLT1_CSE_WIDTH                       1u
#define SIU_HLT1_CSE(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_CSE_SHIFT))&SIU_HLT1_CSE_MASK)
#define SIU_HLT1_CORE1_MASK                      0x40000000u
#define SIU_HLT1_CORE1_SHIFT                     30u
#define SIU_HLT1_CORE1_WIDTH                     1u
#define SIU_HLT1_CORE1(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_CORE1_SHIFT))&SIU_HLT1_CORE1_MASK)
#define SIU_HLT1_CORE0_MASK                      0x80000000u
#define SIU_HLT1_CORE0_SHIFT                     31u
#define SIU_HLT1_CORE0_WIDTH                     1u
#define SIU_HLT1_CORE0(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT1_CORE0_SHIFT))&SIU_HLT1_CORE0_MASK)
/* HLTACK1 Bit Fields */
#define SIU_HLTACK1_ESCIA_MASK                   0x1u
#define SIU_HLTACK1_ESCIA_SHIFT                  0u
#define SIU_HLTACK1_ESCIA_WIDTH                  1u
#define SIU_HLTACK1_ESCIA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ESCIA_SHIFT))&SIU_HLTACK1_ESCIA_MASK)
#define SIU_HLTACK1_ESCIB_MASK                   0x2u
#define SIU_HLTACK1_ESCIB_SHIFT                  1u
#define SIU_HLTACK1_ESCIB_WIDTH                  1u
#define SIU_HLTACK1_ESCIB(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ESCIB_SHIFT))&SIU_HLTACK1_ESCIB_MASK)
#define SIU_HLTACK1_ESCIC_MASK                   0x4u
#define SIU_HLTACK1_ESCIC_SHIFT                  2u
#define SIU_HLTACK1_ESCIC_WIDTH                  1u
#define SIU_HLTACK1_ESCIC(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ESCIC_SHIFT))&SIU_HLTACK1_ESCIC_MASK)
#define SIU_HLTACK1_ESCID_MASK                   0x8u
#define SIU_HLTACK1_ESCID_SHIFT                  3u
#define SIU_HLTACK1_ESCID_WIDTH                  1u
#define SIU_HLTACK1_ESCID(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ESCID_SHIFT))&SIU_HLTACK1_ESCID_MASK)
#define SIU_HLTACK1_ESCIE_MASK                   0x10u
#define SIU_HLTACK1_ESCIE_SHIFT                  4u
#define SIU_HLTACK1_ESCIE_WIDTH                  1u
#define SIU_HLTACK1_ESCIE(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ESCIE_SHIFT))&SIU_HLTACK1_ESCIE_MASK)
#define SIU_HLTACK1_ESCIF_MASK                   0x20u
#define SIU_HLTACK1_ESCIF_SHIFT                  5u
#define SIU_HLTACK1_ESCIF_WIDTH                  1u
#define SIU_HLTACK1_ESCIF(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ESCIF_SHIFT))&SIU_HLTACK1_ESCIF_MASK)
#define SIU_HLTACK1_DSPIE_MASK                   0x80u
#define SIU_HLTACK1_DSPIE_SHIFT                  7u
#define SIU_HLTACK1_DSPIE_WIDTH                  1u
#define SIU_HLTACK1_DSPIE(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_DSPIE_SHIFT))&SIU_HLTACK1_DSPIE_MASK)
#define SIU_HLTACK1_DSPIA_MASK                   0x100u
#define SIU_HLTACK1_DSPIA_SHIFT                  8u
#define SIU_HLTACK1_DSPIA_WIDTH                  1u
#define SIU_HLTACK1_DSPIA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_DSPIA_SHIFT))&SIU_HLTACK1_DSPIA_MASK)
#define SIU_HLTACK1_DSPIB_MASK                   0x200u
#define SIU_HLTACK1_DSPIB_SHIFT                  9u
#define SIU_HLTACK1_DSPIB_WIDTH                  1u
#define SIU_HLTACK1_DSPIB(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_DSPIB_SHIFT))&SIU_HLTACK1_DSPIB_MASK)
#define SIU_HLTACK1_DSPIC_MASK                   0x400u
#define SIU_HLTACK1_DSPIC_SHIFT                  10u
#define SIU_HLTACK1_DSPIC_WIDTH                  1u
#define SIU_HLTACK1_DSPIC(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_DSPIC_SHIFT))&SIU_HLTACK1_DSPIC_MASK)
#define SIU_HLTACK1_DSPID_MASK                   0x800u
#define SIU_HLTACK1_DSPID_SHIFT                  11u
#define SIU_HLTACK1_DSPID_WIDTH                  1u
#define SIU_HLTACK1_DSPID(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_DSPID_SHIFT))&SIU_HLTACK1_DSPID_MASK)
#define SIU_HLTACK1_FLEXCANA_MASK                0x1000u
#define SIU_HLTACK1_FLEXCANA_SHIFT               12u
#define SIU_HLTACK1_FLEXCANA_WIDTH               1u
#define SIU_HLTACK1_FLEXCANA(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_FLEXCANA_SHIFT))&SIU_HLTACK1_FLEXCANA_MASK)
#define SIU_HLTACK1_FLEXCANB_MASK                0x2000u
#define SIU_HLTACK1_FLEXCANB_SHIFT               13u
#define SIU_HLTACK1_FLEXCANB_WIDTH               1u
#define SIU_HLTACK1_FLEXCANB(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_FLEXCANB_SHIFT))&SIU_HLTACK1_FLEXCANB_MASK)
#define SIU_HLTACK1_FLEXCANC_MASK                0x4000u
#define SIU_HLTACK1_FLEXCANC_SHIFT               14u
#define SIU_HLTACK1_FLEXCANC_WIDTH               1u
#define SIU_HLTACK1_FLEXCANC(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_FLEXCANC_SHIFT))&SIU_HLTACK1_FLEXCANC_MASK)
#define SIU_HLTACK1_FLEXCAND_MASK                0x8000u
#define SIU_HLTACK1_FLEXCAND_SHIFT               15u
#define SIU_HLTACK1_FLEXCAND_WIDTH               1u
#define SIU_HLTACK1_FLEXCAND(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_FLEXCAND_SHIFT))&SIU_HLTACK1_FLEXCAND_MASK)
#define SIU_HLTACK1_PIT_MASK                     0x40000u
#define SIU_HLTACK1_PIT_SHIFT                    18u
#define SIU_HLTACK1_PIT_WIDTH                    1u
#define SIU_HLTACK1_PIT(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_PIT_SHIFT))&SIU_HLTACK1_PIT_MASK)
#define SIU_HLTACK1_EMIOS1_MASK                  0x80000u
#define SIU_HLTACK1_EMIOS1_SHIFT                 19u
#define SIU_HLTACK1_EMIOS1_WIDTH                 1u
#define SIU_HLTACK1_EMIOS1(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_EMIOS1_SHIFT))&SIU_HLTACK1_EMIOS1_MASK)
#define SIU_HLTACK1_DECFIL_MASK                  0x100000u
#define SIU_HLTACK1_DECFIL_SHIFT                 20u
#define SIU_HLTACK1_DECFIL_WIDTH                 1u
#define SIU_HLTACK1_DECFIL(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_DECFIL_SHIFT))&SIU_HLTACK1_DECFIL_MASK)
#define SIU_HLTACK1_EMIOS0_MASK                  0x200000u
#define SIU_HLTACK1_EMIOS0_SHIFT                 21u
#define SIU_HLTACK1_EMIOS0_WIDTH                 1u
#define SIU_HLTACK1_EMIOS0(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_EMIOS0_SHIFT))&SIU_HLTACK1_EMIOS0_MASK)
#define SIU_HLTACK1_EQADCA_MASK                  0x400000u
#define SIU_HLTACK1_EQADCA_SHIFT                 22u
#define SIU_HLTACK1_EQADCA_WIDTH                 1u
#define SIU_HLTACK1_EQADCA(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_EQADCA_SHIFT))&SIU_HLTACK1_EQADCA_MASK)
#define SIU_HLTACK1_EQADCB_MASK                  0x800000u
#define SIU_HLTACK1_EQADCB_SHIFT                 23u
#define SIU_HLTACK1_EQADCB_WIDTH                 1u
#define SIU_HLTACK1_EQADCB(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_EQADCB_SHIFT))&SIU_HLTACK1_EQADCB_MASK)
#define SIU_HLTACK1_EBI_MASK                     0x1000000u
#define SIU_HLTACK1_EBI_SHIFT                    24u
#define SIU_HLTACK1_EBI_WIDTH                    1u
#define SIU_HLTACK1_EBI(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_EBI_SHIFT))&SIU_HLTACK1_EBI_MASK)
#define SIU_HLTACK1_NPC_MASK                     0x2000000u
#define SIU_HLTACK1_NPC_SHIFT                    25u
#define SIU_HLTACK1_NPC_WIDTH                    1u
#define SIU_HLTACK1_NPC(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_NPC_SHIFT))&SIU_HLTACK1_NPC_MASK)
#define SIU_HLTACK1_ETPUA_MASK                   0x4000000u
#define SIU_HLTACK1_ETPUA_SHIFT                  26u
#define SIU_HLTACK1_ETPUA_WIDTH                  1u
#define SIU_HLTACK1_ETPUA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ETPUA_SHIFT))&SIU_HLTACK1_ETPUA_MASK)
#define SIU_HLTACK1_ETPUC_MASK                   0x8000000u
#define SIU_HLTACK1_ETPUC_SHIFT                  27u
#define SIU_HLTACK1_ETPUC_WIDTH                  1u
#define SIU_HLTACK1_ETPUC(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_ETPUC_SHIFT))&SIU_HLTACK1_ETPUC_MASK)
#define SIU_HLTACK1_CSE_MASK                     0x10000000u
#define SIU_HLTACK1_CSE_SHIFT                    28u
#define SIU_HLTACK1_CSE_WIDTH                    1u
#define SIU_HLTACK1_CSE(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_CSE_SHIFT))&SIU_HLTACK1_CSE_MASK)
#define SIU_HLTACK1_CORE1_MASK                   0x40000000u
#define SIU_HLTACK1_CORE1_SHIFT                  30u
#define SIU_HLTACK1_CORE1_WIDTH                  1u
#define SIU_HLTACK1_CORE1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_CORE1_SHIFT))&SIU_HLTACK1_CORE1_MASK)
#define SIU_HLTACK1_CORE0_MASK                   0x80000000u
#define SIU_HLTACK1_CORE0_SHIFT                  31u
#define SIU_HLTACK1_CORE0_WIDTH                  1u
#define SIU_HLTACK1_CORE0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK1_CORE0_SHIFT))&SIU_HLTACK1_CORE0_MASK)
/* RSTVEC0 Bit Fields */
#define SIU_RSTVEC0_VLE_MASK                     0x1u
#define SIU_RSTVEC0_VLE_SHIFT                    0u
#define SIU_RSTVEC0_VLE_WIDTH                    1u
#define SIU_RSTVEC0_VLE(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_RSTVEC0_VLE_SHIFT))&SIU_RSTVEC0_VLE_MASK)
#define SIU_RSTVEC0_RST_MASK                     0x2u
#define SIU_RSTVEC0_RST_SHIFT                    1u
#define SIU_RSTVEC0_RST_WIDTH                    1u
#define SIU_RSTVEC0_RST(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_RSTVEC0_RST_SHIFT))&SIU_RSTVEC0_RST_MASK)
#define SIU_RSTVEC0_RSTVEC_MASK                  0xFFFFFFFCu
#define SIU_RSTVEC0_RSTVEC_SHIFT                 2u
#define SIU_RSTVEC0_RSTVEC_WIDTH                 30u
#define SIU_RSTVEC0_RSTVEC(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_RSTVEC0_RSTVEC_SHIFT))&SIU_RSTVEC0_RSTVEC_MASK)
/* RSTVEC1 Bit Fields */
#define SIU_RSTVEC1_VLE_MASK                     0x1u
#define SIU_RSTVEC1_VLE_SHIFT                    0u
#define SIU_RSTVEC1_VLE_WIDTH                    1u
#define SIU_RSTVEC1_VLE(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_RSTVEC1_VLE_SHIFT))&SIU_RSTVEC1_VLE_MASK)
#define SIU_RSTVEC1_RST_MASK                     0x2u
#define SIU_RSTVEC1_RST_SHIFT                    1u
#define SIU_RSTVEC1_RST_WIDTH                    1u
#define SIU_RSTVEC1_RST(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_RSTVEC1_RST_SHIFT))&SIU_RSTVEC1_RST_MASK)
#define SIU_RSTVEC1_RSTVEC_MASK                  0xFFFFFFFCu
#define SIU_RSTVEC1_RSTVEC_SHIFT                 2u
#define SIU_RSTVEC1_RSTVEC_WIDTH                 30u
#define SIU_RSTVEC1_RSTVEC(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_RSTVEC1_RSTVEC_SHIFT))&SIU_RSTVEC1_RSTVEC_MASK)
/* C0PID Bit Fields */
#define SIU_C0PID_EXT_PID_MASK                   0x3u
#define SIU_C0PID_EXT_PID_SHIFT                  0u
#define SIU_C0PID_EXT_PID_WIDTH                  2u
#define SIU_C0PID_EXT_PID(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_C0PID_EXT_PID_SHIFT))&SIU_C0PID_EXT_PID_MASK)
#define SIU_C0PID_EXT_PID_SYNC_MASK              0x40000000u
#define SIU_C0PID_EXT_PID_SYNC_SHIFT             30u
#define SIU_C0PID_EXT_PID_SYNC_WIDTH             1u
#define SIU_C0PID_EXT_PID_SYNC(x)                (((uint32_t)(((uint32_t)(x))<<SIU_C0PID_EXT_PID_SYNC_SHIFT))&SIU_C0PID_EXT_PID_SYNC_MASK)
#define SIU_C0PID_EXT_PID_EN_MASK                0x80000000u
#define SIU_C0PID_EXT_PID_EN_SHIFT               31u
#define SIU_C0PID_EXT_PID_EN_WIDTH               1u
#define SIU_C0PID_EXT_PID_EN(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_C0PID_EXT_PID_EN_SHIFT))&SIU_C0PID_EXT_PID_EN_MASK)
/* C1PID Bit Fields */
#define SIU_C1PID_EXT_PID_MASK                   0x3u
#define SIU_C1PID_EXT_PID_SHIFT                  0u
#define SIU_C1PID_EXT_PID_WIDTH                  2u
#define SIU_C1PID_EXT_PID(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_C1PID_EXT_PID_SHIFT))&SIU_C1PID_EXT_PID_MASK)
#define SIU_C1PID_EXT_PID_SYNC_MASK              0x40000000u
#define SIU_C1PID_EXT_PID_SYNC_SHIFT             30u
#define SIU_C1PID_EXT_PID_SYNC_WIDTH             1u
#define SIU_C1PID_EXT_PID_SYNC(x)                (((uint32_t)(((uint32_t)(x))<<SIU_C1PID_EXT_PID_SYNC_SHIFT))&SIU_C1PID_EXT_PID_SYNC_MASK)
#define SIU_C1PID_EXT_PID_EN_MASK                0x80000000u
#define SIU_C1PID_EXT_PID_EN_SHIFT               31u
#define SIU_C1PID_EXT_PID_EN_WIDTH               1u
#define SIU_C1PID_EXT_PID_EN(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_C1PID_EXT_PID_EN_SHIFT))&SIU_C1PID_EXT_PID_EN_MASK)
/* HLT2 Bit Fields */
#define SIU_HLT2_MCANA_MASK                      0x1u
#define SIU_HLT2_MCANA_SHIFT                     0u
#define SIU_HLT2_MCANA_WIDTH                     1u
#define SIU_HLT2_MCANA(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_MCANA_SHIFT))&SIU_HLT2_MCANA_MASK)
#define SIU_HLT2_MCANB_MASK                      0x2u
#define SIU_HLT2_MCANB_SHIFT                     1u
#define SIU_HLT2_MCANB_WIDTH                     1u
#define SIU_HLT2_MCANB(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_MCANB_SHIFT))&SIU_HLT2_MCANB_MASK)
#define SIU_HLT2_PSI5A_MASK                      0x10u
#define SIU_HLT2_PSI5A_SHIFT                     4u
#define SIU_HLT2_PSI5A_WIDTH                     1u
#define SIU_HLT2_PSI5A(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_PSI5A_SHIFT))&SIU_HLT2_PSI5A_MASK)
#define SIU_HLT2_PSI5B_MASK                      0x20u
#define SIU_HLT2_PSI5B_SHIFT                     5u
#define SIU_HLT2_PSI5B_WIDTH                     1u
#define SIU_HLT2_PSI5B(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_PSI5B_SHIFT))&SIU_HLT2_PSI5B_MASK)
#define SIU_HLT2_SRX0_MASK                       0x100u
#define SIU_HLT2_SRX0_SHIFT                      8u
#define SIU_HLT2_SRX0_WIDTH                      1u
#define SIU_HLT2_SRX0(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SRX0_SHIFT))&SIU_HLT2_SRX0_MASK)
#define SIU_HLT2_SRX1_MASK                       0x200u
#define SIU_HLT2_SRX1_SHIFT                      9u
#define SIU_HLT2_SRX1_WIDTH                      1u
#define SIU_HLT2_SRX1(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SRX1_SHIFT))&SIU_HLT2_SRX1_MASK)
#define SIU_HLT2_STCU_MASK                       0x2000u
#define SIU_HLT2_STCU_SHIFT                      13u
#define SIU_HLT2_STCU_WIDTH                      1u
#define SIU_HLT2_STCU(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_STCU_SHIFT))&SIU_HLT2_STCU_MASK)
#define SIU_HLT2_CRC_MASK                        0x4000u
#define SIU_HLT2_CRC_SHIFT                       14u
#define SIU_HLT2_CRC_WIDTH                       1u
#define SIU_HLT2_CRC(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_CRC_SHIFT))&SIU_HLT2_CRC_MASK)
#define SIU_HLT2_SIPI_MASK                       0x8000u
#define SIU_HLT2_SIPI_SHIFT                      15u
#define SIU_HLT2_SIPI_WIDTH                      1u
#define SIU_HLT2_SIPI(x)                         (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SIPI_SHIFT))&SIU_HLT2_SIPI_MASK)
#define SIU_HLT2_SDA_MASK                        0x10000u
#define SIU_HLT2_SDA_SHIFT                       16u
#define SIU_HLT2_SDA_WIDTH                       1u
#define SIU_HLT2_SDA(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SDA_SHIFT))&SIU_HLT2_SDA_MASK)
#define SIU_HLT2_SDB_MASK                        0x20000u
#define SIU_HLT2_SDB_SHIFT                       17u
#define SIU_HLT2_SDB_WIDTH                       1u
#define SIU_HLT2_SDB(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SDB_SHIFT))&SIU_HLT2_SDB_MASK)
#define SIU_HLT2_SDC_MASK                        0x40000u
#define SIU_HLT2_SDC_SHIFT                       18u
#define SIU_HLT2_SDC_WIDTH                       1u
