neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_HLT2_SDC(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SDC_SHIFT))&SIU_HLT2_SDC_MASK)
#define SIU_HLT2_SDD_MASK                        0x80000u
#define SIU_HLT2_SDD_SHIFT                       19u
#define SIU_HLT2_SDD_WIDTH                       1u
#define SIU_HLT2_SDD(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_SDD_SHIFT))&SIU_HLT2_SDD_MASK)
#define SIU_HLT2_FEC_MASK                        0x80000000u
#define SIU_HLT2_FEC_SHIFT                       31u
#define SIU_HLT2_FEC_WIDTH                       1u
#define SIU_HLT2_FEC(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_HLT2_FEC_SHIFT))&SIU_HLT2_FEC_MASK)
/* HLTACK2 Bit Fields */
#define SIU_HLTACK2_MCANA_MASK                   0x1u
#define SIU_HLTACK2_MCANA_SHIFT                  0u
#define SIU_HLTACK2_MCANA_WIDTH                  1u
#define SIU_HLTACK2_MCANA(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_MCANA_SHIFT))&SIU_HLTACK2_MCANA_MASK)
#define SIU_HLTACK2_MCANB_MASK                   0x2u
#define SIU_HLTACK2_MCANB_SHIFT                  1u
#define SIU_HLTACK2_MCANB_WIDTH                  1u
#define SIU_HLTACK2_MCANB(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_MCANB_SHIFT))&SIU_HLTACK2_MCANB_MASK)
#define SIU_HLTACK2_PSI5A_MASK                   0x10u
#define SIU_HLTACK2_PSI5A_SHIFT                  4u
#define SIU_HLTACK2_PSI5A_WIDTH                  1u
#define SIU_HLTACK2_PSI5A(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_PSI5A_SHIFT))&SIU_HLTACK2_PSI5A_MASK)
#define SIU_HLTACK2_PSI5B_MASK                   0x20u
#define SIU_HLTACK2_PSI5B_SHIFT                  5u
#define SIU_HLTACK2_PSI5B_WIDTH                  1u
#define SIU_HLTACK2_PSI5B(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_PSI5B_SHIFT))&SIU_HLTACK2_PSI5B_MASK)
#define SIU_HLTACK2_SRX0_MASK                    0x100u
#define SIU_HLTACK2_SRX0_SHIFT                   8u
#define SIU_HLTACK2_SRX0_WIDTH                   1u
#define SIU_HLTACK2_SRX0(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SRX0_SHIFT))&SIU_HLTACK2_SRX0_MASK)
#define SIU_HLTACK2_SRX1_MASK                    0x200u
#define SIU_HLTACK2_SRX1_SHIFT                   9u
#define SIU_HLTACK2_SRX1_WIDTH                   1u
#define SIU_HLTACK2_SRX1(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SRX1_SHIFT))&SIU_HLTACK2_SRX1_MASK)
#define SIU_HLTACK2_STCU_MASK                    0x2000u
#define SIU_HLTACK2_STCU_SHIFT                   13u
#define SIU_HLTACK2_STCU_WIDTH                   1u
#define SIU_HLTACK2_STCU(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_STCU_SHIFT))&SIU_HLTACK2_STCU_MASK)
#define SIU_HLTACK2_CRC_MASK                     0x4000u
#define SIU_HLTACK2_CRC_SHIFT                    14u
#define SIU_HLTACK2_CRC_WIDTH                    1u
#define SIU_HLTACK2_CRC(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_CRC_SHIFT))&SIU_HLTACK2_CRC_MASK)
#define SIU_HLTACK2_SIPI_MASK                    0x8000u
#define SIU_HLTACK2_SIPI_SHIFT                   15u
#define SIU_HLTACK2_SIPI_WIDTH                   1u
#define SIU_HLTACK2_SIPI(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SIPI_SHIFT))&SIU_HLTACK2_SIPI_MASK)
#define SIU_HLTACK2_SDA_MASK                     0x10000u
#define SIU_HLTACK2_SDA_SHIFT                    16u
#define SIU_HLTACK2_SDA_WIDTH                    1u
#define SIU_HLTACK2_SDA(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SDA_SHIFT))&SIU_HLTACK2_SDA_MASK)
#define SIU_HLTACK2_SDB_MASK                     0x20000u
#define SIU_HLTACK2_SDB_SHIFT                    17u
#define SIU_HLTACK2_SDB_WIDTH                    1u
#define SIU_HLTACK2_SDB(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SDB_SHIFT))&SIU_HLTACK2_SDB_MASK)
#define SIU_HLTACK2_SDC_MASK                     0x40000u
#define SIU_HLTACK2_SDC_SHIFT                    18u
#define SIU_HLTACK2_SDC_WIDTH                    1u
#define SIU_HLTACK2_SDC(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SDC_SHIFT))&SIU_HLTACK2_SDC_MASK)
#define SIU_HLTACK2_SDD_MASK                     0x80000u
#define SIU_HLTACK2_SDD_SHIFT                    19u
#define SIU_HLTACK2_SDD_WIDTH                    1u
#define SIU_HLTACK2_SDD(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_SDD_SHIFT))&SIU_HLTACK2_SDD_MASK)
#define SIU_HLTACK2_FEC_MASK                     0x80000000u
#define SIU_HLTACK2_FEC_SHIFT                    31u
#define SIU_HLTACK2_FEC_WIDTH                    1u
#define SIU_HLTACK2_FEC(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_HLTACK2_FEC_SHIFT))&SIU_HLTACK2_FEC_MASK)
/* SDCLKCFG Bit Fields */
#define SIU_SDCLKCFG_SDDIV_MASK                  0x7Fu
#define SIU_SDCLKCFG_SDDIV_SHIFT                 0u
#define SIU_SDCLKCFG_SDDIV_WIDTH                 7u
#define SIU_SDCLKCFG_SDDIV(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_SDCLKCFG_SDDIV_SHIFT))&SIU_SDCLKCFG_SDDIV_MASK)
#define SIU_SDCLKCFG_LCK_MASK                    0x80000000u
#define SIU_SDCLKCFG_LCK_SHIFT                   31u
#define SIU_SDCLKCFG_LCK_WIDTH                   1u
#define SIU_SDCLKCFG_LCK(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_SDCLKCFG_LCK_SHIFT))&SIU_SDCLKCFG_LCK_MASK)
/* LFCLKCFG Bit Fields */
#define SIU_LFCLKCFG_LFDIV_MASK                  0x7Fu
#define SIU_LFCLKCFG_LFDIV_SHIFT                 0u
#define SIU_LFCLKCFG_LFDIV_WIDTH                 7u
#define SIU_LFCLKCFG_LFDIV(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_LFCLKCFG_LFDIV_SHIFT))&SIU_LFCLKCFG_LFDIV_MASK)
#define SIU_LFCLKCFG_LFCLKSEL_MASK               0x3000u
#define SIU_LFCLKCFG_LFCLKSEL_SHIFT              12u
#define SIU_LFCLKCFG_LFCLKSEL_WIDTH              2u
#define SIU_LFCLKCFG_LFCLKSEL(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_LFCLKCFG_LFCLKSEL_SHIFT))&SIU_LFCLKCFG_LFCLKSEL_MASK)
#define SIU_LFCLKCFG_LCK_MASK                    0x80000000u
#define SIU_LFCLKCFG_LCK_SHIFT                   31u
#define SIU_LFCLKCFG_LCK_WIDTH                   1u
#define SIU_LFCLKCFG_LCK(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_LFCLKCFG_LCK_SHIFT))&SIU_LFCLKCFG_LCK_MASK)
/* PSCLKCFG Bit Fields */
#define SIU_PSCLKCFG_PSDIV1M_MASK                0x3FFu
#define SIU_PSCLKCFG_PSDIV1M_SHIFT               0u
#define SIU_PSCLKCFG_PSDIV1M_WIDTH               10u
#define SIU_PSCLKCFG_PSDIV1M(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_PSCLKCFG_PSDIV1M_SHIFT))&SIU_PSCLKCFG_PSDIV1M_MASK)
#define SIU_PSCLKCFG_PSDIV_MASK                  0xFF0000u
#define SIU_PSCLKCFG_PSDIV_SHIFT                 16u
#define SIU_PSCLKCFG_PSDIV_WIDTH                 8u
#define SIU_PSCLKCFG_PSDIV(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_PSCLKCFG_PSDIV_SHIFT))&SIU_PSCLKCFG_PSDIV_MASK)
#define SIU_PSCLKCFG_LCK_MASK                    0x80000000u
#define SIU_PSCLKCFG_LCK_SHIFT                   31u
#define SIU_PSCLKCFG_LCK_WIDTH                   1u
#define SIU_PSCLKCFG_LCK(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PSCLKCFG_LCK_SHIFT))&SIU_PSCLKCFG_LCK_MASK)
/* RCR Bit Fields */
#define SIU_RCR_RET_MASK                         0xFu
#define SIU_RCR_RET_SHIFT                        0u
#define SIU_RCR_RET_WIDTH                        4u
#define SIU_RCR_RET(x)                           (((uint32_t)(((uint32_t)(x))<<SIU_RCR_RET_SHIFT))&SIU_RCR_RET_MASK)
/* LOCKSTEP Bit Fields */
#define SIU_LOCKSTEP_LSE_MASK                    0x1u
#define SIU_LOCKSTEP_LSE_SHIFT                   0u
#define SIU_LOCKSTEP_LSE_WIDTH                   1u
#define SIU_LOCKSTEP_LSE(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_LOCKSTEP_LSE_SHIFT))&SIU_LOCKSTEP_LSE_MASK)
/* PCSER Bit Fields */
#define SIU_PCSER_PCSE_MASK                      0x1u
#define SIU_PCSER_PCSE_SHIFT                     0u
#define SIU_PCSER_PCSE_WIDTH                     1u
#define SIU_PCSER_PCSE(x)                        (((uint32_t)(((uint32_t)(x))<<SIU_PCSER_PCSE_SHIFT))&SIU_PCSER_PCSE_MASK)
/* PCSIFR Bit Fields */
#define SIU_PCSIFR_PCSI_MASK                     0x1u
#define SIU_PCSIFR_PCSI_SHIFT                    0u
#define SIU_PCSIFR_PCSI_WIDTH                    1u
#define SIU_PCSIFR_PCSI(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_PCSIFR_PCSI_SHIFT))&SIU_PCSIFR_PCSI_MASK)
#define SIU_PCSIFR_PCSMS_MASK                    0x6u
#define SIU_PCSIFR_PCSMS_SHIFT                   1u
#define SIU_PCSIFR_PCSMS_WIDTH                   2u
#define SIU_PCSIFR_PCSMS(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PCSIFR_PCSMS_SHIFT))&SIU_PCSIFR_PCSMS_MASK)
/* FECCR Bit Fields */
#define SIU_FECCR_FM_MASK                        0x1u
#define SIU_FECCR_FM_SHIFT                       0u
#define SIU_FECCR_FM_WIDTH                       1u
#define SIU_FECCR_FM(x)                          (((uint32_t)(((uint32_t)(x))<<SIU_FECCR_FM_SHIFT))&SIU_FECCR_FM_MASK)
/* ECCEIR Bit Fields */
#define SIU_ECCEIR_CHKINVM_MASK                  0x7Fu
#define SIU_ECCEIR_CHKINVM_SHIFT                 0u
#define SIU_ECCEIR_CHKINVM_WIDTH                 7u
#define SIU_ECCEIR_CHKINVM(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ECCEIR_CHKINVM_SHIFT))&SIU_ECCEIR_CHKINVM_MASK)
#define SIU_ECCEIR_INVC_MASK                     0x80u
#define SIU_ECCEIR_INVC_SHIFT                    7u
#define SIU_ECCEIR_INVC_WIDTH                    1u
#define SIU_ECCEIR_INVC(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_ECCEIR_INVC_SHIFT))&SIU_ECCEIR_INVC_MASK)
/* PGPDO Bit Fields */
#define SIU_PGPDO_PGPDO31_MASK                   0x1u
#define SIU_PGPDO_PGPDO31_SHIFT                  0u
#define SIU_PGPDO_PGPDO31_WIDTH                  1u
#define SIU_PGPDO_PGPDO31(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO31_SHIFT))&SIU_PGPDO_PGPDO31_MASK)
#define SIU_PGPDO_PGPDO30_MASK                   0x2u
#define SIU_PGPDO_PGPDO30_SHIFT                  1u
#define SIU_PGPDO_PGPDO30_WIDTH                  1u
#define SIU_PGPDO_PGPDO30(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO30_SHIFT))&SIU_PGPDO_PGPDO30_MASK)
#define SIU_PGPDO_PGPDO29_MASK                   0x4u
#define SIU_PGPDO_PGPDO29_SHIFT                  2u
#define SIU_PGPDO_PGPDO29_WIDTH                  1u
#define SIU_PGPDO_PGPDO29(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO29_SHIFT))&SIU_PGPDO_PGPDO29_MASK)
#define SIU_PGPDO_PGPDO28_MASK                   0x8u
#define SIU_PGPDO_PGPDO28_SHIFT                  3u
#define SIU_PGPDO_PGPDO28_WIDTH                  1u
#define SIU_PGPDO_PGPDO28(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO28_SHIFT))&SIU_PGPDO_PGPDO28_MASK)
#define SIU_PGPDO_PGPDO27_MASK                   0x10u
#define SIU_PGPDO_PGPDO27_SHIFT                  4u
#define SIU_PGPDO_PGPDO27_WIDTH                  1u
#define SIU_PGPDO_PGPDO27(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO27_SHIFT))&SIU_PGPDO_PGPDO27_MASK)
#define SIU_PGPDO_PGPDO26_MASK                   0x20u
#define SIU_PGPDO_PGPDO26_SHIFT                  5u
#define SIU_PGPDO_PGPDO26_WIDTH                  1u
#define SIU_PGPDO_PGPDO26(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO26_SHIFT))&SIU_PGPDO_PGPDO26_MASK)
#define SIU_PGPDO_PGPDO25_MASK                   0x40u
#define SIU_PGPDO_PGPDO25_SHIFT                  6u
#define SIU_PGPDO_PGPDO25_WIDTH                  1u
#define SIU_PGPDO_PGPDO25(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO25_SHIFT))&SIU_PGPDO_PGPDO25_MASK)
#define SIU_PGPDO_PGPDO24_MASK                   0x80u
#define SIU_PGPDO_PGPDO24_SHIFT                  7u
#define SIU_PGPDO_PGPDO24_WIDTH                  1u
#define SIU_PGPDO_PGPDO24(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO24_SHIFT))&SIU_PGPDO_PGPDO24_MASK)
#define SIU_PGPDO_PGPDO23_MASK                   0x100u
#define SIU_PGPDO_PGPDO23_SHIFT                  8u
#define SIU_PGPDO_PGPDO23_WIDTH                  1u
#define SIU_PGPDO_PGPDO23(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO23_SHIFT))&SIU_PGPDO_PGPDO23_MASK)
#define SIU_PGPDO_PGPDO22_MASK                   0x200u
#define SIU_PGPDO_PGPDO22_SHIFT                  9u
#define SIU_PGPDO_PGPDO22_WIDTH                  1u
#define SIU_PGPDO_PGPDO22(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO22_SHIFT))&SIU_PGPDO_PGPDO22_MASK)
#define SIU_PGPDO_PGPDO21_MASK                   0x400u
#define SIU_PGPDO_PGPDO21_SHIFT                  10u
#define SIU_PGPDO_PGPDO21_WIDTH                  1u
#define SIU_PGPDO_PGPDO21(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO21_SHIFT))&SIU_PGPDO_PGPDO21_MASK)
#define SIU_PGPDO_PGPDO20_MASK                   0x800u
#define SIU_PGPDO_PGPDO20_SHIFT                  11u
#define SIU_PGPDO_PGPDO20_WIDTH                  1u
#define SIU_PGPDO_PGPDO20(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO20_SHIFT))&SIU_PGPDO_PGPDO20_MASK)
#define SIU_PGPDO_PGPDO19_MASK                   0x1000u
#define SIU_PGPDO_PGPDO19_SHIFT                  12u
#define SIU_PGPDO_PGPDO19_WIDTH                  1u
#define SIU_PGPDO_PGPDO19(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO19_SHIFT))&SIU_PGPDO_PGPDO19_MASK)
#define SIU_PGPDO_PGPDO18_MASK                   0x2000u
#define SIU_PGPDO_PGPDO18_SHIFT                  13u
#define SIU_PGPDO_PGPDO18_WIDTH                  1u
#define SIU_PGPDO_PGPDO18(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO18_SHIFT))&SIU_PGPDO_PGPDO18_MASK)
#define SIU_PGPDO_PGPDO17_MASK                   0x4000u
#define SIU_PGPDO_PGPDO17_SHIFT                  14u
#define SIU_PGPDO_PGPDO17_WIDTH                  1u
#define SIU_PGPDO_PGPDO17(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO17_SHIFT))&SIU_PGPDO_PGPDO17_MASK)
#define SIU_PGPDO_PGPDO16_MASK                   0x8000u
#define SIU_PGPDO_PGPDO16_SHIFT                  15u
#define SIU_PGPDO_PGPDO16_WIDTH                  1u
#define SIU_PGPDO_PGPDO16(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO16_SHIFT))&SIU_PGPDO_PGPDO16_MASK)
#define SIU_PGPDO_PGPDO15_MASK                   0x10000u
#define SIU_PGPDO_PGPDO15_SHIFT                  16u
#define SIU_PGPDO_PGPDO15_WIDTH                  1u
#define SIU_PGPDO_PGPDO15(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO15_SHIFT))&SIU_PGPDO_PGPDO15_MASK)
#define SIU_PGPDO_PGPDO14_MASK                   0x20000u
#define SIU_PGPDO_PGPDO14_SHIFT                  17u
#define SIU_PGPDO_PGPDO14_WIDTH                  1u
#define SIU_PGPDO_PGPDO14(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO14_SHIFT))&SIU_PGPDO_PGPDO14_MASK)
#define SIU_PGPDO_PGPDO13_MASK                   0x40000u
#define SIU_PGPDO_PGPDO13_SHIFT                  18u
#define SIU_PGPDO_PGPDO13_WIDTH                  1u
#define SIU_PGPDO_PGPDO13(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO13_SHIFT))&SIU_PGPDO_PGPDO13_MASK)
#define SIU_PGPDO_PGPDO12_MASK                   0x80000u
#define SIU_PGPDO_PGPDO12_SHIFT                  19u
#define SIU_PGPDO_PGPDO12_WIDTH                  1u
#define SIU_PGPDO_PGPDO12(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO12_SHIFT))&SIU_PGPDO_PGPDO12_MASK)
#define SIU_PGPDO_PGPDO11_MASK                   0x100000u
#define SIU_PGPDO_PGPDO11_SHIFT                  20u
#define SIU_PGPDO_PGPDO11_WIDTH                  1u
#define SIU_PGPDO_PGPDO11(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO11_SHIFT))&SIU_PGPDO_PGPDO11_MASK)
#define SIU_PGPDO_PGPDO10_MASK                   0x200000u
#define SIU_PGPDO_PGPDO10_SHIFT                  21u
#define SIU_PGPDO_PGPDO10_WIDTH                  1u
#define SIU_PGPDO_PGPDO10(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO10_SHIFT))&SIU_PGPDO_PGPDO10_MASK)
#define SIU_PGPDO_PGPDO9_MASK                    0x400000u
#define SIU_PGPDO_PGPDO9_SHIFT                   22u
#define SIU_PGPDO_PGPDO9_WIDTH                   1u
#define SIU_PGPDO_PGPDO9(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO9_SHIFT))&SIU_PGPDO_PGPDO9_MASK)
#define SIU_PGPDO_PGPDO8_MASK                    0x800000u
#define SIU_PGPDO_PGPDO8_SHIFT                   23u
#define SIU_PGPDO_PGPDO8_WIDTH                   1u
#define SIU_PGPDO_PGPDO8(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO8_SHIFT))&SIU_PGPDO_PGPDO8_MASK)
#define SIU_PGPDO_PGPDO7_MASK                    0x1000000u
#define SIU_PGPDO_PGPDO7_SHIFT                   24u
#define SIU_PGPDO_PGPDO7_WIDTH                   1u
#define SIU_PGPDO_PGPDO7(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO7_SHIFT))&SIU_PGPDO_PGPDO7_MASK)
#define SIU_PGPDO_PGPDO6_MASK                    0x2000000u
#define SIU_PGPDO_PGPDO6_SHIFT                   25u
#define SIU_PGPDO_PGPDO6_WIDTH                   1u
#define SIU_PGPDO_PGPDO6(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO6_SHIFT))&SIU_PGPDO_PGPDO6_MASK)
#define SIU_PGPDO_PGPDO5_MASK                    0x4000000u
#define SIU_PGPDO_PGPDO5_SHIFT                   26u
#define SIU_PGPDO_PGPDO5_WIDTH                   1u
#define SIU_PGPDO_PGPDO5(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO5_SHIFT))&SIU_PGPDO_PGPDO5_MASK)
#define SIU_PGPDO_PGPDO4_MASK                    0x8000000u
#define SIU_PGPDO_PGPDO4_SHIFT                   27u
#define SIU_PGPDO_PGPDO4_WIDTH                   1u
#define SIU_PGPDO_PGPDO4(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO4_SHIFT))&SIU_PGPDO_PGPDO4_MASK)
#define SIU_PGPDO_PGPDO3_MASK                    0x10000000u
#define SIU_PGPDO_PGPDO3_SHIFT                   28u
#define SIU_PGPDO_PGPDO3_WIDTH                   1u
#define SIU_PGPDO_PGPDO3(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO3_SHIFT))&SIU_PGPDO_PGPDO3_MASK)
#define SIU_PGPDO_PGPDO2_MASK                    0x20000000u
#define SIU_PGPDO_PGPDO2_SHIFT                   29u
#define SIU_PGPDO_PGPDO2_WIDTH                   1u
#define SIU_PGPDO_PGPDO2(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO2_SHIFT))&SIU_PGPDO_PGPDO2_MASK)
#define SIU_PGPDO_PGPDO1_MASK                    0x40000000u
#define SIU_PGPDO_PGPDO1_SHIFT                   30u
#define SIU_PGPDO_PGPDO1_WIDTH                   1u
#define SIU_PGPDO_PGPDO1(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO1_SHIFT))&SIU_PGPDO_PGPDO1_MASK)
#define SIU_PGPDO_PGPDO0_MASK                    0x80000000u
#define SIU_PGPDO_PGPDO0_SHIFT                   31u
#define SIU_PGPDO_PGPDO0_WIDTH                   1u
#define SIU_PGPDO_PGPDO0(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDO_PGPDO0_SHIFT))&SIU_PGPDO_PGPDO0_MASK)
/* PGPDI Bit Fields */
#define SIU_PGPDI_PGPDI31_MASK                   0x1u
#define SIU_PGPDI_PGPDI31_SHIFT                  0u
#define SIU_PGPDI_PGPDI31_WIDTH                  1u
#define SIU_PGPDI_PGPDI31(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI31_SHIFT))&SIU_PGPDI_PGPDI31_MASK)
#define SIU_PGPDI_PGPDI30_MASK                   0x2u
#define SIU_PGPDI_PGPDI30_SHIFT                  1u
#define SIU_PGPDI_PGPDI30_WIDTH                  1u
#define SIU_PGPDI_PGPDI30(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI30_SHIFT))&SIU_PGPDI_PGPDI30_MASK)
#define SIU_PGPDI_PGPDI29_MASK                   0x4u
#define SIU_PGPDI_PGPDI29_SHIFT                  2u
#define SIU_PGPDI_PGPDI29_WIDTH                  1u
#define SIU_PGPDI_PGPDI29(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI29_SHIFT))&SIU_PGPDI_PGPDI29_MASK)
#define SIU_PGPDI_PGPDI28_MASK                   0x8u
#define SIU_PGPDI_PGPDI28_SHIFT                  3u
#define SIU_PGPDI_PGPDI28_WIDTH                  1u
#define SIU_PGPDI_PGPDI28(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI28_SHIFT))&SIU_PGPDI_PGPDI28_MASK)
#define SIU_PGPDI_PGPDI27_MASK                   0x10u
#define SIU_PGPDI_PGPDI27_SHIFT                  4u
#define SIU_PGPDI_PGPDI27_WIDTH                  1u
#define SIU_PGPDI_PGPDI27(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI27_SHIFT))&SIU_PGPDI_PGPDI27_MASK)
#define SIU_PGPDI_PGPDI26_MASK                   0x20u
#define SIU_PGPDI_PGPDI26_SHIFT                  5u
#define SIU_PGPDI_PGPDI26_WIDTH                  1u
#define SIU_PGPDI_PGPDI26(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI26_SHIFT))&SIU_PGPDI_PGPDI26_MASK)
#define SIU_PGPDI_PGPDI25_MASK                   0x40u
#define SIU_PGPDI_PGPDI25_SHIFT                  6u
#define SIU_PGPDI_PGPDI25_WIDTH                  1u
#define SIU_PGPDI_PGPDI25(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI25_SHIFT))&SIU_PGPDI_PGPDI25_MASK)
#define SIU_PGPDI_PGPDI24_MASK                   0x80u
#define SIU_PGPDI_PGPDI24_SHIFT                  7u
#define SIU_PGPDI_PGPDI24_WIDTH                  1u
#define SIU_PGPDI_PGPDI24(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI24_SHIFT))&SIU_PGPDI_PGPDI24_MASK)
#define SIU_PGPDI_PGPDI23_MASK                   0x100u
#define SIU_PGPDI_PGPDI23_SHIFT                  8u
#define SIU_PGPDI_PGPDI23_WIDTH                  1u
#define SIU_PGPDI_PGPDI23(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI23_SHIFT))&SIU_PGPDI_PGPDI23_MASK)
#define SIU_PGPDI_PGPDI22_MASK                   0x200u
#define SIU_PGPDI_PGPDI22_SHIFT                  9u
#define SIU_PGPDI_PGPDI22_WIDTH                  1u
#define SIU_PGPDI_PGPDI22(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI22_SHIFT))&SIU_PGPDI_PGPDI22_MASK)
#define SIU_PGPDI_PGPDI21_MASK                   0x400u
#define SIU_PGPDI_PGPDI21_SHIFT                  10u
#define SIU_PGPDI_PGPDI21_WIDTH                  1u
#define SIU_PGPDI_PGPDI21(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI21_SHIFT))&SIU_PGPDI_PGPDI21_MASK)
#define SIU_PGPDI_PGPDI20_MASK                   0x800u
#define SIU_PGPDI_PGPDI20_SHIFT                  11u
#define SIU_PGPDI_PGPDI20_WIDTH                  1u
#define SIU_PGPDI_PGPDI20(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI20_SHIFT))&SIU_PGPDI_PGPDI20_MASK)
#define SIU_PGPDI_PGPDI19_MASK                   0x1000u
#define SIU_PGPDI_PGPDI19_SHIFT                  12u
#define SIU_PGPDI_PGPDI19_WIDTH                  1u
#define SIU_PGPDI_PGPDI19(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI19_SHIFT))&SIU_PGPDI_PGPDI19_MASK)
#define SIU_PGPDI_PGPDI18_MASK                   0x2000u
#define SIU_PGPDI_PGPDI18_SHIFT                  13u
#define SIU_PGPDI_PGPDI18_WIDTH                  1u
#define SIU_PGPDI_PGPDI18(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI18_SHIFT))&SIU_PGPDI_PGPDI18_MASK)
#define SIU_PGPDI_PGPDI17_MASK                   0x4000u
#define SIU_PGPDI_PGPDI17_SHIFT                  14u
#define SIU_PGPDI_PGPDI17_WIDTH                  1u
#define SIU_PGPDI_PGPDI17(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI17_SHIFT))&SIU_PGPDI_PGPDI17_MASK)
#define SIU_PGPDI_PGPDI16_MASK                   0x8000u
#define SIU_PGPDI_PGPDI16_SHIFT                  15u
#define SIU_PGPDI_PGPDI16_WIDTH                  1u
#define SIU_PGPDI_PGPDI16(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI16_SHIFT))&SIU_PGPDI_PGPDI16_MASK)
#define SIU_PGPDI_PGPDI15_MASK                   0x10000u
#define SIU_PGPDI_PGPDI15_SHIFT                  16u
#define SIU_PGPDI_PGPDI15_WIDTH                  1u
#define SIU_PGPDI_PGPDI15(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI15_SHIFT))&SIU_PGPDI_PGPDI15_MASK)
#define SIU_PGPDI_PGPDI14_MASK                   0x20000u
#define SIU_PGPDI_PGPDI14_SHIFT                  17u
#define SIU_PGPDI_PGPDI14_WIDTH                  1u
