neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_PGPDI_PGPDI14(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI14_SHIFT))&SIU_PGPDI_PGPDI14_MASK)
#define SIU_PGPDI_PGPDI13_MASK                   0x40000u
#define SIU_PGPDI_PGPDI13_SHIFT                  18u
#define SIU_PGPDI_PGPDI13_WIDTH                  1u
#define SIU_PGPDI_PGPDI13(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI13_SHIFT))&SIU_PGPDI_PGPDI13_MASK)
#define SIU_PGPDI_PGPDI12_MASK                   0x80000u
#define SIU_PGPDI_PGPDI12_SHIFT                  19u
#define SIU_PGPDI_PGPDI12_WIDTH                  1u
#define SIU_PGPDI_PGPDI12(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI12_SHIFT))&SIU_PGPDI_PGPDI12_MASK)
#define SIU_PGPDI_PGPDI11_MASK                   0x100000u
#define SIU_PGPDI_PGPDI11_SHIFT                  20u
#define SIU_PGPDI_PGPDI11_WIDTH                  1u
#define SIU_PGPDI_PGPDI11(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI11_SHIFT))&SIU_PGPDI_PGPDI11_MASK)
#define SIU_PGPDI_PGPDI10_MASK                   0x200000u
#define SIU_PGPDI_PGPDI10_SHIFT                  21u
#define SIU_PGPDI_PGPDI10_WIDTH                  1u
#define SIU_PGPDI_PGPDI10(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI10_SHIFT))&SIU_PGPDI_PGPDI10_MASK)
#define SIU_PGPDI_PGPDI9_MASK                    0x400000u
#define SIU_PGPDI_PGPDI9_SHIFT                   22u
#define SIU_PGPDI_PGPDI9_WIDTH                   1u
#define SIU_PGPDI_PGPDI9(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI9_SHIFT))&SIU_PGPDI_PGPDI9_MASK)
#define SIU_PGPDI_PGPDI8_MASK                    0x800000u
#define SIU_PGPDI_PGPDI8_SHIFT                   23u
#define SIU_PGPDI_PGPDI8_WIDTH                   1u
#define SIU_PGPDI_PGPDI8(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI8_SHIFT))&SIU_PGPDI_PGPDI8_MASK)
#define SIU_PGPDI_PGPDI7_MASK                    0x1000000u
#define SIU_PGPDI_PGPDI7_SHIFT                   24u
#define SIU_PGPDI_PGPDI7_WIDTH                   1u
#define SIU_PGPDI_PGPDI7(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI7_SHIFT))&SIU_PGPDI_PGPDI7_MASK)
#define SIU_PGPDI_PGPDI6_MASK                    0x2000000u
#define SIU_PGPDI_PGPDI6_SHIFT                   25u
#define SIU_PGPDI_PGPDI6_WIDTH                   1u
#define SIU_PGPDI_PGPDI6(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI6_SHIFT))&SIU_PGPDI_PGPDI6_MASK)
#define SIU_PGPDI_PGPDI5_MASK                    0x4000000u
#define SIU_PGPDI_PGPDI5_SHIFT                   26u
#define SIU_PGPDI_PGPDI5_WIDTH                   1u
#define SIU_PGPDI_PGPDI5(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI5_SHIFT))&SIU_PGPDI_PGPDI5_MASK)
#define SIU_PGPDI_PGPDI4_MASK                    0x8000000u
#define SIU_PGPDI_PGPDI4_SHIFT                   27u
#define SIU_PGPDI_PGPDI4_WIDTH                   1u
#define SIU_PGPDI_PGPDI4(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI4_SHIFT))&SIU_PGPDI_PGPDI4_MASK)
#define SIU_PGPDI_PGPDI3_MASK                    0x10000000u
#define SIU_PGPDI_PGPDI3_SHIFT                   28u
#define SIU_PGPDI_PGPDI3_WIDTH                   1u
#define SIU_PGPDI_PGPDI3(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI3_SHIFT))&SIU_PGPDI_PGPDI3_MASK)
#define SIU_PGPDI_PGPDI2_MASK                    0x20000000u
#define SIU_PGPDI_PGPDI2_SHIFT                   29u
#define SIU_PGPDI_PGPDI2_WIDTH                   1u
#define SIU_PGPDI_PGPDI2(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI2_SHIFT))&SIU_PGPDI_PGPDI2_MASK)
#define SIU_PGPDI_PGPDI1_MASK                    0x40000000u
#define SIU_PGPDI_PGPDI1_SHIFT                   30u
#define SIU_PGPDI_PGPDI1_WIDTH                   1u
#define SIU_PGPDI_PGPDI1(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI1_SHIFT))&SIU_PGPDI_PGPDI1_MASK)
#define SIU_PGPDI_PGPDI0_MASK                    0x80000000u
#define SIU_PGPDI_PGPDI0_SHIFT                   31u
#define SIU_PGPDI_PGPDI0_WIDTH                   1u
#define SIU_PGPDI_PGPDI0(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_PGPDI_PGPDI0_SHIFT))&SIU_PGPDI_PGPDI0_MASK)
/* MPGPDO Bit Fields */
#define SIU_MPGPDO_DATA15_MASK                   0x1u
#define SIU_MPGPDO_DATA15_SHIFT                  0u
#define SIU_MPGPDO_DATA15_WIDTH                  1u
#define SIU_MPGPDO_DATA15(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA15_SHIFT))&SIU_MPGPDO_DATA15_MASK)
#define SIU_MPGPDO_DATA14_MASK                   0x2u
#define SIU_MPGPDO_DATA14_SHIFT                  1u
#define SIU_MPGPDO_DATA14_WIDTH                  1u
#define SIU_MPGPDO_DATA14(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA14_SHIFT))&SIU_MPGPDO_DATA14_MASK)
#define SIU_MPGPDO_DATA13_MASK                   0x4u
#define SIU_MPGPDO_DATA13_SHIFT                  2u
#define SIU_MPGPDO_DATA13_WIDTH                  1u
#define SIU_MPGPDO_DATA13(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA13_SHIFT))&SIU_MPGPDO_DATA13_MASK)
#define SIU_MPGPDO_DATA12_MASK                   0x8u
#define SIU_MPGPDO_DATA12_SHIFT                  3u
#define SIU_MPGPDO_DATA12_WIDTH                  1u
#define SIU_MPGPDO_DATA12(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA12_SHIFT))&SIU_MPGPDO_DATA12_MASK)
#define SIU_MPGPDO_DATA11_MASK                   0x10u
#define SIU_MPGPDO_DATA11_SHIFT                  4u
#define SIU_MPGPDO_DATA11_WIDTH                  1u
#define SIU_MPGPDO_DATA11(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA11_SHIFT))&SIU_MPGPDO_DATA11_MASK)
#define SIU_MPGPDO_DATA10_MASK                   0x20u
#define SIU_MPGPDO_DATA10_SHIFT                  5u
#define SIU_MPGPDO_DATA10_WIDTH                  1u
#define SIU_MPGPDO_DATA10(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA10_SHIFT))&SIU_MPGPDO_DATA10_MASK)
#define SIU_MPGPDO_DATA9_MASK                    0x40u
#define SIU_MPGPDO_DATA9_SHIFT                   6u
#define SIU_MPGPDO_DATA9_WIDTH                   1u
#define SIU_MPGPDO_DATA9(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA9_SHIFT))&SIU_MPGPDO_DATA9_MASK)
#define SIU_MPGPDO_DATA8_MASK                    0x80u
#define SIU_MPGPDO_DATA8_SHIFT                   7u
#define SIU_MPGPDO_DATA8_WIDTH                   1u
#define SIU_MPGPDO_DATA8(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA8_SHIFT))&SIU_MPGPDO_DATA8_MASK)
#define SIU_MPGPDO_DATA7_MASK                    0x100u
#define SIU_MPGPDO_DATA7_SHIFT                   8u
#define SIU_MPGPDO_DATA7_WIDTH                   1u
#define SIU_MPGPDO_DATA7(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA7_SHIFT))&SIU_MPGPDO_DATA7_MASK)
#define SIU_MPGPDO_DATA6_MASK                    0x200u
#define SIU_MPGPDO_DATA6_SHIFT                   9u
#define SIU_MPGPDO_DATA6_WIDTH                   1u
#define SIU_MPGPDO_DATA6(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA6_SHIFT))&SIU_MPGPDO_DATA6_MASK)
#define SIU_MPGPDO_DATA5_MASK                    0x400u
#define SIU_MPGPDO_DATA5_SHIFT                   10u
#define SIU_MPGPDO_DATA5_WIDTH                   1u
#define SIU_MPGPDO_DATA5(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA5_SHIFT))&SIU_MPGPDO_DATA5_MASK)
#define SIU_MPGPDO_DATA4_MASK                    0x800u
#define SIU_MPGPDO_DATA4_SHIFT                   11u
#define SIU_MPGPDO_DATA4_WIDTH                   1u
#define SIU_MPGPDO_DATA4(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA4_SHIFT))&SIU_MPGPDO_DATA4_MASK)
#define SIU_MPGPDO_DATA3_MASK                    0x1000u
#define SIU_MPGPDO_DATA3_SHIFT                   12u
#define SIU_MPGPDO_DATA3_WIDTH                   1u
#define SIU_MPGPDO_DATA3(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA3_SHIFT))&SIU_MPGPDO_DATA3_MASK)
#define SIU_MPGPDO_DATA2_MASK                    0x2000u
#define SIU_MPGPDO_DATA2_SHIFT                   13u
#define SIU_MPGPDO_DATA2_WIDTH                   1u
#define SIU_MPGPDO_DATA2(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA2_SHIFT))&SIU_MPGPDO_DATA2_MASK)
#define SIU_MPGPDO_DATA1_MASK                    0x4000u
#define SIU_MPGPDO_DATA1_SHIFT                   14u
#define SIU_MPGPDO_DATA1_WIDTH                   1u
#define SIU_MPGPDO_DATA1(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA1_SHIFT))&SIU_MPGPDO_DATA1_MASK)
#define SIU_MPGPDO_DATA0_MASK                    0x8000u
#define SIU_MPGPDO_DATA0_SHIFT                   15u
#define SIU_MPGPDO_DATA0_WIDTH                   1u
#define SIU_MPGPDO_DATA0(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_DATA0_SHIFT))&SIU_MPGPDO_DATA0_MASK)
#define SIU_MPGPDO_MASK15_MASK                   0x10000u
#define SIU_MPGPDO_MASK15_SHIFT                  16u
#define SIU_MPGPDO_MASK15_WIDTH                  1u
#define SIU_MPGPDO_MASK15(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK15_SHIFT))&SIU_MPGPDO_MASK15_MASK)
#define SIU_MPGPDO_MASK14_MASK                   0x20000u
#define SIU_MPGPDO_MASK14_SHIFT                  17u
#define SIU_MPGPDO_MASK14_WIDTH                  1u
#define SIU_MPGPDO_MASK14(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK14_SHIFT))&SIU_MPGPDO_MASK14_MASK)
#define SIU_MPGPDO_MASK13_MASK                   0x40000u
#define SIU_MPGPDO_MASK13_SHIFT                  18u
#define SIU_MPGPDO_MASK13_WIDTH                  1u
#define SIU_MPGPDO_MASK13(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK13_SHIFT))&SIU_MPGPDO_MASK13_MASK)
#define SIU_MPGPDO_MASK12_MASK                   0x80000u
#define SIU_MPGPDO_MASK12_SHIFT                  19u
#define SIU_MPGPDO_MASK12_WIDTH                  1u
#define SIU_MPGPDO_MASK12(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK12_SHIFT))&SIU_MPGPDO_MASK12_MASK)
#define SIU_MPGPDO_MASK11_MASK                   0x100000u
#define SIU_MPGPDO_MASK11_SHIFT                  20u
#define SIU_MPGPDO_MASK11_WIDTH                  1u
#define SIU_MPGPDO_MASK11(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK11_SHIFT))&SIU_MPGPDO_MASK11_MASK)
#define SIU_MPGPDO_MASK10_MASK                   0x200000u
#define SIU_MPGPDO_MASK10_SHIFT                  21u
#define SIU_MPGPDO_MASK10_WIDTH                  1u
#define SIU_MPGPDO_MASK10(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK10_SHIFT))&SIU_MPGPDO_MASK10_MASK)
#define SIU_MPGPDO_MASK9_MASK                    0x400000u
#define SIU_MPGPDO_MASK9_SHIFT                   22u
#define SIU_MPGPDO_MASK9_WIDTH                   1u
#define SIU_MPGPDO_MASK9(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK9_SHIFT))&SIU_MPGPDO_MASK9_MASK)
#define SIU_MPGPDO_MASK8_MASK                    0x800000u
#define SIU_MPGPDO_MASK8_SHIFT                   23u
#define SIU_MPGPDO_MASK8_WIDTH                   1u
#define SIU_MPGPDO_MASK8(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK8_SHIFT))&SIU_MPGPDO_MASK8_MASK)
#define SIU_MPGPDO_MASK7_MASK                    0x1000000u
#define SIU_MPGPDO_MASK7_SHIFT                   24u
#define SIU_MPGPDO_MASK7_WIDTH                   1u
#define SIU_MPGPDO_MASK7(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK7_SHIFT))&SIU_MPGPDO_MASK7_MASK)
#define SIU_MPGPDO_MASK6_MASK                    0x2000000u
#define SIU_MPGPDO_MASK6_SHIFT                   25u
#define SIU_MPGPDO_MASK6_WIDTH                   1u
#define SIU_MPGPDO_MASK6(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK6_SHIFT))&SIU_MPGPDO_MASK6_MASK)
#define SIU_MPGPDO_MASK5_MASK                    0x4000000u
#define SIU_MPGPDO_MASK5_SHIFT                   26u
#define SIU_MPGPDO_MASK5_WIDTH                   1u
#define SIU_MPGPDO_MASK5(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK5_SHIFT))&SIU_MPGPDO_MASK5_MASK)
#define SIU_MPGPDO_MASK4_MASK                    0x8000000u
#define SIU_MPGPDO_MASK4_SHIFT                   27u
#define SIU_MPGPDO_MASK4_WIDTH                   1u
#define SIU_MPGPDO_MASK4(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK4_SHIFT))&SIU_MPGPDO_MASK4_MASK)
#define SIU_MPGPDO_MASK3_MASK                    0x10000000u
#define SIU_MPGPDO_MASK3_SHIFT                   28u
#define SIU_MPGPDO_MASK3_WIDTH                   1u
#define SIU_MPGPDO_MASK3(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK3_SHIFT))&SIU_MPGPDO_MASK3_MASK)
#define SIU_MPGPDO_MASK2_MASK                    0x20000000u
#define SIU_MPGPDO_MASK2_SHIFT                   29u
#define SIU_MPGPDO_MASK2_WIDTH                   1u
#define SIU_MPGPDO_MASK2(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK2_SHIFT))&SIU_MPGPDO_MASK2_MASK)
#define SIU_MPGPDO_MASK1_MASK                    0x40000000u
#define SIU_MPGPDO_MASK1_SHIFT                   30u
#define SIU_MPGPDO_MASK1_WIDTH                   1u
#define SIU_MPGPDO_MASK1(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK1_SHIFT))&SIU_MPGPDO_MASK1_MASK)
#define SIU_MPGPDO_MASK0_MASK                    0x80000000u
#define SIU_MPGPDO_MASK0_SHIFT                   31u
#define SIU_MPGPDO_MASK0_WIDTH                   1u
#define SIU_MPGPDO_MASK0(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_MPGPDO_MASK0_SHIFT))&SIU_MPGPDO_MASK0_MASK)
/* DSPIH Bit Fields */
#define SIU_DSPIH_DATA15_MASK                    0x1u
#define SIU_DSPIH_DATA15_SHIFT                   0u
#define SIU_DSPIH_DATA15_WIDTH                   1u
#define SIU_DSPIH_DATA15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA15_SHIFT))&SIU_DSPIH_DATA15_MASK)
#define SIU_DSPIH_DATA14_MASK                    0x2u
#define SIU_DSPIH_DATA14_SHIFT                   1u
#define SIU_DSPIH_DATA14_WIDTH                   1u
#define SIU_DSPIH_DATA14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA14_SHIFT))&SIU_DSPIH_DATA14_MASK)
#define SIU_DSPIH_DATA13_MASK                    0x4u
#define SIU_DSPIH_DATA13_SHIFT                   2u
#define SIU_DSPIH_DATA13_WIDTH                   1u
#define SIU_DSPIH_DATA13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA13_SHIFT))&SIU_DSPIH_DATA13_MASK)
#define SIU_DSPIH_DATA12_MASK                    0x8u
#define SIU_DSPIH_DATA12_SHIFT                   3u
#define SIU_DSPIH_DATA12_WIDTH                   1u
#define SIU_DSPIH_DATA12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA12_SHIFT))&SIU_DSPIH_DATA12_MASK)
#define SIU_DSPIH_DATA11_MASK                    0x10u
#define SIU_DSPIH_DATA11_SHIFT                   4u
#define SIU_DSPIH_DATA11_WIDTH                   1u
#define SIU_DSPIH_DATA11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA11_SHIFT))&SIU_DSPIH_DATA11_MASK)
#define SIU_DSPIH_DATA10_MASK                    0x20u
#define SIU_DSPIH_DATA10_SHIFT                   5u
#define SIU_DSPIH_DATA10_WIDTH                   1u
#define SIU_DSPIH_DATA10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA10_SHIFT))&SIU_DSPIH_DATA10_MASK)
#define SIU_DSPIH_DATA9_MASK                     0x40u
#define SIU_DSPIH_DATA9_SHIFT                    6u
#define SIU_DSPIH_DATA9_WIDTH                    1u
#define SIU_DSPIH_DATA9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA9_SHIFT))&SIU_DSPIH_DATA9_MASK)
#define SIU_DSPIH_DATA8_MASK                     0x80u
#define SIU_DSPIH_DATA8_SHIFT                    7u
#define SIU_DSPIH_DATA8_WIDTH                    1u
#define SIU_DSPIH_DATA8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA8_SHIFT))&SIU_DSPIH_DATA8_MASK)
#define SIU_DSPIH_DATA7_MASK                     0x100u
#define SIU_DSPIH_DATA7_SHIFT                    8u
#define SIU_DSPIH_DATA7_WIDTH                    1u
#define SIU_DSPIH_DATA7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA7_SHIFT))&SIU_DSPIH_DATA7_MASK)
#define SIU_DSPIH_DATA6_MASK                     0x200u
#define SIU_DSPIH_DATA6_SHIFT                    9u
#define SIU_DSPIH_DATA6_WIDTH                    1u
#define SIU_DSPIH_DATA6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA6_SHIFT))&SIU_DSPIH_DATA6_MASK)
#define SIU_DSPIH_DATA5_MASK                     0x400u
#define SIU_DSPIH_DATA5_SHIFT                    10u
#define SIU_DSPIH_DATA5_WIDTH                    1u
#define SIU_DSPIH_DATA5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA5_SHIFT))&SIU_DSPIH_DATA5_MASK)
#define SIU_DSPIH_DATA4_MASK                     0x800u
#define SIU_DSPIH_DATA4_SHIFT                    11u
#define SIU_DSPIH_DATA4_WIDTH                    1u
#define SIU_DSPIH_DATA4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA4_SHIFT))&SIU_DSPIH_DATA4_MASK)
#define SIU_DSPIH_DATA3_MASK                     0x1000u
#define SIU_DSPIH_DATA3_SHIFT                    12u
#define SIU_DSPIH_DATA3_WIDTH                    1u
#define SIU_DSPIH_DATA3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA3_SHIFT))&SIU_DSPIH_DATA3_MASK)
#define SIU_DSPIH_DATA2_MASK                     0x2000u
#define SIU_DSPIH_DATA2_SHIFT                    13u
#define SIU_DSPIH_DATA2_WIDTH                    1u
#define SIU_DSPIH_DATA2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA2_SHIFT))&SIU_DSPIH_DATA2_MASK)
#define SIU_DSPIH_DATA1_MASK                     0x4000u
#define SIU_DSPIH_DATA1_SHIFT                    14u
#define SIU_DSPIH_DATA1_WIDTH                    1u
#define SIU_DSPIH_DATA1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA1_SHIFT))&SIU_DSPIH_DATA1_MASK)
#define SIU_DSPIH_DATA0_MASK                     0x8000u
#define SIU_DSPIH_DATA0_SHIFT                    15u
#define SIU_DSPIH_DATA0_WIDTH                    1u
#define SIU_DSPIH_DATA0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_DATA0_SHIFT))&SIU_DSPIH_DATA0_MASK)
#define SIU_DSPIH_MASK15_MASK                    0x10000u
#define SIU_DSPIH_MASK15_SHIFT                   16u
#define SIU_DSPIH_MASK15_WIDTH                   1u
#define SIU_DSPIH_MASK15(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK15_SHIFT))&SIU_DSPIH_MASK15_MASK)
#define SIU_DSPIH_MASK14_MASK                    0x20000u
#define SIU_DSPIH_MASK14_SHIFT                   17u
#define SIU_DSPIH_MASK14_WIDTH                   1u
#define SIU_DSPIH_MASK14(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK14_SHIFT))&SIU_DSPIH_MASK14_MASK)
#define SIU_DSPIH_MASK13_MASK                    0x40000u
#define SIU_DSPIH_MASK13_SHIFT                   18u
#define SIU_DSPIH_MASK13_WIDTH                   1u
#define SIU_DSPIH_MASK13(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK13_SHIFT))&SIU_DSPIH_MASK13_MASK)
#define SIU_DSPIH_MASK12_MASK                    0x80000u
#define SIU_DSPIH_MASK12_SHIFT                   19u
#define SIU_DSPIH_MASK12_WIDTH                   1u
#define SIU_DSPIH_MASK12(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK12_SHIFT))&SIU_DSPIH_MASK12_MASK)
#define SIU_DSPIH_MASK11_MASK                    0x100000u
#define SIU_DSPIH_MASK11_SHIFT                   20u
#define SIU_DSPIH_MASK11_WIDTH                   1u
#define SIU_DSPIH_MASK11(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK11_SHIFT))&SIU_DSPIH_MASK11_MASK)
#define SIU_DSPIH_MASK10_MASK                    0x200000u
#define SIU_DSPIH_MASK10_SHIFT                   21u
#define SIU_DSPIH_MASK10_WIDTH                   1u
#define SIU_DSPIH_MASK10(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK10_SHIFT))&SIU_DSPIH_MASK10_MASK)
#define SIU_DSPIH_MASK9_MASK                     0x400000u
#define SIU_DSPIH_MASK9_SHIFT                    22u
#define SIU_DSPIH_MASK9_WIDTH                    1u
#define SIU_DSPIH_MASK9(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK9_SHIFT))&SIU_DSPIH_MASK9_MASK)
#define SIU_DSPIH_MASK8_MASK                     0x800000u
#define SIU_DSPIH_MASK8_SHIFT                    23u
#define SIU_DSPIH_MASK8_WIDTH                    1u
#define SIU_DSPIH_MASK8(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK8_SHIFT))&SIU_DSPIH_MASK8_MASK)
#define SIU_DSPIH_MASK7_MASK                     0x1000000u
#define SIU_DSPIH_MASK7_SHIFT                    24u
#define SIU_DSPIH_MASK7_WIDTH                    1u
#define SIU_DSPIH_MASK7(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK7_SHIFT))&SIU_DSPIH_MASK7_MASK)
#define SIU_DSPIH_MASK6_MASK                     0x2000000u
#define SIU_DSPIH_MASK6_SHIFT                    25u
#define SIU_DSPIH_MASK6_WIDTH                    1u
#define SIU_DSPIH_MASK6(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK6_SHIFT))&SIU_DSPIH_MASK6_MASK)
#define SIU_DSPIH_MASK5_MASK                     0x4000000u
#define SIU_DSPIH_MASK5_SHIFT                    26u
#define SIU_DSPIH_MASK5_WIDTH                    1u
#define SIU_DSPIH_MASK5(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK5_SHIFT))&SIU_DSPIH_MASK5_MASK)
#define SIU_DSPIH_MASK4_MASK                     0x8000000u
#define SIU_DSPIH_MASK4_SHIFT                    27u
#define SIU_DSPIH_MASK4_WIDTH                    1u
#define SIU_DSPIH_MASK4(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK4_SHIFT))&SIU_DSPIH_MASK4_MASK)
#define SIU_DSPIH_MASK3_MASK                     0x10000000u
#define SIU_DSPIH_MASK3_SHIFT                    28u
#define SIU_DSPIH_MASK3_WIDTH                    1u
#define SIU_DSPIH_MASK3(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK3_SHIFT))&SIU_DSPIH_MASK3_MASK)
#define SIU_DSPIH_MASK2_MASK                     0x20000000u
#define SIU_DSPIH_MASK2_SHIFT                    29u
#define SIU_DSPIH_MASK2_WIDTH                    1u
#define SIU_DSPIH_MASK2(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK2_SHIFT))&SIU_DSPIH_MASK2_MASK)
#define SIU_DSPIH_MASK1_MASK                     0x40000000u
#define SIU_DSPIH_MASK1_SHIFT                    30u
#define SIU_DSPIH_MASK1_WIDTH                    1u
#define SIU_DSPIH_MASK1(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK1_SHIFT))&SIU_DSPIH_MASK1_MASK)
#define SIU_DSPIH_MASK0_MASK                     0x80000000u
#define SIU_DSPIH_MASK0_SHIFT                    31u
#define SIU_DSPIH_MASK0_WIDTH                    1u
#define SIU_DSPIH_MASK0(x)                       (((uint32_t)(((uint32_t)(x))<<SIU_DSPIH_MASK0_SHIFT))&SIU_DSPIH_MASK0_MASK)
/* DSPIL Bit Fields */
#define SIU_DSPIL_DATA31_MASK                    0x1u
#define SIU_DSPIL_DATA31_SHIFT                   0u
#define SIU_DSPIL_DATA31_WIDTH                   1u
#define SIU_DSPIL_DATA31(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA31_SHIFT))&SIU_DSPIL_DATA31_MASK)
#define SIU_DSPIL_DATA30_MASK                    0x2u
#define SIU_DSPIL_DATA30_SHIFT                   1u
#define SIU_DSPIL_DATA30_WIDTH                   1u
#define SIU_DSPIL_DATA30(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA30_SHIFT))&SIU_DSPIL_DATA30_MASK)
#define SIU_DSPIL_DATA29_MASK                    0x4u
#define SIU_DSPIL_DATA29_SHIFT                   2u
#define SIU_DSPIL_DATA29_WIDTH                   1u
#define SIU_DSPIL_DATA29(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA29_SHIFT))&SIU_DSPIL_DATA29_MASK)
#define SIU_DSPIL_DATA28_MASK                    0x8u
#define SIU_DSPIL_DATA28_SHIFT                   3u
#define SIU_DSPIL_DATA28_WIDTH                   1u
#define SIU_DSPIL_DATA28(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA28_SHIFT))&SIU_DSPIL_DATA28_MASK)
#define SIU_DSPIL_DATA27_MASK                    0x10u
