neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_DSPIL_DATA27_SHIFT                   4u
#define SIU_DSPIL_DATA27_WIDTH                   1u
#define SIU_DSPIL_DATA27(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA27_SHIFT))&SIU_DSPIL_DATA27_MASK)
#define SIU_DSPIL_DATA26_MASK                    0x20u
#define SIU_DSPIL_DATA26_SHIFT                   5u
#define SIU_DSPIL_DATA26_WIDTH                   1u
#define SIU_DSPIL_DATA26(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA26_SHIFT))&SIU_DSPIL_DATA26_MASK)
#define SIU_DSPIL_DATA25_MASK                    0x40u
#define SIU_DSPIL_DATA25_SHIFT                   6u
#define SIU_DSPIL_DATA25_WIDTH                   1u
#define SIU_DSPIL_DATA25(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA25_SHIFT))&SIU_DSPIL_DATA25_MASK)
#define SIU_DSPIL_DATA24_MASK                    0x80u
#define SIU_DSPIL_DATA24_SHIFT                   7u
#define SIU_DSPIL_DATA24_WIDTH                   1u
#define SIU_DSPIL_DATA24(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA24_SHIFT))&SIU_DSPIL_DATA24_MASK)
#define SIU_DSPIL_DATA23_MASK                    0x100u
#define SIU_DSPIL_DATA23_SHIFT                   8u
#define SIU_DSPIL_DATA23_WIDTH                   1u
#define SIU_DSPIL_DATA23(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA23_SHIFT))&SIU_DSPIL_DATA23_MASK)
#define SIU_DSPIL_DATA22_MASK                    0x200u
#define SIU_DSPIL_DATA22_SHIFT                   9u
#define SIU_DSPIL_DATA22_WIDTH                   1u
#define SIU_DSPIL_DATA22(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA22_SHIFT))&SIU_DSPIL_DATA22_MASK)
#define SIU_DSPIL_DATA21_MASK                    0x400u
#define SIU_DSPIL_DATA21_SHIFT                   10u
#define SIU_DSPIL_DATA21_WIDTH                   1u
#define SIU_DSPIL_DATA21(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA21_SHIFT))&SIU_DSPIL_DATA21_MASK)
#define SIU_DSPIL_DATA20_MASK                    0x800u
#define SIU_DSPIL_DATA20_SHIFT                   11u
#define SIU_DSPIL_DATA20_WIDTH                   1u
#define SIU_DSPIL_DATA20(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA20_SHIFT))&SIU_DSPIL_DATA20_MASK)
#define SIU_DSPIL_DATA19_MASK                    0x1000u
#define SIU_DSPIL_DATA19_SHIFT                   12u
#define SIU_DSPIL_DATA19_WIDTH                   1u
#define SIU_DSPIL_DATA19(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA19_SHIFT))&SIU_DSPIL_DATA19_MASK)
#define SIU_DSPIL_DATA18_MASK                    0x2000u
#define SIU_DSPIL_DATA18_SHIFT                   13u
#define SIU_DSPIL_DATA18_WIDTH                   1u
#define SIU_DSPIL_DATA18(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA18_SHIFT))&SIU_DSPIL_DATA18_MASK)
#define SIU_DSPIL_DATA17_MASK                    0x4000u
#define SIU_DSPIL_DATA17_SHIFT                   14u
#define SIU_DSPIL_DATA17_WIDTH                   1u
#define SIU_DSPIL_DATA17(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA17_SHIFT))&SIU_DSPIL_DATA17_MASK)
#define SIU_DSPIL_DATA16_MASK                    0x8000u
#define SIU_DSPIL_DATA16_SHIFT                   15u
#define SIU_DSPIL_DATA16_WIDTH                   1u
#define SIU_DSPIL_DATA16(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_DATA16_SHIFT))&SIU_DSPIL_DATA16_MASK)
#define SIU_DSPIL_MASK31_MASK                    0x10000u
#define SIU_DSPIL_MASK31_SHIFT                   16u
#define SIU_DSPIL_MASK31_WIDTH                   1u
#define SIU_DSPIL_MASK31(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK31_SHIFT))&SIU_DSPIL_MASK31_MASK)
#define SIU_DSPIL_MASK30_MASK                    0x20000u
#define SIU_DSPIL_MASK30_SHIFT                   17u
#define SIU_DSPIL_MASK30_WIDTH                   1u
#define SIU_DSPIL_MASK30(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK30_SHIFT))&SIU_DSPIL_MASK30_MASK)
#define SIU_DSPIL_MASK29_MASK                    0x40000u
#define SIU_DSPIL_MASK29_SHIFT                   18u
#define SIU_DSPIL_MASK29_WIDTH                   1u
#define SIU_DSPIL_MASK29(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK29_SHIFT))&SIU_DSPIL_MASK29_MASK)
#define SIU_DSPIL_MASK28_MASK                    0x80000u
#define SIU_DSPIL_MASK28_SHIFT                   19u
#define SIU_DSPIL_MASK28_WIDTH                   1u
#define SIU_DSPIL_MASK28(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK28_SHIFT))&SIU_DSPIL_MASK28_MASK)
#define SIU_DSPIL_MASK27_MASK                    0x100000u
#define SIU_DSPIL_MASK27_SHIFT                   20u
#define SIU_DSPIL_MASK27_WIDTH                   1u
#define SIU_DSPIL_MASK27(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK27_SHIFT))&SIU_DSPIL_MASK27_MASK)
#define SIU_DSPIL_MASK26_MASK                    0x200000u
#define SIU_DSPIL_MASK26_SHIFT                   21u
#define SIU_DSPIL_MASK26_WIDTH                   1u
#define SIU_DSPIL_MASK26(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK26_SHIFT))&SIU_DSPIL_MASK26_MASK)
#define SIU_DSPIL_MASK25_MASK                    0x400000u
#define SIU_DSPIL_MASK25_SHIFT                   22u
#define SIU_DSPIL_MASK25_WIDTH                   1u
#define SIU_DSPIL_MASK25(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK25_SHIFT))&SIU_DSPIL_MASK25_MASK)
#define SIU_DSPIL_MASK24_MASK                    0x800000u
#define SIU_DSPIL_MASK24_SHIFT                   23u
#define SIU_DSPIL_MASK24_WIDTH                   1u
#define SIU_DSPIL_MASK24(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK24_SHIFT))&SIU_DSPIL_MASK24_MASK)
#define SIU_DSPIL_MASK23_MASK                    0x1000000u
#define SIU_DSPIL_MASK23_SHIFT                   24u
#define SIU_DSPIL_MASK23_WIDTH                   1u
#define SIU_DSPIL_MASK23(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK23_SHIFT))&SIU_DSPIL_MASK23_MASK)
#define SIU_DSPIL_MASK22_MASK                    0x2000000u
#define SIU_DSPIL_MASK22_SHIFT                   25u
#define SIU_DSPIL_MASK22_WIDTH                   1u
#define SIU_DSPIL_MASK22(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK22_SHIFT))&SIU_DSPIL_MASK22_MASK)
#define SIU_DSPIL_MASK21_MASK                    0x4000000u
#define SIU_DSPIL_MASK21_SHIFT                   26u
#define SIU_DSPIL_MASK21_WIDTH                   1u
#define SIU_DSPIL_MASK21(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK21_SHIFT))&SIU_DSPIL_MASK21_MASK)
#define SIU_DSPIL_MASK20_MASK                    0x8000000u
#define SIU_DSPIL_MASK20_SHIFT                   27u
#define SIU_DSPIL_MASK20_WIDTH                   1u
#define SIU_DSPIL_MASK20(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK20_SHIFT))&SIU_DSPIL_MASK20_MASK)
#define SIU_DSPIL_MASK19_MASK                    0x10000000u
#define SIU_DSPIL_MASK19_SHIFT                   28u
#define SIU_DSPIL_MASK19_WIDTH                   1u
#define SIU_DSPIL_MASK19(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK19_SHIFT))&SIU_DSPIL_MASK19_MASK)
#define SIU_DSPIL_MASK18_MASK                    0x20000000u
#define SIU_DSPIL_MASK18_SHIFT                   29u
#define SIU_DSPIL_MASK18_WIDTH                   1u
#define SIU_DSPIL_MASK18(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK18_SHIFT))&SIU_DSPIL_MASK18_MASK)
#define SIU_DSPIL_MASK17_MASK                    0x40000000u
#define SIU_DSPIL_MASK17_SHIFT                   30u
#define SIU_DSPIL_MASK17_WIDTH                   1u
#define SIU_DSPIL_MASK17(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK17_SHIFT))&SIU_DSPIL_MASK17_MASK)
#define SIU_DSPIL_MASK16_MASK                    0x80000000u
#define SIU_DSPIL_MASK16_SHIFT                   31u
#define SIU_DSPIL_MASK16_WIDTH                   1u
#define SIU_DSPIL_MASK16(x)                      (((uint32_t)(((uint32_t)(x))<<SIU_DSPIL_MASK16_SHIFT))&SIU_DSPIL_MASK16_MASK)
/* ETPUBA Bit Fields */
#define SIU_ETPUBA_ETPUB16_MASK                  0x1u
#define SIU_ETPUBA_ETPUB16_SHIFT                 0u
#define SIU_ETPUBA_ETPUB16_WIDTH                 1u
#define SIU_ETPUBA_ETPUB16(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB16_SHIFT))&SIU_ETPUBA_ETPUB16_MASK)
#define SIU_ETPUBA_ETPUB17_MASK                  0x2u
#define SIU_ETPUBA_ETPUB17_SHIFT                 1u
#define SIU_ETPUBA_ETPUB17_WIDTH                 1u
#define SIU_ETPUBA_ETPUB17(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB17_SHIFT))&SIU_ETPUBA_ETPUB17_MASK)
#define SIU_ETPUBA_ETPUB18_MASK                  0x4u
#define SIU_ETPUBA_ETPUB18_SHIFT                 2u
#define SIU_ETPUBA_ETPUB18_WIDTH                 1u
#define SIU_ETPUBA_ETPUB18(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB18_SHIFT))&SIU_ETPUBA_ETPUB18_MASK)
#define SIU_ETPUBA_ETPUB19_MASK                  0x8u
#define SIU_ETPUBA_ETPUB19_SHIFT                 3u
#define SIU_ETPUBA_ETPUB19_WIDTH                 1u
#define SIU_ETPUBA_ETPUB19(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB19_SHIFT))&SIU_ETPUBA_ETPUB19_MASK)
#define SIU_ETPUBA_ETPUB20_MASK                  0x10u
#define SIU_ETPUBA_ETPUB20_SHIFT                 4u
#define SIU_ETPUBA_ETPUB20_WIDTH                 1u
#define SIU_ETPUBA_ETPUB20(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB20_SHIFT))&SIU_ETPUBA_ETPUB20_MASK)
#define SIU_ETPUBA_ETPUB21_MASK                  0x20u
#define SIU_ETPUBA_ETPUB21_SHIFT                 5u
#define SIU_ETPUBA_ETPUB21_WIDTH                 1u
#define SIU_ETPUBA_ETPUB21(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB21_SHIFT))&SIU_ETPUBA_ETPUB21_MASK)
#define SIU_ETPUBA_ETPUB22_MASK                  0x40u
#define SIU_ETPUBA_ETPUB22_SHIFT                 6u
#define SIU_ETPUBA_ETPUB22_WIDTH                 1u
#define SIU_ETPUBA_ETPUB22(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB22_SHIFT))&SIU_ETPUBA_ETPUB22_MASK)
#define SIU_ETPUBA_ETPUB23_MASK                  0x80u
#define SIU_ETPUBA_ETPUB23_SHIFT                 7u
#define SIU_ETPUBA_ETPUB23_WIDTH                 1u
#define SIU_ETPUBA_ETPUB23(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB23_SHIFT))&SIU_ETPUBA_ETPUB23_MASK)
#define SIU_ETPUBA_ETPUB24_MASK                  0x100u
#define SIU_ETPUBA_ETPUB24_SHIFT                 8u
#define SIU_ETPUBA_ETPUB24_WIDTH                 1u
#define SIU_ETPUBA_ETPUB24(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB24_SHIFT))&SIU_ETPUBA_ETPUB24_MASK)
#define SIU_ETPUBA_ETPUB25_MASK                  0x200u
#define SIU_ETPUBA_ETPUB25_SHIFT                 9u
#define SIU_ETPUBA_ETPUB25_WIDTH                 1u
#define SIU_ETPUBA_ETPUB25(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB25_SHIFT))&SIU_ETPUBA_ETPUB25_MASK)
#define SIU_ETPUBA_ETPUB26_MASK                  0x400u
#define SIU_ETPUBA_ETPUB26_SHIFT                 10u
#define SIU_ETPUBA_ETPUB26_WIDTH                 1u
#define SIU_ETPUBA_ETPUB26(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB26_SHIFT))&SIU_ETPUBA_ETPUB26_MASK)
#define SIU_ETPUBA_ETPUB27_MASK                  0x800u
#define SIU_ETPUBA_ETPUB27_SHIFT                 11u
#define SIU_ETPUBA_ETPUB27_WIDTH                 1u
#define SIU_ETPUBA_ETPUB27(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB27_SHIFT))&SIU_ETPUBA_ETPUB27_MASK)
#define SIU_ETPUBA_ETPUB28_MASK                  0x1000u
#define SIU_ETPUBA_ETPUB28_SHIFT                 12u
#define SIU_ETPUBA_ETPUB28_WIDTH                 1u
#define SIU_ETPUBA_ETPUB28(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB28_SHIFT))&SIU_ETPUBA_ETPUB28_MASK)
#define SIU_ETPUBA_ETPUB29_MASK                  0x2000u
#define SIU_ETPUBA_ETPUB29_SHIFT                 13u
#define SIU_ETPUBA_ETPUB29_WIDTH                 1u
#define SIU_ETPUBA_ETPUB29(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB29_SHIFT))&SIU_ETPUBA_ETPUB29_MASK)
#define SIU_ETPUBA_ETPUB30_MASK                  0x4000u
#define SIU_ETPUBA_ETPUB30_SHIFT                 14u
#define SIU_ETPUBA_ETPUB30_WIDTH                 1u
#define SIU_ETPUBA_ETPUB30(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB30_SHIFT))&SIU_ETPUBA_ETPUB30_MASK)
#define SIU_ETPUBA_ETPUB31_MASK                  0x8000u
#define SIU_ETPUBA_ETPUB31_SHIFT                 15u
#define SIU_ETPUBA_ETPUB31_WIDTH                 1u
#define SIU_ETPUBA_ETPUB31(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB31_SHIFT))&SIU_ETPUBA_ETPUB31_MASK)
#define SIU_ETPUBA_ETPUB0_MASK                   0x10000u
#define SIU_ETPUBA_ETPUB0_SHIFT                  16u
#define SIU_ETPUBA_ETPUB0_WIDTH                  1u
#define SIU_ETPUBA_ETPUB0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB0_SHIFT))&SIU_ETPUBA_ETPUB0_MASK)
#define SIU_ETPUBA_ETPUB1_MASK                   0x20000u
#define SIU_ETPUBA_ETPUB1_SHIFT                  17u
#define SIU_ETPUBA_ETPUB1_WIDTH                  1u
#define SIU_ETPUBA_ETPUB1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB1_SHIFT))&SIU_ETPUBA_ETPUB1_MASK)
#define SIU_ETPUBA_ETPUB2_MASK                   0x40000u
#define SIU_ETPUBA_ETPUB2_SHIFT                  18u
#define SIU_ETPUBA_ETPUB2_WIDTH                  1u
#define SIU_ETPUBA_ETPUB2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB2_SHIFT))&SIU_ETPUBA_ETPUB2_MASK)
#define SIU_ETPUBA_ETPUB3_MASK                   0x80000u
#define SIU_ETPUBA_ETPUB3_SHIFT                  19u
#define SIU_ETPUBA_ETPUB3_WIDTH                  1u
#define SIU_ETPUBA_ETPUB3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB3_SHIFT))&SIU_ETPUBA_ETPUB3_MASK)
#define SIU_ETPUBA_ETPUB4_MASK                   0x100000u
#define SIU_ETPUBA_ETPUB4_SHIFT                  20u
#define SIU_ETPUBA_ETPUB4_WIDTH                  1u
#define SIU_ETPUBA_ETPUB4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB4_SHIFT))&SIU_ETPUBA_ETPUB4_MASK)
#define SIU_ETPUBA_ETPUB5_MASK                   0x200000u
#define SIU_ETPUBA_ETPUB5_SHIFT                  21u
#define SIU_ETPUBA_ETPUB5_WIDTH                  1u
#define SIU_ETPUBA_ETPUB5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB5_SHIFT))&SIU_ETPUBA_ETPUB5_MASK)
#define SIU_ETPUBA_ETPUB6_MASK                   0x400000u
#define SIU_ETPUBA_ETPUB6_SHIFT                  22u
#define SIU_ETPUBA_ETPUB6_WIDTH                  1u
#define SIU_ETPUBA_ETPUB6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB6_SHIFT))&SIU_ETPUBA_ETPUB6_MASK)
#define SIU_ETPUBA_ETPUB7_MASK                   0x800000u
#define SIU_ETPUBA_ETPUB7_SHIFT                  23u
#define SIU_ETPUBA_ETPUB7_WIDTH                  1u
#define SIU_ETPUBA_ETPUB7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB7_SHIFT))&SIU_ETPUBA_ETPUB7_MASK)
#define SIU_ETPUBA_ETPUB8_MASK                   0x1000000u
#define SIU_ETPUBA_ETPUB8_SHIFT                  24u
#define SIU_ETPUBA_ETPUB8_WIDTH                  1u
#define SIU_ETPUBA_ETPUB8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB8_SHIFT))&SIU_ETPUBA_ETPUB8_MASK)
#define SIU_ETPUBA_ETPUB9_MASK                   0x2000000u
#define SIU_ETPUBA_ETPUB9_SHIFT                  25u
#define SIU_ETPUBA_ETPUB9_WIDTH                  1u
#define SIU_ETPUBA_ETPUB9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB9_SHIFT))&SIU_ETPUBA_ETPUB9_MASK)
#define SIU_ETPUBA_ETPUB10_MASK                  0x4000000u
#define SIU_ETPUBA_ETPUB10_SHIFT                 26u
#define SIU_ETPUBA_ETPUB10_WIDTH                 1u
#define SIU_ETPUBA_ETPUB10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB10_SHIFT))&SIU_ETPUBA_ETPUB10_MASK)
#define SIU_ETPUBA_ETPUB11_MASK                  0x8000000u
#define SIU_ETPUBA_ETPUB11_SHIFT                 27u
#define SIU_ETPUBA_ETPUB11_WIDTH                 1u
#define SIU_ETPUBA_ETPUB11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB11_SHIFT))&SIU_ETPUBA_ETPUB11_MASK)
#define SIU_ETPUBA_ETPUB12_MASK                  0x10000000u
#define SIU_ETPUBA_ETPUB12_SHIFT                 28u
#define SIU_ETPUBA_ETPUB12_WIDTH                 1u
#define SIU_ETPUBA_ETPUB12(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB12_SHIFT))&SIU_ETPUBA_ETPUB12_MASK)
#define SIU_ETPUBA_ETPUB13_MASK                  0x20000000u
#define SIU_ETPUBA_ETPUB13_SHIFT                 29u
#define SIU_ETPUBA_ETPUB13_WIDTH                 1u
#define SIU_ETPUBA_ETPUB13(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB13_SHIFT))&SIU_ETPUBA_ETPUB13_MASK)
#define SIU_ETPUBA_ETPUB14_MASK                  0x40000000u
#define SIU_ETPUBA_ETPUB14_SHIFT                 30u
#define SIU_ETPUBA_ETPUB14_WIDTH                 1u
#define SIU_ETPUBA_ETPUB14(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB14_SHIFT))&SIU_ETPUBA_ETPUB14_MASK)
#define SIU_ETPUBA_ETPUB15_MASK                  0x80000000u
#define SIU_ETPUBA_ETPUB15_SHIFT                 31u
#define SIU_ETPUBA_ETPUB15_WIDTH                 1u
#define SIU_ETPUBA_ETPUB15(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBA_ETPUB15_SHIFT))&SIU_ETPUBA_ETPUB15_MASK)
/* EMIOSA Bit Fields */
#define SIU_EMIOSA_EMIOS0_7_OUT31_MASK           0x1u
#define SIU_EMIOSA_EMIOS0_7_OUT31_SHIFT          0u
#define SIU_EMIOSA_EMIOS0_7_OUT31_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_7_OUT31(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_7_OUT31_SHIFT))&SIU_EMIOSA_EMIOS0_7_OUT31_MASK)
#define SIU_EMIOSA_EMIOS0_6_OUT30_MASK           0x2u
#define SIU_EMIOSA_EMIOS0_6_OUT30_SHIFT          1u
#define SIU_EMIOSA_EMIOS0_6_OUT30_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_6_OUT30(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_6_OUT30_SHIFT))&SIU_EMIOSA_EMIOS0_6_OUT30_MASK)
#define SIU_EMIOSA_EMIOS0_5_OUT29_MASK           0x4u
#define SIU_EMIOSA_EMIOS0_5_OUT29_SHIFT          2u
#define SIU_EMIOSA_EMIOS0_5_OUT29_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_5_OUT29(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_5_OUT29_SHIFT))&SIU_EMIOSA_EMIOS0_5_OUT29_MASK)
#define SIU_EMIOSA_EMIOS0_4_OUT28_MASK           0x8u
#define SIU_EMIOSA_EMIOS0_4_OUT28_SHIFT          3u
#define SIU_EMIOSA_EMIOS0_4_OUT28_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_4_OUT28(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_4_OUT28_SHIFT))&SIU_EMIOSA_EMIOS0_4_OUT28_MASK)
#define SIU_EMIOSA_EMIOS0_3_OUT27_MASK           0x10u
#define SIU_EMIOSA_EMIOS0_3_OUT27_SHIFT          4u
#define SIU_EMIOSA_EMIOS0_3_OUT27_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_3_OUT27(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_3_OUT27_SHIFT))&SIU_EMIOSA_EMIOS0_3_OUT27_MASK)
#define SIU_EMIOSA_EMIOS0_2_OUT26_MASK           0x20u
#define SIU_EMIOSA_EMIOS0_2_OUT26_SHIFT          5u
#define SIU_EMIOSA_EMIOS0_2_OUT26_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_2_OUT26(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_2_OUT26_SHIFT))&SIU_EMIOSA_EMIOS0_2_OUT26_MASK)
#define SIU_EMIOSA_EMIOS0_1_OUT25_MASK           0x40u
#define SIU_EMIOSA_EMIOS0_1_OUT25_SHIFT          6u
#define SIU_EMIOSA_EMIOS0_1_OUT25_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_1_OUT25(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_1_OUT25_SHIFT))&SIU_EMIOSA_EMIOS0_1_OUT25_MASK)
#define SIU_EMIOSA_EMIOS0_0_OUT24_MASK           0x80u
#define SIU_EMIOSA_EMIOS0_0_OUT24_SHIFT          7u
#define SIU_EMIOSA_EMIOS0_0_OUT24_WIDTH          1u
#define SIU_EMIOSA_EMIOS0_0_OUT24(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_0_OUT24_SHIFT))&SIU_EMIOSA_EMIOS0_0_OUT24_MASK)
#define SIU_EMIOSA_EMIOS0_23_OUT23_MASK          0x100u
#define SIU_EMIOSA_EMIOS0_23_OUT23_SHIFT         8u
#define SIU_EMIOSA_EMIOS0_23_OUT23_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_23_OUT23(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_23_OUT23_SHIFT))&SIU_EMIOSA_EMIOS0_23_OUT23_MASK)
#define SIU_EMIOSA_EMIOS0_22_OUT22_MASK          0x200u
#define SIU_EMIOSA_EMIOS0_22_OUT22_SHIFT         9u
#define SIU_EMIOSA_EMIOS0_22_OUT22_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_22_OUT22(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_22_OUT22_SHIFT))&SIU_EMIOSA_EMIOS0_22_OUT22_MASK)
#define SIU_EMIOSA_EMIOS0_21_OUT21_MASK          0x400u
#define SIU_EMIOSA_EMIOS0_21_OUT21_SHIFT         10u
#define SIU_EMIOSA_EMIOS0_21_OUT21_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_21_OUT21(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_21_OUT21_SHIFT))&SIU_EMIOSA_EMIOS0_21_OUT21_MASK)
#define SIU_EMIOSA_EMIOS0_20_OUT20_MASK          0x800u
#define SIU_EMIOSA_EMIOS0_20_OUT20_SHIFT         11u
#define SIU_EMIOSA_EMIOS0_20_OUT20_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_20_OUT20(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_20_OUT20_SHIFT))&SIU_EMIOSA_EMIOS0_20_OUT20_MASK)
#define SIU_EMIOSA_EMIOS0_19_OUT19_MASK          0x1000u
#define SIU_EMIOSA_EMIOS0_19_OUT19_SHIFT         12u
#define SIU_EMIOSA_EMIOS0_19_OUT19_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_19_OUT19(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_19_OUT19_SHIFT))&SIU_EMIOSA_EMIOS0_19_OUT19_MASK)
#define SIU_EMIOSA_EMIOS0_18_OUT18_MASK          0x2000u
#define SIU_EMIOSA_EMIOS0_18_OUT18_SHIFT         13u
#define SIU_EMIOSA_EMIOS0_18_OUT18_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_18_OUT18(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_18_OUT18_SHIFT))&SIU_EMIOSA_EMIOS0_18_OUT18_MASK)
#define SIU_EMIOSA_EMIOS0_17_OUT17_MASK          0x4000u
#define SIU_EMIOSA_EMIOS0_17_OUT17_SHIFT         14u
#define SIU_EMIOSA_EMIOS0_17_OUT17_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_17_OUT17(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_17_OUT17_SHIFT))&SIU_EMIOSA_EMIOS0_17_OUT17_MASK)
#define SIU_EMIOSA_EMIOS0_16_OUT16_MASK          0x8000u
#define SIU_EMIOSA_EMIOS0_16_OUT16_SHIFT         15u
#define SIU_EMIOSA_EMIOS0_16_OUT16_WIDTH         1u
#define SIU_EMIOSA_EMIOS0_16_OUT16(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_16_OUT16_SHIFT))&SIU_EMIOSA_EMIOS0_16_OUT16_MASK)
#define SIU_EMIOSA_EMIOS1_7_OUT15_MASK           0x10000u
#define SIU_EMIOSA_EMIOS1_7_OUT15_SHIFT          16u
#define SIU_EMIOSA_EMIOS1_7_OUT15_WIDTH          1u
#define SIU_EMIOSA_EMIOS1_7_OUT15(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_7_OUT15_SHIFT))&SIU_EMIOSA_EMIOS1_7_OUT15_MASK)
#define SIU_EMIOSA_EMIOS1_6_OUT14_MASK           0x20000u
#define SIU_EMIOSA_EMIOS1_6_OUT14_SHIFT          17u
#define SIU_EMIOSA_EMIOS1_6_OUT14_WIDTH          1u
#define SIU_EMIOSA_EMIOS1_6_OUT14(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_6_OUT14_SHIFT))&SIU_EMIOSA_EMIOS1_6_OUT14_MASK)
#define SIU_EMIOSA_EMIOS1_5_OUT13_MASK           0x40000u
#define SIU_EMIOSA_EMIOS1_5_OUT13_SHIFT          18u
#define SIU_EMIOSA_EMIOS1_5_OUT13_WIDTH          1u
#define SIU_EMIOSA_EMIOS1_5_OUT13(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_5_OUT13_SHIFT))&SIU_EMIOSA_EMIOS1_5_OUT13_MASK)
#define SIU_EMIOSA_EMIOS1_4_OUT12_MASK           0x80000u
#define SIU_EMIOSA_EMIOS1_4_OUT12_SHIFT          19u
#define SIU_EMIOSA_EMIOS1_4_OUT12_WIDTH          1u
#define SIU_EMIOSA_EMIOS1_4_OUT12(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_4_OUT12_SHIFT))&SIU_EMIOSA_EMIOS1_4_OUT12_MASK)
#define SIU_EMIOSA_EMIOS1_3_OUT11_MASK           0x100000u
#define SIU_EMIOSA_EMIOS1_3_OUT11_SHIFT          20u
#define SIU_EMIOSA_EMIOS1_3_OUT11_WIDTH          1u
#define SIU_EMIOSA_EMIOS1_3_OUT11(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_3_OUT11_SHIFT))&SIU_EMIOSA_EMIOS1_3_OUT11_MASK)
#define SIU_EMIOSA_EMIOS1_2_OUT10_MASK           0x200000u
