neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_EMIOSA_EMIOS1_2_OUT10_SHIFT          21u
#define SIU_EMIOSA_EMIOS1_2_OUT10_WIDTH          1u
#define SIU_EMIOSA_EMIOS1_2_OUT10(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_2_OUT10_SHIFT))&SIU_EMIOSA_EMIOS1_2_OUT10_MASK)
#define SIU_EMIOSA_EMIOS1_1_OUT9_MASK            0x400000u
#define SIU_EMIOSA_EMIOS1_1_OUT9_SHIFT           22u
#define SIU_EMIOSA_EMIOS1_1_OUT9_WIDTH           1u
#define SIU_EMIOSA_EMIOS1_1_OUT9(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_1_OUT9_SHIFT))&SIU_EMIOSA_EMIOS1_1_OUT9_MASK)
#define SIU_EMIOSA_EMIOS1_0_OUT8_MASK            0x800000u
#define SIU_EMIOSA_EMIOS1_0_OUT8_SHIFT           23u
#define SIU_EMIOSA_EMIOS1_0_OUT8_WIDTH           1u
#define SIU_EMIOSA_EMIOS1_0_OUT8(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS1_0_OUT8_SHIFT))&SIU_EMIOSA_EMIOS1_0_OUT8_MASK)
#define SIU_EMIOSA_EMIOS0_0_OUT7_MASK            0x1000000u
#define SIU_EMIOSA_EMIOS0_0_OUT7_SHIFT           24u
#define SIU_EMIOSA_EMIOS0_0_OUT7_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_0_OUT7(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_0_OUT7_SHIFT))&SIU_EMIOSA_EMIOS0_0_OUT7_MASK)
#define SIU_EMIOSA_EMIOS0_1_OUT6_MASK            0x2000000u
#define SIU_EMIOSA_EMIOS0_1_OUT6_SHIFT           25u
#define SIU_EMIOSA_EMIOS0_1_OUT6_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_1_OUT6(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_1_OUT6_SHIFT))&SIU_EMIOSA_EMIOS0_1_OUT6_MASK)
#define SIU_EMIOSA_EMIOS0_2_OUT5_MASK            0x4000000u
#define SIU_EMIOSA_EMIOS0_2_OUT5_SHIFT           26u
#define SIU_EMIOSA_EMIOS0_2_OUT5_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_2_OUT5(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_2_OUT5_SHIFT))&SIU_EMIOSA_EMIOS0_2_OUT5_MASK)
#define SIU_EMIOSA_EMIOS0_3_OUT4_MASK            0x8000000u
#define SIU_EMIOSA_EMIOS0_3_OUT4_SHIFT           27u
#define SIU_EMIOSA_EMIOS0_3_OUT4_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_3_OUT4(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_3_OUT4_SHIFT))&SIU_EMIOSA_EMIOS0_3_OUT4_MASK)
#define SIU_EMIOSA_EMIOS0_4_OUT3_MASK            0x10000000u
#define SIU_EMIOSA_EMIOS0_4_OUT3_SHIFT           28u
#define SIU_EMIOSA_EMIOS0_4_OUT3_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_4_OUT3(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_4_OUT3_SHIFT))&SIU_EMIOSA_EMIOS0_4_OUT3_MASK)
#define SIU_EMIOSA_EMIOS0_5_OUT2_MASK            0x20000000u
#define SIU_EMIOSA_EMIOS0_5_OUT2_SHIFT           29u
#define SIU_EMIOSA_EMIOS0_5_OUT2_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_5_OUT2(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_5_OUT2_SHIFT))&SIU_EMIOSA_EMIOS0_5_OUT2_MASK)
#define SIU_EMIOSA_EMIOS0_6_OUT1_MASK            0x40000000u
#define SIU_EMIOSA_EMIOS0_6_OUT1_SHIFT           30u
#define SIU_EMIOSA_EMIOS0_6_OUT1_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_6_OUT1(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_6_OUT1_SHIFT))&SIU_EMIOSA_EMIOS0_6_OUT1_MASK)
#define SIU_EMIOSA_EMIOS0_7_OUT0_MASK            0x80000000u
#define SIU_EMIOSA_EMIOS0_7_OUT0_SHIFT           31u
#define SIU_EMIOSA_EMIOS0_7_OUT0_WIDTH           1u
#define SIU_EMIOSA_EMIOS0_7_OUT0(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSA_EMIOS0_7_OUT0_SHIFT))&SIU_EMIOSA_EMIOS0_7_OUT0_MASK)
/* DSPIAHLA Bit Fields */
#define SIU_DSPIAHLA_DSPIAL31_MASK               0x1u
#define SIU_DSPIAHLA_DSPIAL31_SHIFT              0u
#define SIU_DSPIAHLA_DSPIAL31_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL31(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL31_SHIFT))&SIU_DSPIAHLA_DSPIAL31_MASK)
#define SIU_DSPIAHLA_DSPIAL30_MASK               0x2u
#define SIU_DSPIAHLA_DSPIAL30_SHIFT              1u
#define SIU_DSPIAHLA_DSPIAL30_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL30(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL30_SHIFT))&SIU_DSPIAHLA_DSPIAL30_MASK)
#define SIU_DSPIAHLA_DSPIAL29_MASK               0x4u
#define SIU_DSPIAHLA_DSPIAL29_SHIFT              2u
#define SIU_DSPIAHLA_DSPIAL29_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL29(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL29_SHIFT))&SIU_DSPIAHLA_DSPIAL29_MASK)
#define SIU_DSPIAHLA_DSPIAL28_MASK               0x8u
#define SIU_DSPIAHLA_DSPIAL28_SHIFT              3u
#define SIU_DSPIAHLA_DSPIAL28_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL28(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL28_SHIFT))&SIU_DSPIAHLA_DSPIAL28_MASK)
#define SIU_DSPIAHLA_DSPIAL27_MASK               0x10u
#define SIU_DSPIAHLA_DSPIAL27_SHIFT              4u
#define SIU_DSPIAHLA_DSPIAL27_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL27(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL27_SHIFT))&SIU_DSPIAHLA_DSPIAL27_MASK)
#define SIU_DSPIAHLA_DSPIAL26_MASK               0x20u
#define SIU_DSPIAHLA_DSPIAL26_SHIFT              5u
#define SIU_DSPIAHLA_DSPIAL26_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL26(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL26_SHIFT))&SIU_DSPIAHLA_DSPIAL26_MASK)
#define SIU_DSPIAHLA_DSPIAL25_MASK               0x40u
#define SIU_DSPIAHLA_DSPIAL25_SHIFT              6u
#define SIU_DSPIAHLA_DSPIAL25_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL25(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL25_SHIFT))&SIU_DSPIAHLA_DSPIAL25_MASK)
#define SIU_DSPIAHLA_DSPIAL24_MASK               0x80u
#define SIU_DSPIAHLA_DSPIAL24_SHIFT              7u
#define SIU_DSPIAHLA_DSPIAL24_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL24(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL24_SHIFT))&SIU_DSPIAHLA_DSPIAL24_MASK)
#define SIU_DSPIAHLA_DSPIAL23_MASK               0x100u
#define SIU_DSPIAHLA_DSPIAL23_SHIFT              8u
#define SIU_DSPIAHLA_DSPIAL23_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL23(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL23_SHIFT))&SIU_DSPIAHLA_DSPIAL23_MASK)
#define SIU_DSPIAHLA_DSPIAL22_MASK               0x200u
#define SIU_DSPIAHLA_DSPIAL22_SHIFT              9u
#define SIU_DSPIAHLA_DSPIAL22_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL22(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL22_SHIFT))&SIU_DSPIAHLA_DSPIAL22_MASK)
#define SIU_DSPIAHLA_DSPIAL21_MASK               0x400u
#define SIU_DSPIAHLA_DSPIAL21_SHIFT              10u
#define SIU_DSPIAHLA_DSPIAL21_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL21(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL21_SHIFT))&SIU_DSPIAHLA_DSPIAL21_MASK)
#define SIU_DSPIAHLA_DSPIAL20_MASK               0x800u
#define SIU_DSPIAHLA_DSPIAL20_SHIFT              11u
#define SIU_DSPIAHLA_DSPIAL20_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL20(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL20_SHIFT))&SIU_DSPIAHLA_DSPIAL20_MASK)
#define SIU_DSPIAHLA_DSPIAL19_MASK               0x1000u
#define SIU_DSPIAHLA_DSPIAL19_SHIFT              12u
#define SIU_DSPIAHLA_DSPIAL19_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL19(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL19_SHIFT))&SIU_DSPIAHLA_DSPIAL19_MASK)
#define SIU_DSPIAHLA_DSPIAL18_MASK               0x2000u
#define SIU_DSPIAHLA_DSPIAL18_SHIFT              13u
#define SIU_DSPIAHLA_DSPIAL18_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL18(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL18_SHIFT))&SIU_DSPIAHLA_DSPIAL18_MASK)
#define SIU_DSPIAHLA_DSPIAL17_MASK               0x4000u
#define SIU_DSPIAHLA_DSPIAL17_SHIFT              14u
#define SIU_DSPIAHLA_DSPIAL17_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL17(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL17_SHIFT))&SIU_DSPIAHLA_DSPIAL17_MASK)
#define SIU_DSPIAHLA_DSPIAL16_MASK               0x8000u
#define SIU_DSPIAHLA_DSPIAL16_SHIFT              15u
#define SIU_DSPIAHLA_DSPIAL16_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAL16(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAL16_SHIFT))&SIU_DSPIAHLA_DSPIAL16_MASK)
#define SIU_DSPIAHLA_DSPIAH15_MASK               0x10000u
#define SIU_DSPIAHLA_DSPIAH15_SHIFT              16u
#define SIU_DSPIAHLA_DSPIAH15_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAH15(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH15_SHIFT))&SIU_DSPIAHLA_DSPIAH15_MASK)
#define SIU_DSPIAHLA_DSPIAH14_MASK               0x20000u
#define SIU_DSPIAHLA_DSPIAH14_SHIFT              17u
#define SIU_DSPIAHLA_DSPIAH14_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAH14(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH14_SHIFT))&SIU_DSPIAHLA_DSPIAH14_MASK)
#define SIU_DSPIAHLA_DSPIAH13_MASK               0x40000u
#define SIU_DSPIAHLA_DSPIAH13_SHIFT              18u
#define SIU_DSPIAHLA_DSPIAH13_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAH13(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH13_SHIFT))&SIU_DSPIAHLA_DSPIAH13_MASK)
#define SIU_DSPIAHLA_DSPIAH12_MASK               0x80000u
#define SIU_DSPIAHLA_DSPIAH12_SHIFT              19u
#define SIU_DSPIAHLA_DSPIAH12_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAH12(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH12_SHIFT))&SIU_DSPIAHLA_DSPIAH12_MASK)
#define SIU_DSPIAHLA_DSPIAH11_MASK               0x100000u
#define SIU_DSPIAHLA_DSPIAH11_SHIFT              20u
#define SIU_DSPIAHLA_DSPIAH11_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAH11(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH11_SHIFT))&SIU_DSPIAHLA_DSPIAH11_MASK)
#define SIU_DSPIAHLA_DSPIAH10_MASK               0x200000u
#define SIU_DSPIAHLA_DSPIAH10_SHIFT              21u
#define SIU_DSPIAHLA_DSPIAH10_WIDTH              1u
#define SIU_DSPIAHLA_DSPIAH10(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH10_SHIFT))&SIU_DSPIAHLA_DSPIAH10_MASK)
#define SIU_DSPIAHLA_DSPIAH9_MASK                0x400000u
#define SIU_DSPIAHLA_DSPIAH9_SHIFT               22u
#define SIU_DSPIAHLA_DSPIAH9_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH9(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH9_SHIFT))&SIU_DSPIAHLA_DSPIAH9_MASK)
#define SIU_DSPIAHLA_DSPIAH8_MASK                0x800000u
#define SIU_DSPIAHLA_DSPIAH8_SHIFT               23u
#define SIU_DSPIAHLA_DSPIAH8_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH8(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH8_SHIFT))&SIU_DSPIAHLA_DSPIAH8_MASK)
#define SIU_DSPIAHLA_DSPIAH7_MASK                0x1000000u
#define SIU_DSPIAHLA_DSPIAH7_SHIFT               24u
#define SIU_DSPIAHLA_DSPIAH7_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH7(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH7_SHIFT))&SIU_DSPIAHLA_DSPIAH7_MASK)
#define SIU_DSPIAHLA_DSPIAH6_MASK                0x2000000u
#define SIU_DSPIAHLA_DSPIAH6_SHIFT               25u
#define SIU_DSPIAHLA_DSPIAH6_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH6(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH6_SHIFT))&SIU_DSPIAHLA_DSPIAH6_MASK)
#define SIU_DSPIAHLA_DSPIAH5_MASK                0x4000000u
#define SIU_DSPIAHLA_DSPIAH5_SHIFT               26u
#define SIU_DSPIAHLA_DSPIAH5_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH5(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH5_SHIFT))&SIU_DSPIAHLA_DSPIAH5_MASK)
#define SIU_DSPIAHLA_DSPIAH4_MASK                0x8000000u
#define SIU_DSPIAHLA_DSPIAH4_SHIFT               27u
#define SIU_DSPIAHLA_DSPIAH4_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH4(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH4_SHIFT))&SIU_DSPIAHLA_DSPIAH4_MASK)
#define SIU_DSPIAHLA_DSPIAH3_MASK                0x10000000u
#define SIU_DSPIAHLA_DSPIAH3_SHIFT               28u
#define SIU_DSPIAHLA_DSPIAH3_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH3(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH3_SHIFT))&SIU_DSPIAHLA_DSPIAH3_MASK)
#define SIU_DSPIAHLA_DSPIAH2_MASK                0x20000000u
#define SIU_DSPIAHLA_DSPIAH2_SHIFT               29u
#define SIU_DSPIAHLA_DSPIAH2_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH2(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH2_SHIFT))&SIU_DSPIAHLA_DSPIAH2_MASK)
#define SIU_DSPIAHLA_DSPIAH1_MASK                0x40000000u
#define SIU_DSPIAHLA_DSPIAH1_SHIFT               30u
#define SIU_DSPIAHLA_DSPIAH1_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH1(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH1_SHIFT))&SIU_DSPIAHLA_DSPIAH1_MASK)
#define SIU_DSPIAHLA_DSPIAH0_MASK                0x80000000u
#define SIU_DSPIAHLA_DSPIAH0_SHIFT               31u
#define SIU_DSPIAHLA_DSPIAH0_WIDTH               1u
#define SIU_DSPIAHLA_DSPIAH0(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIAHLA_DSPIAH0_SHIFT))&SIU_DSPIAHLA_DSPIAH0_MASK)
/* ETPUAB Bit Fields */
#define SIU_ETPUAB_ETPUA11_MASK                  0x1u
#define SIU_ETPUAB_ETPUA11_SHIFT                 0u
#define SIU_ETPUAB_ETPUA11_WIDTH                 1u
#define SIU_ETPUAB_ETPUA11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA11_SHIFT))&SIU_ETPUAB_ETPUA11_MASK)
#define SIU_ETPUAB_ETPUA10_MASK                  0x2u
#define SIU_ETPUAB_ETPUA10_SHIFT                 1u
#define SIU_ETPUAB_ETPUA10_WIDTH                 1u
#define SIU_ETPUAB_ETPUA10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA10_SHIFT))&SIU_ETPUAB_ETPUA10_MASK)
#define SIU_ETPUAB_ETPUA9_MASK                   0x4u
#define SIU_ETPUAB_ETPUA9_SHIFT                  2u
#define SIU_ETPUAB_ETPUA9_WIDTH                  1u
#define SIU_ETPUAB_ETPUA9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA9_SHIFT))&SIU_ETPUAB_ETPUA9_MASK)
#define SIU_ETPUAB_ETPUA8_MASK                   0x8u
#define SIU_ETPUAB_ETPUA8_SHIFT                  3u
#define SIU_ETPUAB_ETPUA8_WIDTH                  1u
#define SIU_ETPUAB_ETPUA8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA8_SHIFT))&SIU_ETPUAB_ETPUA8_MASK)
#define SIU_ETPUAB_ETPUA7_MASK                   0x10u
#define SIU_ETPUAB_ETPUA7_SHIFT                  4u
#define SIU_ETPUAB_ETPUA7_WIDTH                  1u
#define SIU_ETPUAB_ETPUA7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA7_SHIFT))&SIU_ETPUAB_ETPUA7_MASK)
#define SIU_ETPUAB_ETPUA6_MASK                   0x20u
#define SIU_ETPUAB_ETPUA6_SHIFT                  5u
#define SIU_ETPUAB_ETPUA6_WIDTH                  1u
#define SIU_ETPUAB_ETPUA6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA6_SHIFT))&SIU_ETPUAB_ETPUA6_MASK)
#define SIU_ETPUAB_ETPUA5_MASK                   0x40u
#define SIU_ETPUAB_ETPUA5_SHIFT                  6u
#define SIU_ETPUAB_ETPUA5_WIDTH                  1u
#define SIU_ETPUAB_ETPUA5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA5_SHIFT))&SIU_ETPUAB_ETPUA5_MASK)
#define SIU_ETPUAB_ETPUA4_MASK                   0x80u
#define SIU_ETPUAB_ETPUA4_SHIFT                  7u
#define SIU_ETPUAB_ETPUA4_WIDTH                  1u
#define SIU_ETPUAB_ETPUA4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA4_SHIFT))&SIU_ETPUAB_ETPUA4_MASK)
#define SIU_ETPUAB_ETPUA3_MASK                   0x100u
#define SIU_ETPUAB_ETPUA3_SHIFT                  8u
#define SIU_ETPUAB_ETPUA3_WIDTH                  1u
#define SIU_ETPUAB_ETPUA3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA3_SHIFT))&SIU_ETPUAB_ETPUA3_MASK)
#define SIU_ETPUAB_ETPUA2_MASK                   0x200u
#define SIU_ETPUAB_ETPUA2_SHIFT                  9u
#define SIU_ETPUAB_ETPUA2_WIDTH                  1u
#define SIU_ETPUAB_ETPUA2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA2_SHIFT))&SIU_ETPUAB_ETPUA2_MASK)
#define SIU_ETPUAB_ETPUA1_MASK                   0x400u
#define SIU_ETPUAB_ETPUA1_SHIFT                  10u
#define SIU_ETPUAB_ETPUA1_WIDTH                  1u
#define SIU_ETPUAB_ETPUA1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA1_SHIFT))&SIU_ETPUAB_ETPUA1_MASK)
#define SIU_ETPUAB_ETPUA0_MASK                   0x800u
#define SIU_ETPUAB_ETPUA0_SHIFT                  11u
#define SIU_ETPUAB_ETPUA0_WIDTH                  1u
#define SIU_ETPUAB_ETPUA0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA0_SHIFT))&SIU_ETPUAB_ETPUA0_MASK)
#define SIU_ETPUAB_ETPUA15_MASK                  0x1000u
#define SIU_ETPUAB_ETPUA15_SHIFT                 12u
#define SIU_ETPUAB_ETPUA15_WIDTH                 1u
#define SIU_ETPUAB_ETPUA15(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA15_SHIFT))&SIU_ETPUAB_ETPUA15_MASK)
#define SIU_ETPUAB_ETPUA14_MASK                  0x2000u
#define SIU_ETPUAB_ETPUA14_SHIFT                 13u
#define SIU_ETPUAB_ETPUA14_WIDTH                 1u
#define SIU_ETPUAB_ETPUA14(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA14_SHIFT))&SIU_ETPUAB_ETPUA14_MASK)
#define SIU_ETPUAB_ETPUA13_MASK                  0x4000u
#define SIU_ETPUAB_ETPUA13_SHIFT                 14u
#define SIU_ETPUAB_ETPUA13_WIDTH                 1u
#define SIU_ETPUAB_ETPUA13(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA13_SHIFT))&SIU_ETPUAB_ETPUA13_MASK)
#define SIU_ETPUAB_ETPUA12_MASK                  0x8000u
#define SIU_ETPUAB_ETPUA12_SHIFT                 15u
#define SIU_ETPUAB_ETPUA12_WIDTH                 1u
#define SIU_ETPUAB_ETPUA12(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA12_SHIFT))&SIU_ETPUAB_ETPUA12_MASK)
#define SIU_ETPUAB_ETPUA30_MASK                  0x10000u
#define SIU_ETPUAB_ETPUA30_SHIFT                 16u
#define SIU_ETPUAB_ETPUA30_WIDTH                 1u
#define SIU_ETPUAB_ETPUA30(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA30_SHIFT))&SIU_ETPUAB_ETPUA30_MASK)
#define SIU_ETPUAB_ETPUA31_MASK                  0x20000u
#define SIU_ETPUAB_ETPUA31_SHIFT                 17u
#define SIU_ETPUAB_ETPUA31_WIDTH                 1u
#define SIU_ETPUAB_ETPUA31(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA31_SHIFT))&SIU_ETPUAB_ETPUA31_MASK)
#define SIU_ETPUAB_ETPUA24_MASK                  0x40000u
#define SIU_ETPUAB_ETPUA24_SHIFT                 18u
#define SIU_ETPUAB_ETPUA24_WIDTH                 1u
#define SIU_ETPUAB_ETPUA24(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA24_SHIFT))&SIU_ETPUAB_ETPUA24_MASK)
#define SIU_ETPUAB_ETPUA25_MASK                  0x80000u
#define SIU_ETPUAB_ETPUA25_SHIFT                 19u
#define SIU_ETPUAB_ETPUA25_WIDTH                 1u
#define SIU_ETPUAB_ETPUA25(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA25_SHIFT))&SIU_ETPUAB_ETPUA25_MASK)
#define SIU_ETPUAB_ETPUA26_MASK                  0x100000u
#define SIU_ETPUAB_ETPUA26_SHIFT                 20u
#define SIU_ETPUAB_ETPUA26_WIDTH                 1u
#define SIU_ETPUAB_ETPUA26(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA26_SHIFT))&SIU_ETPUAB_ETPUA26_MASK)
#define SIU_ETPUAB_ETPUA27_MASK                  0x200000u
#define SIU_ETPUAB_ETPUA27_SHIFT                 21u
#define SIU_ETPUAB_ETPUA27_WIDTH                 1u
#define SIU_ETPUAB_ETPUA27(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA27_SHIFT))&SIU_ETPUAB_ETPUA27_MASK)
#define SIU_ETPUAB_ETPUA28_MASK                  0x400000u
#define SIU_ETPUAB_ETPUA28_SHIFT                 22u
#define SIU_ETPUAB_ETPUA28_WIDTH                 1u
#define SIU_ETPUAB_ETPUA28(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA28_SHIFT))&SIU_ETPUAB_ETPUA28_MASK)
#define SIU_ETPUAB_ETPUA29_MASK                  0x800000u
#define SIU_ETPUAB_ETPUA29_SHIFT                 23u
#define SIU_ETPUAB_ETPUA29_WIDTH                 1u
#define SIU_ETPUAB_ETPUA29(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA29_SHIFT))&SIU_ETPUAB_ETPUA29_MASK)
#define SIU_ETPUAB_ETPUA16_MASK                  0x1000000u
#define SIU_ETPUAB_ETPUA16_SHIFT                 24u
#define SIU_ETPUAB_ETPUA16_WIDTH                 1u
#define SIU_ETPUAB_ETPUA16(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA16_SHIFT))&SIU_ETPUAB_ETPUA16_MASK)
#define SIU_ETPUAB_ETPUA17_MASK                  0x2000000u
#define SIU_ETPUAB_ETPUA17_SHIFT                 25u
#define SIU_ETPUAB_ETPUA17_WIDTH                 1u
#define SIU_ETPUAB_ETPUA17(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA17_SHIFT))&SIU_ETPUAB_ETPUA17_MASK)
#define SIU_ETPUAB_ETPUA18_MASK                  0x4000000u
#define SIU_ETPUAB_ETPUA18_SHIFT                 26u
#define SIU_ETPUAB_ETPUA18_WIDTH                 1u
#define SIU_ETPUAB_ETPUA18(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA18_SHIFT))&SIU_ETPUAB_ETPUA18_MASK)
#define SIU_ETPUAB_ETPUA19_MASK                  0x8000000u
#define SIU_ETPUAB_ETPUA19_SHIFT                 27u
#define SIU_ETPUAB_ETPUA19_WIDTH                 1u
#define SIU_ETPUAB_ETPUA19(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA19_SHIFT))&SIU_ETPUAB_ETPUA19_MASK)
#define SIU_ETPUAB_ETPUA20_MASK                  0x10000000u
#define SIU_ETPUAB_ETPUA20_SHIFT                 28u
#define SIU_ETPUAB_ETPUA20_WIDTH                 1u
#define SIU_ETPUAB_ETPUA20(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA20_SHIFT))&SIU_ETPUAB_ETPUA20_MASK)
#define SIU_ETPUAB_ETPUA21_MASK                  0x20000000u
#define SIU_ETPUAB_ETPUA21_SHIFT                 29u
#define SIU_ETPUAB_ETPUA21_WIDTH                 1u
#define SIU_ETPUAB_ETPUA21(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA21_SHIFT))&SIU_ETPUAB_ETPUA21_MASK)
#define SIU_ETPUAB_ETPUA22_MASK                  0x40000000u
#define SIU_ETPUAB_ETPUA22_SHIFT                 30u
#define SIU_ETPUAB_ETPUA22_WIDTH                 1u
#define SIU_ETPUAB_ETPUA22(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA22_SHIFT))&SIU_ETPUAB_ETPUA22_MASK)
#define SIU_ETPUAB_ETPUA23_MASK                  0x80000000u
#define SIU_ETPUAB_ETPUA23_SHIFT                 31u
#define SIU_ETPUAB_ETPUA23_WIDTH                 1u
#define SIU_ETPUAB_ETPUA23(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAB_ETPUA23_SHIFT))&SIU_ETPUAB_ETPUA23_MASK)
/* EMIOSB Bit Fields */
#define SIU_EMIOSB_EMIOS0_0_OUT31_MASK           0x1u
#define SIU_EMIOSB_EMIOS0_0_OUT31_SHIFT          0u
#define SIU_EMIOSB_EMIOS0_0_OUT31_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_0_OUT31(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_0_OUT31_SHIFT))&SIU_EMIOSB_EMIOS0_0_OUT31_MASK)
#define SIU_EMIOSB_EMIOS0_1_OUT30_MASK           0x2u
#define SIU_EMIOSB_EMIOS0_1_OUT30_SHIFT          1u
#define SIU_EMIOSB_EMIOS0_1_OUT30_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_1_OUT30(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_1_OUT30_SHIFT))&SIU_EMIOSB_EMIOS0_1_OUT30_MASK)
#define SIU_EMIOSB_EMIOS0_2_OUT29_MASK           0x4u
#define SIU_EMIOSB_EMIOS0_2_OUT29_SHIFT          2u
#define SIU_EMIOSB_EMIOS0_2_OUT29_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_2_OUT29(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_2_OUT29_SHIFT))&SIU_EMIOSB_EMIOS0_2_OUT29_MASK)
#define SIU_EMIOSB_EMIOS0_3_OUT28_MASK           0x8u
#define SIU_EMIOSB_EMIOS0_3_OUT28_SHIFT          3u
#define SIU_EMIOSB_EMIOS0_3_OUT28_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_3_OUT28(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_3_OUT28_SHIFT))&SIU_EMIOSB_EMIOS0_3_OUT28_MASK)
#define SIU_EMIOSB_EMIOS0_4_OUT27_MASK           0x10u
#define SIU_EMIOSB_EMIOS0_4_OUT27_SHIFT          4u
#define SIU_EMIOSB_EMIOS0_4_OUT27_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_4_OUT27(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_4_OUT27_SHIFT))&SIU_EMIOSB_EMIOS0_4_OUT27_MASK)
#define SIU_EMIOSB_EMIOS0_5_OUT26_MASK           0x20u
#define SIU_EMIOSB_EMIOS0_5_OUT26_SHIFT          5u
#define SIU_EMIOSB_EMIOS0_5_OUT26_WIDTH          1u
