neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_EMIOSB_EMIOS0_5_OUT26(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_5_OUT26_SHIFT))&SIU_EMIOSB_EMIOS0_5_OUT26_MASK)
#define SIU_EMIOSB_EMIOS0_6_OUT25_MASK           0x40u
#define SIU_EMIOSB_EMIOS0_6_OUT25_SHIFT          6u
#define SIU_EMIOSB_EMIOS0_6_OUT25_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_6_OUT25(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_6_OUT25_SHIFT))&SIU_EMIOSB_EMIOS0_6_OUT25_MASK)
#define SIU_EMIOSB_EMIOS1_0_OUT24_MASK           0x80u
#define SIU_EMIOSB_EMIOS1_0_OUT24_SHIFT          7u
#define SIU_EMIOSB_EMIOS1_0_OUT24_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_0_OUT24(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_0_OUT24_SHIFT))&SIU_EMIOSB_EMIOS1_0_OUT24_MASK)
#define SIU_EMIOSB_EMIOS1_1_OUT23_MASK           0x100u
#define SIU_EMIOSB_EMIOS1_1_OUT23_SHIFT          8u
#define SIU_EMIOSB_EMIOS1_1_OUT23_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_1_OUT23(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_1_OUT23_SHIFT))&SIU_EMIOSB_EMIOS1_1_OUT23_MASK)
#define SIU_EMIOSB_EMIOS1_2_OUT22_MASK           0x200u
#define SIU_EMIOSB_EMIOS1_2_OUT22_SHIFT          9u
#define SIU_EMIOSB_EMIOS1_2_OUT22_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_2_OUT22(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_2_OUT22_SHIFT))&SIU_EMIOSB_EMIOS1_2_OUT22_MASK)
#define SIU_EMIOSB_EMIOS1_3_OUT21_MASK           0x400u
#define SIU_EMIOSB_EMIOS1_3_OUT21_SHIFT          10u
#define SIU_EMIOSB_EMIOS1_3_OUT21_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_3_OUT21(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_3_OUT21_SHIFT))&SIU_EMIOSB_EMIOS1_3_OUT21_MASK)
#define SIU_EMIOSB_EMIOS1_4_OUT20_MASK           0x800u
#define SIU_EMIOSB_EMIOS1_4_OUT20_SHIFT          11u
#define SIU_EMIOSB_EMIOS1_4_OUT20_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_4_OUT20(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_4_OUT20_SHIFT))&SIU_EMIOSB_EMIOS1_4_OUT20_MASK)
#define SIU_EMIOSB_EMIOS1_5_OUT19_MASK           0x1000u
#define SIU_EMIOSB_EMIOS1_5_OUT19_SHIFT          12u
#define SIU_EMIOSB_EMIOS1_5_OUT19_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_5_OUT19(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_5_OUT19_SHIFT))&SIU_EMIOSB_EMIOS1_5_OUT19_MASK)
#define SIU_EMIOSB_EMIOS1_6_OUT18_MASK           0x2000u
#define SIU_EMIOSB_EMIOS1_6_OUT18_SHIFT          13u
#define SIU_EMIOSB_EMIOS1_6_OUT18_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_6_OUT18(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_6_OUT18_SHIFT))&SIU_EMIOSB_EMIOS1_6_OUT18_MASK)
#define SIU_EMIOSB_EMIOS1_7_OUT17_MASK           0x4000u
#define SIU_EMIOSB_EMIOS1_7_OUT17_SHIFT          14u
#define SIU_EMIOSB_EMIOS1_7_OUT17_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_7_OUT17(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_7_OUT17_SHIFT))&SIU_EMIOSB_EMIOS1_7_OUT17_MASK)
#define SIU_EMIOSB_EMIOS0_23_OUT16_MASK          0x8000u
#define SIU_EMIOSB_EMIOS0_23_OUT16_SHIFT         15u
#define SIU_EMIOSB_EMIOS0_23_OUT16_WIDTH         1u
#define SIU_EMIOSB_EMIOS0_23_OUT16(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_23_OUT16_SHIFT))&SIU_EMIOSB_EMIOS0_23_OUT16_MASK)
#define SIU_EMIOSB_EMIOS1_4_OUT15_MASK           0x10000u
#define SIU_EMIOSB_EMIOS1_4_OUT15_SHIFT          16u
#define SIU_EMIOSB_EMIOS1_4_OUT15_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_4_OUT15(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_4_OUT15_SHIFT))&SIU_EMIOSB_EMIOS1_4_OUT15_MASK)
#define SIU_EMIOSB_EMIOS1_5_OUT14_MASK           0x20000u
#define SIU_EMIOSB_EMIOS1_5_OUT14_SHIFT          17u
#define SIU_EMIOSB_EMIOS1_5_OUT14_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_5_OUT14(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_5_OUT14_SHIFT))&SIU_EMIOSB_EMIOS1_5_OUT14_MASK)
#define SIU_EMIOSB_EMIOS1_6_OUT13_MASK           0x40000u
#define SIU_EMIOSB_EMIOS1_6_OUT13_SHIFT          18u
#define SIU_EMIOSB_EMIOS1_6_OUT13_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_6_OUT13(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_6_OUT13_SHIFT))&SIU_EMIOSB_EMIOS1_6_OUT13_MASK)
#define SIU_EMIOSB_EMIOS1_7_OUT12_MASK           0x80000u
#define SIU_EMIOSB_EMIOS1_7_OUT12_SHIFT          19u
#define SIU_EMIOSB_EMIOS1_7_OUT12_WIDTH          1u
#define SIU_EMIOSB_EMIOS1_7_OUT12(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_7_OUT12_SHIFT))&SIU_EMIOSB_EMIOS1_7_OUT12_MASK)
#define SIU_EMIOSB_EMIOS0_23_OUT11_MASK          0x100000u
#define SIU_EMIOSB_EMIOS0_23_OUT11_SHIFT         20u
#define SIU_EMIOSB_EMIOS0_23_OUT11_WIDTH         1u
#define SIU_EMIOSB_EMIOS0_23_OUT11(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_23_OUT11_SHIFT))&SIU_EMIOSB_EMIOS0_23_OUT11_MASK)
#define SIU_EMIOSB_EMIOS0_0_OUT10_MASK           0x200000u
#define SIU_EMIOSB_EMIOS0_0_OUT10_SHIFT          21u
#define SIU_EMIOSB_EMIOS0_0_OUT10_WIDTH          1u
#define SIU_EMIOSB_EMIOS0_0_OUT10(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_0_OUT10_SHIFT))&SIU_EMIOSB_EMIOS0_0_OUT10_MASK)
#define SIU_EMIOSB_EMIOS0_1_OUT9_MASK            0x400000u
#define SIU_EMIOSB_EMIOS0_1_OUT9_SHIFT           22u
#define SIU_EMIOSB_EMIOS0_1_OUT9_WIDTH           1u
#define SIU_EMIOSB_EMIOS0_1_OUT9(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_1_OUT9_SHIFT))&SIU_EMIOSB_EMIOS0_1_OUT9_MASK)
#define SIU_EMIOSB_EMIOS0_2_OUT8_MASK            0x800000u
#define SIU_EMIOSB_EMIOS0_2_OUT8_SHIFT           23u
#define SIU_EMIOSB_EMIOS0_2_OUT8_WIDTH           1u
#define SIU_EMIOSB_EMIOS0_2_OUT8(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_2_OUT8_SHIFT))&SIU_EMIOSB_EMIOS0_2_OUT8_MASK)
#define SIU_EMIOSB_EMIOS0_3_OUT7_MASK            0x1000000u
#define SIU_EMIOSB_EMIOS0_3_OUT7_SHIFT           24u
#define SIU_EMIOSB_EMIOS0_3_OUT7_WIDTH           1u
#define SIU_EMIOSB_EMIOS0_3_OUT7(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_3_OUT7_SHIFT))&SIU_EMIOSB_EMIOS0_3_OUT7_MASK)
#define SIU_EMIOSB_EMIOS0_4_OUT6_MASK            0x2000000u
#define SIU_EMIOSB_EMIOS0_4_OUT6_SHIFT           25u
#define SIU_EMIOSB_EMIOS0_4_OUT6_WIDTH           1u
#define SIU_EMIOSB_EMIOS0_4_OUT6(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_4_OUT6_SHIFT))&SIU_EMIOSB_EMIOS0_4_OUT6_MASK)
#define SIU_EMIOSB_EMIOS0_5_OUT5_MASK            0x4000000u
#define SIU_EMIOSB_EMIOS0_5_OUT5_SHIFT           26u
#define SIU_EMIOSB_EMIOS0_5_OUT5_WIDTH           1u
#define SIU_EMIOSB_EMIOS0_5_OUT5(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_5_OUT5_SHIFT))&SIU_EMIOSB_EMIOS0_5_OUT5_MASK)
#define SIU_EMIOSB_EMIOS0_6_OUT4_MASK            0x8000000u
#define SIU_EMIOSB_EMIOS0_6_OUT4_SHIFT           27u
#define SIU_EMIOSB_EMIOS0_6_OUT4_WIDTH           1u
#define SIU_EMIOSB_EMIOS0_6_OUT4(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS0_6_OUT4_SHIFT))&SIU_EMIOSB_EMIOS0_6_OUT4_MASK)
#define SIU_EMIOSB_EMIOS1_0_OUT3_MASK            0x10000000u
#define SIU_EMIOSB_EMIOS1_0_OUT3_SHIFT           28u
#define SIU_EMIOSB_EMIOS1_0_OUT3_WIDTH           1u
#define SIU_EMIOSB_EMIOS1_0_OUT3(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_0_OUT3_SHIFT))&SIU_EMIOSB_EMIOS1_0_OUT3_MASK)
#define SIU_EMIOSB_EMIOS1_1_OUT2_MASK            0x20000000u
#define SIU_EMIOSB_EMIOS1_1_OUT2_SHIFT           29u
#define SIU_EMIOSB_EMIOS1_1_OUT2_WIDTH           1u
#define SIU_EMIOSB_EMIOS1_1_OUT2(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_1_OUT2_SHIFT))&SIU_EMIOSB_EMIOS1_1_OUT2_MASK)
#define SIU_EMIOSB_EMIOS1_2_OUT1_MASK            0x40000000u
#define SIU_EMIOSB_EMIOS1_2_OUT1_SHIFT           30u
#define SIU_EMIOSB_EMIOS1_2_OUT1_WIDTH           1u
#define SIU_EMIOSB_EMIOS1_2_OUT1(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_2_OUT1_SHIFT))&SIU_EMIOSB_EMIOS1_2_OUT1_MASK)
#define SIU_EMIOSB_EMIOS1_3_OUT0_MASK            0x80000000u
#define SIU_EMIOSB_EMIOS1_3_OUT0_SHIFT           31u
#define SIU_EMIOSB_EMIOS1_3_OUT0_WIDTH           1u
#define SIU_EMIOSB_EMIOS1_3_OUT0(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSB_EMIOS1_3_OUT0_SHIFT))&SIU_EMIOSB_EMIOS1_3_OUT0_MASK)
/* DSPIBHLB Bit Fields */
#define SIU_DSPIBHLB_DSPIBL31_MASK               0x1u
#define SIU_DSPIBHLB_DSPIBL31_SHIFT              0u
#define SIU_DSPIBHLB_DSPIBL31_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL31(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL31_SHIFT))&SIU_DSPIBHLB_DSPIBL31_MASK)
#define SIU_DSPIBHLB_DSPIBL30_MASK               0x2u
#define SIU_DSPIBHLB_DSPIBL30_SHIFT              1u
#define SIU_DSPIBHLB_DSPIBL30_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL30(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL30_SHIFT))&SIU_DSPIBHLB_DSPIBL30_MASK)
#define SIU_DSPIBHLB_DSPIBL29_MASK               0x4u
#define SIU_DSPIBHLB_DSPIBL29_SHIFT              2u
#define SIU_DSPIBHLB_DSPIBL29_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL29(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL29_SHIFT))&SIU_DSPIBHLB_DSPIBL29_MASK)
#define SIU_DSPIBHLB_DSPIBL28_MASK               0x8u
#define SIU_DSPIBHLB_DSPIBL28_SHIFT              3u
#define SIU_DSPIBHLB_DSPIBL28_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL28(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL28_SHIFT))&SIU_DSPIBHLB_DSPIBL28_MASK)
#define SIU_DSPIBHLB_DSPIBL27_MASK               0x10u
#define SIU_DSPIBHLB_DSPIBL27_SHIFT              4u
#define SIU_DSPIBHLB_DSPIBL27_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL27(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL27_SHIFT))&SIU_DSPIBHLB_DSPIBL27_MASK)
#define SIU_DSPIBHLB_DSPIBL26_MASK               0x20u
#define SIU_DSPIBHLB_DSPIBL26_SHIFT              5u
#define SIU_DSPIBHLB_DSPIBL26_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL26(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL26_SHIFT))&SIU_DSPIBHLB_DSPIBL26_MASK)
#define SIU_DSPIBHLB_DSPIBL25_MASK               0x40u
#define SIU_DSPIBHLB_DSPIBL25_SHIFT              6u
#define SIU_DSPIBHLB_DSPIBL25_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL25(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL25_SHIFT))&SIU_DSPIBHLB_DSPIBL25_MASK)
#define SIU_DSPIBHLB_DSPIBL24_MASK               0x80u
#define SIU_DSPIBHLB_DSPIBL24_SHIFT              7u
#define SIU_DSPIBHLB_DSPIBL24_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL24(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL24_SHIFT))&SIU_DSPIBHLB_DSPIBL24_MASK)
#define SIU_DSPIBHLB_DSPIBL23_MASK               0x100u
#define SIU_DSPIBHLB_DSPIBL23_SHIFT              8u
#define SIU_DSPIBHLB_DSPIBL23_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL23(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL23_SHIFT))&SIU_DSPIBHLB_DSPIBL23_MASK)
#define SIU_DSPIBHLB_DSPIBL22_MASK               0x200u
#define SIU_DSPIBHLB_DSPIBL22_SHIFT              9u
#define SIU_DSPIBHLB_DSPIBL22_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL22(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL22_SHIFT))&SIU_DSPIBHLB_DSPIBL22_MASK)
#define SIU_DSPIBHLB_DSPIBL21_MASK               0x400u
#define SIU_DSPIBHLB_DSPIBL21_SHIFT              10u
#define SIU_DSPIBHLB_DSPIBL21_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL21(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL21_SHIFT))&SIU_DSPIBHLB_DSPIBL21_MASK)
#define SIU_DSPIBHLB_DSPIBL20_MASK               0x800u
#define SIU_DSPIBHLB_DSPIBL20_SHIFT              11u
#define SIU_DSPIBHLB_DSPIBL20_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL20(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL20_SHIFT))&SIU_DSPIBHLB_DSPIBL20_MASK)
#define SIU_DSPIBHLB_DSPIBL19_MASK               0x1000u
#define SIU_DSPIBHLB_DSPIBL19_SHIFT              12u
#define SIU_DSPIBHLB_DSPIBL19_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL19(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL19_SHIFT))&SIU_DSPIBHLB_DSPIBL19_MASK)
#define SIU_DSPIBHLB_DSPIBL18_MASK               0x2000u
#define SIU_DSPIBHLB_DSPIBL18_SHIFT              13u
#define SIU_DSPIBHLB_DSPIBL18_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL18(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL18_SHIFT))&SIU_DSPIBHLB_DSPIBL18_MASK)
#define SIU_DSPIBHLB_DSPIBL17_MASK               0x4000u
#define SIU_DSPIBHLB_DSPIBL17_SHIFT              14u
#define SIU_DSPIBHLB_DSPIBL17_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL17(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL17_SHIFT))&SIU_DSPIBHLB_DSPIBL17_MASK)
#define SIU_DSPIBHLB_DSPIBL16_MASK               0x8000u
#define SIU_DSPIBHLB_DSPIBL16_SHIFT              15u
#define SIU_DSPIBHLB_DSPIBL16_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBL16(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBL16_SHIFT))&SIU_DSPIBHLB_DSPIBL16_MASK)
#define SIU_DSPIBHLB_DSPIBH15_MASK               0x10000u
#define SIU_DSPIBHLB_DSPIBH15_SHIFT              16u
#define SIU_DSPIBHLB_DSPIBH15_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBH15(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH15_SHIFT))&SIU_DSPIBHLB_DSPIBH15_MASK)
#define SIU_DSPIBHLB_DSPIBH14_MASK               0x20000u
#define SIU_DSPIBHLB_DSPIBH14_SHIFT              17u
#define SIU_DSPIBHLB_DSPIBH14_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBH14(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH14_SHIFT))&SIU_DSPIBHLB_DSPIBH14_MASK)
#define SIU_DSPIBHLB_DSPIBH13_MASK               0x40000u
#define SIU_DSPIBHLB_DSPIBH13_SHIFT              18u
#define SIU_DSPIBHLB_DSPIBH13_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBH13(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH13_SHIFT))&SIU_DSPIBHLB_DSPIBH13_MASK)
#define SIU_DSPIBHLB_DSPIBH12_MASK               0x80000u
#define SIU_DSPIBHLB_DSPIBH12_SHIFT              19u
#define SIU_DSPIBHLB_DSPIBH12_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBH12(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH12_SHIFT))&SIU_DSPIBHLB_DSPIBH12_MASK)
#define SIU_DSPIBHLB_DSPIBH11_MASK               0x100000u
#define SIU_DSPIBHLB_DSPIBH11_SHIFT              20u
#define SIU_DSPIBHLB_DSPIBH11_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBH11(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH11_SHIFT))&SIU_DSPIBHLB_DSPIBH11_MASK)
#define SIU_DSPIBHLB_DSPIBH10_MASK               0x200000u
#define SIU_DSPIBHLB_DSPIBH10_SHIFT              21u
#define SIU_DSPIBHLB_DSPIBH10_WIDTH              1u
#define SIU_DSPIBHLB_DSPIBH10(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH10_SHIFT))&SIU_DSPIBHLB_DSPIBH10_MASK)
#define SIU_DSPIBHLB_DSPIBH9_MASK                0x400000u
#define SIU_DSPIBHLB_DSPIBH9_SHIFT               22u
#define SIU_DSPIBHLB_DSPIBH9_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH9(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH9_SHIFT))&SIU_DSPIBHLB_DSPIBH9_MASK)
#define SIU_DSPIBHLB_DSPIBH8_MASK                0x800000u
#define SIU_DSPIBHLB_DSPIBH8_SHIFT               23u
#define SIU_DSPIBHLB_DSPIBH8_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH8(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH8_SHIFT))&SIU_DSPIBHLB_DSPIBH8_MASK)
#define SIU_DSPIBHLB_DSPIBH7_MASK                0x1000000u
#define SIU_DSPIBHLB_DSPIBH7_SHIFT               24u
#define SIU_DSPIBHLB_DSPIBH7_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH7(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH7_SHIFT))&SIU_DSPIBHLB_DSPIBH7_MASK)
#define SIU_DSPIBHLB_DSPIBH6_MASK                0x2000000u
#define SIU_DSPIBHLB_DSPIBH6_SHIFT               25u
#define SIU_DSPIBHLB_DSPIBH6_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH6(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH6_SHIFT))&SIU_DSPIBHLB_DSPIBH6_MASK)
#define SIU_DSPIBHLB_DSPIBH5_MASK                0x4000000u
#define SIU_DSPIBHLB_DSPIBH5_SHIFT               26u
#define SIU_DSPIBHLB_DSPIBH5_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH5(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH5_SHIFT))&SIU_DSPIBHLB_DSPIBH5_MASK)
#define SIU_DSPIBHLB_DSPIBH4_MASK                0x8000000u
#define SIU_DSPIBHLB_DSPIBH4_SHIFT               27u
#define SIU_DSPIBHLB_DSPIBH4_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH4(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH4_SHIFT))&SIU_DSPIBHLB_DSPIBH4_MASK)
#define SIU_DSPIBHLB_DSPIBH3_MASK                0x10000000u
#define SIU_DSPIBHLB_DSPIBH3_SHIFT               28u
#define SIU_DSPIBHLB_DSPIBH3_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH3(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH3_SHIFT))&SIU_DSPIBHLB_DSPIBH3_MASK)
#define SIU_DSPIBHLB_DSPIBH2_MASK                0x20000000u
#define SIU_DSPIBHLB_DSPIBH2_SHIFT               29u
#define SIU_DSPIBHLB_DSPIBH2_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH2(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH2_SHIFT))&SIU_DSPIBHLB_DSPIBH2_MASK)
#define SIU_DSPIBHLB_DSPIBH1_MASK                0x40000000u
#define SIU_DSPIBHLB_DSPIBH1_SHIFT               30u
#define SIU_DSPIBHLB_DSPIBH1_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH1(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH1_SHIFT))&SIU_DSPIBHLB_DSPIBH1_MASK)
#define SIU_DSPIBHLB_DSPIBH0_MASK                0x80000000u
#define SIU_DSPIBHLB_DSPIBH0_SHIFT               31u
#define SIU_DSPIBHLB_DSPIBH0_WIDTH               1u
#define SIU_DSPIBHLB_DSPIBH0(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIBHLB_DSPIBH0_SHIFT))&SIU_DSPIBHLB_DSPIBH0_MASK)
/* ETPUAC Bit Fields */
#define SIU_ETPUAC_ETPUA30_MASK                  0x1u
#define SIU_ETPUAC_ETPUA30_SHIFT                 0u
#define SIU_ETPUAC_ETPUA30_WIDTH                 1u
#define SIU_ETPUAC_ETPUA30(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA30_SHIFT))&SIU_ETPUAC_ETPUA30_MASK)
#define SIU_ETPUAC_ETPUA31_MASK                  0x2u
#define SIU_ETPUAC_ETPUA31_SHIFT                 1u
#define SIU_ETPUAC_ETPUA31_WIDTH                 1u
#define SIU_ETPUAC_ETPUA31(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA31_SHIFT))&SIU_ETPUAC_ETPUA31_MASK)
#define SIU_ETPUAC_ETPUA24_MASK                  0x4u
#define SIU_ETPUAC_ETPUA24_SHIFT                 2u
#define SIU_ETPUAC_ETPUA24_WIDTH                 1u
#define SIU_ETPUAC_ETPUA24(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA24_SHIFT))&SIU_ETPUAC_ETPUA24_MASK)
#define SIU_ETPUAC_ETPUA25_MASK                  0x8u
#define SIU_ETPUAC_ETPUA25_SHIFT                 3u
#define SIU_ETPUAC_ETPUA25_WIDTH                 1u
#define SIU_ETPUAC_ETPUA25(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA25_SHIFT))&SIU_ETPUAC_ETPUA25_MASK)
#define SIU_ETPUAC_ETPUA26_MASK                  0x10u
#define SIU_ETPUAC_ETPUA26_SHIFT                 4u
#define SIU_ETPUAC_ETPUA26_WIDTH                 1u
#define SIU_ETPUAC_ETPUA26(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA26_SHIFT))&SIU_ETPUAC_ETPUA26_MASK)
#define SIU_ETPUAC_ETPUA27_MASK                  0x20u
#define SIU_ETPUAC_ETPUA27_SHIFT                 5u
#define SIU_ETPUAC_ETPUA27_WIDTH                 1u
#define SIU_ETPUAC_ETPUA27(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA27_SHIFT))&SIU_ETPUAC_ETPUA27_MASK)
#define SIU_ETPUAC_ETPUA28_MASK                  0x40u
#define SIU_ETPUAC_ETPUA28_SHIFT                 6u
#define SIU_ETPUAC_ETPUA28_WIDTH                 1u
#define SIU_ETPUAC_ETPUA28(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA28_SHIFT))&SIU_ETPUAC_ETPUA28_MASK)
#define SIU_ETPUAC_ETPUA29_MASK                  0x80u
#define SIU_ETPUAC_ETPUA29_SHIFT                 7u
#define SIU_ETPUAC_ETPUA29_WIDTH                 1u
#define SIU_ETPUAC_ETPUA29(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA29_SHIFT))&SIU_ETPUAC_ETPUA29_MASK)
#define SIU_ETPUAC_ETPUA16_MASK                  0x100u
#define SIU_ETPUAC_ETPUA16_SHIFT                 8u
#define SIU_ETPUAC_ETPUA16_WIDTH                 1u
#define SIU_ETPUAC_ETPUA16(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA16_SHIFT))&SIU_ETPUAC_ETPUA16_MASK)
#define SIU_ETPUAC_ETPUA17_MASK                  0x200u
#define SIU_ETPUAC_ETPUA17_SHIFT                 9u
#define SIU_ETPUAC_ETPUA17_WIDTH                 1u
#define SIU_ETPUAC_ETPUA17(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA17_SHIFT))&SIU_ETPUAC_ETPUA17_MASK)
#define SIU_ETPUAC_ETPUA18_MASK                  0x400u
#define SIU_ETPUAC_ETPUA18_SHIFT                 10u
#define SIU_ETPUAC_ETPUA18_WIDTH                 1u
#define SIU_ETPUAC_ETPUA18(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA18_SHIFT))&SIU_ETPUAC_ETPUA18_MASK)
#define SIU_ETPUAC_ETPUA19_MASK                  0x800u
#define SIU_ETPUAC_ETPUA19_SHIFT                 11u
#define SIU_ETPUAC_ETPUA19_WIDTH                 1u
#define SIU_ETPUAC_ETPUA19(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA19_SHIFT))&SIU_ETPUAC_ETPUA19_MASK)
#define SIU_ETPUAC_ETPUA20_MASK                  0x1000u
#define SIU_ETPUAC_ETPUA20_SHIFT                 12u
#define SIU_ETPUAC_ETPUA20_WIDTH                 1u
#define SIU_ETPUAC_ETPUA20(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA20_SHIFT))&SIU_ETPUAC_ETPUA20_MASK)
#define SIU_ETPUAC_ETPUA21_MASK                  0x2000u
#define SIU_ETPUAC_ETPUA21_SHIFT                 13u
#define SIU_ETPUAC_ETPUA21_WIDTH                 1u
#define SIU_ETPUAC_ETPUA21(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA21_SHIFT))&SIU_ETPUAC_ETPUA21_MASK)
#define SIU_ETPUAC_ETPUA22_MASK                  0x4000u
#define SIU_ETPUAC_ETPUA22_SHIFT                 14u
#define SIU_ETPUAC_ETPUA22_WIDTH                 1u
#define SIU_ETPUAC_ETPUA22(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA22_SHIFT))&SIU_ETPUAC_ETPUA22_MASK)
#define SIU_ETPUAC_ETPUA23_MASK                  0x8000u
#define SIU_ETPUAC_ETPUA23_SHIFT                 15u
#define SIU_ETPUAC_ETPUA23_WIDTH                 1u
#define SIU_ETPUAC_ETPUA23(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA23_SHIFT))&SIU_ETPUAC_ETPUA23_MASK)
#define SIU_ETPUAC_ETPUA11_MASK                  0x10000u
#define SIU_ETPUAC_ETPUA11_SHIFT                 16u
#define SIU_ETPUAC_ETPUA11_WIDTH                 1u
#define SIU_ETPUAC_ETPUA11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA11_SHIFT))&SIU_ETPUAC_ETPUA11_MASK)
#define SIU_ETPUAC_ETPUA10_MASK                  0x20000u
#define SIU_ETPUAC_ETPUA10_SHIFT                 17u
#define SIU_ETPUAC_ETPUA10_WIDTH                 1u
#define SIU_ETPUAC_ETPUA10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA10_SHIFT))&SIU_ETPUAC_ETPUA10_MASK)
#define SIU_ETPUAC_ETPUA9_MASK                   0x40000u
#define SIU_ETPUAC_ETPUA9_SHIFT                  18u
#define SIU_ETPUAC_ETPUA9_WIDTH                  1u
#define SIU_ETPUAC_ETPUA9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA9_SHIFT))&SIU_ETPUAC_ETPUA9_MASK)
#define SIU_ETPUAC_ETPUA8_MASK                   0x80000u
#define SIU_ETPUAC_ETPUA8_SHIFT                  19u
#define SIU_ETPUAC_ETPUA8_WIDTH                  1u
#define SIU_ETPUAC_ETPUA8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA8_SHIFT))&SIU_ETPUAC_ETPUA8_MASK)
#define SIU_ETPUAC_ETPUA7_MASK                   0x100000u
#define SIU_ETPUAC_ETPUA7_SHIFT                  20u
#define SIU_ETPUAC_ETPUA7_WIDTH                  1u
#define SIU_ETPUAC_ETPUA7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA7_SHIFT))&SIU_ETPUAC_ETPUA7_MASK)
#define SIU_ETPUAC_ETPUA6_MASK                   0x200000u
#define SIU_ETPUAC_ETPUA6_SHIFT                  21u
