neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_ETPUAC_ETPUA6_WIDTH                  1u
#define SIU_ETPUAC_ETPUA6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA6_SHIFT))&SIU_ETPUAC_ETPUA6_MASK)
#define SIU_ETPUAC_ETPUA5_MASK                   0x400000u
#define SIU_ETPUAC_ETPUA5_SHIFT                  22u
#define SIU_ETPUAC_ETPUA5_WIDTH                  1u
#define SIU_ETPUAC_ETPUA5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA5_SHIFT))&SIU_ETPUAC_ETPUA5_MASK)
#define SIU_ETPUAC_ETPUA4_MASK                   0x800000u
#define SIU_ETPUAC_ETPUA4_SHIFT                  23u
#define SIU_ETPUAC_ETPUA4_WIDTH                  1u
#define SIU_ETPUAC_ETPUA4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA4_SHIFT))&SIU_ETPUAC_ETPUA4_MASK)
#define SIU_ETPUAC_ETPUA3_MASK                   0x1000000u
#define SIU_ETPUAC_ETPUA3_SHIFT                  24u
#define SIU_ETPUAC_ETPUA3_WIDTH                  1u
#define SIU_ETPUAC_ETPUA3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA3_SHIFT))&SIU_ETPUAC_ETPUA3_MASK)
#define SIU_ETPUAC_ETPUA2_MASK                   0x2000000u
#define SIU_ETPUAC_ETPUA2_SHIFT                  25u
#define SIU_ETPUAC_ETPUA2_WIDTH                  1u
#define SIU_ETPUAC_ETPUA2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA2_SHIFT))&SIU_ETPUAC_ETPUA2_MASK)
#define SIU_ETPUAC_ETPUA1_MASK                   0x4000000u
#define SIU_ETPUAC_ETPUA1_SHIFT                  26u
#define SIU_ETPUAC_ETPUA1_WIDTH                  1u
#define SIU_ETPUAC_ETPUA1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA1_SHIFT))&SIU_ETPUAC_ETPUA1_MASK)
#define SIU_ETPUAC_ETPUA0_MASK                   0x8000000u
#define SIU_ETPUAC_ETPUA0_SHIFT                  27u
#define SIU_ETPUAC_ETPUA0_WIDTH                  1u
#define SIU_ETPUAC_ETPUA0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA0_SHIFT))&SIU_ETPUAC_ETPUA0_MASK)
#define SIU_ETPUAC_ETPUA15_MASK                  0x10000000u
#define SIU_ETPUAC_ETPUA15_SHIFT                 28u
#define SIU_ETPUAC_ETPUA15_WIDTH                 1u
#define SIU_ETPUAC_ETPUA15(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA15_SHIFT))&SIU_ETPUAC_ETPUA15_MASK)
#define SIU_ETPUAC_ETPUA14_MASK                  0x20000000u
#define SIU_ETPUAC_ETPUA14_SHIFT                 29u
#define SIU_ETPUAC_ETPUA14_WIDTH                 1u
#define SIU_ETPUAC_ETPUA14(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA14_SHIFT))&SIU_ETPUAC_ETPUA14_MASK)
#define SIU_ETPUAC_ETPUA13_MASK                  0x40000000u
#define SIU_ETPUAC_ETPUA13_SHIFT                 30u
#define SIU_ETPUAC_ETPUA13_WIDTH                 1u
#define SIU_ETPUAC_ETPUA13(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA13_SHIFT))&SIU_ETPUAC_ETPUA13_MASK)
#define SIU_ETPUAC_ETPUA12_MASK                  0x80000000u
#define SIU_ETPUAC_ETPUA12_SHIFT                 31u
#define SIU_ETPUAC_ETPUA12_WIDTH                 1u
#define SIU_ETPUAC_ETPUA12(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUAC_ETPUA12_SHIFT))&SIU_ETPUAC_ETPUA12_MASK)
/* EMIOSC Bit Fields */
#define SIU_EMIOSC_EMIOS0_23_OUT31_MASK          0x1u
#define SIU_EMIOSC_EMIOS0_23_OUT31_SHIFT         0u
#define SIU_EMIOSC_EMIOS0_23_OUT31_WIDTH         1u
#define SIU_EMIOSC_EMIOS0_23_OUT31(x)            (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_23_OUT31_SHIFT))&SIU_EMIOSC_EMIOS0_23_OUT31_MASK)
#define SIU_EMIOSC_EMIOS1_7_OUT30_MASK           0x2u
#define SIU_EMIOSC_EMIOS1_7_OUT30_SHIFT          1u
#define SIU_EMIOSC_EMIOS1_7_OUT30_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_7_OUT30(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_7_OUT30_SHIFT))&SIU_EMIOSC_EMIOS1_7_OUT30_MASK)
#define SIU_EMIOSC_EMIOS1_6_OUT29_MASK           0x4u
#define SIU_EMIOSC_EMIOS1_6_OUT29_SHIFT          2u
#define SIU_EMIOSC_EMIOS1_6_OUT29_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_6_OUT29(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_6_OUT29_SHIFT))&SIU_EMIOSC_EMIOS1_6_OUT29_MASK)
#define SIU_EMIOSC_EMIOS1_5_OUT28_MASK           0x8u
#define SIU_EMIOSC_EMIOS1_5_OUT28_SHIFT          3u
#define SIU_EMIOSC_EMIOS1_5_OUT28_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_5_OUT28(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_5_OUT28_SHIFT))&SIU_EMIOSC_EMIOS1_5_OUT28_MASK)
#define SIU_EMIOSC_EMIOS1_4_OUT27_MASK           0x10u
#define SIU_EMIOSC_EMIOS1_4_OUT27_SHIFT          4u
#define SIU_EMIOSC_EMIOS1_4_OUT27_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_4_OUT27(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_4_OUT27_SHIFT))&SIU_EMIOSC_EMIOS1_4_OUT27_MASK)
#define SIU_EMIOSC_EMIOS1_3_OUT26_MASK           0x20u
#define SIU_EMIOSC_EMIOS1_3_OUT26_SHIFT          5u
#define SIU_EMIOSC_EMIOS1_3_OUT26_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_3_OUT26(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_3_OUT26_SHIFT))&SIU_EMIOSC_EMIOS1_3_OUT26_MASK)
#define SIU_EMIOSC_EMIOS1_2_OUT25_MASK           0x40u
#define SIU_EMIOSC_EMIOS1_2_OUT25_SHIFT          6u
#define SIU_EMIOSC_EMIOS1_2_OUT25_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_2_OUT25(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_2_OUT25_SHIFT))&SIU_EMIOSC_EMIOS1_2_OUT25_MASK)
#define SIU_EMIOSC_EMIOS1_1_OUT24_MASK           0x80u
#define SIU_EMIOSC_EMIOS1_1_OUT24_SHIFT          7u
#define SIU_EMIOSC_EMIOS1_1_OUT24_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_1_OUT24(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_1_OUT24_SHIFT))&SIU_EMIOSC_EMIOS1_1_OUT24_MASK)
#define SIU_EMIOSC_EMIOS1_0_OUT23_MASK           0x100u
#define SIU_EMIOSC_EMIOS1_0_OUT23_SHIFT          8u
#define SIU_EMIOSC_EMIOS1_0_OUT23_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_0_OUT23(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_0_OUT23_SHIFT))&SIU_EMIOSC_EMIOS1_0_OUT23_MASK)
#define SIU_EMIOSC_EMIOS0_6_OUT22_MASK           0x200u
#define SIU_EMIOSC_EMIOS0_6_OUT22_SHIFT          9u
#define SIU_EMIOSC_EMIOS0_6_OUT22_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_6_OUT22(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_6_OUT22_SHIFT))&SIU_EMIOSC_EMIOS0_6_OUT22_MASK)
#define SIU_EMIOSC_EMIOS0_5_OUT21_MASK           0x400u
#define SIU_EMIOSC_EMIOS0_5_OUT21_SHIFT          10u
#define SIU_EMIOSC_EMIOS0_5_OUT21_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_5_OUT21(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_5_OUT21_SHIFT))&SIU_EMIOSC_EMIOS0_5_OUT21_MASK)
#define SIU_EMIOSC_EMIOS0_4_OUT20_MASK           0x800u
#define SIU_EMIOSC_EMIOS0_4_OUT20_SHIFT          11u
#define SIU_EMIOSC_EMIOS0_4_OUT20_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_4_OUT20(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_4_OUT20_SHIFT))&SIU_EMIOSC_EMIOS0_4_OUT20_MASK)
#define SIU_EMIOSC_EMIOS0_3_OUT19_MASK           0x1000u
#define SIU_EMIOSC_EMIOS0_3_OUT19_SHIFT          12u
#define SIU_EMIOSC_EMIOS0_3_OUT19_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_3_OUT19(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_3_OUT19_SHIFT))&SIU_EMIOSC_EMIOS0_3_OUT19_MASK)
#define SIU_EMIOSC_EMIOS0_2_OUT18_MASK           0x2000u
#define SIU_EMIOSC_EMIOS0_2_OUT18_SHIFT          13u
#define SIU_EMIOSC_EMIOS0_2_OUT18_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_2_OUT18(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_2_OUT18_SHIFT))&SIU_EMIOSC_EMIOS0_2_OUT18_MASK)
#define SIU_EMIOSC_EMIOS0_1_OUT17_MASK           0x4000u
#define SIU_EMIOSC_EMIOS0_1_OUT17_SHIFT          14u
#define SIU_EMIOSC_EMIOS0_1_OUT17_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_1_OUT17(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_1_OUT17_SHIFT))&SIU_EMIOSC_EMIOS0_1_OUT17_MASK)
#define SIU_EMIOSC_EMIOS0_0_OUT16_MASK           0x8000u
#define SIU_EMIOSC_EMIOS0_0_OUT16_SHIFT          15u
#define SIU_EMIOSC_EMIOS0_0_OUT16_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_0_OUT16(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_0_OUT16_SHIFT))&SIU_EMIOSC_EMIOS0_0_OUT16_MASK)
#define SIU_EMIOSC_EMIOS1_3_OUT15_MASK           0x10000u
#define SIU_EMIOSC_EMIOS1_3_OUT15_SHIFT          16u
#define SIU_EMIOSC_EMIOS1_3_OUT15_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_3_OUT15(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_3_OUT15_SHIFT))&SIU_EMIOSC_EMIOS1_3_OUT15_MASK)
#define SIU_EMIOSC_EMIOS1_2_OUT14_MASK           0x20000u
#define SIU_EMIOSC_EMIOS1_2_OUT14_SHIFT          17u
#define SIU_EMIOSC_EMIOS1_2_OUT14_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_2_OUT14(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_2_OUT14_SHIFT))&SIU_EMIOSC_EMIOS1_2_OUT14_MASK)
#define SIU_EMIOSC_EMIOS1_1_OUT13_MASK           0x40000u
#define SIU_EMIOSC_EMIOS1_1_OUT13_SHIFT          18u
#define SIU_EMIOSC_EMIOS1_1_OUT13_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_1_OUT13(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_1_OUT13_SHIFT))&SIU_EMIOSC_EMIOS1_1_OUT13_MASK)
#define SIU_EMIOSC_EMIOS1_0_OUT12_MASK           0x80000u
#define SIU_EMIOSC_EMIOS1_0_OUT12_SHIFT          19u
#define SIU_EMIOSC_EMIOS1_0_OUT12_WIDTH          1u
#define SIU_EMIOSC_EMIOS1_0_OUT12(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_0_OUT12_SHIFT))&SIU_EMIOSC_EMIOS1_0_OUT12_MASK)
#define SIU_EMIOSC_EMIOS0_6_OUT11_MASK           0x100000u
#define SIU_EMIOSC_EMIOS0_6_OUT11_SHIFT          20u
#define SIU_EMIOSC_EMIOS0_6_OUT11_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_6_OUT11(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_6_OUT11_SHIFT))&SIU_EMIOSC_EMIOS0_6_OUT11_MASK)
#define SIU_EMIOSC_EMIOS0_5_OUT10_MASK           0x200000u
#define SIU_EMIOSC_EMIOS0_5_OUT10_SHIFT          21u
#define SIU_EMIOSC_EMIOS0_5_OUT10_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_5_OUT10(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_5_OUT10_SHIFT))&SIU_EMIOSC_EMIOS0_5_OUT10_MASK)
#define SIU_EMIOSC_EMIOS0_4_OUT9_MASK            0x400000u
#define SIU_EMIOSC_EMIOS0_4_OUT9_SHIFT           22u
#define SIU_EMIOSC_EMIOS0_4_OUT9_WIDTH           1u
#define SIU_EMIOSC_EMIOS0_4_OUT9(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_4_OUT9_SHIFT))&SIU_EMIOSC_EMIOS0_4_OUT9_MASK)
#define SIU_EMIOSC_EMIOS0_3_OUT8_MASK            0x800000u
#define SIU_EMIOSC_EMIOS0_3_OUT8_SHIFT           23u
#define SIU_EMIOSC_EMIOS0_3_OUT8_WIDTH           1u
#define SIU_EMIOSC_EMIOS0_3_OUT8(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_3_OUT8_SHIFT))&SIU_EMIOSC_EMIOS0_3_OUT8_MASK)
#define SIU_EMIOSC_EMIOS0_2_OUT7_MASK            0x1000000u
#define SIU_EMIOSC_EMIOS0_2_OUT7_SHIFT           24u
#define SIU_EMIOSC_EMIOS0_2_OUT7_WIDTH           1u
#define SIU_EMIOSC_EMIOS0_2_OUT7(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_2_OUT7_SHIFT))&SIU_EMIOSC_EMIOS0_2_OUT7_MASK)
#define SIU_EMIOSC_EMIOS0_1_OUT6_MASK            0x2000000u
#define SIU_EMIOSC_EMIOS0_1_OUT6_SHIFT           25u
#define SIU_EMIOSC_EMIOS0_1_OUT6_WIDTH           1u
#define SIU_EMIOSC_EMIOS0_1_OUT6(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_1_OUT6_SHIFT))&SIU_EMIOSC_EMIOS0_1_OUT6_MASK)
#define SIU_EMIOSC_EMIOS0_0_OUT5_MASK            0x4000000u
#define SIU_EMIOSC_EMIOS0_0_OUT5_SHIFT           26u
#define SIU_EMIOSC_EMIOS0_0_OUT5_WIDTH           1u
#define SIU_EMIOSC_EMIOS0_0_OUT5(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_0_OUT5_SHIFT))&SIU_EMIOSC_EMIOS0_0_OUT5_MASK)
#define SIU_EMIOSC_EMIOS0_23_OUT4_MASK           0x8000000u
#define SIU_EMIOSC_EMIOS0_23_OUT4_SHIFT          27u
#define SIU_EMIOSC_EMIOS0_23_OUT4_WIDTH          1u
#define SIU_EMIOSC_EMIOS0_23_OUT4(x)             (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS0_23_OUT4_SHIFT))&SIU_EMIOSC_EMIOS0_23_OUT4_MASK)
#define SIU_EMIOSC_EMIOS1_7_OUT3_MASK            0x10000000u
#define SIU_EMIOSC_EMIOS1_7_OUT3_SHIFT           28u
#define SIU_EMIOSC_EMIOS1_7_OUT3_WIDTH           1u
#define SIU_EMIOSC_EMIOS1_7_OUT3(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_7_OUT3_SHIFT))&SIU_EMIOSC_EMIOS1_7_OUT3_MASK)
#define SIU_EMIOSC_EMIOS1_6_OUT2_MASK            0x20000000u
#define SIU_EMIOSC_EMIOS1_6_OUT2_SHIFT           29u
#define SIU_EMIOSC_EMIOS1_6_OUT2_WIDTH           1u
#define SIU_EMIOSC_EMIOS1_6_OUT2(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_6_OUT2_SHIFT))&SIU_EMIOSC_EMIOS1_6_OUT2_MASK)
#define SIU_EMIOSC_EMIOS1_5_OUT1_MASK            0x40000000u
#define SIU_EMIOSC_EMIOS1_5_OUT1_SHIFT           30u
#define SIU_EMIOSC_EMIOS1_5_OUT1_WIDTH           1u
#define SIU_EMIOSC_EMIOS1_5_OUT1(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_5_OUT1_SHIFT))&SIU_EMIOSC_EMIOS1_5_OUT1_MASK)
#define SIU_EMIOSC_EMIOS1_4_OUT0_MASK            0x80000000u
#define SIU_EMIOSC_EMIOS1_4_OUT0_SHIFT           31u
#define SIU_EMIOSC_EMIOS1_4_OUT0_WIDTH           1u
#define SIU_EMIOSC_EMIOS1_4_OUT0(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSC_EMIOS1_4_OUT0_SHIFT))&SIU_EMIOSC_EMIOS1_4_OUT0_MASK)
/* DSPICHLC Bit Fields */
#define SIU_DSPICHLC_DSPICL31_MASK               0x1u
#define SIU_DSPICHLC_DSPICL31_SHIFT              0u
#define SIU_DSPICHLC_DSPICL31_WIDTH              1u
#define SIU_DSPICHLC_DSPICL31(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL31_SHIFT))&SIU_DSPICHLC_DSPICL31_MASK)
#define SIU_DSPICHLC_DSPICL30_MASK               0x2u
#define SIU_DSPICHLC_DSPICL30_SHIFT              1u
#define SIU_DSPICHLC_DSPICL30_WIDTH              1u
#define SIU_DSPICHLC_DSPICL30(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL30_SHIFT))&SIU_DSPICHLC_DSPICL30_MASK)
#define SIU_DSPICHLC_DSPICL29_MASK               0x4u
#define SIU_DSPICHLC_DSPICL29_SHIFT              2u
#define SIU_DSPICHLC_DSPICL29_WIDTH              1u
#define SIU_DSPICHLC_DSPICL29(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL29_SHIFT))&SIU_DSPICHLC_DSPICL29_MASK)
#define SIU_DSPICHLC_DSPICL28_MASK               0x8u
#define SIU_DSPICHLC_DSPICL28_SHIFT              3u
#define SIU_DSPICHLC_DSPICL28_WIDTH              1u
#define SIU_DSPICHLC_DSPICL28(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL28_SHIFT))&SIU_DSPICHLC_DSPICL28_MASK)
#define SIU_DSPICHLC_DSPICL27_MASK               0x10u
#define SIU_DSPICHLC_DSPICL27_SHIFT              4u
#define SIU_DSPICHLC_DSPICL27_WIDTH              1u
#define SIU_DSPICHLC_DSPICL27(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL27_SHIFT))&SIU_DSPICHLC_DSPICL27_MASK)
#define SIU_DSPICHLC_DSPICL26_MASK               0x20u
#define SIU_DSPICHLC_DSPICL26_SHIFT              5u
#define SIU_DSPICHLC_DSPICL26_WIDTH              1u
#define SIU_DSPICHLC_DSPICL26(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL26_SHIFT))&SIU_DSPICHLC_DSPICL26_MASK)
#define SIU_DSPICHLC_DSPICL25_MASK               0x40u
#define SIU_DSPICHLC_DSPICL25_SHIFT              6u
#define SIU_DSPICHLC_DSPICL25_WIDTH              1u
#define SIU_DSPICHLC_DSPICL25(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL25_SHIFT))&SIU_DSPICHLC_DSPICL25_MASK)
#define SIU_DSPICHLC_DSPICL24_MASK               0x80u
#define SIU_DSPICHLC_DSPICL24_SHIFT              7u
#define SIU_DSPICHLC_DSPICL24_WIDTH              1u
#define SIU_DSPICHLC_DSPICL24(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL24_SHIFT))&SIU_DSPICHLC_DSPICL24_MASK)
#define SIU_DSPICHLC_DSPICL23_MASK               0x100u
#define SIU_DSPICHLC_DSPICL23_SHIFT              8u
#define SIU_DSPICHLC_DSPICL23_WIDTH              1u
#define SIU_DSPICHLC_DSPICL23(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL23_SHIFT))&SIU_DSPICHLC_DSPICL23_MASK)
#define SIU_DSPICHLC_DSPICL22_MASK               0x200u
#define SIU_DSPICHLC_DSPICL22_SHIFT              9u
#define SIU_DSPICHLC_DSPICL22_WIDTH              1u
#define SIU_DSPICHLC_DSPICL22(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL22_SHIFT))&SIU_DSPICHLC_DSPICL22_MASK)
#define SIU_DSPICHLC_DSPICL21_MASK               0x400u
#define SIU_DSPICHLC_DSPICL21_SHIFT              10u
#define SIU_DSPICHLC_DSPICL21_WIDTH              1u
#define SIU_DSPICHLC_DSPICL21(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL21_SHIFT))&SIU_DSPICHLC_DSPICL21_MASK)
#define SIU_DSPICHLC_DSPICL20_MASK               0x800u
#define SIU_DSPICHLC_DSPICL20_SHIFT              11u
#define SIU_DSPICHLC_DSPICL20_WIDTH              1u
#define SIU_DSPICHLC_DSPICL20(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL20_SHIFT))&SIU_DSPICHLC_DSPICL20_MASK)
#define SIU_DSPICHLC_DSPICL19_MASK               0x1000u
#define SIU_DSPICHLC_DSPICL19_SHIFT              12u
#define SIU_DSPICHLC_DSPICL19_WIDTH              1u
#define SIU_DSPICHLC_DSPICL19(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL19_SHIFT))&SIU_DSPICHLC_DSPICL19_MASK)
#define SIU_DSPICHLC_DSPICL18_MASK               0x2000u
#define SIU_DSPICHLC_DSPICL18_SHIFT              13u
#define SIU_DSPICHLC_DSPICL18_WIDTH              1u
#define SIU_DSPICHLC_DSPICL18(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL18_SHIFT))&SIU_DSPICHLC_DSPICL18_MASK)
#define SIU_DSPICHLC_DSPICL17_MASK               0x4000u
#define SIU_DSPICHLC_DSPICL17_SHIFT              14u
#define SIU_DSPICHLC_DSPICL17_WIDTH              1u
#define SIU_DSPICHLC_DSPICL17(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL17_SHIFT))&SIU_DSPICHLC_DSPICL17_MASK)
#define SIU_DSPICHLC_DSPICL16_MASK               0x8000u
#define SIU_DSPICHLC_DSPICL16_SHIFT              15u
#define SIU_DSPICHLC_DSPICL16_WIDTH              1u
#define SIU_DSPICHLC_DSPICL16(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICL16_SHIFT))&SIU_DSPICHLC_DSPICL16_MASK)
#define SIU_DSPICHLC_DSPICH15_MASK               0x10000u
#define SIU_DSPICHLC_DSPICH15_SHIFT              16u
#define SIU_DSPICHLC_DSPICH15_WIDTH              1u
#define SIU_DSPICHLC_DSPICH15(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH15_SHIFT))&SIU_DSPICHLC_DSPICH15_MASK)
#define SIU_DSPICHLC_DSPICH14_MASK               0x20000u
#define SIU_DSPICHLC_DSPICH14_SHIFT              17u
#define SIU_DSPICHLC_DSPICH14_WIDTH              1u
#define SIU_DSPICHLC_DSPICH14(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH14_SHIFT))&SIU_DSPICHLC_DSPICH14_MASK)
#define SIU_DSPICHLC_DSPICH13_MASK               0x40000u
#define SIU_DSPICHLC_DSPICH13_SHIFT              18u
#define SIU_DSPICHLC_DSPICH13_WIDTH              1u
#define SIU_DSPICHLC_DSPICH13(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH13_SHIFT))&SIU_DSPICHLC_DSPICH13_MASK)
#define SIU_DSPICHLC_DSPICH12_MASK               0x80000u
#define SIU_DSPICHLC_DSPICH12_SHIFT              19u
#define SIU_DSPICHLC_DSPICH12_WIDTH              1u
#define SIU_DSPICHLC_DSPICH12(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH12_SHIFT))&SIU_DSPICHLC_DSPICH12_MASK)
#define SIU_DSPICHLC_DSPICH11_MASK               0x100000u
#define SIU_DSPICHLC_DSPICH11_SHIFT              20u
#define SIU_DSPICHLC_DSPICH11_WIDTH              1u
#define SIU_DSPICHLC_DSPICH11(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH11_SHIFT))&SIU_DSPICHLC_DSPICH11_MASK)
#define SIU_DSPICHLC_DSPICH10_MASK               0x200000u
#define SIU_DSPICHLC_DSPICH10_SHIFT              21u
#define SIU_DSPICHLC_DSPICH10_WIDTH              1u
#define SIU_DSPICHLC_DSPICH10(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH10_SHIFT))&SIU_DSPICHLC_DSPICH10_MASK)
#define SIU_DSPICHLC_DSPICH9_MASK                0x400000u
#define SIU_DSPICHLC_DSPICH9_SHIFT               22u
#define SIU_DSPICHLC_DSPICH9_WIDTH               1u
#define SIU_DSPICHLC_DSPICH9(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH9_SHIFT))&SIU_DSPICHLC_DSPICH9_MASK)
#define SIU_DSPICHLC_DSPICH8_MASK                0x800000u
#define SIU_DSPICHLC_DSPICH8_SHIFT               23u
#define SIU_DSPICHLC_DSPICH8_WIDTH               1u
#define SIU_DSPICHLC_DSPICH8(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH8_SHIFT))&SIU_DSPICHLC_DSPICH8_MASK)
#define SIU_DSPICHLC_DSPICH7_MASK                0x1000000u
#define SIU_DSPICHLC_DSPICH7_SHIFT               24u
#define SIU_DSPICHLC_DSPICH7_WIDTH               1u
#define SIU_DSPICHLC_DSPICH7(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH7_SHIFT))&SIU_DSPICHLC_DSPICH7_MASK)
#define SIU_DSPICHLC_DSPICH6_MASK                0x2000000u
#define SIU_DSPICHLC_DSPICH6_SHIFT               25u
#define SIU_DSPICHLC_DSPICH6_WIDTH               1u
#define SIU_DSPICHLC_DSPICH6(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH6_SHIFT))&SIU_DSPICHLC_DSPICH6_MASK)
#define SIU_DSPICHLC_DSPICH5_MASK                0x4000000u
#define SIU_DSPICHLC_DSPICH5_SHIFT               26u
#define SIU_DSPICHLC_DSPICH5_WIDTH               1u
#define SIU_DSPICHLC_DSPICH5(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH5_SHIFT))&SIU_DSPICHLC_DSPICH5_MASK)
#define SIU_DSPICHLC_DSPICH4_MASK                0x8000000u
#define SIU_DSPICHLC_DSPICH4_SHIFT               27u
#define SIU_DSPICHLC_DSPICH4_WIDTH               1u
#define SIU_DSPICHLC_DSPICH4(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH4_SHIFT))&SIU_DSPICHLC_DSPICH4_MASK)
#define SIU_DSPICHLC_DSPICH3_MASK                0x10000000u
#define SIU_DSPICHLC_DSPICH3_SHIFT               28u
#define SIU_DSPICHLC_DSPICH3_WIDTH               1u
#define SIU_DSPICHLC_DSPICH3(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH3_SHIFT))&SIU_DSPICHLC_DSPICH3_MASK)
#define SIU_DSPICHLC_DSPICH2_MASK                0x20000000u
#define SIU_DSPICHLC_DSPICH2_SHIFT               29u
#define SIU_DSPICHLC_DSPICH2_WIDTH               1u
#define SIU_DSPICHLC_DSPICH2(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH2_SHIFT))&SIU_DSPICHLC_DSPICH2_MASK)
#define SIU_DSPICHLC_DSPICH1_MASK                0x40000000u
#define SIU_DSPICHLC_DSPICH1_SHIFT               30u
#define SIU_DSPICHLC_DSPICH1_WIDTH               1u
#define SIU_DSPICHLC_DSPICH1(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH1_SHIFT))&SIU_DSPICHLC_DSPICH1_MASK)
#define SIU_DSPICHLC_DSPICH0_MASK                0x80000000u
#define SIU_DSPICHLC_DSPICH0_SHIFT               31u
#define SIU_DSPICHLC_DSPICH0_WIDTH               1u
#define SIU_DSPICHLC_DSPICH0(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPICHLC_DSPICH0_SHIFT))&SIU_DSPICHLC_DSPICH0_MASK)
/* ETPUBC Bit Fields */
#define SIU_ETPUBC_ETPUB16_MASK                  0x1u
#define SIU_ETPUBC_ETPUB16_SHIFT                 0u
#define SIU_ETPUBC_ETPUB16_WIDTH                 1u
#define SIU_ETPUBC_ETPUB16(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB16_SHIFT))&SIU_ETPUBC_ETPUB16_MASK)
#define SIU_ETPUBC_ETPUB17_MASK                  0x2u
#define SIU_ETPUBC_ETPUB17_SHIFT                 1u
#define SIU_ETPUBC_ETPUB17_WIDTH                 1u
#define SIU_ETPUBC_ETPUB17(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB17_SHIFT))&SIU_ETPUBC_ETPUB17_MASK)
#define SIU_ETPUBC_ETPUB18_MASK                  0x4u
#define SIU_ETPUBC_ETPUB18_SHIFT                 2u
#define SIU_ETPUBC_ETPUB18_WIDTH                 1u
#define SIU_ETPUBC_ETPUB18(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB18_SHIFT))&SIU_ETPUBC_ETPUB18_MASK)
#define SIU_ETPUBC_ETPUB19_MASK                  0x8u
#define SIU_ETPUBC_ETPUB19_SHIFT                 3u
#define SIU_ETPUBC_ETPUB19_WIDTH                 1u
#define SIU_ETPUBC_ETPUB19(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB19_SHIFT))&SIU_ETPUBC_ETPUB19_MASK)
#define SIU_ETPUBC_ETPUB20_MASK                  0x10u
#define SIU_ETPUBC_ETPUB20_SHIFT                 4u
#define SIU_ETPUBC_ETPUB20_WIDTH                 1u
