neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_ETPUBC_ETPUB20(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB20_SHIFT))&SIU_ETPUBC_ETPUB20_MASK)
#define SIU_ETPUBC_ETPUB21_MASK                  0x20u
#define SIU_ETPUBC_ETPUB21_SHIFT                 5u
#define SIU_ETPUBC_ETPUB21_WIDTH                 1u
#define SIU_ETPUBC_ETPUB21(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB21_SHIFT))&SIU_ETPUBC_ETPUB21_MASK)
#define SIU_ETPUBC_ETPUB22_MASK                  0x40u
#define SIU_ETPUBC_ETPUB22_SHIFT                 6u
#define SIU_ETPUBC_ETPUB22_WIDTH                 1u
#define SIU_ETPUBC_ETPUB22(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB22_SHIFT))&SIU_ETPUBC_ETPUB22_MASK)
#define SIU_ETPUBC_ETPUB23_MASK                  0x80u
#define SIU_ETPUBC_ETPUB23_SHIFT                 7u
#define SIU_ETPUBC_ETPUB23_WIDTH                 1u
#define SIU_ETPUBC_ETPUB23(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB23_SHIFT))&SIU_ETPUBC_ETPUB23_MASK)
#define SIU_ETPUBC_ETPUB24_MASK                  0x100u
#define SIU_ETPUBC_ETPUB24_SHIFT                 8u
#define SIU_ETPUBC_ETPUB24_WIDTH                 1u
#define SIU_ETPUBC_ETPUB24(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB24_SHIFT))&SIU_ETPUBC_ETPUB24_MASK)
#define SIU_ETPUBC_ETPUB25_MASK                  0x200u
#define SIU_ETPUBC_ETPUB25_SHIFT                 9u
#define SIU_ETPUBC_ETPUB25_WIDTH                 1u
#define SIU_ETPUBC_ETPUB25(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB25_SHIFT))&SIU_ETPUBC_ETPUB25_MASK)
#define SIU_ETPUBC_ETPUB26_MASK                  0x400u
#define SIU_ETPUBC_ETPUB26_SHIFT                 10u
#define SIU_ETPUBC_ETPUB26_WIDTH                 1u
#define SIU_ETPUBC_ETPUB26(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB26_SHIFT))&SIU_ETPUBC_ETPUB26_MASK)
#define SIU_ETPUBC_ETPUB27_MASK                  0x800u
#define SIU_ETPUBC_ETPUB27_SHIFT                 11u
#define SIU_ETPUBC_ETPUB27_WIDTH                 1u
#define SIU_ETPUBC_ETPUB27(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB27_SHIFT))&SIU_ETPUBC_ETPUB27_MASK)
#define SIU_ETPUBC_ETPUB28_MASK                  0x1000u
#define SIU_ETPUBC_ETPUB28_SHIFT                 12u
#define SIU_ETPUBC_ETPUB28_WIDTH                 1u
#define SIU_ETPUBC_ETPUB28(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB28_SHIFT))&SIU_ETPUBC_ETPUB28_MASK)
#define SIU_ETPUBC_ETPUB29_MASK                  0x2000u
#define SIU_ETPUBC_ETPUB29_SHIFT                 13u
#define SIU_ETPUBC_ETPUB29_WIDTH                 1u
#define SIU_ETPUBC_ETPUB29(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB29_SHIFT))&SIU_ETPUBC_ETPUB29_MASK)
#define SIU_ETPUBC_ETPUB30_MASK                  0x4000u
#define SIU_ETPUBC_ETPUB30_SHIFT                 14u
#define SIU_ETPUBC_ETPUB30_WIDTH                 1u
#define SIU_ETPUBC_ETPUB30(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB30_SHIFT))&SIU_ETPUBC_ETPUB30_MASK)
#define SIU_ETPUBC_ETPUB31_MASK                  0x8000u
#define SIU_ETPUBC_ETPUB31_SHIFT                 15u
#define SIU_ETPUBC_ETPUB31_WIDTH                 1u
#define SIU_ETPUBC_ETPUB31(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB31_SHIFT))&SIU_ETPUBC_ETPUB31_MASK)
#define SIU_ETPUBC_ETPUB0_MASK                   0x10000u
#define SIU_ETPUBC_ETPUB0_SHIFT                  16u
#define SIU_ETPUBC_ETPUB0_WIDTH                  1u
#define SIU_ETPUBC_ETPUB0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB0_SHIFT))&SIU_ETPUBC_ETPUB0_MASK)
#define SIU_ETPUBC_ETPUB1_MASK                   0x20000u
#define SIU_ETPUBC_ETPUB1_SHIFT                  17u
#define SIU_ETPUBC_ETPUB1_WIDTH                  1u
#define SIU_ETPUBC_ETPUB1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB1_SHIFT))&SIU_ETPUBC_ETPUB1_MASK)
#define SIU_ETPUBC_ETPUB2_MASK                   0x40000u
#define SIU_ETPUBC_ETPUB2_SHIFT                  18u
#define SIU_ETPUBC_ETPUB2_WIDTH                  1u
#define SIU_ETPUBC_ETPUB2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB2_SHIFT))&SIU_ETPUBC_ETPUB2_MASK)
#define SIU_ETPUBC_ETPUB3_MASK                   0x80000u
#define SIU_ETPUBC_ETPUB3_SHIFT                  19u
#define SIU_ETPUBC_ETPUB3_WIDTH                  1u
#define SIU_ETPUBC_ETPUB3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB3_SHIFT))&SIU_ETPUBC_ETPUB3_MASK)
#define SIU_ETPUBC_ETPUB4_MASK                   0x100000u
#define SIU_ETPUBC_ETPUB4_SHIFT                  20u
#define SIU_ETPUBC_ETPUB4_WIDTH                  1u
#define SIU_ETPUBC_ETPUB4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB4_SHIFT))&SIU_ETPUBC_ETPUB4_MASK)
#define SIU_ETPUBC_ETPUB5_MASK                   0x200000u
#define SIU_ETPUBC_ETPUB5_SHIFT                  21u
#define SIU_ETPUBC_ETPUB5_WIDTH                  1u
#define SIU_ETPUBC_ETPUB5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB5_SHIFT))&SIU_ETPUBC_ETPUB5_MASK)
#define SIU_ETPUBC_ETPUB6_MASK                   0x400000u
#define SIU_ETPUBC_ETPUB6_SHIFT                  22u
#define SIU_ETPUBC_ETPUB6_WIDTH                  1u
#define SIU_ETPUBC_ETPUB6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB6_SHIFT))&SIU_ETPUBC_ETPUB6_MASK)
#define SIU_ETPUBC_ETPUB7_MASK                   0x800000u
#define SIU_ETPUBC_ETPUB7_SHIFT                  23u
#define SIU_ETPUBC_ETPUB7_WIDTH                  1u
#define SIU_ETPUBC_ETPUB7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB7_SHIFT))&SIU_ETPUBC_ETPUB7_MASK)
#define SIU_ETPUBC_ETPUB8_MASK                   0x1000000u
#define SIU_ETPUBC_ETPUB8_SHIFT                  24u
#define SIU_ETPUBC_ETPUB8_WIDTH                  1u
#define SIU_ETPUBC_ETPUB8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB8_SHIFT))&SIU_ETPUBC_ETPUB8_MASK)
#define SIU_ETPUBC_ETPUB9_MASK                   0x2000000u
#define SIU_ETPUBC_ETPUB9_SHIFT                  25u
#define SIU_ETPUBC_ETPUB9_WIDTH                  1u
#define SIU_ETPUBC_ETPUB9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB9_SHIFT))&SIU_ETPUBC_ETPUB9_MASK)
#define SIU_ETPUBC_ETPUB10_MASK                  0x4000000u
#define SIU_ETPUBC_ETPUB10_SHIFT                 26u
#define SIU_ETPUBC_ETPUB10_WIDTH                 1u
#define SIU_ETPUBC_ETPUB10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB10_SHIFT))&SIU_ETPUBC_ETPUB10_MASK)
#define SIU_ETPUBC_ETPUB11_MASK                  0x8000000u
#define SIU_ETPUBC_ETPUB11_SHIFT                 27u
#define SIU_ETPUBC_ETPUB11_WIDTH                 1u
#define SIU_ETPUBC_ETPUB11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB11_SHIFT))&SIU_ETPUBC_ETPUB11_MASK)
#define SIU_ETPUBC_ETPUB12_MASK                  0x10000000u
#define SIU_ETPUBC_ETPUB12_SHIFT                 28u
#define SIU_ETPUBC_ETPUB12_WIDTH                 1u
#define SIU_ETPUBC_ETPUB12(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB12_SHIFT))&SIU_ETPUBC_ETPUB12_MASK)
#define SIU_ETPUBC_ETPUB13_MASK                  0x20000000u
#define SIU_ETPUBC_ETPUB13_SHIFT                 29u
#define SIU_ETPUBC_ETPUB13_WIDTH                 1u
#define SIU_ETPUBC_ETPUB13(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB13_SHIFT))&SIU_ETPUBC_ETPUB13_MASK)
#define SIU_ETPUBC_ETPUB14_MASK                  0x40000000u
#define SIU_ETPUBC_ETPUB14_SHIFT                 30u
#define SIU_ETPUBC_ETPUB14_WIDTH                 1u
#define SIU_ETPUBC_ETPUB14(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB14_SHIFT))&SIU_ETPUBC_ETPUB14_MASK)
#define SIU_ETPUBC_ETPUB15_MASK                  0x80000000u
#define SIU_ETPUBC_ETPUB15_SHIFT                 31u
#define SIU_ETPUBC_ETPUB15_WIDTH                 1u
#define SIU_ETPUBC_ETPUB15(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBC_ETPUB15_SHIFT))&SIU_ETPUBC_ETPUB15_MASK)
/* ETPUBD Bit Fields */
#define SIU_ETPUBD_ETPUB24_MASK                  0x10000u
#define SIU_ETPUBD_ETPUB24_SHIFT                 16u
#define SIU_ETPUBD_ETPUB24_WIDTH                 1u
#define SIU_ETPUBD_ETPUB24(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB24_SHIFT))&SIU_ETPUBD_ETPUB24_MASK)
#define SIU_ETPUBD_ETPUB25_MASK                  0x20000u
#define SIU_ETPUBD_ETPUB25_SHIFT                 17u
#define SIU_ETPUBD_ETPUB25_WIDTH                 1u
#define SIU_ETPUBD_ETPUB25(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB25_SHIFT))&SIU_ETPUBD_ETPUB25_MASK)
#define SIU_ETPUBD_ETPUB26_MASK                  0x40000u
#define SIU_ETPUBD_ETPUB26_SHIFT                 18u
#define SIU_ETPUBD_ETPUB26_WIDTH                 1u
#define SIU_ETPUBD_ETPUB26(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB26_SHIFT))&SIU_ETPUBD_ETPUB26_MASK)
#define SIU_ETPUBD_ETPUB27_MASK                  0x80000u
#define SIU_ETPUBD_ETPUB27_SHIFT                 19u
#define SIU_ETPUBD_ETPUB27_WIDTH                 1u
#define SIU_ETPUBD_ETPUB27(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB27_SHIFT))&SIU_ETPUBD_ETPUB27_MASK)
#define SIU_ETPUBD_ETPUB28_MASK                  0x100000u
#define SIU_ETPUBD_ETPUB28_SHIFT                 20u
#define SIU_ETPUBD_ETPUB28_WIDTH                 1u
#define SIU_ETPUBD_ETPUB28(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB28_SHIFT))&SIU_ETPUBD_ETPUB28_MASK)
#define SIU_ETPUBD_ETPUB29_MASK                  0x200000u
#define SIU_ETPUBD_ETPUB29_SHIFT                 21u
#define SIU_ETPUBD_ETPUB29_WIDTH                 1u
#define SIU_ETPUBD_ETPUB29(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB29_SHIFT))&SIU_ETPUBD_ETPUB29_MASK)
#define SIU_ETPUBD_ETPUB16_MASK                  0x4000000u
#define SIU_ETPUBD_ETPUB16_SHIFT                 26u
#define SIU_ETPUBD_ETPUB16_WIDTH                 1u
#define SIU_ETPUBD_ETPUB16(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB16_SHIFT))&SIU_ETPUBD_ETPUB16_MASK)
#define SIU_ETPUBD_ETPUB17_MASK                  0x8000000u
#define SIU_ETPUBD_ETPUB17_SHIFT                 27u
#define SIU_ETPUBD_ETPUB17_WIDTH                 1u
#define SIU_ETPUBD_ETPUB17(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB17_SHIFT))&SIU_ETPUBD_ETPUB17_MASK)
#define SIU_ETPUBD_ETPUB18_MASK                  0x10000000u
#define SIU_ETPUBD_ETPUB18_SHIFT                 28u
#define SIU_ETPUBD_ETPUB18_WIDTH                 1u
#define SIU_ETPUBD_ETPUB18(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB18_SHIFT))&SIU_ETPUBD_ETPUB18_MASK)
#define SIU_ETPUBD_ETPUB19_MASK                  0x20000000u
#define SIU_ETPUBD_ETPUB19_SHIFT                 29u
#define SIU_ETPUBD_ETPUB19_WIDTH                 1u
#define SIU_ETPUBD_ETPUB19(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB19_SHIFT))&SIU_ETPUBD_ETPUB19_MASK)
#define SIU_ETPUBD_ETPUB20_MASK                  0x40000000u
#define SIU_ETPUBD_ETPUB20_SHIFT                 30u
#define SIU_ETPUBD_ETPUB20_WIDTH                 1u
#define SIU_ETPUBD_ETPUB20(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB20_SHIFT))&SIU_ETPUBD_ETPUB20_MASK)
#define SIU_ETPUBD_ETPUB21_MASK                  0x80000000u
#define SIU_ETPUBD_ETPUB21_SHIFT                 31u
#define SIU_ETPUBD_ETPUB21_WIDTH                 1u
#define SIU_ETPUBD_ETPUB21(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_ETPUBD_ETPUB21_SHIFT))&SIU_ETPUBD_ETPUB21_MASK)
/* EMIOSD Bit Fields */
#define SIU_EMIOSD_EMIOS1_4_OUT9_MASK            0x400000u
#define SIU_EMIOSD_EMIOS1_4_OUT9_SHIFT           22u
#define SIU_EMIOSD_EMIOS1_4_OUT9_WIDTH           1u
#define SIU_EMIOSD_EMIOS1_4_OUT9(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSD_EMIOS1_4_OUT9_SHIFT))&SIU_EMIOSD_EMIOS1_4_OUT9_MASK)
#define SIU_EMIOSD_EMIOS1_5_OUT8_MASK            0x800000u
#define SIU_EMIOSD_EMIOS1_5_OUT8_SHIFT           23u
#define SIU_EMIOSD_EMIOS1_5_OUT8_WIDTH           1u
#define SIU_EMIOSD_EMIOS1_5_OUT8(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSD_EMIOS1_5_OUT8_SHIFT))&SIU_EMIOSD_EMIOS1_5_OUT8_MASK)
#define SIU_EMIOSD_EMIOS1_2_OUT7_MASK            0x1000000u
#define SIU_EMIOSD_EMIOS1_2_OUT7_SHIFT           24u
#define SIU_EMIOSD_EMIOS1_2_OUT7_WIDTH           1u
#define SIU_EMIOSD_EMIOS1_2_OUT7(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSD_EMIOS1_2_OUT7_SHIFT))&SIU_EMIOSD_EMIOS1_2_OUT7_MASK)
#define SIU_EMIOSD_EMIOS1_3_OUT6_MASK            0x2000000u
#define SIU_EMIOSD_EMIOS1_3_OUT6_SHIFT           25u
#define SIU_EMIOSD_EMIOS1_3_OUT6_WIDTH           1u
#define SIU_EMIOSD_EMIOS1_3_OUT6(x)              (((uint32_t)(((uint32_t)(x))<<SIU_EMIOSD_EMIOS1_3_OUT6_SHIFT))&SIU_EMIOSD_EMIOS1_3_OUT6_MASK)
/* DSPIDHLD Bit Fields */
#define SIU_DSPIDHLD_DSPIDL31_MASK               0x1u
#define SIU_DSPIDHLD_DSPIDL31_SHIFT              0u
#define SIU_DSPIDHLD_DSPIDL31_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL31(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL31_SHIFT))&SIU_DSPIDHLD_DSPIDL31_MASK)
#define SIU_DSPIDHLD_DSPIDL30_MASK               0x2u
#define SIU_DSPIDHLD_DSPIDL30_SHIFT              1u
#define SIU_DSPIDHLD_DSPIDL30_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL30(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL30_SHIFT))&SIU_DSPIDHLD_DSPIDL30_MASK)
#define SIU_DSPIDHLD_DSPIDL29_MASK               0x4u
#define SIU_DSPIDHLD_DSPIDL29_SHIFT              2u
#define SIU_DSPIDHLD_DSPIDL29_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL29(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL29_SHIFT))&SIU_DSPIDHLD_DSPIDL29_MASK)
#define SIU_DSPIDHLD_DSPIDL28_MASK               0x8u
#define SIU_DSPIDHLD_DSPIDL28_SHIFT              3u
#define SIU_DSPIDHLD_DSPIDL28_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL28(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL28_SHIFT))&SIU_DSPIDHLD_DSPIDL28_MASK)
#define SIU_DSPIDHLD_DSPIDL27_MASK               0x10u
#define SIU_DSPIDHLD_DSPIDL27_SHIFT              4u
#define SIU_DSPIDHLD_DSPIDL27_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL27(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL27_SHIFT))&SIU_DSPIDHLD_DSPIDL27_MASK)
#define SIU_DSPIDHLD_DSPIDL26_MASK               0x20u
#define SIU_DSPIDHLD_DSPIDL26_SHIFT              5u
#define SIU_DSPIDHLD_DSPIDL26_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL26(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL26_SHIFT))&SIU_DSPIDHLD_DSPIDL26_MASK)
#define SIU_DSPIDHLD_DSPIDL25_MASK               0x40u
#define SIU_DSPIDHLD_DSPIDL25_SHIFT              6u
#define SIU_DSPIDHLD_DSPIDL25_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL25(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL25_SHIFT))&SIU_DSPIDHLD_DSPIDL25_MASK)
#define SIU_DSPIDHLD_DSPIDL24_MASK               0x80u
#define SIU_DSPIDHLD_DSPIDL24_SHIFT              7u
#define SIU_DSPIDHLD_DSPIDL24_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL24(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL24_SHIFT))&SIU_DSPIDHLD_DSPIDL24_MASK)
#define SIU_DSPIDHLD_DSPIDL23_MASK               0x100u
#define SIU_DSPIDHLD_DSPIDL23_SHIFT              8u
#define SIU_DSPIDHLD_DSPIDL23_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL23(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL23_SHIFT))&SIU_DSPIDHLD_DSPIDL23_MASK)
#define SIU_DSPIDHLD_DSPIDL22_MASK               0x200u
#define SIU_DSPIDHLD_DSPIDL22_SHIFT              9u
#define SIU_DSPIDHLD_DSPIDL22_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL22(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL22_SHIFT))&SIU_DSPIDHLD_DSPIDL22_MASK)
#define SIU_DSPIDHLD_DSPIDL21_MASK               0x400u
#define SIU_DSPIDHLD_DSPIDL21_SHIFT              10u
#define SIU_DSPIDHLD_DSPIDL21_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL21(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL21_SHIFT))&SIU_DSPIDHLD_DSPIDL21_MASK)
#define SIU_DSPIDHLD_DSPIDL20_MASK               0x800u
#define SIU_DSPIDHLD_DSPIDL20_SHIFT              11u
#define SIU_DSPIDHLD_DSPIDL20_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL20(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL20_SHIFT))&SIU_DSPIDHLD_DSPIDL20_MASK)
#define SIU_DSPIDHLD_DSPIDL19_MASK               0x1000u
#define SIU_DSPIDHLD_DSPIDL19_SHIFT              12u
#define SIU_DSPIDHLD_DSPIDL19_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL19(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL19_SHIFT))&SIU_DSPIDHLD_DSPIDL19_MASK)
#define SIU_DSPIDHLD_DSPIDL18_MASK               0x2000u
#define SIU_DSPIDHLD_DSPIDL18_SHIFT              13u
#define SIU_DSPIDHLD_DSPIDL18_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL18(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL18_SHIFT))&SIU_DSPIDHLD_DSPIDL18_MASK)
#define SIU_DSPIDHLD_DSPIDL17_MASK               0x4000u
#define SIU_DSPIDHLD_DSPIDL17_SHIFT              14u
#define SIU_DSPIDHLD_DSPIDL17_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL17(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL17_SHIFT))&SIU_DSPIDHLD_DSPIDL17_MASK)
#define SIU_DSPIDHLD_DSPIDL16_MASK               0x8000u
#define SIU_DSPIDHLD_DSPIDL16_SHIFT              15u
#define SIU_DSPIDHLD_DSPIDL16_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDL16(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDL16_SHIFT))&SIU_DSPIDHLD_DSPIDL16_MASK)
#define SIU_DSPIDHLD_DSPIDH15_MASK               0x10000u
#define SIU_DSPIDHLD_DSPIDH15_SHIFT              16u
#define SIU_DSPIDHLD_DSPIDH15_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDH15(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH15_SHIFT))&SIU_DSPIDHLD_DSPIDH15_MASK)
#define SIU_DSPIDHLD_DSPIDH14_MASK               0x20000u
#define SIU_DSPIDHLD_DSPIDH14_SHIFT              17u
#define SIU_DSPIDHLD_DSPIDH14_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDH14(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH14_SHIFT))&SIU_DSPIDHLD_DSPIDH14_MASK)
#define SIU_DSPIDHLD_DSPIDH13_MASK               0x40000u
#define SIU_DSPIDHLD_DSPIDH13_SHIFT              18u
#define SIU_DSPIDHLD_DSPIDH13_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDH13(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH13_SHIFT))&SIU_DSPIDHLD_DSPIDH13_MASK)
#define SIU_DSPIDHLD_DSPIDH12_MASK               0x80000u
#define SIU_DSPIDHLD_DSPIDH12_SHIFT              19u
#define SIU_DSPIDHLD_DSPIDH12_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDH12(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH12_SHIFT))&SIU_DSPIDHLD_DSPIDH12_MASK)
#define SIU_DSPIDHLD_DSPIDH11_MASK               0x100000u
#define SIU_DSPIDHLD_DSPIDH11_SHIFT              20u
#define SIU_DSPIDHLD_DSPIDH11_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDH11(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH11_SHIFT))&SIU_DSPIDHLD_DSPIDH11_MASK)
#define SIU_DSPIDHLD_DSPIDH10_MASK               0x200000u
#define SIU_DSPIDHLD_DSPIDH10_SHIFT              21u
#define SIU_DSPIDHLD_DSPIDH10_WIDTH              1u
#define SIU_DSPIDHLD_DSPIDH10(x)                 (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH10_SHIFT))&SIU_DSPIDHLD_DSPIDH10_MASK)
#define SIU_DSPIDHLD_DSPIDH9_MASK                0x400000u
#define SIU_DSPIDHLD_DSPIDH9_SHIFT               22u
#define SIU_DSPIDHLD_DSPIDH9_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH9(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH9_SHIFT))&SIU_DSPIDHLD_DSPIDH9_MASK)
#define SIU_DSPIDHLD_DSPIDH8_MASK                0x800000u
#define SIU_DSPIDHLD_DSPIDH8_SHIFT               23u
#define SIU_DSPIDHLD_DSPIDH8_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH8(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH8_SHIFT))&SIU_DSPIDHLD_DSPIDH8_MASK)
#define SIU_DSPIDHLD_DSPIDH7_MASK                0x1000000u
#define SIU_DSPIDHLD_DSPIDH7_SHIFT               24u
#define SIU_DSPIDHLD_DSPIDH7_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH7(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH7_SHIFT))&SIU_DSPIDHLD_DSPIDH7_MASK)
#define SIU_DSPIDHLD_DSPIDH6_MASK                0x2000000u
#define SIU_DSPIDHLD_DSPIDH6_SHIFT               25u
#define SIU_DSPIDHLD_DSPIDH6_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH6(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH6_SHIFT))&SIU_DSPIDHLD_DSPIDH6_MASK)
#define SIU_DSPIDHLD_DSPIDH5_MASK                0x4000000u
#define SIU_DSPIDHLD_DSPIDH5_SHIFT               26u
#define SIU_DSPIDHLD_DSPIDH5_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH5(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH5_SHIFT))&SIU_DSPIDHLD_DSPIDH5_MASK)
#define SIU_DSPIDHLD_DSPIDH4_MASK                0x8000000u
#define SIU_DSPIDHLD_DSPIDH4_SHIFT               27u
#define SIU_DSPIDHLD_DSPIDH4_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH4(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH4_SHIFT))&SIU_DSPIDHLD_DSPIDH4_MASK)
#define SIU_DSPIDHLD_DSPIDH3_MASK                0x10000000u
#define SIU_DSPIDHLD_DSPIDH3_SHIFT               28u
#define SIU_DSPIDHLD_DSPIDH3_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH3(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH3_SHIFT))&SIU_DSPIDHLD_DSPIDH3_MASK)
#define SIU_DSPIDHLD_DSPIDH2_MASK                0x20000000u
#define SIU_DSPIDHLD_DSPIDH2_SHIFT               29u
#define SIU_DSPIDHLD_DSPIDH2_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH2(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH2_SHIFT))&SIU_DSPIDHLD_DSPIDH2_MASK)
#define SIU_DSPIDHLD_DSPIDH1_MASK                0x40000000u
#define SIU_DSPIDHLD_DSPIDH1_SHIFT               30u
#define SIU_DSPIDHLD_DSPIDH1_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH1(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH1_SHIFT))&SIU_DSPIDHLD_DSPIDH1_MASK)
#define SIU_DSPIDHLD_DSPIDH0_MASK                0x80000000u
#define SIU_DSPIDHLD_DSPIDH0_SHIFT               31u
#define SIU_DSPIDHLD_DSPIDH0_WIDTH               1u
#define SIU_DSPIDHLD_DSPIDH0(x)                  (((uint32_t)(((uint32_t)(x))<<SIU_DSPIDHLD_DSPIDH0_SHIFT))&SIU_DSPIDHLD_DSPIDH0_MASK)
/* GPDI Bit Fields */
#define SIU_GPDI_PDIn_MASK                       0x1u
#define SIU_GPDI_PDIn_SHIFT                      0u
#define SIU_GPDI_PDIn_WIDTH                      1u
#define SIU_GPDI_PDIn(x)                         (((uint8_t)(((uint8_t)(x))<<SIU_GPDI_PDIn_SHIFT))&SIU_GPDI_PDIn_MASK)
/* IMUX0 Bit Fields */
#define SIU_IMUX0_MUXSEL0_MASK                   0x3u
#define SIU_IMUX0_MUXSEL0_SHIFT                  0u
#define SIU_IMUX0_MUXSEL0_WIDTH                  2u
#define SIU_IMUX0_MUXSEL0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL0_SHIFT))&SIU_IMUX0_MUXSEL0_MASK)
#define SIU_IMUX0_MUXSEL1_MASK                   0xCu
#define SIU_IMUX0_MUXSEL1_SHIFT                  2u
#define SIU_IMUX0_MUXSEL1_WIDTH                  2u
#define SIU_IMUX0_MUXSEL1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL1_SHIFT))&SIU_IMUX0_MUXSEL1_MASK)
#define SIU_IMUX0_MUXSEL2_MASK                   0x30u
#define SIU_IMUX0_MUXSEL2_SHIFT                  4u
#define SIU_IMUX0_MUXSEL2_WIDTH                  2u
#define SIU_IMUX0_MUXSEL2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL2_SHIFT))&SIU_IMUX0_MUXSEL2_MASK)
#define SIU_IMUX0_MUXSEL3_MASK                   0xC0u
#define SIU_IMUX0_MUXSEL3_SHIFT                  6u
#define SIU_IMUX0_MUXSEL3_WIDTH                  2u
#define SIU_IMUX0_MUXSEL3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL3_SHIFT))&SIU_IMUX0_MUXSEL3_MASK)
#define SIU_IMUX0_MUXSEL4_MASK                   0x300u
