neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SIU_IMUX0_MUXSEL4_SHIFT                  8u
#define SIU_IMUX0_MUXSEL4_WIDTH                  2u
#define SIU_IMUX0_MUXSEL4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL4_SHIFT))&SIU_IMUX0_MUXSEL4_MASK)
#define SIU_IMUX0_MUXSEL5_MASK                   0xC00u
#define SIU_IMUX0_MUXSEL5_SHIFT                  10u
#define SIU_IMUX0_MUXSEL5_WIDTH                  2u
#define SIU_IMUX0_MUXSEL5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL5_SHIFT))&SIU_IMUX0_MUXSEL5_MASK)
#define SIU_IMUX0_MUXSEL6_MASK                   0x3000u
#define SIU_IMUX0_MUXSEL6_SHIFT                  12u
#define SIU_IMUX0_MUXSEL6_WIDTH                  2u
#define SIU_IMUX0_MUXSEL6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL6_SHIFT))&SIU_IMUX0_MUXSEL6_MASK)
#define SIU_IMUX0_MUXSEL7_MASK                   0xC000u
#define SIU_IMUX0_MUXSEL7_SHIFT                  14u
#define SIU_IMUX0_MUXSEL7_WIDTH                  2u
#define SIU_IMUX0_MUXSEL7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL7_SHIFT))&SIU_IMUX0_MUXSEL7_MASK)
#define SIU_IMUX0_MUXSEL8_MASK                   0x30000u
#define SIU_IMUX0_MUXSEL8_SHIFT                  16u
#define SIU_IMUX0_MUXSEL8_WIDTH                  2u
#define SIU_IMUX0_MUXSEL8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL8_SHIFT))&SIU_IMUX0_MUXSEL8_MASK)
#define SIU_IMUX0_MUXSEL9_MASK                   0xC0000u
#define SIU_IMUX0_MUXSEL9_SHIFT                  18u
#define SIU_IMUX0_MUXSEL9_WIDTH                  2u
#define SIU_IMUX0_MUXSEL9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL9_SHIFT))&SIU_IMUX0_MUXSEL9_MASK)
#define SIU_IMUX0_MUXSEL10_MASK                  0x300000u
#define SIU_IMUX0_MUXSEL10_SHIFT                 20u
#define SIU_IMUX0_MUXSEL10_WIDTH                 2u
#define SIU_IMUX0_MUXSEL10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL10_SHIFT))&SIU_IMUX0_MUXSEL10_MASK)
#define SIU_IMUX0_MUXSEL11_MASK                  0xC00000u
#define SIU_IMUX0_MUXSEL11_SHIFT                 22u
#define SIU_IMUX0_MUXSEL11_WIDTH                 2u
#define SIU_IMUX0_MUXSEL11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX0_MUXSEL11_SHIFT))&SIU_IMUX0_MUXSEL11_MASK)
/* IMUX1 Bit Fields */
#define SIU_IMUX1_MUXSEL0_MASK                   0x3u
#define SIU_IMUX1_MUXSEL0_SHIFT                  0u
#define SIU_IMUX1_MUXSEL0_WIDTH                  2u
#define SIU_IMUX1_MUXSEL0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX1_MUXSEL0_SHIFT))&SIU_IMUX1_MUXSEL0_MASK)
#define SIU_IMUX1_MUXSEL1_MASK                   0xCu
#define SIU_IMUX1_MUXSEL1_SHIFT                  2u
#define SIU_IMUX1_MUXSEL1_WIDTH                  2u
#define SIU_IMUX1_MUXSEL1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX1_MUXSEL1_SHIFT))&SIU_IMUX1_MUXSEL1_MASK)
#define SIU_IMUX1_MUXSEL5_MASK                   0xC00u
#define SIU_IMUX1_MUXSEL5_SHIFT                  10u
#define SIU_IMUX1_MUXSEL5_WIDTH                  2u
#define SIU_IMUX1_MUXSEL5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX1_MUXSEL5_SHIFT))&SIU_IMUX1_MUXSEL5_MASK)
/* IMUX2 Bit Fields */
#define SIU_IMUX2_MUXSEL5_MASK                   0xC00u
#define SIU_IMUX2_MUXSEL5_SHIFT                  10u
#define SIU_IMUX2_MUXSEL5_WIDTH                  2u
#define SIU_IMUX2_MUXSEL5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL5_SHIFT))&SIU_IMUX2_MUXSEL5_MASK)
#define SIU_IMUX2_MUXSEL6_MASK                   0x3000u
#define SIU_IMUX2_MUXSEL6_SHIFT                  12u
#define SIU_IMUX2_MUXSEL6_WIDTH                  2u
#define SIU_IMUX2_MUXSEL6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL6_SHIFT))&SIU_IMUX2_MUXSEL6_MASK)
#define SIU_IMUX2_MUXSEL7_MASK                   0xC000u
#define SIU_IMUX2_MUXSEL7_SHIFT                  14u
#define SIU_IMUX2_MUXSEL7_WIDTH                  2u
#define SIU_IMUX2_MUXSEL7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL7_SHIFT))&SIU_IMUX2_MUXSEL7_MASK)
#define SIU_IMUX2_MUXSEL8_MASK                   0x30000u
#define SIU_IMUX2_MUXSEL8_SHIFT                  16u
#define SIU_IMUX2_MUXSEL8_WIDTH                  2u
#define SIU_IMUX2_MUXSEL8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL8_SHIFT))&SIU_IMUX2_MUXSEL8_MASK)
#define SIU_IMUX2_MUXSEL9_MASK                   0xC0000u
#define SIU_IMUX2_MUXSEL9_SHIFT                  18u
#define SIU_IMUX2_MUXSEL9_WIDTH                  2u
#define SIU_IMUX2_MUXSEL9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL9_SHIFT))&SIU_IMUX2_MUXSEL9_MASK)
#define SIU_IMUX2_MUXSEL10_MASK                  0x300000u
#define SIU_IMUX2_MUXSEL10_SHIFT                 20u
#define SIU_IMUX2_MUXSEL10_WIDTH                 2u
#define SIU_IMUX2_MUXSEL10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL10_SHIFT))&SIU_IMUX2_MUXSEL10_MASK)
#define SIU_IMUX2_MUXSEL11_MASK                  0xC00000u
#define SIU_IMUX2_MUXSEL11_SHIFT                 22u
#define SIU_IMUX2_MUXSEL11_WIDTH                 2u
#define SIU_IMUX2_MUXSEL11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX2_MUXSEL11_SHIFT))&SIU_IMUX2_MUXSEL11_MASK)
/* IMUX3 Bit Fields */
#define SIU_IMUX3_MUXSEL0_MASK                   0x3u
#define SIU_IMUX3_MUXSEL0_SHIFT                  0u
#define SIU_IMUX3_MUXSEL0_WIDTH                  2u
#define SIU_IMUX3_MUXSEL0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL0_SHIFT))&SIU_IMUX3_MUXSEL0_MASK)
#define SIU_IMUX3_MUXSEL1_MASK                   0xCu
#define SIU_IMUX3_MUXSEL1_SHIFT                  2u
#define SIU_IMUX3_MUXSEL1_WIDTH                  2u
#define SIU_IMUX3_MUXSEL1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL1_SHIFT))&SIU_IMUX3_MUXSEL1_MASK)
#define SIU_IMUX3_MUXSEL2_MASK                   0x30u
#define SIU_IMUX3_MUXSEL2_SHIFT                  4u
#define SIU_IMUX3_MUXSEL2_WIDTH                  2u
#define SIU_IMUX3_MUXSEL2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL2_SHIFT))&SIU_IMUX3_MUXSEL2_MASK)
#define SIU_IMUX3_MUXSEL3_MASK                   0xC0u
#define SIU_IMUX3_MUXSEL3_SHIFT                  6u
#define SIU_IMUX3_MUXSEL3_WIDTH                  2u
#define SIU_IMUX3_MUXSEL3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL3_SHIFT))&SIU_IMUX3_MUXSEL3_MASK)
#define SIU_IMUX3_MUXSEL4_MASK                   0x300u
#define SIU_IMUX3_MUXSEL4_SHIFT                  8u
#define SIU_IMUX3_MUXSEL4_WIDTH                  2u
#define SIU_IMUX3_MUXSEL4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL4_SHIFT))&SIU_IMUX3_MUXSEL4_MASK)
#define SIU_IMUX3_MUXSEL5_MASK                   0xC00u
#define SIU_IMUX3_MUXSEL5_SHIFT                  10u
#define SIU_IMUX3_MUXSEL5_WIDTH                  2u
#define SIU_IMUX3_MUXSEL5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL5_SHIFT))&SIU_IMUX3_MUXSEL5_MASK)
#define SIU_IMUX3_MUXSEL6_MASK                   0x3000u
#define SIU_IMUX3_MUXSEL6_SHIFT                  12u
#define SIU_IMUX3_MUXSEL6_WIDTH                  2u
#define SIU_IMUX3_MUXSEL6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX3_MUXSEL6_SHIFT))&SIU_IMUX3_MUXSEL6_MASK)
/* IMUX4 Bit Fields */
#define SIU_IMUX4_MUXSEL0_MASK                   0x3u
#define SIU_IMUX4_MUXSEL0_SHIFT                  0u
#define SIU_IMUX4_MUXSEL0_WIDTH                  2u
#define SIU_IMUX4_MUXSEL0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX4_MUXSEL0_SHIFT))&SIU_IMUX4_MUXSEL0_MASK)
#define SIU_IMUX4_MUXSEL1_MASK                   0xCu
#define SIU_IMUX4_MUXSEL1_SHIFT                  2u
#define SIU_IMUX4_MUXSEL1_WIDTH                  2u
#define SIU_IMUX4_MUXSEL1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX4_MUXSEL1_SHIFT))&SIU_IMUX4_MUXSEL1_MASK)
#define SIU_IMUX4_MUXSEL2_MASK                   0x30u
#define SIU_IMUX4_MUXSEL2_SHIFT                  4u
#define SIU_IMUX4_MUXSEL2_WIDTH                  2u
#define SIU_IMUX4_MUXSEL2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX4_MUXSEL2_SHIFT))&SIU_IMUX4_MUXSEL2_MASK)
#define SIU_IMUX4_MUXSEL3_MASK                   0xC0u
#define SIU_IMUX4_MUXSEL3_SHIFT                  6u
#define SIU_IMUX4_MUXSEL3_WIDTH                  2u
#define SIU_IMUX4_MUXSEL3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX4_MUXSEL3_SHIFT))&SIU_IMUX4_MUXSEL3_MASK)
#define SIU_IMUX4_MUXSEL8_MASK                   0x30000u
#define SIU_IMUX4_MUXSEL8_SHIFT                  16u
#define SIU_IMUX4_MUXSEL8_WIDTH                  2u
#define SIU_IMUX4_MUXSEL8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX4_MUXSEL8_SHIFT))&SIU_IMUX4_MUXSEL8_MASK)
/* IMUX5 Bit Fields */
#define SIU_IMUX5_MUXSEL0_MASK                   0x3u
#define SIU_IMUX5_MUXSEL0_SHIFT                  0u
#define SIU_IMUX5_MUXSEL0_WIDTH                  2u
#define SIU_IMUX5_MUXSEL0(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL0_SHIFT))&SIU_IMUX5_MUXSEL0_MASK)
#define SIU_IMUX5_MUXSEL1_MASK                   0xCu
#define SIU_IMUX5_MUXSEL1_SHIFT                  2u
#define SIU_IMUX5_MUXSEL1_WIDTH                  2u
#define SIU_IMUX5_MUXSEL1(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL1_SHIFT))&SIU_IMUX5_MUXSEL1_MASK)
#define SIU_IMUX5_MUXSEL2_MASK                   0x30u
#define SIU_IMUX5_MUXSEL2_SHIFT                  4u
#define SIU_IMUX5_MUXSEL2_WIDTH                  2u
#define SIU_IMUX5_MUXSEL2(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL2_SHIFT))&SIU_IMUX5_MUXSEL2_MASK)
#define SIU_IMUX5_MUXSEL3_MASK                   0xC0u
#define SIU_IMUX5_MUXSEL3_SHIFT                  6u
#define SIU_IMUX5_MUXSEL3_WIDTH                  2u
#define SIU_IMUX5_MUXSEL3(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL3_SHIFT))&SIU_IMUX5_MUXSEL3_MASK)
#define SIU_IMUX5_MUXSEL4_MASK                   0x300u
#define SIU_IMUX5_MUXSEL4_SHIFT                  8u
#define SIU_IMUX5_MUXSEL4_WIDTH                  2u
#define SIU_IMUX5_MUXSEL4(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL4_SHIFT))&SIU_IMUX5_MUXSEL4_MASK)
#define SIU_IMUX5_MUXSEL5_MASK                   0xC00u
#define SIU_IMUX5_MUXSEL5_SHIFT                  10u
#define SIU_IMUX5_MUXSEL5_WIDTH                  2u
#define SIU_IMUX5_MUXSEL5(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL5_SHIFT))&SIU_IMUX5_MUXSEL5_MASK)
#define SIU_IMUX5_MUXSEL6_MASK                   0x3000u
#define SIU_IMUX5_MUXSEL6_SHIFT                  12u
#define SIU_IMUX5_MUXSEL6_WIDTH                  2u
#define SIU_IMUX5_MUXSEL6(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL6_SHIFT))&SIU_IMUX5_MUXSEL6_MASK)
#define SIU_IMUX5_MUXSEL7_MASK                   0xC000u
#define SIU_IMUX5_MUXSEL7_SHIFT                  14u
#define SIU_IMUX5_MUXSEL7_WIDTH                  2u
#define SIU_IMUX5_MUXSEL7(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL7_SHIFT))&SIU_IMUX5_MUXSEL7_MASK)
#define SIU_IMUX5_MUXSEL8_MASK                   0x30000u
#define SIU_IMUX5_MUXSEL8_SHIFT                  16u
#define SIU_IMUX5_MUXSEL8_WIDTH                  2u
#define SIU_IMUX5_MUXSEL8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL8_SHIFT))&SIU_IMUX5_MUXSEL8_MASK)
#define SIU_IMUX5_MUXSEL9_MASK                   0xC0000u
#define SIU_IMUX5_MUXSEL9_SHIFT                  18u
#define SIU_IMUX5_MUXSEL9_WIDTH                  2u
#define SIU_IMUX5_MUXSEL9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL9_SHIFT))&SIU_IMUX5_MUXSEL9_MASK)
#define SIU_IMUX5_MUXSEL10_MASK                  0x300000u
#define SIU_IMUX5_MUXSEL10_SHIFT                 20u
#define SIU_IMUX5_MUXSEL10_WIDTH                 2u
#define SIU_IMUX5_MUXSEL10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL10_SHIFT))&SIU_IMUX5_MUXSEL10_MASK)
#define SIU_IMUX5_MUXSEL11_MASK                  0xC00000u
#define SIU_IMUX5_MUXSEL11_SHIFT                 22u
#define SIU_IMUX5_MUXSEL11_WIDTH                 2u
#define SIU_IMUX5_MUXSEL11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL11_SHIFT))&SIU_IMUX5_MUXSEL11_MASK)
#define SIU_IMUX5_MUXSEL12_MASK                  0x3000000u
#define SIU_IMUX5_MUXSEL12_SHIFT                 24u
#define SIU_IMUX5_MUXSEL12_WIDTH                 2u
#define SIU_IMUX5_MUXSEL12(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL12_SHIFT))&SIU_IMUX5_MUXSEL12_MASK)
#define SIU_IMUX5_MUXSEL13_MASK                  0xC000000u
#define SIU_IMUX5_MUXSEL13_SHIFT                 26u
#define SIU_IMUX5_MUXSEL13_WIDTH                 2u
#define SIU_IMUX5_MUXSEL13(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL13_SHIFT))&SIU_IMUX5_MUXSEL13_MASK)
#define SIU_IMUX5_MUXSEL14_MASK                  0x30000000u
#define SIU_IMUX5_MUXSEL14_SHIFT                 28u
#define SIU_IMUX5_MUXSEL14_WIDTH                 2u
#define SIU_IMUX5_MUXSEL14(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL14_SHIFT))&SIU_IMUX5_MUXSEL14_MASK)
#define SIU_IMUX5_MUXSEL15_MASK                  0xC0000000u
#define SIU_IMUX5_MUXSEL15_SHIFT                 30u
#define SIU_IMUX5_MUXSEL15_WIDTH                 2u
#define SIU_IMUX5_MUXSEL15(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX5_MUXSEL15_SHIFT))&SIU_IMUX5_MUXSEL15_MASK)
/* IMUX7 Bit Fields */
#define SIU_IMUX7_MUXSEL8_MASK                   0x30000u
#define SIU_IMUX7_MUXSEL8_SHIFT                  16u
#define SIU_IMUX7_MUXSEL8_WIDTH                  2u
#define SIU_IMUX7_MUXSEL8(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL8_SHIFT))&SIU_IMUX7_MUXSEL8_MASK)
#define SIU_IMUX7_MUXSEL9_MASK                   0xC0000u
#define SIU_IMUX7_MUXSEL9_SHIFT                  18u
#define SIU_IMUX7_MUXSEL9_WIDTH                  2u
#define SIU_IMUX7_MUXSEL9(x)                     (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL9_SHIFT))&SIU_IMUX7_MUXSEL9_MASK)
#define SIU_IMUX7_MUXSEL10_MASK                  0x300000u
#define SIU_IMUX7_MUXSEL10_SHIFT                 20u
#define SIU_IMUX7_MUXSEL10_WIDTH                 2u
#define SIU_IMUX7_MUXSEL10(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL10_SHIFT))&SIU_IMUX7_MUXSEL10_MASK)
#define SIU_IMUX7_MUXSEL11_MASK                  0xC00000u
#define SIU_IMUX7_MUXSEL11_SHIFT                 22u
#define SIU_IMUX7_MUXSEL11_WIDTH                 2u
#define SIU_IMUX7_MUXSEL11(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL11_SHIFT))&SIU_IMUX7_MUXSEL11_MASK)
#define SIU_IMUX7_MUXSEL12_MASK                  0x3000000u
#define SIU_IMUX7_MUXSEL12_SHIFT                 24u
#define SIU_IMUX7_MUXSEL12_WIDTH                 2u
#define SIU_IMUX7_MUXSEL12(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL12_SHIFT))&SIU_IMUX7_MUXSEL12_MASK)
#define SIU_IMUX7_MUXSEL13_MASK                  0xC000000u
#define SIU_IMUX7_MUXSEL13_SHIFT                 26u
#define SIU_IMUX7_MUXSEL13_WIDTH                 2u
#define SIU_IMUX7_MUXSEL13(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL13_SHIFT))&SIU_IMUX7_MUXSEL13_MASK)
#define SIU_IMUX7_MUXSEL14_MASK                  0x30000000u
#define SIU_IMUX7_MUXSEL14_SHIFT                 28u
#define SIU_IMUX7_MUXSEL14_WIDTH                 2u
#define SIU_IMUX7_MUXSEL14(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL14_SHIFT))&SIU_IMUX7_MUXSEL14_MASK)
#define SIU_IMUX7_MUXSEL15_MASK                  0xC0000000u
#define SIU_IMUX7_MUXSEL15_SHIFT                 30u
#define SIU_IMUX7_MUXSEL15_WIDTH                 2u
#define SIU_IMUX7_MUXSEL15(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX7_MUXSEL15_SHIFT))&SIU_IMUX7_MUXSEL15_MASK)
/* IMUX10 Bit Fields */
#define SIU_IMUX10_MUXSEL0_MASK                  0x3u
#define SIU_IMUX10_MUXSEL0_SHIFT                 0u
#define SIU_IMUX10_MUXSEL0_WIDTH                 2u
#define SIU_IMUX10_MUXSEL0(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL0_SHIFT))&SIU_IMUX10_MUXSEL0_MASK)
#define SIU_IMUX10_MUXSEL1_MASK                  0xCu
#define SIU_IMUX10_MUXSEL1_SHIFT                 2u
#define SIU_IMUX10_MUXSEL1_WIDTH                 2u
#define SIU_IMUX10_MUXSEL1(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL1_SHIFT))&SIU_IMUX10_MUXSEL1_MASK)
#define SIU_IMUX10_MUXSEL3_MASK                  0xC0u
#define SIU_IMUX10_MUXSEL3_SHIFT                 6u
#define SIU_IMUX10_MUXSEL3_WIDTH                 2u
#define SIU_IMUX10_MUXSEL3(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL3_SHIFT))&SIU_IMUX10_MUXSEL3_MASK)
#define SIU_IMUX10_MUXSEL8_MASK                  0x30000u
#define SIU_IMUX10_MUXSEL8_SHIFT                 16u
#define SIU_IMUX10_MUXSEL8_WIDTH                 2u
#define SIU_IMUX10_MUXSEL8(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL8_SHIFT))&SIU_IMUX10_MUXSEL8_MASK)
#define SIU_IMUX10_MUXSEL9_MASK                  0xC0000u
#define SIU_IMUX10_MUXSEL9_SHIFT                 18u
#define SIU_IMUX10_MUXSEL9_WIDTH                 2u
#define SIU_IMUX10_MUXSEL9(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL9_SHIFT))&SIU_IMUX10_MUXSEL9_MASK)
#define SIU_IMUX10_MUXSEL10_MASK                 0x300000u
#define SIU_IMUX10_MUXSEL10_SHIFT                20u
#define SIU_IMUX10_MUXSEL10_WIDTH                2u
#define SIU_IMUX10_MUXSEL10(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL10_SHIFT))&SIU_IMUX10_MUXSEL10_MASK)
#define SIU_IMUX10_MUXSEL11_MASK                 0xC00000u
#define SIU_IMUX10_MUXSEL11_SHIFT                22u
#define SIU_IMUX10_MUXSEL11_WIDTH                2u
#define SIU_IMUX10_MUXSEL11(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL11_SHIFT))&SIU_IMUX10_MUXSEL11_MASK)
#define SIU_IMUX10_MUXSEL12_MASK                 0x3000000u
#define SIU_IMUX10_MUXSEL12_SHIFT                24u
#define SIU_IMUX10_MUXSEL12_WIDTH                2u
#define SIU_IMUX10_MUXSEL12(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL12_SHIFT))&SIU_IMUX10_MUXSEL12_MASK)
#define SIU_IMUX10_MUXSEL13_MASK                 0xC000000u
#define SIU_IMUX10_MUXSEL13_SHIFT                26u
#define SIU_IMUX10_MUXSEL13_WIDTH                2u
#define SIU_IMUX10_MUXSEL13(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL13_SHIFT))&SIU_IMUX10_MUXSEL13_MASK)
#define SIU_IMUX10_MUXSEL14_MASK                 0x30000000u
#define SIU_IMUX10_MUXSEL14_SHIFT                28u
#define SIU_IMUX10_MUXSEL14_WIDTH                2u
#define SIU_IMUX10_MUXSEL14(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL14_SHIFT))&SIU_IMUX10_MUXSEL14_MASK)
#define SIU_IMUX10_MUXSEL15_MASK                 0xC0000000u
#define SIU_IMUX10_MUXSEL15_SHIFT                30u
#define SIU_IMUX10_MUXSEL15_WIDTH                2u
#define SIU_IMUX10_MUXSEL15(x)                   (((uint32_t)(((uint32_t)(x))<<SIU_IMUX10_MUXSEL15_SHIFT))&SIU_IMUX10_MUXSEL15_MASK)
/* IMUX12 Bit Fields */
#define SIU_IMUX12_MUXSEL2_MASK                  0x30u
#define SIU_IMUX12_MUXSEL2_SHIFT                 4u
#define SIU_IMUX12_MUXSEL2_WIDTH                 2u
#define SIU_IMUX12_MUXSEL2(x)                    (((uint32_t)(((uint32_t)(x))<<SIU_IMUX12_MUXSEL2_SHIFT))&SIU_IMUX12_MUXSEL2_MASK)

/*!
 * @}
 */ /* end of group SIU_Register_Masks */


/*!
 * @}
 */ /* end of group SIU_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SIU_B Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_B_Peripheral_Access_Layer SIU_B Peripheral Access Layer
 * @{
 */


/** SIU_B - Size of Registers Arrays */
#define SIU_B_PCRM_COUNT                         4u
#define SIU_B_GPDOM_COUNT                        4u
#define SIU_B_GPDIM_COUNT                        4u

/** SIU_B - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[544];
  __IO uint16_t PCRM[SIU_B_PCRM_COUNT];            /**< Pad Configuration Register Mirrored, array offset: 0x220, array step: 0x2 */
       uint8_t RESERVED_1[1224];
  __IO uint8_t GPDOM[SIU_B_GPDOM_COUNT];           /**< GPIO Pin Data Output Register Mirrored, array offset: 0x6F0, array step: 0x1 */
       uint8_t RESERVED_2[508];
  __I  uint8_t GPDIM[SIU_B_GPDIM_COUNT];           /**< GPIO Pin Data Input Register Mirrored, array offset: 0x8F0, array step: 0x1 */
} SIU_B_Type, *SIU_B_MemMapPtr;

