neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the SIU_B module. */
#define SIU_B_INSTANCE_COUNT                     (1u)


/* SIU_B - Peripheral instance base addresses */
/** Peripheral SIU_B base address */
#define SIU_B_BASE                               (0xC3F98000u)
/** Peripheral SIU_B base pointer */
#define SIU_B                                    ((SIU_B_Type *)SIU_B_BASE)
/** Array initializer of SIU_B peripheral base addresses */
#define SIU_B_BASE_ADDRS                         { SIU_B_BASE }
/** Array initializer of SIU_B peripheral base pointers */
#define SIU_B_BASE_PTRS                          { SIU_B }

/* ----------------------------------------------------------------------------
   -- SIU_B Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SIU_B_Register_Masks SIU_B Register Masks
 * @{
 */

/* PCRM Bit Fields */
#define SIU_B_PCRM_WPS_MASK                      0x1u
#define SIU_B_PCRM_WPS_SHIFT                     0u
#define SIU_B_PCRM_WPS_WIDTH                     1u
#define SIU_B_PCRM_WPS(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_WPS_SHIFT))&SIU_B_PCRM_WPS_MASK)
#define SIU_B_PCRM_WPE_MASK                      0x2u
#define SIU_B_PCRM_WPE_SHIFT                     1u
#define SIU_B_PCRM_WPE_WIDTH                     1u
#define SIU_B_PCRM_WPE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_WPE_SHIFT))&SIU_B_PCRM_WPE_MASK)
#define SIU_B_PCRM_SRC_MASK                      0xCu
#define SIU_B_PCRM_SRC_SHIFT                     2u
#define SIU_B_PCRM_SRC_WIDTH                     2u
#define SIU_B_PCRM_SRC(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_SRC_SHIFT))&SIU_B_PCRM_SRC_MASK)
#define SIU_B_PCRM_HYS_MASK                      0x10u
#define SIU_B_PCRM_HYS_SHIFT                     4u
#define SIU_B_PCRM_HYS_WIDTH                     1u
#define SIU_B_PCRM_HYS(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_HYS_SHIFT))&SIU_B_PCRM_HYS_MASK)
#define SIU_B_PCRM_ODE_MASK                      0x20u
#define SIU_B_PCRM_ODE_SHIFT                     5u
#define SIU_B_PCRM_ODE_WIDTH                     1u
#define SIU_B_PCRM_ODE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_ODE_SHIFT))&SIU_B_PCRM_ODE_MASK)
#define SIU_B_PCRM_DSC_MASK                      0xC0u
#define SIU_B_PCRM_DSC_SHIFT                     6u
#define SIU_B_PCRM_DSC_WIDTH                     2u
#define SIU_B_PCRM_DSC(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_DSC_SHIFT))&SIU_B_PCRM_DSC_MASK)
#define SIU_B_PCRM_IBE_MASK                      0x100u
#define SIU_B_PCRM_IBE_SHIFT                     8u
#define SIU_B_PCRM_IBE_WIDTH                     1u
#define SIU_B_PCRM_IBE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_IBE_SHIFT))&SIU_B_PCRM_IBE_MASK)
#define SIU_B_PCRM_OBE_MASK                      0x200u
#define SIU_B_PCRM_OBE_SHIFT                     9u
#define SIU_B_PCRM_OBE_WIDTH                     1u
#define SIU_B_PCRM_OBE(x)                        (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_OBE_SHIFT))&SIU_B_PCRM_OBE_MASK)
#define SIU_B_PCRM_PA_MASK                       0x1C00u
#define SIU_B_PCRM_PA_SHIFT                      10u
#define SIU_B_PCRM_PA_WIDTH                      3u
#define SIU_B_PCRM_PA(x)                         (((uint16_t)(((uint16_t)(x))<<SIU_B_PCRM_PA_SHIFT))&SIU_B_PCRM_PA_MASK)
/* GPDOM Bit Fields */
#define SIU_B_GPDOM_PDOn_MASK                    0x1u
#define SIU_B_GPDOM_PDOn_SHIFT                   0u
#define SIU_B_GPDOM_PDOn_WIDTH                   1u
#define SIU_B_GPDOM_PDOn(x)                      (((uint8_t)(((uint8_t)(x))<<SIU_B_GPDOM_PDOn_SHIFT))&SIU_B_GPDOM_PDOn_MASK)
/* GPDIM Bit Fields */
#define SIU_B_GPDIM_PDIn_MASK                    0x1u
#define SIU_B_GPDIM_PDIn_SHIFT                   0u
#define SIU_B_GPDIM_PDIn_WIDTH                   1u
#define SIU_B_GPDIM_PDIn(x)                      (((uint8_t)(((uint8_t)(x))<<SIU_B_GPDIM_PDIn_SHIFT))&SIU_B_GPDIM_PDIn_MASK)

/*!
 * @}
 */ /* end of group SIU_B_Register_Masks */


/*!
 * @}
 */ /* end of group SIU_B_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SRX Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRX_Peripheral_Access_Layer SRX Peripheral Access Layer
 * @{
 */


/** SRX - Size of Registers Arrays */
#define SRX_CH_COUNT                             6u
#define SRX_CHANNEL_COUNT                        6u

/** SRX - Register Layout Typedef */
typedef struct {
  __IO uint32_t GBL_CTRL;                          /**< Global Control Register, offset: 0x0 */
  __IO uint32_t CHNL_EN;                           /**< Channel Enable Register, offset: 0x4 */
  __IO uint32_t GBL_STATUS;                        /**< Global Status Register, offset: 0x8 */
  __IO uint32_t FMSG_RDY;                          /**< Fast Message Ready Status Register, offset: 0xC */
  __IO uint32_t SMSG_RDY;                          /**< Slow Serial Message Ready Status Register, offset: 0x10 */
       uint8_t RESERVED_0[4];
  __IO uint32_t DATA_CTRL1;                        /**< Data Control Register 1, offset: 0x18 */
       uint8_t RESERVED_1[12];
  __IO uint32_t FDMA_CTRL;                         /**< Fast Message DMA Control Register, offset: 0x28 */
  __IO uint32_t SDMA_CTRL;                         /**< Slow Serial Message DMA Control Register, offset: 0x2C */
       uint8_t RESERVED_2[4];
  __IO uint32_t FRDY_IE;                           /**< Fast Message Ready Interrupt Control Register, offset: 0x34 */
  __IO uint32_t SRDY_IE;                           /**< Slow Serial Message Ready Interrupt Enable Register, offset: 0x38 */
       uint8_t RESERVED_3[4];
  __I  uint32_t DMA_FMSG_DATA;                     /**< DMA Fast Message Data Read Register, offset: 0x40 */
  __I  uint32_t DMA_FMSG_CRC;                      /**< DMA Fast Message CRC Read Register, offset: 0x44 */
  __I  uint32_t DMA_FMSG_TS;                       /**< DMA Fast Message Time Stamp Read Register, offset: 0x48 */
       uint8_t RESERVED_4[4];
  __I  uint32_t DMA_SMSG_BIT3;                     /**< DMA Slow Serial Message Bit3 Read Register, offset: 0x50 */
  __I  uint32_t DMA_SMSG_BIT2;                     /**< DMA Slow Serial Message Bit2 Read Register, offset: 0x54 */
  __I  uint32_t DMA_SMSG_TS;                       /**< DMA Slow Serial Message Time Stamp Read Register, offset: 0x58 */
       uint8_t RESERVED_5[4];
  struct {                                         /* offset: 0x60, array step: 0x10 */
    __IO uint32_t CLK_CTRL;                          /**< Channel 'n' Clock Control Register (n = 0 to (CH-1)), array offset: 0x60, array step: 0x10 */
    __IO uint32_t STATUS;                            /**< Channel 'n' Status Register (n=0 to (CH-1)), array offset: 0x64, array step: 0x10 */
    __IO uint32_t CONFIG;                            /**< Channel 'n' Configuration Register (n=0 to (CH-1)), array offset: 0x68, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } CH[SRX_CH_COUNT];
       uint8_t RESERVED_6[160];
  struct {                                         /* offset: 0x160, array step: 0x18 */
    __I  uint32_t FMSG_DATA;                         /**< Channel 'n' Fast Message Data Read Register (n=0 to (CH-1)), array offset: 0x160, array step: 0x18 */
    __I  uint32_t FMSG_CRC;                          /**< Channel 'n' Fast Message CRC Read Register (n=0 to (CH-1)), array offset: 0x164, array step: 0x18 */
    __I  uint32_t FMSG_TS;                           /**< Channel 'n' Fast Message Time Stamp Read Register (n=0 to (CH-1)), array offset: 0x168, array step: 0x18 */
    __I  uint32_t SMSG_BIT3;                         /**< Channel 'n' Serial Message Read Register (Bit 3) (n=0 to (CH-1)), array offset: 0x16C, array step: 0x18 */
    __I  uint32_t SMSG_BIT2;                         /**< Channel 'n' Serial Message Read Register (Bit 2)(n=0 to (CH-1)), array offset: 0x170, array step: 0x18 */
    __I  uint32_t SMSG_TS;                           /**< Channel 'n' Serial Message Time Stamp Read Register (n=0 to (CH-1)), array offset: 0x174, array step: 0x18 */
  } CHANNEL[SRX_CHANNEL_COUNT];
} SRX_Type, *SRX_MemMapPtr;

 /** Number of instances of the SRX module. */
#define SRX_INSTANCE_COUNT                       (2u)


