neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* SRX - Peripheral instance base addresses */
/** Peripheral SRX_0 base address */
#define SRX_0_BASE                               (0xFFE5C000u)
/** Peripheral SRX_0 base pointer */
#define SRX_0                                    ((SRX_Type *)SRX_0_BASE)
/** Peripheral SRX_1 base address */
#define SRX_1_BASE                               (0xC3E5C000u)
/** Peripheral SRX_1 base pointer */
#define SRX_1                                    ((SRX_Type *)SRX_1_BASE)
/** Array initializer of SRX peripheral base addresses */
#define SRX_BASE_ADDRS                           { SRX_0_BASE, SRX_1_BASE }
/** Array initializer of SRX peripheral base pointers */
#define SRX_BASE_PTRS                            { SRX_0, SRX_1 }

/* ----------------------------------------------------------------------------
   -- SRX Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SRX_Register_Masks SRX Register Masks
 * @{
 */

/* GBL_CTRL Bit Fields */
#define SRX_GBL_CTRL_SENT_EN_MASK                0x1u
#define SRX_GBL_CTRL_SENT_EN_SHIFT               0u
#define SRX_GBL_CTRL_SENT_EN_WIDTH               1u
#define SRX_GBL_CTRL_SENT_EN(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_SENT_EN_SHIFT))&SRX_GBL_CTRL_SENT_EN_MASK)
#define SRX_GBL_CTRL_DBG_FRZ_MASK                0x4u
#define SRX_GBL_CTRL_DBG_FRZ_SHIFT               2u
#define SRX_GBL_CTRL_DBG_FRZ_WIDTH               1u
#define SRX_GBL_CTRL_DBG_FRZ(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_DBG_FRZ_SHIFT))&SRX_GBL_CTRL_DBG_FRZ_MASK)
#define SRX_GBL_CTRL_FAST_CLR_MASK               0x10u
#define SRX_GBL_CTRL_FAST_CLR_SHIFT              4u
#define SRX_GBL_CTRL_FAST_CLR_WIDTH              1u
#define SRX_GBL_CTRL_FAST_CLR(x)                 (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_FAST_CLR_SHIFT))&SRX_GBL_CTRL_FAST_CLR_MASK)
#define SRX_GBL_CTRL_FIFO_EN_MASK                0x40u
#define SRX_GBL_CTRL_FIFO_EN_SHIFT               6u
#define SRX_GBL_CTRL_FIFO_EN_WIDTH               1u
#define SRX_GBL_CTRL_FIFO_EN(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_FIFO_EN_SHIFT))&SRX_GBL_CTRL_FIFO_EN_MASK)
#define SRX_GBL_CTRL_SMDUIE_MASK                 0x100u
#define SRX_GBL_CTRL_SMDUIE_SHIFT                8u
#define SRX_GBL_CTRL_SMDUIE_WIDTH                1u
#define SRX_GBL_CTRL_SMDUIE(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_SMDUIE_SHIFT))&SRX_GBL_CTRL_SMDUIE_MASK)
#define SRX_GBL_CTRL_FMDUIE_MASK                 0x200u
#define SRX_GBL_CTRL_FMDUIE_SHIFT                9u
#define SRX_GBL_CTRL_FMDUIE_WIDTH                1u
#define SRX_GBL_CTRL_FMDUIE(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_FMDUIE_SHIFT))&SRX_GBL_CTRL_FMDUIE_MASK)
#define SRX_GBL_CTRL_FMFOIE_MASK                 0x400u
#define SRX_GBL_CTRL_FMFOIE_SHIFT                10u
#define SRX_GBL_CTRL_FMFOIE_WIDTH                1u
#define SRX_GBL_CTRL_FMFOIE(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_FMFOIE_SHIFT))&SRX_GBL_CTRL_FMFOIE_MASK)
#define SRX_GBL_CTRL_NIB_LEN_VAR_LIMIT_MASK      0x8000u
#define SRX_GBL_CTRL_NIB_LEN_VAR_LIMIT_SHIFT     15u
#define SRX_GBL_CTRL_NIB_LEN_VAR_LIMIT_WIDTH     1u
#define SRX_GBL_CTRL_NIB_LEN_VAR_LIMIT(x)        (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_NIB_LEN_VAR_LIMIT_SHIFT))&SRX_GBL_CTRL_NIB_LEN_VAR_LIMIT_MASK)
#define SRX_GBL_CTRL_FIFOWM_MASK                 0x1F0000u
#define SRX_GBL_CTRL_FIFOWM_SHIFT                16u
#define SRX_GBL_CTRL_FIFOWM_WIDTH                5u
#define SRX_GBL_CTRL_FIFOWM(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_FIFOWM_SHIFT))&SRX_GBL_CTRL_FIFOWM_MASK)
#define SRX_GBL_CTRL_TSPRSC_MASK                 0xFF000000u
#define SRX_GBL_CTRL_TSPRSC_SHIFT                24u
#define SRX_GBL_CTRL_TSPRSC_WIDTH                8u
#define SRX_GBL_CTRL_TSPRSC(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_CTRL_TSPRSC_SHIFT))&SRX_GBL_CTRL_TSPRSC_MASK)
/* CHNL_EN Bit Fields */
#define SRX_CHNL_EN_EN_CH_MASK                   0x3Fu
#define SRX_CHNL_EN_EN_CH_SHIFT                  0u
#define SRX_CHNL_EN_EN_CH_WIDTH                  6u
#define SRX_CHNL_EN_EN_CH(x)                     (((uint32_t)(((uint32_t)(x))<<SRX_CHNL_EN_EN_CH_SHIFT))&SRX_CHNL_EN_EN_CH_MASK)
/* GBL_STATUS Bit Fields */
#define SRX_GBL_STATUS_SMDU_MASK                 0x100u
#define SRX_GBL_STATUS_SMDU_SHIFT                8u
#define SRX_GBL_STATUS_SMDU_WIDTH                1u
#define SRX_GBL_STATUS_SMDU(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_STATUS_SMDU_SHIFT))&SRX_GBL_STATUS_SMDU_MASK)
#define SRX_GBL_STATUS_FMDU_MASK                 0x200u
#define SRX_GBL_STATUS_FMDU_SHIFT                9u
#define SRX_GBL_STATUS_FMDU_WIDTH                1u
#define SRX_GBL_STATUS_FMDU(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_STATUS_FMDU_SHIFT))&SRX_GBL_STATUS_FMDU_MASK)
#define SRX_GBL_STATUS_FMFO_MASK                 0x400u
#define SRX_GBL_STATUS_FMFO_SHIFT                10u
#define SRX_GBL_STATUS_FMFO_WIDTH                1u
#define SRX_GBL_STATUS_FMFO(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_GBL_STATUS_FMFO_SHIFT))&SRX_GBL_STATUS_FMFO_MASK)
/* FMSG_RDY Bit Fields */
#define SRX_FMSG_RDY_F_RDY_MASK                  0x3Fu
#define SRX_FMSG_RDY_F_RDY_SHIFT                 0u
#define SRX_FMSG_RDY_F_RDY_WIDTH                 6u
#define SRX_FMSG_RDY_F_RDY(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_RDY_F_RDY_SHIFT))&SRX_FMSG_RDY_F_RDY_MASK)
/* SMSG_RDY Bit Fields */
#define SRX_SMSG_RDY_S_RDY_MASK                  0x3Fu
#define SRX_SMSG_RDY_S_RDY_SHIFT                 0u
#define SRX_SMSG_RDY_S_RDY_WIDTH                 6u
#define SRX_SMSG_RDY_S_RDY(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_RDY_S_RDY_SHIFT))&SRX_SMSG_RDY_S_RDY_MASK)
/* DATA_CTRL1 Bit Fields */
#define SRX_DATA_CTRL1_NIBBCH5_MASK              0x700u
#define SRX_DATA_CTRL1_NIBBCH5_SHIFT             8u
#define SRX_DATA_CTRL1_NIBBCH5_WIDTH             3u
#define SRX_DATA_CTRL1_NIBBCH5(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DATA_CTRL1_NIBBCH5_SHIFT))&SRX_DATA_CTRL1_NIBBCH5_MASK)
#define SRX_DATA_CTRL1_NIBBCH4_MASK              0x7000u
#define SRX_DATA_CTRL1_NIBBCH4_SHIFT             12u
#define SRX_DATA_CTRL1_NIBBCH4_WIDTH             3u
#define SRX_DATA_CTRL1_NIBBCH4(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DATA_CTRL1_NIBBCH4_SHIFT))&SRX_DATA_CTRL1_NIBBCH4_MASK)
#define SRX_DATA_CTRL1_NIBBCH3_MASK              0x70000u
#define SRX_DATA_CTRL1_NIBBCH3_SHIFT             16u
#define SRX_DATA_CTRL1_NIBBCH3_WIDTH             3u
#define SRX_DATA_CTRL1_NIBBCH3(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DATA_CTRL1_NIBBCH3_SHIFT))&SRX_DATA_CTRL1_NIBBCH3_MASK)
#define SRX_DATA_CTRL1_NIBBCH2_MASK              0x700000u
#define SRX_DATA_CTRL1_NIBBCH2_SHIFT             20u
#define SRX_DATA_CTRL1_NIBBCH2_WIDTH             3u
#define SRX_DATA_CTRL1_NIBBCH2(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DATA_CTRL1_NIBBCH2_SHIFT))&SRX_DATA_CTRL1_NIBBCH2_MASK)
#define SRX_DATA_CTRL1_NIBBCH1_MASK              0x7000000u
#define SRX_DATA_CTRL1_NIBBCH1_SHIFT             24u
#define SRX_DATA_CTRL1_NIBBCH1_WIDTH             3u
#define SRX_DATA_CTRL1_NIBBCH1(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DATA_CTRL1_NIBBCH1_SHIFT))&SRX_DATA_CTRL1_NIBBCH1_MASK)
#define SRX_DATA_CTRL1_NIBBCH0_MASK              0x70000000u
#define SRX_DATA_CTRL1_NIBBCH0_SHIFT             28u
#define SRX_DATA_CTRL1_NIBBCH0_WIDTH             3u
#define SRX_DATA_CTRL1_NIBBCH0(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DATA_CTRL1_NIBBCH0_SHIFT))&SRX_DATA_CTRL1_NIBBCH0_MASK)
/* FDMA_CTRL Bit Fields */
#define SRX_FDMA_CTRL_FDMA_EN_MASK               0x3Fu
#define SRX_FDMA_CTRL_FDMA_EN_SHIFT              0u
#define SRX_FDMA_CTRL_FDMA_EN_WIDTH              6u
#define SRX_FDMA_CTRL_FDMA_EN(x)                 (((uint32_t)(((uint32_t)(x))<<SRX_FDMA_CTRL_FDMA_EN_SHIFT))&SRX_FDMA_CTRL_FDMA_EN_MASK)
/* SDMA_CTRL Bit Fields */
#define SRX_SDMA_CTRL_SDMA_EN_MASK               0x3Fu
#define SRX_SDMA_CTRL_SDMA_EN_SHIFT              0u
#define SRX_SDMA_CTRL_SDMA_EN_WIDTH              6u
#define SRX_SDMA_CTRL_SDMA_EN(x)                 (((uint32_t)(((uint32_t)(x))<<SRX_SDMA_CTRL_SDMA_EN_SHIFT))&SRX_SDMA_CTRL_SDMA_EN_MASK)
/* FRDY_IE Bit Fields */
#define SRX_FRDY_IE_FRDY_IE_MASK                 0x3Fu
#define SRX_FRDY_IE_FRDY_IE_SHIFT                0u
#define SRX_FRDY_IE_FRDY_IE_WIDTH                6u
#define SRX_FRDY_IE_FRDY_IE(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FRDY_IE_FRDY_IE_SHIFT))&SRX_FRDY_IE_FRDY_IE_MASK)
/* SRDY_IE Bit Fields */
#define SRX_SRDY_IE_SRDY_IE_MASK                 0x3Fu
#define SRX_SRDY_IE_SRDY_IE_SHIFT                0u
#define SRX_SRDY_IE_SRDY_IE_WIDTH                6u
#define SRX_SRDY_IE_SRDY_IE(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_SRDY_IE_SRDY_IE_SHIFT))&SRX_SRDY_IE_SRDY_IE_MASK)
/* DMA_FMSG_DATA Bit Fields */
#define SRX_DMA_FMSG_DATA_DNIB6_MASK             0xFu
#define SRX_DMA_FMSG_DATA_DNIB6_SHIFT            0u
#define SRX_DMA_FMSG_DATA_DNIB6_WIDTH            4u
#define SRX_DMA_FMSG_DATA_DNIB6(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_DNIB6_SHIFT))&SRX_DMA_FMSG_DATA_DNIB6_MASK)
#define SRX_DMA_FMSG_DATA_DNIB5_MASK             0xF0u
#define SRX_DMA_FMSG_DATA_DNIB5_SHIFT            4u
#define SRX_DMA_FMSG_DATA_DNIB5_WIDTH            4u
#define SRX_DMA_FMSG_DATA_DNIB5(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_DNIB5_SHIFT))&SRX_DMA_FMSG_DATA_DNIB5_MASK)
#define SRX_DMA_FMSG_DATA_DNIB4_MASK             0xF00u
#define SRX_DMA_FMSG_DATA_DNIB4_SHIFT            8u
#define SRX_DMA_FMSG_DATA_DNIB4_WIDTH            4u
#define SRX_DMA_FMSG_DATA_DNIB4(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_DNIB4_SHIFT))&SRX_DMA_FMSG_DATA_DNIB4_MASK)
#define SRX_DMA_FMSG_DATA_DNIB3_MASK             0xF000u
#define SRX_DMA_FMSG_DATA_DNIB3_SHIFT            12u
#define SRX_DMA_FMSG_DATA_DNIB3_WIDTH            4u
#define SRX_DMA_FMSG_DATA_DNIB3(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_DNIB3_SHIFT))&SRX_DMA_FMSG_DATA_DNIB3_MASK)
#define SRX_DMA_FMSG_DATA_DNIB2_MASK             0xF0000u
#define SRX_DMA_FMSG_DATA_DNIB2_SHIFT            16u
#define SRX_DMA_FMSG_DATA_DNIB2_WIDTH            4u
#define SRX_DMA_FMSG_DATA_DNIB2(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_DNIB2_SHIFT))&SRX_DMA_FMSG_DATA_DNIB2_MASK)
#define SRX_DMA_FMSG_DATA_DNIB1_MASK             0xF00000u
#define SRX_DMA_FMSG_DATA_DNIB1_SHIFT            20u
#define SRX_DMA_FMSG_DATA_DNIB1_WIDTH            4u
#define SRX_DMA_FMSG_DATA_DNIB1(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_DNIB1_SHIFT))&SRX_DMA_FMSG_DATA_DNIB1_MASK)
#define SRX_DMA_FMSG_DATA_SCNIB_MASK             0xF000000u
#define SRX_DMA_FMSG_DATA_SCNIB_SHIFT            24u
#define SRX_DMA_FMSG_DATA_SCNIB_WIDTH            4u
#define SRX_DMA_FMSG_DATA_SCNIB(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_SCNIB_SHIFT))&SRX_DMA_FMSG_DATA_SCNIB_MASK)
#define SRX_DMA_FMSG_DATA_CHNUM_MASK             0xF0000000u
#define SRX_DMA_FMSG_DATA_CHNUM_SHIFT            28u
#define SRX_DMA_FMSG_DATA_CHNUM_WIDTH            4u
#define SRX_DMA_FMSG_DATA_CHNUM(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_DATA_CHNUM_SHIFT))&SRX_DMA_FMSG_DATA_CHNUM_MASK)
/* DMA_FMSG_CRC Bit Fields */
#define SRX_DMA_FMSG_CRC_CRC4b_MASK              0xF0000u
#define SRX_DMA_FMSG_CRC_CRC4b_SHIFT             16u
#define SRX_DMA_FMSG_CRC_CRC4b_WIDTH             4u
#define SRX_DMA_FMSG_CRC_CRC4b(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_CRC_CRC4b_SHIFT))&SRX_DMA_FMSG_CRC_CRC4b_MASK)
/* DMA_FMSG_TS Bit Fields */
#define SRX_DMA_FMSG_TS_TS_MASK                  0xFFFFFFFFu
#define SRX_DMA_FMSG_TS_TS_SHIFT                 0u
#define SRX_DMA_FMSG_TS_TS_WIDTH                 32u
#define SRX_DMA_FMSG_TS_TS(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_DMA_FMSG_TS_TS_SHIFT))&SRX_DMA_FMSG_TS_TS_MASK)
/* DMA_SMSG_BIT3 Bit Fields */
#define SRX_DMA_SMSG_BIT3_ID3_0_DATA15_12_MASK   0x1Eu
#define SRX_DMA_SMSG_BIT3_ID3_0_DATA15_12_SHIFT  1u
#define SRX_DMA_SMSG_BIT3_ID3_0_DATA15_12_WIDTH  4u
#define SRX_DMA_SMSG_BIT3_ID3_0_DATA15_12(x)     (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT3_ID3_0_DATA15_12_SHIFT))&SRX_DMA_SMSG_BIT3_ID3_0_DATA15_12_MASK)
#define SRX_DMA_SMSG_BIT3_ID7_4_ID3_0_MASK       0x3C0u
#define SRX_DMA_SMSG_BIT3_ID7_4_ID3_0_SHIFT      6u
#define SRX_DMA_SMSG_BIT3_ID7_4_ID3_0_WIDTH      4u
#define SRX_DMA_SMSG_BIT3_ID7_4_ID3_0(x)         (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT3_ID7_4_ID3_0_SHIFT))&SRX_DMA_SMSG_BIT3_ID7_4_ID3_0_MASK)
#define SRX_DMA_SMSG_BIT3_CFG_MASK               0x400u
#define SRX_DMA_SMSG_BIT3_CFG_SHIFT              10u
#define SRX_DMA_SMSG_BIT3_CFG_WIDTH              1u
#define SRX_DMA_SMSG_BIT3_CFG(x)                 (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT3_CFG_SHIFT))&SRX_DMA_SMSG_BIT3_CFG_MASK)
#define SRX_DMA_SMSG_BIT3_TYPE_MASK              0x8000000u
#define SRX_DMA_SMSG_BIT3_TYPE_SHIFT             27u
#define SRX_DMA_SMSG_BIT3_TYPE_WIDTH             1u
#define SRX_DMA_SMSG_BIT3_TYPE(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT3_TYPE_SHIFT))&SRX_DMA_SMSG_BIT3_TYPE_MASK)
#define SRX_DMA_SMSG_BIT3_CHNUM_MASK             0xF0000000u
#define SRX_DMA_SMSG_BIT3_CHNUM_SHIFT            28u
#define SRX_DMA_SMSG_BIT3_CHNUM_WIDTH            4u
#define SRX_DMA_SMSG_BIT3_CHNUM(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT3_CHNUM_SHIFT))&SRX_DMA_SMSG_BIT3_CHNUM_MASK)
/* DMA_SMSG_BIT2 Bit Fields */
#define SRX_DMA_SMSG_BIT2_DATA_MASK              0xFFFu
#define SRX_DMA_SMSG_BIT2_DATA_SHIFT             0u
#define SRX_DMA_SMSG_BIT2_DATA_WIDTH             12u
#define SRX_DMA_SMSG_BIT2_DATA(x)                (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT2_DATA_SHIFT))&SRX_DMA_SMSG_BIT2_DATA_MASK)
#define SRX_DMA_SMSG_BIT2_SMCRC_MASK             0x3F0000u
#define SRX_DMA_SMSG_BIT2_SMCRC_SHIFT            16u
#define SRX_DMA_SMSG_BIT2_SMCRC_WIDTH            6u
#define SRX_DMA_SMSG_BIT2_SMCRC(x)               (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_BIT2_SMCRC_SHIFT))&SRX_DMA_SMSG_BIT2_SMCRC_MASK)
/* DMA_SMSG_TS Bit Fields */
#define SRX_DMA_SMSG_TS_TS_MASK                  0xFFFFFFFFu
#define SRX_DMA_SMSG_TS_TS_SHIFT                 0u
#define SRX_DMA_SMSG_TS_TS_WIDTH                 32u
#define SRX_DMA_SMSG_TS_TS(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_DMA_SMSG_TS_TS_SHIFT))&SRX_DMA_SMSG_TS_TS_MASK)
/* CLK_CTRL Bit Fields */
#define SRX_CLK_CTRL_PRSC_MASK                   0x3FFFu
#define SRX_CLK_CTRL_PRSC_SHIFT                  0u
#define SRX_CLK_CTRL_PRSC_WIDTH                  14u
#define SRX_CLK_CTRL_PRSC(x)                     (((uint32_t)(((uint32_t)(x))<<SRX_CLK_CTRL_PRSC_SHIFT))&SRX_CLK_CTRL_PRSC_MASK)
#define SRX_CLK_CTRL_COMP_EN_MASK                0x8000u
#define SRX_CLK_CTRL_COMP_EN_SHIFT               15u
#define SRX_CLK_CTRL_COMP_EN_WIDTH               1u
#define SRX_CLK_CTRL_COMP_EN(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_CLK_CTRL_COMP_EN_SHIFT))&SRX_CLK_CTRL_COMP_EN_MASK)
#define SRX_CLK_CTRL_CM_PRSC_MASK                0x7FFF0000u
#define SRX_CLK_CTRL_CM_PRSC_SHIFT               16u
#define SRX_CLK_CTRL_CM_PRSC_WIDTH               15u
#define SRX_CLK_CTRL_CM_PRSC(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_CLK_CTRL_CM_PRSC_SHIFT))&SRX_CLK_CTRL_CM_PRSC_MASK)
/* STATUS Bit Fields */
#define SRX_STATUS_NUM_EDGES_ERR_MASK            0x10000u
#define SRX_STATUS_NUM_EDGES_ERR_SHIFT           16u
#define SRX_STATUS_NUM_EDGES_ERR_WIDTH           1u
#define SRX_STATUS_NUM_EDGES_ERR(x)              (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_NUM_EDGES_ERR_SHIFT))&SRX_STATUS_NUM_EDGES_ERR_MASK)
#define SRX_STATUS_FMSG_CRC_ERR_MASK             0x20000u
#define SRX_STATUS_FMSG_CRC_ERR_SHIFT            17u
#define SRX_STATUS_FMSG_CRC_ERR_WIDTH            1u
#define SRX_STATUS_FMSG_CRC_ERR(x)               (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_FMSG_CRC_ERR_SHIFT))&SRX_STATUS_FMSG_CRC_ERR_MASK)
#define SRX_STATUS_SMSG_CRC_ERR_MASK             0x40000u
#define SRX_STATUS_SMSG_CRC_ERR_SHIFT            18u
#define SRX_STATUS_SMSG_CRC_ERR_WIDTH            1u
#define SRX_STATUS_SMSG_CRC_ERR(x)               (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_SMSG_CRC_ERR_SHIFT))&SRX_STATUS_SMSG_CRC_ERR_MASK)
#define SRX_STATUS_NIB_VAL_ERR_MASK              0x80000u
#define SRX_STATUS_NIB_VAL_ERR_SHIFT             19u
#define SRX_STATUS_NIB_VAL_ERR_WIDTH             1u
#define SRX_STATUS_NIB_VAL_ERR(x)                (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_NIB_VAL_ERR_SHIFT))&SRX_STATUS_NIB_VAL_ERR_MASK)
#define SRX_STATUS_CAL_DIAG_ERR_MASK             0x100000u
#define SRX_STATUS_CAL_DIAG_ERR_SHIFT            20u
#define SRX_STATUS_CAL_DIAG_ERR_WIDTH            1u
#define SRX_STATUS_CAL_DIAG_ERR(x)               (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_CAL_DIAG_ERR_SHIFT))&SRX_STATUS_CAL_DIAG_ERR_MASK)
#define SRX_STATUS_CAL_LEN_ERR_MASK              0x200000u
#define SRX_STATUS_CAL_LEN_ERR_SHIFT             21u
#define SRX_STATUS_CAL_LEN_ERR_WIDTH             1u
#define SRX_STATUS_CAL_LEN_ERR(x)                (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_CAL_LEN_ERR_SHIFT))&SRX_STATUS_CAL_LEN_ERR_MASK)
#define SRX_STATUS_PP_DIAG_ERR_MASK              0x400000u
#define SRX_STATUS_PP_DIAG_ERR_SHIFT             22u
#define SRX_STATUS_PP_DIAG_ERR_WIDTH             1u
#define SRX_STATUS_PP_DIAG_ERR(x)                (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_PP_DIAG_ERR_SHIFT))&SRX_STATUS_PP_DIAG_ERR_MASK)
#define SRX_STATUS_FMSG_OFLW_MASK                0x1000000u
#define SRX_STATUS_FMSG_OFLW_SHIFT               24u
#define SRX_STATUS_FMSG_OFLW_WIDTH               1u
#define SRX_STATUS_FMSG_OFLW(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_FMSG_OFLW_SHIFT))&SRX_STATUS_FMSG_OFLW_MASK)
#define SRX_STATUS_SMSG_OFLW_MASK                0x2000000u
#define SRX_STATUS_SMSG_OFLW_SHIFT               25u
#define SRX_STATUS_SMSG_OFLW_WIDTH               1u
#define SRX_STATUS_SMSG_OFLW(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_SMSG_OFLW_SHIFT))&SRX_STATUS_SMSG_OFLW_MASK)
#define SRX_STATUS_CAL_20_25_MASK                0x4000000u
#define SRX_STATUS_CAL_20_25_SHIFT               26u
#define SRX_STATUS_CAL_20_25_WIDTH               1u
#define SRX_STATUS_CAL_20_25(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_CAL_20_25_SHIFT))&SRX_STATUS_CAL_20_25_MASK)
#define SRX_STATUS_CAL_RESYNC_MASK               0x8000000u
#define SRX_STATUS_CAL_RESYNC_SHIFT              27u
#define SRX_STATUS_CAL_RESYNC_WIDTH              1u
#define SRX_STATUS_CAL_RESYNC(x)                 (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_CAL_RESYNC_SHIFT))&SRX_STATUS_CAL_RESYNC_MASK)
#define SRX_STATUS_BUS_IDLE_MASK                 0x80000000u
#define SRX_STATUS_BUS_IDLE_SHIFT                31u
#define SRX_STATUS_BUS_IDLE_WIDTH                1u
#define SRX_STATUS_BUS_IDLE(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_STATUS_BUS_IDLE_SHIFT))&SRX_STATUS_BUS_IDLE_MASK)
/* CONFIG Bit Fields */
#define SRX_CONFIG_FIL_CNT_MASK                  0xFFu
#define SRX_CONFIG_FIL_CNT_SHIFT                 0u
#define SRX_CONFIG_FIL_CNT_WIDTH                 8u
#define SRX_CONFIG_FIL_CNT(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_FIL_CNT_SHIFT))&SRX_CONFIG_FIL_CNT_MASK)
#define SRX_CONFIG_SUCC_CAL_CHK_MASK             0x100u
#define SRX_CONFIG_SUCC_CAL_CHK_SHIFT            8u
#define SRX_CONFIG_SUCC_CAL_CHK_WIDTH            1u
#define SRX_CONFIG_SUCC_CAL_CHK(x)               (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_SUCC_CAL_CHK_SHIFT))&SRX_CONFIG_SUCC_CAL_CHK_MASK)
#define SRX_CONFIG_PAUSE_EN_MASK                 0x200u
#define SRX_CONFIG_PAUSE_EN_SHIFT                9u
#define SRX_CONFIG_PAUSE_EN_WIDTH                1u
#define SRX_CONFIG_PAUSE_EN(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_PAUSE_EN_SHIFT))&SRX_CONFIG_PAUSE_EN_MASK)
#define SRX_CONFIG_SCRC_TYPE_MASK                0x400u
#define SRX_CONFIG_SCRC_TYPE_SHIFT               10u
#define SRX_CONFIG_SCRC_TYPE_WIDTH               1u
#define SRX_CONFIG_SCRC_TYPE(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_SCRC_TYPE_SHIFT))&SRX_CONFIG_SCRC_TYPE_MASK)
#define SRX_CONFIG_FCRC_SC_EN_MASK               0x800u
#define SRX_CONFIG_FCRC_SC_EN_SHIFT              11u
#define SRX_CONFIG_FCRC_SC_EN_WIDTH              1u
#define SRX_CONFIG_FCRC_SC_EN(x)                 (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_FCRC_SC_EN_SHIFT))&SRX_CONFIG_FCRC_SC_EN_MASK)
#define SRX_CONFIG_FCRC_TYPE_MASK                0x1000u
#define SRX_CONFIG_FCRC_TYPE_SHIFT               12u
#define SRX_CONFIG_FCRC_TYPE_WIDTH               1u
#define SRX_CONFIG_FCRC_TYPE(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_FCRC_TYPE_SHIFT))&SRX_CONFIG_FCRC_TYPE_MASK)
#define SRX_CONFIG_PP_CHKSEL_MASK                0x2000u
#define SRX_CONFIG_PP_CHKSEL_SHIFT               13u
#define SRX_CONFIG_PP_CHKSEL_WIDTH               1u
#define SRX_CONFIG_PP_CHKSEL(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_PP_CHKSEL_SHIFT))&SRX_CONFIG_PP_CHKSEL_MASK)
#define SRX_CONFIG_CAL_RNG_MASK                  0x4000u
#define SRX_CONFIG_CAL_RNG_SHIFT                 14u
#define SRX_CONFIG_CAL_RNG_WIDTH                 1u
#define SRX_CONFIG_CAL_RNG(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_CAL_RNG_SHIFT))&SRX_CONFIG_CAL_RNG_MASK)
#define SRX_CONFIG_DCHNG_INT_MASK                0x8000u
#define SRX_CONFIG_DCHNG_INT_SHIFT               15u
#define SRX_CONFIG_DCHNG_INT_WIDTH               1u
#define SRX_CONFIG_DCHNG_INT(x)                  (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_DCHNG_INT_SHIFT))&SRX_CONFIG_DCHNG_INT_MASK)
#define SRX_CONFIG_IE_NUM_EDGES_ERR_MASK         0x10000u
#define SRX_CONFIG_IE_NUM_EDGES_ERR_SHIFT        16u
#define SRX_CONFIG_IE_NUM_EDGES_ERR_WIDTH        1u
#define SRX_CONFIG_IE_NUM_EDGES_ERR(x)           (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_NUM_EDGES_ERR_SHIFT))&SRX_CONFIG_IE_NUM_EDGES_ERR_MASK)
#define SRX_CONFIG_IE_FMSG_CRC_ERR_MASK          0x20000u
#define SRX_CONFIG_IE_FMSG_CRC_ERR_SHIFT         17u
#define SRX_CONFIG_IE_FMSG_CRC_ERR_WIDTH         1u
#define SRX_CONFIG_IE_FMSG_CRC_ERR(x)            (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_FMSG_CRC_ERR_SHIFT))&SRX_CONFIG_IE_FMSG_CRC_ERR_MASK)
#define SRX_CONFIG_IE_SMSG_CRC_ERR_MASK          0x40000u
#define SRX_CONFIG_IE_SMSG_CRC_ERR_SHIFT         18u
#define SRX_CONFIG_IE_SMSG_CRC_ERR_WIDTH         1u
#define SRX_CONFIG_IE_SMSG_CRC_ERR(x)            (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_SMSG_CRC_ERR_SHIFT))&SRX_CONFIG_IE_SMSG_CRC_ERR_MASK)
#define SRX_CONFIG_IE_NIB_VAL_ERR_MASK           0x80000u
#define SRX_CONFIG_IE_NIB_VAL_ERR_SHIFT          19u
#define SRX_CONFIG_IE_NIB_VAL_ERR_WIDTH          1u
#define SRX_CONFIG_IE_NIB_VAL_ERR(x)             (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_NIB_VAL_ERR_SHIFT))&SRX_CONFIG_IE_NIB_VAL_ERR_MASK)
#define SRX_CONFIG_IE_CAL_DIAG_ERR_MASK          0x100000u
#define SRX_CONFIG_IE_CAL_DIAG_ERR_SHIFT         20u
#define SRX_CONFIG_IE_CAL_DIAG_ERR_WIDTH         1u
#define SRX_CONFIG_IE_CAL_DIAG_ERR(x)            (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_CAL_DIAG_ERR_SHIFT))&SRX_CONFIG_IE_CAL_DIAG_ERR_MASK)
#define SRX_CONFIG_IE_CAL_LEN_ERR_MASK           0x200000u
#define SRX_CONFIG_IE_CAL_LEN_ERR_SHIFT          21u
#define SRX_CONFIG_IE_CAL_LEN_ERR_WIDTH          1u
#define SRX_CONFIG_IE_CAL_LEN_ERR(x)             (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_CAL_LEN_ERR_SHIFT))&SRX_CONFIG_IE_CAL_LEN_ERR_MASK)
#define SRX_CONFIG_IE_PP_DIAG_ERR_MASK           0x400000u
#define SRX_CONFIG_IE_PP_DIAG_ERR_SHIFT          22u
#define SRX_CONFIG_IE_PP_DIAG_ERR_WIDTH          1u
