neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define SRX_CONFIG_IE_PP_DIAG_ERR(x)             (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_PP_DIAG_ERR_SHIFT))&SRX_CONFIG_IE_PP_DIAG_ERR_MASK)
#define SRX_CONFIG_FCRC_CHK_OFF_MASK             0x800000u
#define SRX_CONFIG_FCRC_CHK_OFF_SHIFT            23u
#define SRX_CONFIG_FCRC_CHK_OFF_WIDTH            1u
#define SRX_CONFIG_FCRC_CHK_OFF(x)               (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_FCRC_CHK_OFF_SHIFT))&SRX_CONFIG_FCRC_CHK_OFF_MASK)
#define SRX_CONFIG_IE_FMSG_OFLW_MASK             0x1000000u
#define SRX_CONFIG_IE_FMSG_OFLW_SHIFT            24u
#define SRX_CONFIG_IE_FMSG_OFLW_WIDTH            1u
#define SRX_CONFIG_IE_FMSG_OFLW(x)               (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_FMSG_OFLW_SHIFT))&SRX_CONFIG_IE_FMSG_OFLW_MASK)
#define SRX_CONFIG_IE_SMSG_OFLW_MASK             0x2000000u
#define SRX_CONFIG_IE_SMSG_OFLW_SHIFT            25u
#define SRX_CONFIG_IE_SMSG_OFLW_WIDTH            1u
#define SRX_CONFIG_IE_SMSG_OFLW(x)               (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_SMSG_OFLW_SHIFT))&SRX_CONFIG_IE_SMSG_OFLW_MASK)
#define SRX_CONFIG_IE_CAL_20_25_MASK             0x4000000u
#define SRX_CONFIG_IE_CAL_20_25_SHIFT            26u
#define SRX_CONFIG_IE_CAL_20_25_WIDTH            1u
#define SRX_CONFIG_IE_CAL_20_25(x)               (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_CAL_20_25_SHIFT))&SRX_CONFIG_IE_CAL_20_25_MASK)
#define SRX_CONFIG_IE_CAL_RESYNC_MASK            0x8000000u
#define SRX_CONFIG_IE_CAL_RESYNC_SHIFT           27u
#define SRX_CONFIG_IE_CAL_RESYNC_WIDTH           1u
#define SRX_CONFIG_IE_CAL_RESYNC(x)              (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_IE_CAL_RESYNC_SHIFT))&SRX_CONFIG_IE_CAL_RESYNC_MASK)
#define SRX_CONFIG_BUS_IDLE_CNT_MASK             0xF0000000u
#define SRX_CONFIG_BUS_IDLE_CNT_SHIFT            28u
#define SRX_CONFIG_BUS_IDLE_CNT_WIDTH            4u
#define SRX_CONFIG_BUS_IDLE_CNT(x)               (((uint32_t)(((uint32_t)(x))<<SRX_CONFIG_BUS_IDLE_CNT_SHIFT))&SRX_CONFIG_BUS_IDLE_CNT_MASK)
/* FMSG_DATA Bit Fields */
#define SRX_FMSG_DATA_DNIB6_MASK                 0xFu
#define SRX_FMSG_DATA_DNIB6_SHIFT                0u
#define SRX_FMSG_DATA_DNIB6_WIDTH                4u
#define SRX_FMSG_DATA_DNIB6(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_DNIB6_SHIFT))&SRX_FMSG_DATA_DNIB6_MASK)
#define SRX_FMSG_DATA_DNIB5_MASK                 0xF0u
#define SRX_FMSG_DATA_DNIB5_SHIFT                4u
#define SRX_FMSG_DATA_DNIB5_WIDTH                4u
#define SRX_FMSG_DATA_DNIB5(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_DNIB5_SHIFT))&SRX_FMSG_DATA_DNIB5_MASK)
#define SRX_FMSG_DATA_DNIB4_MASK                 0xF00u
#define SRX_FMSG_DATA_DNIB4_SHIFT                8u
#define SRX_FMSG_DATA_DNIB4_WIDTH                4u
#define SRX_FMSG_DATA_DNIB4(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_DNIB4_SHIFT))&SRX_FMSG_DATA_DNIB4_MASK)
#define SRX_FMSG_DATA_DNIB3_MASK                 0xF000u
#define SRX_FMSG_DATA_DNIB3_SHIFT                12u
#define SRX_FMSG_DATA_DNIB3_WIDTH                4u
#define SRX_FMSG_DATA_DNIB3(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_DNIB3_SHIFT))&SRX_FMSG_DATA_DNIB3_MASK)
#define SRX_FMSG_DATA_DNIB2_MASK                 0xF0000u
#define SRX_FMSG_DATA_DNIB2_SHIFT                16u
#define SRX_FMSG_DATA_DNIB2_WIDTH                4u
#define SRX_FMSG_DATA_DNIB2(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_DNIB2_SHIFT))&SRX_FMSG_DATA_DNIB2_MASK)
#define SRX_FMSG_DATA_DNIB1_MASK                 0xF00000u
#define SRX_FMSG_DATA_DNIB1_SHIFT                20u
#define SRX_FMSG_DATA_DNIB1_WIDTH                4u
#define SRX_FMSG_DATA_DNIB1(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_DNIB1_SHIFT))&SRX_FMSG_DATA_DNIB1_MASK)
#define SRX_FMSG_DATA_SCNIB_MASK                 0xF000000u
#define SRX_FMSG_DATA_SCNIB_SHIFT                24u
#define SRX_FMSG_DATA_SCNIB_WIDTH                4u
#define SRX_FMSG_DATA_SCNIB(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_SCNIB_SHIFT))&SRX_FMSG_DATA_SCNIB_MASK)
#define SRX_FMSG_DATA_CHNUM_MASK                 0xF0000000u
#define SRX_FMSG_DATA_CHNUM_SHIFT                28u
#define SRX_FMSG_DATA_CHNUM_WIDTH                4u
#define SRX_FMSG_DATA_CHNUM(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_DATA_CHNUM_SHIFT))&SRX_FMSG_DATA_CHNUM_MASK)
/* FMSG_CRC Bit Fields */
#define SRX_FMSG_CRC_CRC4b_MASK                  0xF0000u
#define SRX_FMSG_CRC_CRC4b_SHIFT                 16u
#define SRX_FMSG_CRC_CRC4b_WIDTH                 4u
#define SRX_FMSG_CRC_CRC4b(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_CRC_CRC4b_SHIFT))&SRX_FMSG_CRC_CRC4b_MASK)
/* FMSG_TS Bit Fields */
#define SRX_FMSG_TS_TS_MASK                      0xFFFFFFFFu
#define SRX_FMSG_TS_TS_SHIFT                     0u
#define SRX_FMSG_TS_TS_WIDTH                     32u
#define SRX_FMSG_TS_TS(x)                        (((uint32_t)(((uint32_t)(x))<<SRX_FMSG_TS_TS_SHIFT))&SRX_FMSG_TS_TS_MASK)
/* SMSG_BIT3 Bit Fields */
#define SRX_SMSG_BIT3_ID3_0_DATA15_12_MASK       0x1Eu
#define SRX_SMSG_BIT3_ID3_0_DATA15_12_SHIFT      1u
#define SRX_SMSG_BIT3_ID3_0_DATA15_12_WIDTH      4u
#define SRX_SMSG_BIT3_ID3_0_DATA15_12(x)         (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT3_ID3_0_DATA15_12_SHIFT))&SRX_SMSG_BIT3_ID3_0_DATA15_12_MASK)
#define SRX_SMSG_BIT3_ID7_4_ID3_0_MASK           0x3C0u
#define SRX_SMSG_BIT3_ID7_4_ID3_0_SHIFT          6u
#define SRX_SMSG_BIT3_ID7_4_ID3_0_WIDTH          4u
#define SRX_SMSG_BIT3_ID7_4_ID3_0(x)             (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT3_ID7_4_ID3_0_SHIFT))&SRX_SMSG_BIT3_ID7_4_ID3_0_MASK)
#define SRX_SMSG_BIT3_CFG_MASK                   0x400u
#define SRX_SMSG_BIT3_CFG_SHIFT                  10u
#define SRX_SMSG_BIT3_CFG_WIDTH                  1u
#define SRX_SMSG_BIT3_CFG(x)                     (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT3_CFG_SHIFT))&SRX_SMSG_BIT3_CFG_MASK)
#define SRX_SMSG_BIT3_TYPE_MASK                  0x8000000u
#define SRX_SMSG_BIT3_TYPE_SHIFT                 27u
#define SRX_SMSG_BIT3_TYPE_WIDTH                 1u
#define SRX_SMSG_BIT3_TYPE(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT3_TYPE_SHIFT))&SRX_SMSG_BIT3_TYPE_MASK)
#define SRX_SMSG_BIT3_CHNUM_MASK                 0xF0000000u
#define SRX_SMSG_BIT3_CHNUM_SHIFT                28u
#define SRX_SMSG_BIT3_CHNUM_WIDTH                4u
#define SRX_SMSG_BIT3_CHNUM(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT3_CHNUM_SHIFT))&SRX_SMSG_BIT3_CHNUM_MASK)
/* SMSG_BIT2 Bit Fields */
#define SRX_SMSG_BIT2_DATA_MASK                  0xFFFu
#define SRX_SMSG_BIT2_DATA_SHIFT                 0u
#define SRX_SMSG_BIT2_DATA_WIDTH                 12u
#define SRX_SMSG_BIT2_DATA(x)                    (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT2_DATA_SHIFT))&SRX_SMSG_BIT2_DATA_MASK)
#define SRX_SMSG_BIT2_SMCRC_MASK                 0x3F0000u
#define SRX_SMSG_BIT2_SMCRC_SHIFT                16u
#define SRX_SMSG_BIT2_SMCRC_WIDTH                6u
#define SRX_SMSG_BIT2_SMCRC(x)                   (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_BIT2_SMCRC_SHIFT))&SRX_SMSG_BIT2_SMCRC_MASK)
/* SMSG_TS Bit Fields */
#define SRX_SMSG_TS_TS_MASK                      0xFFFFFFFFu
#define SRX_SMSG_TS_TS_SHIFT                     0u
#define SRX_SMSG_TS_TS_WIDTH                     32u
#define SRX_SMSG_TS_TS(x)                        (((uint32_t)(((uint32_t)(x))<<SRX_SMSG_TS_TS_SHIFT))&SRX_SMSG_TS_TS_MASK)

/*!
 * @}
 */ /* end of group SRX_Register_Masks */


/*!
 * @}
 */ /* end of group SRX_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SSCM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SSCM_Peripheral_Access_Layer SSCM Peripheral Access Layer
 * @{
 */


/** SSCM - Size of Registers Arrays */

