neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** SSCM - Register Layout Typedef */
typedef struct {
  __IO uint16_t STATUS;                            /**< SSCM System Status, offset: 0x0 */
       uint8_t RESERVED_0[4];
  __IO uint16_t ERROR;                             /**< SSCM Error Configuration Register, offset: 0x6 */
       uint8_t RESERVED_1[44];
  __I  uint32_t LCSTAT;                            /**< Life Cycle Status Register, offset: 0x34 */
} SSCM_Type, *SSCM_MemMapPtr;

 /** Number of instances of the SSCM module. */
#define SSCM_INSTANCE_COUNT                      (1u)


/* SSCM - Peripheral instance base addresses */
/** Peripheral SSCM base address */
#define SSCM_BASE                                (0xFFFF8000u)
/** Peripheral SSCM base pointer */
#define SSCM                                     ((SSCM_Type *)SSCM_BASE)
/** Array initializer of SSCM peripheral base addresses */
#define SSCM_BASE_ADDRS                          { SSCM_BASE }
/** Array initializer of SSCM peripheral base pointers */
#define SSCM_BASE_PTRS                           { SSCM }

/* ----------------------------------------------------------------------------
   -- SSCM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SSCM_Register_Masks SSCM Register Masks
 * @{
 */

/* STATUS Bit Fields */
#define SSCM_STATUS_NXEN_MASK                    0x800u
#define SSCM_STATUS_NXEN_SHIFT                   11u
#define SSCM_STATUS_NXEN_WIDTH                   1u
#define SSCM_STATUS_NXEN(x)                      (((uint16_t)(((uint16_t)(x))<<SSCM_STATUS_NXEN_SHIFT))&SSCM_STATUS_NXEN_MASK)
#define SSCM_STATUS_NXEN1_MASK                   0x1000u
#define SSCM_STATUS_NXEN1_SHIFT                  12u
#define SSCM_STATUS_NXEN1_WIDTH                  1u
#define SSCM_STATUS_NXEN1(x)                     (((uint16_t)(((uint16_t)(x))<<SSCM_STATUS_NXEN1_SHIFT))&SSCM_STATUS_NXEN1_MASK)
#define SSCM_STATUS_MER_MASK                     0x2000u
#define SSCM_STATUS_MER_SHIFT                    13u
#define SSCM_STATUS_MER_WIDTH                    1u
#define SSCM_STATUS_MER(x)                       (((uint16_t)(((uint16_t)(x))<<SSCM_STATUS_MER_SHIFT))&SSCM_STATUS_MER_MASK)
#define SSCM_STATUS_CER_MASK                     0x4000u
#define SSCM_STATUS_CER_SHIFT                    14u
#define SSCM_STATUS_CER_WIDTH                    1u
#define SSCM_STATUS_CER(x)                       (((uint16_t)(((uint16_t)(x))<<SSCM_STATUS_CER_SHIFT))&SSCM_STATUS_CER_MASK)
/* ERROR Bit Fields */
#define SSCM_ERROR_PAE_MASK                      0x2u
#define SSCM_ERROR_PAE_SHIFT                     1u
#define SSCM_ERROR_PAE_WIDTH                     1u
#define SSCM_ERROR_PAE(x)                        (((uint16_t)(((uint16_t)(x))<<SSCM_ERROR_PAE_SHIFT))&SSCM_ERROR_PAE_MASK)
/* LCSTAT Bit Fields */
#define SSCM_LCSTAT_LC_MASK                      0x7u
#define SSCM_LCSTAT_LC_SHIFT                     0u
#define SSCM_LCSTAT_LC_WIDTH                     3u
#define SSCM_LCSTAT_LC(x)                        (((uint32_t)(((uint32_t)(x))<<SSCM_LCSTAT_LC_SHIFT))&SSCM_LCSTAT_LC_MASK)

/*!
 * @}
 */ /* end of group SSCM_Register_Masks */


/*!
 * @}
 */ /* end of group SSCM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- STCU2 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup STCU2_Peripheral_Access_Layer STCU2 Peripheral Access Layer
 * @{
 */


/** STCU2 - Size of Registers Arrays */
#define STCU2_LB_COUNT                           6u
#define STCU2_MB_CTRL_COUNT                      65u

/** STCU2 - Register Layout Typedef */
typedef struct {
  __IO uint32_t RUN;                               /**< STCU2 Run Register, offset: 0x0 */
  __IO uint32_t RUNSW;                             /**< STCU2 Run Software Register, offset: 0x4 */
  __O  uint32_t SKC;                               /**< STCU2 SK Code Register, offset: 0x8 */
  __IO uint32_t CFG;                               /**< STCU2 Configuration Register, offset: 0xC */
  __IO uint32_t PLL_CFG;                           /**< STCU2 PLL Configuration Register, offset: 0x10 */
  __IO uint32_t WDG;                               /**< STCU2 Watchdog Granularity, offset: 0x14 */
  __IO uint32_t INT_FLG;                           /**< STCU2 Interrupt Flag Register, offset: 0x18 */
       uint8_t RESERVED_0[8];
  __IO uint32_t ERR_STAT;                          /**< STCU2 Error Register, offset: 0x24 */
  __IO uint32_t ERR_FM;                            /**< STCU2 Error FM Register, offset: 0x28 */
  __I  uint32_t LBS;                               /**< STCU2 Off-Line LBIST Status Register, offset: 0x2C */
  __I  uint32_t LBE;                               /**< STCU2 Off-Line LBIST End Flag Register, offset: 0x30 */
  __I  uint32_t LBSSW;                             /**< STCU2 On-Line LBIST Status Register, offset: 0x34 */
  __I  uint32_t LBESW;                             /**< STCU2 On-Line LBIST End Flag Register, offset: 0x38 */
  __IO uint32_t LBRMSW;                            /**< STCU2 On-Line LBIST Reset Management, offset: 0x3C */
  __IO uint32_t LBUFM;                             /**< STCU2 LBIST Unrecoverable FM Register, offset: 0x40 */
  __I  uint32_t MBSL;                              /**< STCU2 Off-Line MBIST Status Low Register, offset: 0x44 */
  __I  uint32_t MBSM;                              /**< STCU2 Off-Line MBIST Status Medium Register, offset: 0x48 */
  __I  uint32_t MBSH;                              /**< STCU2 Off-Line MBIST Status High Register, offset: 0x4C */
  __I  uint32_t MBEL;                              /**< STCU2 Off-Line MBIST End Flag Low Register, offset: 0x50 */
  __I  uint32_t MBEM;                              /**< STCU2 Off-Line MBIST End Flag Medium Register, offset: 0x54 */
  __I  uint32_t MBEH;                              /**< STCU2 Off-Line MBIST End Flag High Register, offset: 0x58 */
  __I  uint32_t MBSLSW;                            /**< STCU2 On-Line MBIST Status Low Register, offset: 0x5C */
  __I  uint32_t MBSMSW;                            /**< STCU2 On-Line MBIST Status Medium Register, offset: 0x60 */
  __I  uint32_t MBSHSW;                            /**< STCU2 On-Line MBIST Status High Register, offset: 0x64 */
  __I  uint32_t MBELSW;                            /**< STCU2 On-Line MBIST End Flag Low Register, offset: 0x68 */
  __I  uint32_t MBEMSW;                            /**< STCU2 On-Line MBIST End Flag Medium Register, offset: 0x6C */
  __I  uint32_t MBEHSW;                            /**< STCU2 On-Line MBIST End Flag High Register, offset: 0x70 */
  __IO uint32_t MBUFML;                            /**< STCU2 MBIST Unrecoverable FM Low Register, offset: 0x74 */
  __IO uint32_t MBUFMM;                            /**< STCU2 MBIST Unrecoverable FM Medium Register, offset: 0x78 */
  __IO uint32_t MBUFMH;                            /**< STCU2 MBIST Unrecoverable FM High Register, offset: 0x7C */
       uint8_t RESERVED_1[128];
  struct {                                         /* offset: 0x100, array step: 0x40 */
    __IO uint32_t CTRL;                              /**< STCU2 LBIST Control, array offset: 0x100, array step: 0x40 */
    __IO uint32_t PCS;                               /**< STCU2 LBIST PC Stop Register, array offset: 0x104, array step: 0x40 */
         uint8_t RESERVED_0[8];
    __IO uint32_t MISREL;                            /**< STCU2 Off-Line LBIST MISR Expected Low Register, array offset: 0x110, array step: 0x40 */
    __IO uint32_t MISREH;                            /**< STCU2 Off-Line LBIST MISR Expected High Register, array offset: 0x114, array step: 0x40 */
    __I  uint32_t MISRRL;                            /**< STCU2 Off-Line LBIST MISR Read Low Register, array offset: 0x118, array step: 0x40 */
    __I  uint32_t MISRRH;                            /**< STCU2 Off-Line LBIST MISR Read High Register, array offset: 0x11C, array step: 0x40 */
    __IO uint32_t MISRELSW;                          /**< STCU2 On-Line LBIST MISR Expected Low Register, array offset: 0x120, array step: 0x40 */
    __IO uint32_t MISREHSW;                          /**< STCU2 On-Line LBIST MISR Expected High Register, array offset: 0x124, array step: 0x40 */
    __I  uint32_t MISRRLSW;                          /**< STCU2 On-Line LBIST MISR Read Low Register, array offset: 0x128, array step: 0x40 */
    __I  uint32_t MISRRHSW;                          /**< STCU2 On-Line LBIST MISR Read High Register, array offset: 0x12C, array step: 0x40 */
         uint8_t RESERVED_1[16];
  } LB[STCU2_LB_COUNT];
       uint8_t RESERVED_2[896];
  __IO uint32_t MB_CTRL[STCU2_MB_CTRL_COUNT];      /**< STCU2 MBIST Control Register, array offset: 0x600, array step: 0x4 */
} STCU2_Type, *STCU2_MemMapPtr;

 /** Number of instances of the STCU2 module. */
#define STCU2_INSTANCE_COUNT                     (1u)


