neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* STCU2 - Peripheral instance base addresses */
/** Peripheral STCU2 base address */
#define STCU2_BASE                               (0xC3FF4000u)
/** Peripheral STCU2 base pointer */
#define STCU2                                    ((STCU2_Type *)STCU2_BASE)
/** Array initializer of STCU2 peripheral base addresses */
#define STCU2_BASE_ADDRS                         { STCU2_BASE }
/** Array initializer of STCU2 peripheral base pointers */
#define STCU2_BASE_PTRS                          { STCU2 }

/* ----------------------------------------------------------------------------
   -- STCU2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup STCU2_Register_Masks STCU2 Register Masks
 * @{
 */

/* RUN Bit Fields */
#define STCU2_RUN_RUN_MASK                       0x1u
#define STCU2_RUN_RUN_SHIFT                      0u
#define STCU2_RUN_RUN_WIDTH                      1u
#define STCU2_RUN_RUN(x)                         (((uint32_t)(((uint32_t)(x))<<STCU2_RUN_RUN_SHIFT))&STCU2_RUN_RUN_MASK)
#define STCU2_RUN_LBPLLEN_MASK                   0x100u
#define STCU2_RUN_LBPLLEN_SHIFT                  8u
#define STCU2_RUN_LBPLLEN_WIDTH                  1u
#define STCU2_RUN_LBPLLEN(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_RUN_LBPLLEN_SHIFT))&STCU2_RUN_LBPLLEN_MASK)
#define STCU2_RUN_MBPLLEN_MASK                   0x200u
#define STCU2_RUN_MBPLLEN_SHIFT                  9u
#define STCU2_RUN_MBPLLEN_WIDTH                  1u
#define STCU2_RUN_MBPLLEN(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_RUN_MBPLLEN_SHIFT))&STCU2_RUN_MBPLLEN_MASK)
#define STCU2_RUN_BYP_MASK                       0x400u
#define STCU2_RUN_BYP_SHIFT                      10u
#define STCU2_RUN_BYP_WIDTH                      1u
#define STCU2_RUN_BYP(x)                         (((uint32_t)(((uint32_t)(x))<<STCU2_RUN_BYP_SHIFT))&STCU2_RUN_BYP_MASK)
/* RUNSW Bit Fields */
#define STCU2_RUNSW_RUNSW_MASK                   0x1u
#define STCU2_RUNSW_RUNSW_SHIFT                  0u
#define STCU2_RUNSW_RUNSW_WIDTH                  1u
#define STCU2_RUNSW_RUNSW(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_RUNSW_RUNSW_SHIFT))&STCU2_RUNSW_RUNSW_MASK)
#define STCU2_RUNSW_LBSWPLLEN_MASK               0x100u
#define STCU2_RUNSW_LBSWPLLEN_SHIFT              8u
#define STCU2_RUNSW_LBSWPLLEN_WIDTH              1u
#define STCU2_RUNSW_LBSWPLLEN(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_RUNSW_LBSWPLLEN_SHIFT))&STCU2_RUNSW_LBSWPLLEN_MASK)
#define STCU2_RUNSW_MBSWPLLEN_MASK               0x200u
#define STCU2_RUNSW_MBSWPLLEN_SHIFT              9u
#define STCU2_RUNSW_MBSWPLLEN_WIDTH              1u
#define STCU2_RUNSW_MBSWPLLEN(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_RUNSW_MBSWPLLEN_SHIFT))&STCU2_RUNSW_MBSWPLLEN_MASK)
#define STCU2_RUNSW_MBIE_MASK                    0x800u
#define STCU2_RUNSW_MBIE_SHIFT                   11u
#define STCU2_RUNSW_MBIE_WIDTH                   1u
#define STCU2_RUNSW_MBIE(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_RUNSW_MBIE_SHIFT))&STCU2_RUNSW_MBIE_MASK)
/* SKC Bit Fields */
#define STCU2_SKC_SKC_MASK                       0xFFFFFFFFu
#define STCU2_SKC_SKC_SHIFT                      0u
#define STCU2_SKC_SKC_WIDTH                      32u
#define STCU2_SKC_SKC(x)                         (((uint32_t)(((uint32_t)(x))<<STCU2_SKC_SKC_SHIFT))&STCU2_SKC_SKC_MASK)
/* CFG Bit Fields */
#define STCU2_CFG_CLK_CFG_MASK                   0x7u
#define STCU2_CFG_CLK_CFG_SHIFT                  0u
#define STCU2_CFG_CLK_CFG_WIDTH                  3u
#define STCU2_CFG_CLK_CFG(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_CFG_CLK_CFG_SHIFT))&STCU2_CFG_CLK_CFG_MASK)
#define STCU2_CFG_MBU_MASK                       0x8u
#define STCU2_CFG_MBU_SHIFT                      3u
#define STCU2_CFG_MBU_WIDTH                      1u
#define STCU2_CFG_MBU(x)                         (((uint32_t)(((uint32_t)(x))<<STCU2_CFG_MBU_SHIFT))&STCU2_CFG_MBU_MASK)
#define STCU2_CFG_PMOSEN_MASK                    0x10u
#define STCU2_CFG_PMOSEN_SHIFT                   4u
#define STCU2_CFG_PMOSEN_WIDTH                   1u
#define STCU2_CFG_PMOSEN(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_CFG_PMOSEN_SHIFT))&STCU2_CFG_PMOSEN_MASK)
#define STCU2_CFG_WRP_MASK                       0x100u
#define STCU2_CFG_WRP_SHIFT                      8u
#define STCU2_CFG_WRP_WIDTH                      1u
#define STCU2_CFG_WRP(x)                         (((uint32_t)(((uint32_t)(x))<<STCU2_CFG_WRP_SHIFT))&STCU2_CFG_WRP_MASK)
#define STCU2_CFG_LB_DELAY_MASK                  0xFF0000u
#define STCU2_CFG_LB_DELAY_SHIFT                 16u
#define STCU2_CFG_LB_DELAY_WIDTH                 8u
#define STCU2_CFG_LB_DELAY(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_CFG_LB_DELAY_SHIFT))&STCU2_CFG_LB_DELAY_MASK)
#define STCU2_CFG_PTR_MASK                       0x7F000000u
#define STCU2_CFG_PTR_SHIFT                      24u
#define STCU2_CFG_PTR_WIDTH                      7u
#define STCU2_CFG_PTR(x)                         (((uint32_t)(((uint32_t)(x))<<STCU2_CFG_PTR_SHIFT))&STCU2_CFG_PTR_MASK)
/* PLL_CFG Bit Fields */
#define STCU2_PLL_CFG_PLLLDF_MASK                0x7Fu
#define STCU2_PLL_CFG_PLLLDF_SHIFT               0u
#define STCU2_PLL_CFG_PLLLDF_WIDTH               7u
#define STCU2_PLL_CFG_PLLLDF(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_PLL_CFG_PLLLDF_SHIFT))&STCU2_PLL_CFG_PLLLDF_MASK)
#define STCU2_PLL_CFG_PLLIDF_MASK                0x70000u
#define STCU2_PLL_CFG_PLLIDF_SHIFT               16u
#define STCU2_PLL_CFG_PLLIDF_WIDTH               3u
#define STCU2_PLL_CFG_PLLIDF(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_PLL_CFG_PLLIDF_SHIFT))&STCU2_PLL_CFG_PLLIDF_MASK)
#define STCU2_PLL_CFG_PLLODF_MASK                0x3F000000u
#define STCU2_PLL_CFG_PLLODF_SHIFT               24u
#define STCU2_PLL_CFG_PLLODF_WIDTH               6u
#define STCU2_PLL_CFG_PLLODF(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_PLL_CFG_PLLODF_SHIFT))&STCU2_PLL_CFG_PLLODF_MASK)
/* WDG Bit Fields */
#define STCU2_WDG_WDGEOC_MASK                    0xFFFFFFFFu
#define STCU2_WDG_WDGEOC_SHIFT                   0u
#define STCU2_WDG_WDGEOC_WIDTH                   32u
#define STCU2_WDG_WDGEOC(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_WDG_WDGEOC_SHIFT))&STCU2_WDG_WDGEOC_MASK)
/* INT_FLG Bit Fields */
#define STCU2_INT_FLG_MBIFLG_MASK                0x2u
#define STCU2_INT_FLG_MBIFLG_SHIFT               1u
#define STCU2_INT_FLG_MBIFLG_WIDTH               1u
#define STCU2_INT_FLG_MBIFLG(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_INT_FLG_MBIFLG_SHIFT))&STCU2_INT_FLG_MBIFLG_MASK)
/* ERR_STAT Bit Fields */
#define STCU2_ERR_STAT_INVP_MASK                 0x1u
#define STCU2_ERR_STAT_INVP_SHIFT                0u
#define STCU2_ERR_STAT_INVP_WIDTH                1u
#define STCU2_ERR_STAT_INVP(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_INVP_SHIFT))&STCU2_ERR_STAT_INVP_MASK)
#define STCU2_ERR_STAT_ENGE_MASK                 0x2u
#define STCU2_ERR_STAT_ENGE_SHIFT                1u
#define STCU2_ERR_STAT_ENGE_WIDTH                1u
#define STCU2_ERR_STAT_ENGE(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_ENGE_SHIFT))&STCU2_ERR_STAT_ENGE_MASK)
#define STCU2_ERR_STAT_WDTO_MASK                 0x8u
#define STCU2_ERR_STAT_WDTO_SHIFT                3u
#define STCU2_ERR_STAT_WDTO_WIDTH                1u
#define STCU2_ERR_STAT_WDTO(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_WDTO_SHIFT))&STCU2_ERR_STAT_WDTO_MASK)
#define STCU2_ERR_STAT_LOCKE_MASK                0x10u
#define STCU2_ERR_STAT_LOCKE_SHIFT               4u
#define STCU2_ERR_STAT_LOCKE_WIDTH               1u
#define STCU2_ERR_STAT_LOCKE(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_LOCKE_SHIFT))&STCU2_ERR_STAT_LOCKE_MASK)
#define STCU2_ERR_STAT_RFSF_MASK                 0x100u
#define STCU2_ERR_STAT_RFSF_SHIFT                8u
#define STCU2_ERR_STAT_RFSF_WIDTH                1u
#define STCU2_ERR_STAT_RFSF(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_RFSF_SHIFT))&STCU2_ERR_STAT_RFSF_MASK)
#define STCU2_ERR_STAT_UFSF_MASK                 0x200u
#define STCU2_ERR_STAT_UFSF_SHIFT                9u
#define STCU2_ERR_STAT_UFSF_WIDTH                1u
#define STCU2_ERR_STAT_UFSF(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_UFSF_SHIFT))&STCU2_ERR_STAT_UFSF_MASK)
#define STCU2_ERR_STAT_INVPSW_MASK               0x10000u
#define STCU2_ERR_STAT_INVPSW_SHIFT              16u
#define STCU2_ERR_STAT_INVPSW_WIDTH              1u
#define STCU2_ERR_STAT_INVPSW(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_INVPSW_SHIFT))&STCU2_ERR_STAT_INVPSW_MASK)
#define STCU2_ERR_STAT_ENGESW_MASK               0x20000u
#define STCU2_ERR_STAT_ENGESW_SHIFT              17u
#define STCU2_ERR_STAT_ENGESW_WIDTH              1u
#define STCU2_ERR_STAT_ENGESW(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_ENGESW_SHIFT))&STCU2_ERR_STAT_ENGESW_MASK)
#define STCU2_ERR_STAT_WDTOSW_MASK               0x80000u
#define STCU2_ERR_STAT_WDTOSW_SHIFT              19u
#define STCU2_ERR_STAT_WDTOSW_WIDTH              1u
#define STCU2_ERR_STAT_WDTOSW(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_WDTOSW_SHIFT))&STCU2_ERR_STAT_WDTOSW_MASK)
#define STCU2_ERR_STAT_LOCKESW_MASK              0x100000u
#define STCU2_ERR_STAT_LOCKESW_SHIFT             20u
#define STCU2_ERR_STAT_LOCKESW_WIDTH             1u
#define STCU2_ERR_STAT_LOCKESW(x)                (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_STAT_LOCKESW_SHIFT))&STCU2_ERR_STAT_LOCKESW_MASK)
/* ERR_FM Bit Fields */
#define STCU2_ERR_FM_INVPUFM_MASK                0x1u
#define STCU2_ERR_FM_INVPUFM_SHIFT               0u
#define STCU2_ERR_FM_INVPUFM_WIDTH               1u
#define STCU2_ERR_FM_INVPUFM(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_FM_INVPUFM_SHIFT))&STCU2_ERR_FM_INVPUFM_MASK)
#define STCU2_ERR_FM_ENGEUFM_MASK                0x2u
#define STCU2_ERR_FM_ENGEUFM_SHIFT               1u
#define STCU2_ERR_FM_ENGEUFM_WIDTH               1u
#define STCU2_ERR_FM_ENGEUFM(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_FM_ENGEUFM_SHIFT))&STCU2_ERR_FM_ENGEUFM_MASK)
#define STCU2_ERR_FM_WDTOUFM_MASK                0x8u
#define STCU2_ERR_FM_WDTOUFM_SHIFT               3u
#define STCU2_ERR_FM_WDTOUFM_WIDTH               1u
#define STCU2_ERR_FM_WDTOUFM(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_FM_WDTOUFM_SHIFT))&STCU2_ERR_FM_WDTOUFM_MASK)
#define STCU2_ERR_FM_LOCKEUFM_MASK               0x10u
#define STCU2_ERR_FM_LOCKEUFM_SHIFT              4u
#define STCU2_ERR_FM_LOCKEUFM_WIDTH              1u
#define STCU2_ERR_FM_LOCKEUFM(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_ERR_FM_LOCKEUFM_SHIFT))&STCU2_ERR_FM_LOCKEUFM_MASK)
/* LBS Bit Fields */
#define STCU2_LBS_LBS0_MASK                      0x1u
#define STCU2_LBS_LBS0_SHIFT                     0u
#define STCU2_LBS_LBS0_WIDTH                     1u
#define STCU2_LBS_LBS0(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBS_LBS0_SHIFT))&STCU2_LBS_LBS0_MASK)
#define STCU2_LBS_LBS1_MASK                      0x2u
#define STCU2_LBS_LBS1_SHIFT                     1u
#define STCU2_LBS_LBS1_WIDTH                     1u
#define STCU2_LBS_LBS1(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBS_LBS1_SHIFT))&STCU2_LBS_LBS1_MASK)
#define STCU2_LBS_LBS2_MASK                      0x4u
#define STCU2_LBS_LBS2_SHIFT                     2u
#define STCU2_LBS_LBS2_WIDTH                     1u
#define STCU2_LBS_LBS2(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBS_LBS2_SHIFT))&STCU2_LBS_LBS2_MASK)
#define STCU2_LBS_LBS3_MASK                      0x8u
#define STCU2_LBS_LBS3_SHIFT                     3u
#define STCU2_LBS_LBS3_WIDTH                     1u
#define STCU2_LBS_LBS3(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBS_LBS3_SHIFT))&STCU2_LBS_LBS3_MASK)
#define STCU2_LBS_LBS4_MASK                      0x10u
#define STCU2_LBS_LBS4_SHIFT                     4u
#define STCU2_LBS_LBS4_WIDTH                     1u
#define STCU2_LBS_LBS4(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBS_LBS4_SHIFT))&STCU2_LBS_LBS4_MASK)
#define STCU2_LBS_LBS5_MASK                      0x20u
#define STCU2_LBS_LBS5_SHIFT                     5u
#define STCU2_LBS_LBS5_WIDTH                     1u
#define STCU2_LBS_LBS5(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBS_LBS5_SHIFT))&STCU2_LBS_LBS5_MASK)
/* LBE Bit Fields */
#define STCU2_LBE_LBE0_MASK                      0x1u
#define STCU2_LBE_LBE0_SHIFT                     0u
#define STCU2_LBE_LBE0_WIDTH                     1u
#define STCU2_LBE_LBE0(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBE_LBE0_SHIFT))&STCU2_LBE_LBE0_MASK)
#define STCU2_LBE_LBE1_MASK                      0x2u
#define STCU2_LBE_LBE1_SHIFT                     1u
#define STCU2_LBE_LBE1_WIDTH                     1u
#define STCU2_LBE_LBE1(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBE_LBE1_SHIFT))&STCU2_LBE_LBE1_MASK)
#define STCU2_LBE_LBE2_MASK                      0x4u
#define STCU2_LBE_LBE2_SHIFT                     2u
#define STCU2_LBE_LBE2_WIDTH                     1u
#define STCU2_LBE_LBE2(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBE_LBE2_SHIFT))&STCU2_LBE_LBE2_MASK)
#define STCU2_LBE_LBE3_MASK                      0x8u
#define STCU2_LBE_LBE3_SHIFT                     3u
#define STCU2_LBE_LBE3_WIDTH                     1u
#define STCU2_LBE_LBE3(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBE_LBE3_SHIFT))&STCU2_LBE_LBE3_MASK)
#define STCU2_LBE_LBE4_MASK                      0x10u
#define STCU2_LBE_LBE4_SHIFT                     4u
#define STCU2_LBE_LBE4_WIDTH                     1u
#define STCU2_LBE_LBE4(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBE_LBE4_SHIFT))&STCU2_LBE_LBE4_MASK)
#define STCU2_LBE_LBE5_MASK                      0x20u
#define STCU2_LBE_LBE5_SHIFT                     5u
#define STCU2_LBE_LBE5_WIDTH                     1u
#define STCU2_LBE_LBE5(x)                        (((uint32_t)(((uint32_t)(x))<<STCU2_LBE_LBE5_SHIFT))&STCU2_LBE_LBE5_MASK)
/* LBSSW Bit Fields */
#define STCU2_LBSSW_LBSSW0_MASK                  0x1u
#define STCU2_LBSSW_LBSSW0_SHIFT                 0u
#define STCU2_LBSSW_LBSSW0_WIDTH                 1u
#define STCU2_LBSSW_LBSSW0(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBSSW_LBSSW0_SHIFT))&STCU2_LBSSW_LBSSW0_MASK)
#define STCU2_LBSSW_LBSSW1_MASK                  0x2u
#define STCU2_LBSSW_LBSSW1_SHIFT                 1u
#define STCU2_LBSSW_LBSSW1_WIDTH                 1u
#define STCU2_LBSSW_LBSSW1(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBSSW_LBSSW1_SHIFT))&STCU2_LBSSW_LBSSW1_MASK)
#define STCU2_LBSSW_LBSSW2_MASK                  0x4u
#define STCU2_LBSSW_LBSSW2_SHIFT                 2u
#define STCU2_LBSSW_LBSSW2_WIDTH                 1u
#define STCU2_LBSSW_LBSSW2(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBSSW_LBSSW2_SHIFT))&STCU2_LBSSW_LBSSW2_MASK)
#define STCU2_LBSSW_LBSSW3_MASK                  0x8u
#define STCU2_LBSSW_LBSSW3_SHIFT                 3u
#define STCU2_LBSSW_LBSSW3_WIDTH                 1u
#define STCU2_LBSSW_LBSSW3(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBSSW_LBSSW3_SHIFT))&STCU2_LBSSW_LBSSW3_MASK)
#define STCU2_LBSSW_LBSSW4_MASK                  0x10u
#define STCU2_LBSSW_LBSSW4_SHIFT                 4u
#define STCU2_LBSSW_LBSSW4_WIDTH                 1u
#define STCU2_LBSSW_LBSSW4(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBSSW_LBSSW4_SHIFT))&STCU2_LBSSW_LBSSW4_MASK)
#define STCU2_LBSSW_LBSSW5_MASK                  0x20u
#define STCU2_LBSSW_LBSSW5_SHIFT                 5u
#define STCU2_LBSSW_LBSSW5_WIDTH                 1u
#define STCU2_LBSSW_LBSSW5(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBSSW_LBSSW5_SHIFT))&STCU2_LBSSW_LBSSW5_MASK)
/* LBESW Bit Fields */
#define STCU2_LBESW_LBESW0_MASK                  0x1u
#define STCU2_LBESW_LBESW0_SHIFT                 0u
#define STCU2_LBESW_LBESW0_WIDTH                 1u
#define STCU2_LBESW_LBESW0(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBESW_LBESW0_SHIFT))&STCU2_LBESW_LBESW0_MASK)
#define STCU2_LBESW_LBESW1_MASK                  0x2u
#define STCU2_LBESW_LBESW1_SHIFT                 1u
#define STCU2_LBESW_LBESW1_WIDTH                 1u
#define STCU2_LBESW_LBESW1(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBESW_LBESW1_SHIFT))&STCU2_LBESW_LBESW1_MASK)
#define STCU2_LBESW_LBESW2_MASK                  0x4u
#define STCU2_LBESW_LBESW2_SHIFT                 2u
#define STCU2_LBESW_LBESW2_WIDTH                 1u
#define STCU2_LBESW_LBESW2(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBESW_LBESW2_SHIFT))&STCU2_LBESW_LBESW2_MASK)
#define STCU2_LBESW_LBESW3_MASK                  0x8u
#define STCU2_LBESW_LBESW3_SHIFT                 3u
#define STCU2_LBESW_LBESW3_WIDTH                 1u
#define STCU2_LBESW_LBESW3(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBESW_LBESW3_SHIFT))&STCU2_LBESW_LBESW3_MASK)
#define STCU2_LBESW_LBESW4_MASK                  0x10u
#define STCU2_LBESW_LBESW4_SHIFT                 4u
#define STCU2_LBESW_LBESW4_WIDTH                 1u
#define STCU2_LBESW_LBESW4(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBESW_LBESW4_SHIFT))&STCU2_LBESW_LBESW4_MASK)
#define STCU2_LBESW_LBESW5_MASK                  0x20u
#define STCU2_LBESW_LBESW5_SHIFT                 5u
#define STCU2_LBESW_LBESW5_WIDTH                 1u
#define STCU2_LBESW_LBESW5(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBESW_LBESW5_SHIFT))&STCU2_LBESW_LBESW5_MASK)
/* LBRMSW Bit Fields */
#define STCU2_LBRMSW_LBRMSW0_MASK                0x1u
#define STCU2_LBRMSW_LBRMSW0_SHIFT               0u
#define STCU2_LBRMSW_LBRMSW0_WIDTH               1u
#define STCU2_LBRMSW_LBRMSW0(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_LBRMSW_LBRMSW0_SHIFT))&STCU2_LBRMSW_LBRMSW0_MASK)
#define STCU2_LBRMSW_LBRMSW1_MASK                0x2u
#define STCU2_LBRMSW_LBRMSW1_SHIFT               1u
#define STCU2_LBRMSW_LBRMSW1_WIDTH               1u
#define STCU2_LBRMSW_LBRMSW1(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_LBRMSW_LBRMSW1_SHIFT))&STCU2_LBRMSW_LBRMSW1_MASK)
#define STCU2_LBRMSW_LBRMSW2_MASK                0x4u
#define STCU2_LBRMSW_LBRMSW2_SHIFT               2u
#define STCU2_LBRMSW_LBRMSW2_WIDTH               1u
#define STCU2_LBRMSW_LBRMSW2(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_LBRMSW_LBRMSW2_SHIFT))&STCU2_LBRMSW_LBRMSW2_MASK)
#define STCU2_LBRMSW_LBRMSW3_MASK                0x8u
#define STCU2_LBRMSW_LBRMSW3_SHIFT               3u
#define STCU2_LBRMSW_LBRMSW3_WIDTH               1u
#define STCU2_LBRMSW_LBRMSW3(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_LBRMSW_LBRMSW3_SHIFT))&STCU2_LBRMSW_LBRMSW3_MASK)
#define STCU2_LBRMSW_LBRMSW4_MASK                0x10u
#define STCU2_LBRMSW_LBRMSW4_SHIFT               4u
#define STCU2_LBRMSW_LBRMSW4_WIDTH               1u
#define STCU2_LBRMSW_LBRMSW4(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_LBRMSW_LBRMSW4_SHIFT))&STCU2_LBRMSW_LBRMSW4_MASK)
#define STCU2_LBRMSW_LBRMSW5_MASK                0x20u
#define STCU2_LBRMSW_LBRMSW5_SHIFT               5u
#define STCU2_LBRMSW_LBRMSW5_WIDTH               1u
#define STCU2_LBRMSW_LBRMSW5(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_LBRMSW_LBRMSW5_SHIFT))&STCU2_LBRMSW_LBRMSW5_MASK)
/* LBUFM Bit Fields */
#define STCU2_LBUFM_LBUFM0_MASK                  0x1u
#define STCU2_LBUFM_LBUFM0_SHIFT                 0u
#define STCU2_LBUFM_LBUFM0_WIDTH                 1u
#define STCU2_LBUFM_LBUFM0(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBUFM_LBUFM0_SHIFT))&STCU2_LBUFM_LBUFM0_MASK)
#define STCU2_LBUFM_LBUFM1_MASK                  0x2u
#define STCU2_LBUFM_LBUFM1_SHIFT                 1u
#define STCU2_LBUFM_LBUFM1_WIDTH                 1u
#define STCU2_LBUFM_LBUFM1(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBUFM_LBUFM1_SHIFT))&STCU2_LBUFM_LBUFM1_MASK)
#define STCU2_LBUFM_LBUFM2_MASK                  0x4u
#define STCU2_LBUFM_LBUFM2_SHIFT                 2u
#define STCU2_LBUFM_LBUFM2_WIDTH                 1u
#define STCU2_LBUFM_LBUFM2(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBUFM_LBUFM2_SHIFT))&STCU2_LBUFM_LBUFM2_MASK)
#define STCU2_LBUFM_LBUFM3_MASK                  0x8u
#define STCU2_LBUFM_LBUFM3_SHIFT                 3u
#define STCU2_LBUFM_LBUFM3_WIDTH                 1u
#define STCU2_LBUFM_LBUFM3(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBUFM_LBUFM3_SHIFT))&STCU2_LBUFM_LBUFM3_MASK)
#define STCU2_LBUFM_LBUFM4_MASK                  0x10u
#define STCU2_LBUFM_LBUFM4_SHIFT                 4u
#define STCU2_LBUFM_LBUFM4_WIDTH                 1u
#define STCU2_LBUFM_LBUFM4(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBUFM_LBUFM4_SHIFT))&STCU2_LBUFM_LBUFM4_MASK)
#define STCU2_LBUFM_LBUFM5_MASK                  0x20u
#define STCU2_LBUFM_LBUFM5_SHIFT                 5u
#define STCU2_LBUFM_LBUFM5_WIDTH                 1u
#define STCU2_LBUFM_LBUFM5(x)                    (((uint32_t)(((uint32_t)(x))<<STCU2_LBUFM_LBUFM5_SHIFT))&STCU2_LBUFM_LBUFM5_MASK)
/* MBSL Bit Fields */
#define STCU2_MBSL_MBS0_MASK                     0x1u
#define STCU2_MBSL_MBS0_SHIFT                    0u
#define STCU2_MBSL_MBS0_WIDTH                    1u
#define STCU2_MBSL_MBS0(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS0_SHIFT))&STCU2_MBSL_MBS0_MASK)
#define STCU2_MBSL_MBS1_MASK                     0x2u
#define STCU2_MBSL_MBS1_SHIFT                    1u
#define STCU2_MBSL_MBS1_WIDTH                    1u
#define STCU2_MBSL_MBS1(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS1_SHIFT))&STCU2_MBSL_MBS1_MASK)
#define STCU2_MBSL_MBS2_MASK                     0x4u
#define STCU2_MBSL_MBS2_SHIFT                    2u
#define STCU2_MBSL_MBS2_WIDTH                    1u
#define STCU2_MBSL_MBS2(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS2_SHIFT))&STCU2_MBSL_MBS2_MASK)
#define STCU2_MBSL_MBS3_MASK                     0x8u
#define STCU2_MBSL_MBS3_SHIFT                    3u
#define STCU2_MBSL_MBS3_WIDTH                    1u
#define STCU2_MBSL_MBS3(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS3_SHIFT))&STCU2_MBSL_MBS3_MASK)
#define STCU2_MBSL_MBS4_MASK                     0x10u
#define STCU2_MBSL_MBS4_SHIFT                    4u
#define STCU2_MBSL_MBS4_WIDTH                    1u
#define STCU2_MBSL_MBS4(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS4_SHIFT))&STCU2_MBSL_MBS4_MASK)
#define STCU2_MBSL_MBS5_MASK                     0x20u
#define STCU2_MBSL_MBS5_SHIFT                    5u
#define STCU2_MBSL_MBS5_WIDTH                    1u
#define STCU2_MBSL_MBS5(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS5_SHIFT))&STCU2_MBSL_MBS5_MASK)
#define STCU2_MBSL_MBS6_MASK                     0x40u
#define STCU2_MBSL_MBS6_SHIFT                    6u
#define STCU2_MBSL_MBS6_WIDTH                    1u
#define STCU2_MBSL_MBS6(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS6_SHIFT))&STCU2_MBSL_MBS6_MASK)
#define STCU2_MBSL_MBS7_MASK                     0x80u
#define STCU2_MBSL_MBS7_SHIFT                    7u
#define STCU2_MBSL_MBS7_WIDTH                    1u
#define STCU2_MBSL_MBS7(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS7_SHIFT))&STCU2_MBSL_MBS7_MASK)
#define STCU2_MBSL_MBS8_MASK                     0x100u
#define STCU2_MBSL_MBS8_SHIFT                    8u
#define STCU2_MBSL_MBS8_WIDTH                    1u
#define STCU2_MBSL_MBS8(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS8_SHIFT))&STCU2_MBSL_MBS8_MASK)
