neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define STCU2_MBSL_MBS9_MASK                     0x200u
#define STCU2_MBSL_MBS9_SHIFT                    9u
#define STCU2_MBSL_MBS9_WIDTH                    1u
#define STCU2_MBSL_MBS9(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS9_SHIFT))&STCU2_MBSL_MBS9_MASK)
#define STCU2_MBSL_MBS10_MASK                    0x400u
#define STCU2_MBSL_MBS10_SHIFT                   10u
#define STCU2_MBSL_MBS10_WIDTH                   1u
#define STCU2_MBSL_MBS10(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS10_SHIFT))&STCU2_MBSL_MBS10_MASK)
#define STCU2_MBSL_MBS11_MASK                    0x800u
#define STCU2_MBSL_MBS11_SHIFT                   11u
#define STCU2_MBSL_MBS11_WIDTH                   1u
#define STCU2_MBSL_MBS11(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS11_SHIFT))&STCU2_MBSL_MBS11_MASK)
#define STCU2_MBSL_MBS12_MASK                    0x1000u
#define STCU2_MBSL_MBS12_SHIFT                   12u
#define STCU2_MBSL_MBS12_WIDTH                   1u
#define STCU2_MBSL_MBS12(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS12_SHIFT))&STCU2_MBSL_MBS12_MASK)
#define STCU2_MBSL_MBS13_MASK                    0x2000u
#define STCU2_MBSL_MBS13_SHIFT                   13u
#define STCU2_MBSL_MBS13_WIDTH                   1u
#define STCU2_MBSL_MBS13(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS13_SHIFT))&STCU2_MBSL_MBS13_MASK)
#define STCU2_MBSL_MBS14_MASK                    0x4000u
#define STCU2_MBSL_MBS14_SHIFT                   14u
#define STCU2_MBSL_MBS14_WIDTH                   1u
#define STCU2_MBSL_MBS14(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS14_SHIFT))&STCU2_MBSL_MBS14_MASK)
#define STCU2_MBSL_MBS15_MASK                    0x8000u
#define STCU2_MBSL_MBS15_SHIFT                   15u
#define STCU2_MBSL_MBS15_WIDTH                   1u
#define STCU2_MBSL_MBS15(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS15_SHIFT))&STCU2_MBSL_MBS15_MASK)
#define STCU2_MBSL_MBS16_MASK                    0x10000u
#define STCU2_MBSL_MBS16_SHIFT                   16u
#define STCU2_MBSL_MBS16_WIDTH                   1u
#define STCU2_MBSL_MBS16(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS16_SHIFT))&STCU2_MBSL_MBS16_MASK)
#define STCU2_MBSL_MBS17_MASK                    0x20000u
#define STCU2_MBSL_MBS17_SHIFT                   17u
#define STCU2_MBSL_MBS17_WIDTH                   1u
#define STCU2_MBSL_MBS17(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS17_SHIFT))&STCU2_MBSL_MBS17_MASK)
#define STCU2_MBSL_MBS18_MASK                    0x40000u
#define STCU2_MBSL_MBS18_SHIFT                   18u
#define STCU2_MBSL_MBS18_WIDTH                   1u
#define STCU2_MBSL_MBS18(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS18_SHIFT))&STCU2_MBSL_MBS18_MASK)
#define STCU2_MBSL_MBS19_MASK                    0x80000u
#define STCU2_MBSL_MBS19_SHIFT                   19u
#define STCU2_MBSL_MBS19_WIDTH                   1u
#define STCU2_MBSL_MBS19(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS19_SHIFT))&STCU2_MBSL_MBS19_MASK)
#define STCU2_MBSL_MBS20_MASK                    0x100000u
#define STCU2_MBSL_MBS20_SHIFT                   20u
#define STCU2_MBSL_MBS20_WIDTH                   1u
#define STCU2_MBSL_MBS20(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS20_SHIFT))&STCU2_MBSL_MBS20_MASK)
#define STCU2_MBSL_MBS21_MASK                    0x200000u
#define STCU2_MBSL_MBS21_SHIFT                   21u
#define STCU2_MBSL_MBS21_WIDTH                   1u
#define STCU2_MBSL_MBS21(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS21_SHIFT))&STCU2_MBSL_MBS21_MASK)
#define STCU2_MBSL_MBS22_MASK                    0x400000u
#define STCU2_MBSL_MBS22_SHIFT                   22u
#define STCU2_MBSL_MBS22_WIDTH                   1u
#define STCU2_MBSL_MBS22(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS22_SHIFT))&STCU2_MBSL_MBS22_MASK)
#define STCU2_MBSL_MBS23_MASK                    0x800000u
#define STCU2_MBSL_MBS23_SHIFT                   23u
#define STCU2_MBSL_MBS23_WIDTH                   1u
#define STCU2_MBSL_MBS23(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS23_SHIFT))&STCU2_MBSL_MBS23_MASK)
#define STCU2_MBSL_MBS24_MASK                    0x1000000u
#define STCU2_MBSL_MBS24_SHIFT                   24u
#define STCU2_MBSL_MBS24_WIDTH                   1u
#define STCU2_MBSL_MBS24(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS24_SHIFT))&STCU2_MBSL_MBS24_MASK)
#define STCU2_MBSL_MBS25_MASK                    0x2000000u
#define STCU2_MBSL_MBS25_SHIFT                   25u
#define STCU2_MBSL_MBS25_WIDTH                   1u
#define STCU2_MBSL_MBS25(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS25_SHIFT))&STCU2_MBSL_MBS25_MASK)
#define STCU2_MBSL_MBS26_MASK                    0x4000000u
#define STCU2_MBSL_MBS26_SHIFT                   26u
#define STCU2_MBSL_MBS26_WIDTH                   1u
#define STCU2_MBSL_MBS26(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS26_SHIFT))&STCU2_MBSL_MBS26_MASK)
#define STCU2_MBSL_MBS27_MASK                    0x8000000u
#define STCU2_MBSL_MBS27_SHIFT                   27u
#define STCU2_MBSL_MBS27_WIDTH                   1u
#define STCU2_MBSL_MBS27(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS27_SHIFT))&STCU2_MBSL_MBS27_MASK)
#define STCU2_MBSL_MBS28_MASK                    0x10000000u
#define STCU2_MBSL_MBS28_SHIFT                   28u
#define STCU2_MBSL_MBS28_WIDTH                   1u
#define STCU2_MBSL_MBS28(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS28_SHIFT))&STCU2_MBSL_MBS28_MASK)
#define STCU2_MBSL_MBS29_MASK                    0x20000000u
#define STCU2_MBSL_MBS29_SHIFT                   29u
#define STCU2_MBSL_MBS29_WIDTH                   1u
#define STCU2_MBSL_MBS29(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS29_SHIFT))&STCU2_MBSL_MBS29_MASK)
#define STCU2_MBSL_MBS30_MASK                    0x40000000u
#define STCU2_MBSL_MBS30_SHIFT                   30u
#define STCU2_MBSL_MBS30_WIDTH                   1u
#define STCU2_MBSL_MBS30(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS30_SHIFT))&STCU2_MBSL_MBS30_MASK)
#define STCU2_MBSL_MBS31_MASK                    0x80000000u
#define STCU2_MBSL_MBS31_SHIFT                   31u
#define STCU2_MBSL_MBS31_WIDTH                   1u
#define STCU2_MBSL_MBS31(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSL_MBS31_SHIFT))&STCU2_MBSL_MBS31_MASK)
/* MBSM Bit Fields */
#define STCU2_MBSM_MBS32_MASK                    0x1u
#define STCU2_MBSM_MBS32_SHIFT                   0u
#define STCU2_MBSM_MBS32_WIDTH                   1u
#define STCU2_MBSM_MBS32(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS32_SHIFT))&STCU2_MBSM_MBS32_MASK)
#define STCU2_MBSM_MBS33_MASK                    0x2u
#define STCU2_MBSM_MBS33_SHIFT                   1u
#define STCU2_MBSM_MBS33_WIDTH                   1u
#define STCU2_MBSM_MBS33(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS33_SHIFT))&STCU2_MBSM_MBS33_MASK)
#define STCU2_MBSM_MBS34_MASK                    0x4u
#define STCU2_MBSM_MBS34_SHIFT                   2u
#define STCU2_MBSM_MBS34_WIDTH                   1u
#define STCU2_MBSM_MBS34(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS34_SHIFT))&STCU2_MBSM_MBS34_MASK)
#define STCU2_MBSM_MBS35_MASK                    0x8u
#define STCU2_MBSM_MBS35_SHIFT                   3u
#define STCU2_MBSM_MBS35_WIDTH                   1u
#define STCU2_MBSM_MBS35(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS35_SHIFT))&STCU2_MBSM_MBS35_MASK)
#define STCU2_MBSM_MBS36_MASK                    0x10u
#define STCU2_MBSM_MBS36_SHIFT                   4u
#define STCU2_MBSM_MBS36_WIDTH                   1u
#define STCU2_MBSM_MBS36(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS36_SHIFT))&STCU2_MBSM_MBS36_MASK)
#define STCU2_MBSM_MBS37_MASK                    0x20u
#define STCU2_MBSM_MBS37_SHIFT                   5u
#define STCU2_MBSM_MBS37_WIDTH                   1u
#define STCU2_MBSM_MBS37(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS37_SHIFT))&STCU2_MBSM_MBS37_MASK)
#define STCU2_MBSM_MBS38_MASK                    0x40u
#define STCU2_MBSM_MBS38_SHIFT                   6u
#define STCU2_MBSM_MBS38_WIDTH                   1u
#define STCU2_MBSM_MBS38(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS38_SHIFT))&STCU2_MBSM_MBS38_MASK)
#define STCU2_MBSM_MBS39_MASK                    0x80u
#define STCU2_MBSM_MBS39_SHIFT                   7u
#define STCU2_MBSM_MBS39_WIDTH                   1u
#define STCU2_MBSM_MBS39(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS39_SHIFT))&STCU2_MBSM_MBS39_MASK)
#define STCU2_MBSM_MBS40_MASK                    0x100u
#define STCU2_MBSM_MBS40_SHIFT                   8u
#define STCU2_MBSM_MBS40_WIDTH                   1u
#define STCU2_MBSM_MBS40(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS40_SHIFT))&STCU2_MBSM_MBS40_MASK)
#define STCU2_MBSM_MBS41_MASK                    0x200u
#define STCU2_MBSM_MBS41_SHIFT                   9u
#define STCU2_MBSM_MBS41_WIDTH                   1u
#define STCU2_MBSM_MBS41(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS41_SHIFT))&STCU2_MBSM_MBS41_MASK)
#define STCU2_MBSM_MBS42_MASK                    0x400u
#define STCU2_MBSM_MBS42_SHIFT                   10u
#define STCU2_MBSM_MBS42_WIDTH                   1u
#define STCU2_MBSM_MBS42(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS42_SHIFT))&STCU2_MBSM_MBS42_MASK)
#define STCU2_MBSM_MBS43_MASK                    0x800u
#define STCU2_MBSM_MBS43_SHIFT                   11u
#define STCU2_MBSM_MBS43_WIDTH                   1u
#define STCU2_MBSM_MBS43(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS43_SHIFT))&STCU2_MBSM_MBS43_MASK)
#define STCU2_MBSM_MBS44_MASK                    0x1000u
#define STCU2_MBSM_MBS44_SHIFT                   12u
#define STCU2_MBSM_MBS44_WIDTH                   1u
#define STCU2_MBSM_MBS44(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS44_SHIFT))&STCU2_MBSM_MBS44_MASK)
#define STCU2_MBSM_MBS45_MASK                    0x2000u
#define STCU2_MBSM_MBS45_SHIFT                   13u
#define STCU2_MBSM_MBS45_WIDTH                   1u
#define STCU2_MBSM_MBS45(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS45_SHIFT))&STCU2_MBSM_MBS45_MASK)
#define STCU2_MBSM_MBS46_MASK                    0x4000u
#define STCU2_MBSM_MBS46_SHIFT                   14u
#define STCU2_MBSM_MBS46_WIDTH                   1u
#define STCU2_MBSM_MBS46(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS46_SHIFT))&STCU2_MBSM_MBS46_MASK)
#define STCU2_MBSM_MBS47_MASK                    0x8000u
#define STCU2_MBSM_MBS47_SHIFT                   15u
#define STCU2_MBSM_MBS47_WIDTH                   1u
#define STCU2_MBSM_MBS47(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS47_SHIFT))&STCU2_MBSM_MBS47_MASK)
#define STCU2_MBSM_MBS48_MASK                    0x10000u
#define STCU2_MBSM_MBS48_SHIFT                   16u
#define STCU2_MBSM_MBS48_WIDTH                   1u
#define STCU2_MBSM_MBS48(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS48_SHIFT))&STCU2_MBSM_MBS48_MASK)
#define STCU2_MBSM_MBS49_MASK                    0x20000u
#define STCU2_MBSM_MBS49_SHIFT                   17u
#define STCU2_MBSM_MBS49_WIDTH                   1u
#define STCU2_MBSM_MBS49(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS49_SHIFT))&STCU2_MBSM_MBS49_MASK)
#define STCU2_MBSM_MBS50_MASK                    0x40000u
#define STCU2_MBSM_MBS50_SHIFT                   18u
#define STCU2_MBSM_MBS50_WIDTH                   1u
#define STCU2_MBSM_MBS50(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS50_SHIFT))&STCU2_MBSM_MBS50_MASK)
#define STCU2_MBSM_MBS51_MASK                    0x80000u
#define STCU2_MBSM_MBS51_SHIFT                   19u
#define STCU2_MBSM_MBS51_WIDTH                   1u
#define STCU2_MBSM_MBS51(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS51_SHIFT))&STCU2_MBSM_MBS51_MASK)
#define STCU2_MBSM_MBS52_MASK                    0x100000u
#define STCU2_MBSM_MBS52_SHIFT                   20u
#define STCU2_MBSM_MBS52_WIDTH                   1u
#define STCU2_MBSM_MBS52(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS52_SHIFT))&STCU2_MBSM_MBS52_MASK)
#define STCU2_MBSM_MBS53_MASK                    0x200000u
#define STCU2_MBSM_MBS53_SHIFT                   21u
#define STCU2_MBSM_MBS53_WIDTH                   1u
#define STCU2_MBSM_MBS53(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS53_SHIFT))&STCU2_MBSM_MBS53_MASK)
#define STCU2_MBSM_MBS54_MASK                    0x400000u
#define STCU2_MBSM_MBS54_SHIFT                   22u
#define STCU2_MBSM_MBS54_WIDTH                   1u
#define STCU2_MBSM_MBS54(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS54_SHIFT))&STCU2_MBSM_MBS54_MASK)
#define STCU2_MBSM_MBS55_MASK                    0x800000u
#define STCU2_MBSM_MBS55_SHIFT                   23u
#define STCU2_MBSM_MBS55_WIDTH                   1u
#define STCU2_MBSM_MBS55(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS55_SHIFT))&STCU2_MBSM_MBS55_MASK)
#define STCU2_MBSM_MBS56_MASK                    0x1000000u
#define STCU2_MBSM_MBS56_SHIFT                   24u
#define STCU2_MBSM_MBS56_WIDTH                   1u
#define STCU2_MBSM_MBS56(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS56_SHIFT))&STCU2_MBSM_MBS56_MASK)
#define STCU2_MBSM_MBS57_MASK                    0x2000000u
#define STCU2_MBSM_MBS57_SHIFT                   25u
#define STCU2_MBSM_MBS57_WIDTH                   1u
#define STCU2_MBSM_MBS57(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS57_SHIFT))&STCU2_MBSM_MBS57_MASK)
#define STCU2_MBSM_MBS58_MASK                    0x4000000u
#define STCU2_MBSM_MBS58_SHIFT                   26u
#define STCU2_MBSM_MBS58_WIDTH                   1u
#define STCU2_MBSM_MBS58(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS58_SHIFT))&STCU2_MBSM_MBS58_MASK)
#define STCU2_MBSM_MBS59_MASK                    0x8000000u
#define STCU2_MBSM_MBS59_SHIFT                   27u
#define STCU2_MBSM_MBS59_WIDTH                   1u
#define STCU2_MBSM_MBS59(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS59_SHIFT))&STCU2_MBSM_MBS59_MASK)
#define STCU2_MBSM_MBS60_MASK                    0x10000000u
#define STCU2_MBSM_MBS60_SHIFT                   28u
#define STCU2_MBSM_MBS60_WIDTH                   1u
#define STCU2_MBSM_MBS60(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS60_SHIFT))&STCU2_MBSM_MBS60_MASK)
#define STCU2_MBSM_MBS61_MASK                    0x20000000u
#define STCU2_MBSM_MBS61_SHIFT                   29u
#define STCU2_MBSM_MBS61_WIDTH                   1u
#define STCU2_MBSM_MBS61(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS61_SHIFT))&STCU2_MBSM_MBS61_MASK)
#define STCU2_MBSM_MBS62_MASK                    0x40000000u
#define STCU2_MBSM_MBS62_SHIFT                   30u
#define STCU2_MBSM_MBS62_WIDTH                   1u
#define STCU2_MBSM_MBS62(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS62_SHIFT))&STCU2_MBSM_MBS62_MASK)
#define STCU2_MBSM_MBS63_MASK                    0x80000000u
#define STCU2_MBSM_MBS63_SHIFT                   31u
#define STCU2_MBSM_MBS63_WIDTH                   1u
#define STCU2_MBSM_MBS63(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSM_MBS63_SHIFT))&STCU2_MBSM_MBS63_MASK)
/* MBSH Bit Fields */
#define STCU2_MBSH_MBS64_MASK                    0x1u
#define STCU2_MBSH_MBS64_SHIFT                   0u
#define STCU2_MBSH_MBS64_WIDTH                   1u
#define STCU2_MBSH_MBS64(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBSH_MBS64_SHIFT))&STCU2_MBSH_MBS64_MASK)
/* MBEL Bit Fields */
#define STCU2_MBEL_MBE0_MASK                     0x1u
#define STCU2_MBEL_MBE0_SHIFT                    0u
#define STCU2_MBEL_MBE0_WIDTH                    1u
#define STCU2_MBEL_MBE0(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE0_SHIFT))&STCU2_MBEL_MBE0_MASK)
#define STCU2_MBEL_MBE1_MASK                     0x2u
#define STCU2_MBEL_MBE1_SHIFT                    1u
#define STCU2_MBEL_MBE1_WIDTH                    1u
#define STCU2_MBEL_MBE1(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE1_SHIFT))&STCU2_MBEL_MBE1_MASK)
#define STCU2_MBEL_MBE2_MASK                     0x4u
#define STCU2_MBEL_MBE2_SHIFT                    2u
#define STCU2_MBEL_MBE2_WIDTH                    1u
#define STCU2_MBEL_MBE2(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE2_SHIFT))&STCU2_MBEL_MBE2_MASK)
#define STCU2_MBEL_MBE3_MASK                     0x8u
#define STCU2_MBEL_MBE3_SHIFT                    3u
#define STCU2_MBEL_MBE3_WIDTH                    1u
#define STCU2_MBEL_MBE3(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE3_SHIFT))&STCU2_MBEL_MBE3_MASK)
#define STCU2_MBEL_MBE4_MASK                     0x10u
#define STCU2_MBEL_MBE4_SHIFT                    4u
#define STCU2_MBEL_MBE4_WIDTH                    1u
#define STCU2_MBEL_MBE4(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE4_SHIFT))&STCU2_MBEL_MBE4_MASK)
#define STCU2_MBEL_MBE5_MASK                     0x20u
#define STCU2_MBEL_MBE5_SHIFT                    5u
#define STCU2_MBEL_MBE5_WIDTH                    1u
#define STCU2_MBEL_MBE5(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE5_SHIFT))&STCU2_MBEL_MBE5_MASK)
#define STCU2_MBEL_MBE6_MASK                     0x40u
#define STCU2_MBEL_MBE6_SHIFT                    6u
#define STCU2_MBEL_MBE6_WIDTH                    1u
#define STCU2_MBEL_MBE6(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE6_SHIFT))&STCU2_MBEL_MBE6_MASK)
#define STCU2_MBEL_MBE7_MASK                     0x80u
#define STCU2_MBEL_MBE7_SHIFT                    7u
#define STCU2_MBEL_MBE7_WIDTH                    1u
#define STCU2_MBEL_MBE7(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE7_SHIFT))&STCU2_MBEL_MBE7_MASK)
#define STCU2_MBEL_MBE8_MASK                     0x100u
#define STCU2_MBEL_MBE8_SHIFT                    8u
#define STCU2_MBEL_MBE8_WIDTH                    1u
#define STCU2_MBEL_MBE8(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE8_SHIFT))&STCU2_MBEL_MBE8_MASK)
#define STCU2_MBEL_MBE9_MASK                     0x200u
#define STCU2_MBEL_MBE9_SHIFT                    9u
#define STCU2_MBEL_MBE9_WIDTH                    1u
#define STCU2_MBEL_MBE9(x)                       (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE9_SHIFT))&STCU2_MBEL_MBE9_MASK)
#define STCU2_MBEL_MBE10_MASK                    0x400u
#define STCU2_MBEL_MBE10_SHIFT                   10u
#define STCU2_MBEL_MBE10_WIDTH                   1u
#define STCU2_MBEL_MBE10(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE10_SHIFT))&STCU2_MBEL_MBE10_MASK)
#define STCU2_MBEL_MBE11_MASK                    0x800u
#define STCU2_MBEL_MBE11_SHIFT                   11u
#define STCU2_MBEL_MBE11_WIDTH                   1u
#define STCU2_MBEL_MBE11(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE11_SHIFT))&STCU2_MBEL_MBE11_MASK)
#define STCU2_MBEL_MBE12_MASK                    0x1000u
#define STCU2_MBEL_MBE12_SHIFT                   12u
#define STCU2_MBEL_MBE12_WIDTH                   1u
#define STCU2_MBEL_MBE12(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE12_SHIFT))&STCU2_MBEL_MBE12_MASK)
#define STCU2_MBEL_MBE13_MASK                    0x2000u
#define STCU2_MBEL_MBE13_SHIFT                   13u
#define STCU2_MBEL_MBE13_WIDTH                   1u
#define STCU2_MBEL_MBE13(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE13_SHIFT))&STCU2_MBEL_MBE13_MASK)
#define STCU2_MBEL_MBE14_MASK                    0x4000u
#define STCU2_MBEL_MBE14_SHIFT                   14u
#define STCU2_MBEL_MBE14_WIDTH                   1u
#define STCU2_MBEL_MBE14(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE14_SHIFT))&STCU2_MBEL_MBE14_MASK)
#define STCU2_MBEL_MBE15_MASK                    0x8000u
#define STCU2_MBEL_MBE15_SHIFT                   15u
#define STCU2_MBEL_MBE15_WIDTH                   1u
#define STCU2_MBEL_MBE15(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE15_SHIFT))&STCU2_MBEL_MBE15_MASK)
#define STCU2_MBEL_MBE16_MASK                    0x10000u
#define STCU2_MBEL_MBE16_SHIFT                   16u
#define STCU2_MBEL_MBE16_WIDTH                   1u
#define STCU2_MBEL_MBE16(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE16_SHIFT))&STCU2_MBEL_MBE16_MASK)
#define STCU2_MBEL_MBE17_MASK                    0x20000u
#define STCU2_MBEL_MBE17_SHIFT                   17u
#define STCU2_MBEL_MBE17_WIDTH                   1u
#define STCU2_MBEL_MBE17(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE17_SHIFT))&STCU2_MBEL_MBE17_MASK)
#define STCU2_MBEL_MBE18_MASK                    0x40000u
#define STCU2_MBEL_MBE18_SHIFT                   18u
#define STCU2_MBEL_MBE18_WIDTH                   1u
#define STCU2_MBEL_MBE18(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE18_SHIFT))&STCU2_MBEL_MBE18_MASK)
#define STCU2_MBEL_MBE19_MASK                    0x80000u
#define STCU2_MBEL_MBE19_SHIFT                   19u
#define STCU2_MBEL_MBE19_WIDTH                   1u
#define STCU2_MBEL_MBE19(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE19_SHIFT))&STCU2_MBEL_MBE19_MASK)
#define STCU2_MBEL_MBE20_MASK                    0x100000u
#define STCU2_MBEL_MBE20_SHIFT                   20u
#define STCU2_MBEL_MBE20_WIDTH                   1u
#define STCU2_MBEL_MBE20(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE20_SHIFT))&STCU2_MBEL_MBE20_MASK)
#define STCU2_MBEL_MBE21_MASK                    0x200000u
#define STCU2_MBEL_MBE21_SHIFT                   21u
#define STCU2_MBEL_MBE21_WIDTH                   1u
#define STCU2_MBEL_MBE21(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE21_SHIFT))&STCU2_MBEL_MBE21_MASK)
#define STCU2_MBEL_MBE22_MASK                    0x400000u
#define STCU2_MBEL_MBE22_SHIFT                   22u
#define STCU2_MBEL_MBE22_WIDTH                   1u
#define STCU2_MBEL_MBE22(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE22_SHIFT))&STCU2_MBEL_MBE22_MASK)
#define STCU2_MBEL_MBE23_MASK                    0x800000u
#define STCU2_MBEL_MBE23_SHIFT                   23u
#define STCU2_MBEL_MBE23_WIDTH                   1u
#define STCU2_MBEL_MBE23(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE23_SHIFT))&STCU2_MBEL_MBE23_MASK)
#define STCU2_MBEL_MBE24_MASK                    0x1000000u
#define STCU2_MBEL_MBE24_SHIFT                   24u
#define STCU2_MBEL_MBE24_WIDTH                   1u
#define STCU2_MBEL_MBE24(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE24_SHIFT))&STCU2_MBEL_MBE24_MASK)
#define STCU2_MBEL_MBE25_MASK                    0x2000000u
#define STCU2_MBEL_MBE25_SHIFT                   25u
#define STCU2_MBEL_MBE25_WIDTH                   1u
#define STCU2_MBEL_MBE25(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE25_SHIFT))&STCU2_MBEL_MBE25_MASK)
#define STCU2_MBEL_MBE26_MASK                    0x4000000u
#define STCU2_MBEL_MBE26_SHIFT                   26u
#define STCU2_MBEL_MBE26_WIDTH                   1u
