neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define STCU2_MBEL_MBE26(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE26_SHIFT))&STCU2_MBEL_MBE26_MASK)
#define STCU2_MBEL_MBE27_MASK                    0x8000000u
#define STCU2_MBEL_MBE27_SHIFT                   27u
#define STCU2_MBEL_MBE27_WIDTH                   1u
#define STCU2_MBEL_MBE27(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE27_SHIFT))&STCU2_MBEL_MBE27_MASK)
#define STCU2_MBEL_MBE28_MASK                    0x10000000u
#define STCU2_MBEL_MBE28_SHIFT                   28u
#define STCU2_MBEL_MBE28_WIDTH                   1u
#define STCU2_MBEL_MBE28(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE28_SHIFT))&STCU2_MBEL_MBE28_MASK)
#define STCU2_MBEL_MBE29_MASK                    0x20000000u
#define STCU2_MBEL_MBE29_SHIFT                   29u
#define STCU2_MBEL_MBE29_WIDTH                   1u
#define STCU2_MBEL_MBE29(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE29_SHIFT))&STCU2_MBEL_MBE29_MASK)
#define STCU2_MBEL_MBE30_MASK                    0x40000000u
#define STCU2_MBEL_MBE30_SHIFT                   30u
#define STCU2_MBEL_MBE30_WIDTH                   1u
#define STCU2_MBEL_MBE30(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE30_SHIFT))&STCU2_MBEL_MBE30_MASK)
#define STCU2_MBEL_MBE31_MASK                    0x80000000u
#define STCU2_MBEL_MBE31_SHIFT                   31u
#define STCU2_MBEL_MBE31_WIDTH                   1u
#define STCU2_MBEL_MBE31(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEL_MBE31_SHIFT))&STCU2_MBEL_MBE31_MASK)
/* MBEM Bit Fields */
#define STCU2_MBEM_MBE32_MASK                    0x1u
#define STCU2_MBEM_MBE32_SHIFT                   0u
#define STCU2_MBEM_MBE32_WIDTH                   1u
#define STCU2_MBEM_MBE32(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE32_SHIFT))&STCU2_MBEM_MBE32_MASK)
#define STCU2_MBEM_MBE33_MASK                    0x2u
#define STCU2_MBEM_MBE33_SHIFT                   1u
#define STCU2_MBEM_MBE33_WIDTH                   1u
#define STCU2_MBEM_MBE33(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE33_SHIFT))&STCU2_MBEM_MBE33_MASK)
#define STCU2_MBEM_MBE34_MASK                    0x4u
#define STCU2_MBEM_MBE34_SHIFT                   2u
#define STCU2_MBEM_MBE34_WIDTH                   1u
#define STCU2_MBEM_MBE34(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE34_SHIFT))&STCU2_MBEM_MBE34_MASK)
#define STCU2_MBEM_MBE35_MASK                    0x8u
#define STCU2_MBEM_MBE35_SHIFT                   3u
#define STCU2_MBEM_MBE35_WIDTH                   1u
#define STCU2_MBEM_MBE35(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE35_SHIFT))&STCU2_MBEM_MBE35_MASK)
#define STCU2_MBEM_MBE36_MASK                    0x10u
#define STCU2_MBEM_MBE36_SHIFT                   4u
#define STCU2_MBEM_MBE36_WIDTH                   1u
#define STCU2_MBEM_MBE36(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE36_SHIFT))&STCU2_MBEM_MBE36_MASK)
#define STCU2_MBEM_MBE37_MASK                    0x20u
#define STCU2_MBEM_MBE37_SHIFT                   5u
#define STCU2_MBEM_MBE37_WIDTH                   1u
#define STCU2_MBEM_MBE37(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE37_SHIFT))&STCU2_MBEM_MBE37_MASK)
#define STCU2_MBEM_MBE38_MASK                    0x40u
#define STCU2_MBEM_MBE38_SHIFT                   6u
#define STCU2_MBEM_MBE38_WIDTH                   1u
#define STCU2_MBEM_MBE38(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE38_SHIFT))&STCU2_MBEM_MBE38_MASK)
#define STCU2_MBEM_MBE39_MASK                    0x80u
#define STCU2_MBEM_MBE39_SHIFT                   7u
#define STCU2_MBEM_MBE39_WIDTH                   1u
#define STCU2_MBEM_MBE39(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE39_SHIFT))&STCU2_MBEM_MBE39_MASK)
#define STCU2_MBEM_MBE40_MASK                    0x100u
#define STCU2_MBEM_MBE40_SHIFT                   8u
#define STCU2_MBEM_MBE40_WIDTH                   1u
#define STCU2_MBEM_MBE40(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE40_SHIFT))&STCU2_MBEM_MBE40_MASK)
#define STCU2_MBEM_MBE41_MASK                    0x200u
#define STCU2_MBEM_MBE41_SHIFT                   9u
#define STCU2_MBEM_MBE41_WIDTH                   1u
#define STCU2_MBEM_MBE41(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE41_SHIFT))&STCU2_MBEM_MBE41_MASK)
#define STCU2_MBEM_MBE42_MASK                    0x400u
#define STCU2_MBEM_MBE42_SHIFT                   10u
#define STCU2_MBEM_MBE42_WIDTH                   1u
#define STCU2_MBEM_MBE42(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE42_SHIFT))&STCU2_MBEM_MBE42_MASK)
#define STCU2_MBEM_MBE43_MASK                    0x800u
#define STCU2_MBEM_MBE43_SHIFT                   11u
#define STCU2_MBEM_MBE43_WIDTH                   1u
#define STCU2_MBEM_MBE43(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE43_SHIFT))&STCU2_MBEM_MBE43_MASK)
#define STCU2_MBEM_MBE44_MASK                    0x1000u
#define STCU2_MBEM_MBE44_SHIFT                   12u
#define STCU2_MBEM_MBE44_WIDTH                   1u
#define STCU2_MBEM_MBE44(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE44_SHIFT))&STCU2_MBEM_MBE44_MASK)
#define STCU2_MBEM_MBE45_MASK                    0x2000u
#define STCU2_MBEM_MBE45_SHIFT                   13u
#define STCU2_MBEM_MBE45_WIDTH                   1u
#define STCU2_MBEM_MBE45(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE45_SHIFT))&STCU2_MBEM_MBE45_MASK)
#define STCU2_MBEM_MBE46_MASK                    0x4000u
#define STCU2_MBEM_MBE46_SHIFT                   14u
#define STCU2_MBEM_MBE46_WIDTH                   1u
#define STCU2_MBEM_MBE46(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE46_SHIFT))&STCU2_MBEM_MBE46_MASK)
#define STCU2_MBEM_MBE47_MASK                    0x8000u
#define STCU2_MBEM_MBE47_SHIFT                   15u
#define STCU2_MBEM_MBE47_WIDTH                   1u
#define STCU2_MBEM_MBE47(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE47_SHIFT))&STCU2_MBEM_MBE47_MASK)
#define STCU2_MBEM_MBE48_MASK                    0x10000u
#define STCU2_MBEM_MBE48_SHIFT                   16u
#define STCU2_MBEM_MBE48_WIDTH                   1u
#define STCU2_MBEM_MBE48(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE48_SHIFT))&STCU2_MBEM_MBE48_MASK)
#define STCU2_MBEM_MBE49_MASK                    0x20000u
#define STCU2_MBEM_MBE49_SHIFT                   17u
#define STCU2_MBEM_MBE49_WIDTH                   1u
#define STCU2_MBEM_MBE49(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE49_SHIFT))&STCU2_MBEM_MBE49_MASK)
#define STCU2_MBEM_MBE50_MASK                    0x40000u
#define STCU2_MBEM_MBE50_SHIFT                   18u
#define STCU2_MBEM_MBE50_WIDTH                   1u
#define STCU2_MBEM_MBE50(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE50_SHIFT))&STCU2_MBEM_MBE50_MASK)
#define STCU2_MBEM_MBE51_MASK                    0x80000u
#define STCU2_MBEM_MBE51_SHIFT                   19u
#define STCU2_MBEM_MBE51_WIDTH                   1u
#define STCU2_MBEM_MBE51(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE51_SHIFT))&STCU2_MBEM_MBE51_MASK)
#define STCU2_MBEM_MBE52_MASK                    0x100000u
#define STCU2_MBEM_MBE52_SHIFT                   20u
#define STCU2_MBEM_MBE52_WIDTH                   1u
#define STCU2_MBEM_MBE52(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE52_SHIFT))&STCU2_MBEM_MBE52_MASK)
#define STCU2_MBEM_MBE53_MASK                    0x200000u
#define STCU2_MBEM_MBE53_SHIFT                   21u
#define STCU2_MBEM_MBE53_WIDTH                   1u
#define STCU2_MBEM_MBE53(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE53_SHIFT))&STCU2_MBEM_MBE53_MASK)
#define STCU2_MBEM_MBE54_MASK                    0x400000u
#define STCU2_MBEM_MBE54_SHIFT                   22u
#define STCU2_MBEM_MBE54_WIDTH                   1u
#define STCU2_MBEM_MBE54(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE54_SHIFT))&STCU2_MBEM_MBE54_MASK)
#define STCU2_MBEM_MBE55_MASK                    0x800000u
#define STCU2_MBEM_MBE55_SHIFT                   23u
#define STCU2_MBEM_MBE55_WIDTH                   1u
#define STCU2_MBEM_MBE55(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE55_SHIFT))&STCU2_MBEM_MBE55_MASK)
#define STCU2_MBEM_MBE56_MASK                    0x1000000u
#define STCU2_MBEM_MBE56_SHIFT                   24u
#define STCU2_MBEM_MBE56_WIDTH                   1u
#define STCU2_MBEM_MBE56(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE56_SHIFT))&STCU2_MBEM_MBE56_MASK)
#define STCU2_MBEM_MBE57_MASK                    0x2000000u
#define STCU2_MBEM_MBE57_SHIFT                   25u
#define STCU2_MBEM_MBE57_WIDTH                   1u
#define STCU2_MBEM_MBE57(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE57_SHIFT))&STCU2_MBEM_MBE57_MASK)
#define STCU2_MBEM_MBE58_MASK                    0x4000000u
#define STCU2_MBEM_MBE58_SHIFT                   26u
#define STCU2_MBEM_MBE58_WIDTH                   1u
#define STCU2_MBEM_MBE58(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE58_SHIFT))&STCU2_MBEM_MBE58_MASK)
#define STCU2_MBEM_MBE59_MASK                    0x8000000u
#define STCU2_MBEM_MBE59_SHIFT                   27u
#define STCU2_MBEM_MBE59_WIDTH                   1u
#define STCU2_MBEM_MBE59(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE59_SHIFT))&STCU2_MBEM_MBE59_MASK)
#define STCU2_MBEM_MBE60_MASK                    0x10000000u
#define STCU2_MBEM_MBE60_SHIFT                   28u
#define STCU2_MBEM_MBE60_WIDTH                   1u
#define STCU2_MBEM_MBE60(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE60_SHIFT))&STCU2_MBEM_MBE60_MASK)
#define STCU2_MBEM_MBE61_MASK                    0x20000000u
#define STCU2_MBEM_MBE61_SHIFT                   29u
#define STCU2_MBEM_MBE61_WIDTH                   1u
#define STCU2_MBEM_MBE61(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE61_SHIFT))&STCU2_MBEM_MBE61_MASK)
#define STCU2_MBEM_MBE62_MASK                    0x40000000u
#define STCU2_MBEM_MBE62_SHIFT                   30u
#define STCU2_MBEM_MBE62_WIDTH                   1u
#define STCU2_MBEM_MBE62(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE62_SHIFT))&STCU2_MBEM_MBE62_MASK)
#define STCU2_MBEM_MBE63_MASK                    0x80000000u
#define STCU2_MBEM_MBE63_SHIFT                   31u
#define STCU2_MBEM_MBE63_WIDTH                   1u
#define STCU2_MBEM_MBE63(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEM_MBE63_SHIFT))&STCU2_MBEM_MBE63_MASK)
/* MBEH Bit Fields */
#define STCU2_MBEH_MBE64_MASK                    0x1u
#define STCU2_MBEH_MBE64_SHIFT                   0u
#define STCU2_MBEH_MBE64_WIDTH                   1u
#define STCU2_MBEH_MBE64(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_MBEH_MBE64_SHIFT))&STCU2_MBEH_MBE64_MASK)
/* MBSLSW Bit Fields */
#define STCU2_MBSLSW_MBSSW0_MASK                 0x1u
#define STCU2_MBSLSW_MBSSW0_SHIFT                0u
#define STCU2_MBSLSW_MBSSW0_WIDTH                1u
#define STCU2_MBSLSW_MBSSW0(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW0_SHIFT))&STCU2_MBSLSW_MBSSW0_MASK)
#define STCU2_MBSLSW_MBSSW1_MASK                 0x2u
#define STCU2_MBSLSW_MBSSW1_SHIFT                1u
#define STCU2_MBSLSW_MBSSW1_WIDTH                1u
#define STCU2_MBSLSW_MBSSW1(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW1_SHIFT))&STCU2_MBSLSW_MBSSW1_MASK)
#define STCU2_MBSLSW_MBSSW2_MASK                 0x4u
#define STCU2_MBSLSW_MBSSW2_SHIFT                2u
#define STCU2_MBSLSW_MBSSW2_WIDTH                1u
#define STCU2_MBSLSW_MBSSW2(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW2_SHIFT))&STCU2_MBSLSW_MBSSW2_MASK)
#define STCU2_MBSLSW_MBSSW3_MASK                 0x8u
#define STCU2_MBSLSW_MBSSW3_SHIFT                3u
#define STCU2_MBSLSW_MBSSW3_WIDTH                1u
#define STCU2_MBSLSW_MBSSW3(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW3_SHIFT))&STCU2_MBSLSW_MBSSW3_MASK)
#define STCU2_MBSLSW_MBSSW4_MASK                 0x10u
#define STCU2_MBSLSW_MBSSW4_SHIFT                4u
#define STCU2_MBSLSW_MBSSW4_WIDTH                1u
#define STCU2_MBSLSW_MBSSW4(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW4_SHIFT))&STCU2_MBSLSW_MBSSW4_MASK)
#define STCU2_MBSLSW_MBSSW5_MASK                 0x20u
#define STCU2_MBSLSW_MBSSW5_SHIFT                5u
#define STCU2_MBSLSW_MBSSW5_WIDTH                1u
#define STCU2_MBSLSW_MBSSW5(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW5_SHIFT))&STCU2_MBSLSW_MBSSW5_MASK)
#define STCU2_MBSLSW_MBSSW6_MASK                 0x40u
#define STCU2_MBSLSW_MBSSW6_SHIFT                6u
#define STCU2_MBSLSW_MBSSW6_WIDTH                1u
#define STCU2_MBSLSW_MBSSW6(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW6_SHIFT))&STCU2_MBSLSW_MBSSW6_MASK)
#define STCU2_MBSLSW_MBSSW7_MASK                 0x80u
#define STCU2_MBSLSW_MBSSW7_SHIFT                7u
#define STCU2_MBSLSW_MBSSW7_WIDTH                1u
#define STCU2_MBSLSW_MBSSW7(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW7_SHIFT))&STCU2_MBSLSW_MBSSW7_MASK)
#define STCU2_MBSLSW_MBSSW8_MASK                 0x100u
#define STCU2_MBSLSW_MBSSW8_SHIFT                8u
#define STCU2_MBSLSW_MBSSW8_WIDTH                1u
#define STCU2_MBSLSW_MBSSW8(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW8_SHIFT))&STCU2_MBSLSW_MBSSW8_MASK)
#define STCU2_MBSLSW_MBSSW9_MASK                 0x200u
#define STCU2_MBSLSW_MBSSW9_SHIFT                9u
#define STCU2_MBSLSW_MBSSW9_WIDTH                1u
#define STCU2_MBSLSW_MBSSW9(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW9_SHIFT))&STCU2_MBSLSW_MBSSW9_MASK)
#define STCU2_MBSLSW_MBSSW10_MASK                0x400u
#define STCU2_MBSLSW_MBSSW10_SHIFT               10u
#define STCU2_MBSLSW_MBSSW10_WIDTH               1u
#define STCU2_MBSLSW_MBSSW10(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW10_SHIFT))&STCU2_MBSLSW_MBSSW10_MASK)
#define STCU2_MBSLSW_MBSSW11_MASK                0x800u
#define STCU2_MBSLSW_MBSSW11_SHIFT               11u
#define STCU2_MBSLSW_MBSSW11_WIDTH               1u
#define STCU2_MBSLSW_MBSSW11(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW11_SHIFT))&STCU2_MBSLSW_MBSSW11_MASK)
#define STCU2_MBSLSW_MBSSW12_MASK                0x1000u
#define STCU2_MBSLSW_MBSSW12_SHIFT               12u
#define STCU2_MBSLSW_MBSSW12_WIDTH               1u
#define STCU2_MBSLSW_MBSSW12(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW12_SHIFT))&STCU2_MBSLSW_MBSSW12_MASK)
#define STCU2_MBSLSW_MBSSW13_MASK                0x2000u
#define STCU2_MBSLSW_MBSSW13_SHIFT               13u
#define STCU2_MBSLSW_MBSSW13_WIDTH               1u
#define STCU2_MBSLSW_MBSSW13(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW13_SHIFT))&STCU2_MBSLSW_MBSSW13_MASK)
#define STCU2_MBSLSW_MBSSW14_MASK                0x4000u
#define STCU2_MBSLSW_MBSSW14_SHIFT               14u
#define STCU2_MBSLSW_MBSSW14_WIDTH               1u
#define STCU2_MBSLSW_MBSSW14(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW14_SHIFT))&STCU2_MBSLSW_MBSSW14_MASK)
#define STCU2_MBSLSW_MBSSW15_MASK                0x8000u
#define STCU2_MBSLSW_MBSSW15_SHIFT               15u
#define STCU2_MBSLSW_MBSSW15_WIDTH               1u
#define STCU2_MBSLSW_MBSSW15(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW15_SHIFT))&STCU2_MBSLSW_MBSSW15_MASK)
#define STCU2_MBSLSW_MBSSW16_MASK                0x10000u
#define STCU2_MBSLSW_MBSSW16_SHIFT               16u
#define STCU2_MBSLSW_MBSSW16_WIDTH               1u
#define STCU2_MBSLSW_MBSSW16(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW16_SHIFT))&STCU2_MBSLSW_MBSSW16_MASK)
#define STCU2_MBSLSW_MBSSW17_MASK                0x20000u
#define STCU2_MBSLSW_MBSSW17_SHIFT               17u
#define STCU2_MBSLSW_MBSSW17_WIDTH               1u
#define STCU2_MBSLSW_MBSSW17(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW17_SHIFT))&STCU2_MBSLSW_MBSSW17_MASK)
#define STCU2_MBSLSW_MBSSW18_MASK                0x40000u
#define STCU2_MBSLSW_MBSSW18_SHIFT               18u
#define STCU2_MBSLSW_MBSSW18_WIDTH               1u
#define STCU2_MBSLSW_MBSSW18(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW18_SHIFT))&STCU2_MBSLSW_MBSSW18_MASK)
#define STCU2_MBSLSW_MBSSW19_MASK                0x80000u
#define STCU2_MBSLSW_MBSSW19_SHIFT               19u
#define STCU2_MBSLSW_MBSSW19_WIDTH               1u
#define STCU2_MBSLSW_MBSSW19(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW19_SHIFT))&STCU2_MBSLSW_MBSSW19_MASK)
#define STCU2_MBSLSW_MBSSW20_MASK                0x100000u
#define STCU2_MBSLSW_MBSSW20_SHIFT               20u
#define STCU2_MBSLSW_MBSSW20_WIDTH               1u
#define STCU2_MBSLSW_MBSSW20(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW20_SHIFT))&STCU2_MBSLSW_MBSSW20_MASK)
#define STCU2_MBSLSW_MBSSW21_MASK                0x200000u
#define STCU2_MBSLSW_MBSSW21_SHIFT               21u
#define STCU2_MBSLSW_MBSSW21_WIDTH               1u
#define STCU2_MBSLSW_MBSSW21(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW21_SHIFT))&STCU2_MBSLSW_MBSSW21_MASK)
#define STCU2_MBSLSW_MBSSW22_MASK                0x400000u
#define STCU2_MBSLSW_MBSSW22_SHIFT               22u
#define STCU2_MBSLSW_MBSSW22_WIDTH               1u
#define STCU2_MBSLSW_MBSSW22(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW22_SHIFT))&STCU2_MBSLSW_MBSSW22_MASK)
#define STCU2_MBSLSW_MBSSW23_MASK                0x800000u
#define STCU2_MBSLSW_MBSSW23_SHIFT               23u
#define STCU2_MBSLSW_MBSSW23_WIDTH               1u
#define STCU2_MBSLSW_MBSSW23(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW23_SHIFT))&STCU2_MBSLSW_MBSSW23_MASK)
#define STCU2_MBSLSW_MBSSW24_MASK                0x1000000u
#define STCU2_MBSLSW_MBSSW24_SHIFT               24u
#define STCU2_MBSLSW_MBSSW24_WIDTH               1u
#define STCU2_MBSLSW_MBSSW24(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW24_SHIFT))&STCU2_MBSLSW_MBSSW24_MASK)
#define STCU2_MBSLSW_MBSSW25_MASK                0x2000000u
#define STCU2_MBSLSW_MBSSW25_SHIFT               25u
#define STCU2_MBSLSW_MBSSW25_WIDTH               1u
#define STCU2_MBSLSW_MBSSW25(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW25_SHIFT))&STCU2_MBSLSW_MBSSW25_MASK)
#define STCU2_MBSLSW_MBSSW26_MASK                0x4000000u
#define STCU2_MBSLSW_MBSSW26_SHIFT               26u
#define STCU2_MBSLSW_MBSSW26_WIDTH               1u
#define STCU2_MBSLSW_MBSSW26(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW26_SHIFT))&STCU2_MBSLSW_MBSSW26_MASK)
#define STCU2_MBSLSW_MBSSW27_MASK                0x8000000u
#define STCU2_MBSLSW_MBSSW27_SHIFT               27u
#define STCU2_MBSLSW_MBSSW27_WIDTH               1u
#define STCU2_MBSLSW_MBSSW27(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW27_SHIFT))&STCU2_MBSLSW_MBSSW27_MASK)
#define STCU2_MBSLSW_MBSSW28_MASK                0x10000000u
#define STCU2_MBSLSW_MBSSW28_SHIFT               28u
#define STCU2_MBSLSW_MBSSW28_WIDTH               1u
#define STCU2_MBSLSW_MBSSW28(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW28_SHIFT))&STCU2_MBSLSW_MBSSW28_MASK)
#define STCU2_MBSLSW_MBSSW29_MASK                0x20000000u
#define STCU2_MBSLSW_MBSSW29_SHIFT               29u
#define STCU2_MBSLSW_MBSSW29_WIDTH               1u
#define STCU2_MBSLSW_MBSSW29(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW29_SHIFT))&STCU2_MBSLSW_MBSSW29_MASK)
#define STCU2_MBSLSW_MBSSW30_MASK                0x40000000u
#define STCU2_MBSLSW_MBSSW30_SHIFT               30u
#define STCU2_MBSLSW_MBSSW30_WIDTH               1u
#define STCU2_MBSLSW_MBSSW30(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW30_SHIFT))&STCU2_MBSLSW_MBSSW30_MASK)
#define STCU2_MBSLSW_MBSSW31_MASK                0x80000000u
#define STCU2_MBSLSW_MBSSW31_SHIFT               31u
#define STCU2_MBSLSW_MBSSW31_WIDTH               1u
#define STCU2_MBSLSW_MBSSW31(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSLSW_MBSSW31_SHIFT))&STCU2_MBSLSW_MBSSW31_MASK)
/* MBSMSW Bit Fields */
#define STCU2_MBSMSW_MBSSW32_MASK                0x1u
#define STCU2_MBSMSW_MBSSW32_SHIFT               0u
#define STCU2_MBSMSW_MBSSW32_WIDTH               1u
#define STCU2_MBSMSW_MBSSW32(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW32_SHIFT))&STCU2_MBSMSW_MBSSW32_MASK)
#define STCU2_MBSMSW_MBSSW33_MASK                0x2u
#define STCU2_MBSMSW_MBSSW33_SHIFT               1u
#define STCU2_MBSMSW_MBSSW33_WIDTH               1u
#define STCU2_MBSMSW_MBSSW33(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW33_SHIFT))&STCU2_MBSMSW_MBSSW33_MASK)
#define STCU2_MBSMSW_MBSSW34_MASK                0x4u
#define STCU2_MBSMSW_MBSSW34_SHIFT               2u
#define STCU2_MBSMSW_MBSSW34_WIDTH               1u
#define STCU2_MBSMSW_MBSSW34(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW34_SHIFT))&STCU2_MBSMSW_MBSSW34_MASK)
#define STCU2_MBSMSW_MBSSW35_MASK                0x8u
#define STCU2_MBSMSW_MBSSW35_SHIFT               3u
#define STCU2_MBSMSW_MBSSW35_WIDTH               1u
#define STCU2_MBSMSW_MBSSW35(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW35_SHIFT))&STCU2_MBSMSW_MBSSW35_MASK)
#define STCU2_MBSMSW_MBSSW36_MASK                0x10u
#define STCU2_MBSMSW_MBSSW36_SHIFT               4u
#define STCU2_MBSMSW_MBSSW36_WIDTH               1u
#define STCU2_MBSMSW_MBSSW36(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW36_SHIFT))&STCU2_MBSMSW_MBSSW36_MASK)
#define STCU2_MBSMSW_MBSSW37_MASK                0x20u
#define STCU2_MBSMSW_MBSSW37_SHIFT               5u
#define STCU2_MBSMSW_MBSSW37_WIDTH               1u
#define STCU2_MBSMSW_MBSSW37(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW37_SHIFT))&STCU2_MBSMSW_MBSSW37_MASK)
#define STCU2_MBSMSW_MBSSW38_MASK                0x40u
#define STCU2_MBSMSW_MBSSW38_SHIFT               6u
#define STCU2_MBSMSW_MBSSW38_WIDTH               1u
#define STCU2_MBSMSW_MBSSW38(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW38_SHIFT))&STCU2_MBSMSW_MBSSW38_MASK)
#define STCU2_MBSMSW_MBSSW39_MASK                0x80u
#define STCU2_MBSMSW_MBSSW39_SHIFT               7u
#define STCU2_MBSMSW_MBSSW39_WIDTH               1u
#define STCU2_MBSMSW_MBSSW39(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW39_SHIFT))&STCU2_MBSMSW_MBSSW39_MASK)
#define STCU2_MBSMSW_MBSSW40_MASK                0x100u
#define STCU2_MBSMSW_MBSSW40_SHIFT               8u
#define STCU2_MBSMSW_MBSSW40_WIDTH               1u
#define STCU2_MBSMSW_MBSSW40(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW40_SHIFT))&STCU2_MBSMSW_MBSSW40_MASK)
#define STCU2_MBSMSW_MBSSW41_MASK                0x200u
#define STCU2_MBSMSW_MBSSW41_SHIFT               9u
#define STCU2_MBSMSW_MBSSW41_WIDTH               1u
#define STCU2_MBSMSW_MBSSW41(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW41_SHIFT))&STCU2_MBSMSW_MBSSW41_MASK)
#define STCU2_MBSMSW_MBSSW42_MASK                0x400u
#define STCU2_MBSMSW_MBSSW42_SHIFT               10u
#define STCU2_MBSMSW_MBSSW42_WIDTH               1u
#define STCU2_MBSMSW_MBSSW42(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW42_SHIFT))&STCU2_MBSMSW_MBSSW42_MASK)
