neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define STCU2_MBSMSW_MBSSW43_MASK                0x800u
#define STCU2_MBSMSW_MBSSW43_SHIFT               11u
#define STCU2_MBSMSW_MBSSW43_WIDTH               1u
#define STCU2_MBSMSW_MBSSW43(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW43_SHIFT))&STCU2_MBSMSW_MBSSW43_MASK)
#define STCU2_MBSMSW_MBSSW44_MASK                0x1000u
#define STCU2_MBSMSW_MBSSW44_SHIFT               12u
#define STCU2_MBSMSW_MBSSW44_WIDTH               1u
#define STCU2_MBSMSW_MBSSW44(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW44_SHIFT))&STCU2_MBSMSW_MBSSW44_MASK)
#define STCU2_MBSMSW_MBSSW45_MASK                0x2000u
#define STCU2_MBSMSW_MBSSW45_SHIFT               13u
#define STCU2_MBSMSW_MBSSW45_WIDTH               1u
#define STCU2_MBSMSW_MBSSW45(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW45_SHIFT))&STCU2_MBSMSW_MBSSW45_MASK)
#define STCU2_MBSMSW_MBSSW46_MASK                0x4000u
#define STCU2_MBSMSW_MBSSW46_SHIFT               14u
#define STCU2_MBSMSW_MBSSW46_WIDTH               1u
#define STCU2_MBSMSW_MBSSW46(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW46_SHIFT))&STCU2_MBSMSW_MBSSW46_MASK)
#define STCU2_MBSMSW_MBSSW47_MASK                0x8000u
#define STCU2_MBSMSW_MBSSW47_SHIFT               15u
#define STCU2_MBSMSW_MBSSW47_WIDTH               1u
#define STCU2_MBSMSW_MBSSW47(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW47_SHIFT))&STCU2_MBSMSW_MBSSW47_MASK)
#define STCU2_MBSMSW_MBSSW48_MASK                0x10000u
#define STCU2_MBSMSW_MBSSW48_SHIFT               16u
#define STCU2_MBSMSW_MBSSW48_WIDTH               1u
#define STCU2_MBSMSW_MBSSW48(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW48_SHIFT))&STCU2_MBSMSW_MBSSW48_MASK)
#define STCU2_MBSMSW_MBSSW49_MASK                0x20000u
#define STCU2_MBSMSW_MBSSW49_SHIFT               17u
#define STCU2_MBSMSW_MBSSW49_WIDTH               1u
#define STCU2_MBSMSW_MBSSW49(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW49_SHIFT))&STCU2_MBSMSW_MBSSW49_MASK)
#define STCU2_MBSMSW_MBSSW50_MASK                0x40000u
#define STCU2_MBSMSW_MBSSW50_SHIFT               18u
#define STCU2_MBSMSW_MBSSW50_WIDTH               1u
#define STCU2_MBSMSW_MBSSW50(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW50_SHIFT))&STCU2_MBSMSW_MBSSW50_MASK)
#define STCU2_MBSMSW_MBSSW51_MASK                0x80000u
#define STCU2_MBSMSW_MBSSW51_SHIFT               19u
#define STCU2_MBSMSW_MBSSW51_WIDTH               1u
#define STCU2_MBSMSW_MBSSW51(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW51_SHIFT))&STCU2_MBSMSW_MBSSW51_MASK)
#define STCU2_MBSMSW_MBSSW52_MASK                0x100000u
#define STCU2_MBSMSW_MBSSW52_SHIFT               20u
#define STCU2_MBSMSW_MBSSW52_WIDTH               1u
#define STCU2_MBSMSW_MBSSW52(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW52_SHIFT))&STCU2_MBSMSW_MBSSW52_MASK)
#define STCU2_MBSMSW_MBSSW53_MASK                0x200000u
#define STCU2_MBSMSW_MBSSW53_SHIFT               21u
#define STCU2_MBSMSW_MBSSW53_WIDTH               1u
#define STCU2_MBSMSW_MBSSW53(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW53_SHIFT))&STCU2_MBSMSW_MBSSW53_MASK)
#define STCU2_MBSMSW_MBSSW54_MASK                0x400000u
#define STCU2_MBSMSW_MBSSW54_SHIFT               22u
#define STCU2_MBSMSW_MBSSW54_WIDTH               1u
#define STCU2_MBSMSW_MBSSW54(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW54_SHIFT))&STCU2_MBSMSW_MBSSW54_MASK)
#define STCU2_MBSMSW_MBSSW55_MASK                0x800000u
#define STCU2_MBSMSW_MBSSW55_SHIFT               23u
#define STCU2_MBSMSW_MBSSW55_WIDTH               1u
#define STCU2_MBSMSW_MBSSW55(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW55_SHIFT))&STCU2_MBSMSW_MBSSW55_MASK)
#define STCU2_MBSMSW_MBSSW56_MASK                0x1000000u
#define STCU2_MBSMSW_MBSSW56_SHIFT               24u
#define STCU2_MBSMSW_MBSSW56_WIDTH               1u
#define STCU2_MBSMSW_MBSSW56(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW56_SHIFT))&STCU2_MBSMSW_MBSSW56_MASK)
#define STCU2_MBSMSW_MBSSW57_MASK                0x2000000u
#define STCU2_MBSMSW_MBSSW57_SHIFT               25u
#define STCU2_MBSMSW_MBSSW57_WIDTH               1u
#define STCU2_MBSMSW_MBSSW57(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW57_SHIFT))&STCU2_MBSMSW_MBSSW57_MASK)
#define STCU2_MBSMSW_MBSSW58_MASK                0x4000000u
#define STCU2_MBSMSW_MBSSW58_SHIFT               26u
#define STCU2_MBSMSW_MBSSW58_WIDTH               1u
#define STCU2_MBSMSW_MBSSW58(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW58_SHIFT))&STCU2_MBSMSW_MBSSW58_MASK)
#define STCU2_MBSMSW_MBSSW59_MASK                0x8000000u
#define STCU2_MBSMSW_MBSSW59_SHIFT               27u
#define STCU2_MBSMSW_MBSSW59_WIDTH               1u
#define STCU2_MBSMSW_MBSSW59(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW59_SHIFT))&STCU2_MBSMSW_MBSSW59_MASK)
#define STCU2_MBSMSW_MBSSW60_MASK                0x10000000u
#define STCU2_MBSMSW_MBSSW60_SHIFT               28u
#define STCU2_MBSMSW_MBSSW60_WIDTH               1u
#define STCU2_MBSMSW_MBSSW60(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW60_SHIFT))&STCU2_MBSMSW_MBSSW60_MASK)
#define STCU2_MBSMSW_MBSSW61_MASK                0x20000000u
#define STCU2_MBSMSW_MBSSW61_SHIFT               29u
#define STCU2_MBSMSW_MBSSW61_WIDTH               1u
#define STCU2_MBSMSW_MBSSW61(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW61_SHIFT))&STCU2_MBSMSW_MBSSW61_MASK)
#define STCU2_MBSMSW_MBSSW62_MASK                0x40000000u
#define STCU2_MBSMSW_MBSSW62_SHIFT               30u
#define STCU2_MBSMSW_MBSSW62_WIDTH               1u
#define STCU2_MBSMSW_MBSSW62(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW62_SHIFT))&STCU2_MBSMSW_MBSSW62_MASK)
#define STCU2_MBSMSW_MBSSW63_MASK                0x80000000u
#define STCU2_MBSMSW_MBSSW63_SHIFT               31u
#define STCU2_MBSMSW_MBSSW63_WIDTH               1u
#define STCU2_MBSMSW_MBSSW63(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSMSW_MBSSW63_SHIFT))&STCU2_MBSMSW_MBSSW63_MASK)
/* MBSHSW Bit Fields */
#define STCU2_MBSHSW_MBSSW64_MASK                0x1u
#define STCU2_MBSHSW_MBSSW64_SHIFT               0u
#define STCU2_MBSHSW_MBSSW64_WIDTH               1u
#define STCU2_MBSHSW_MBSSW64(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBSHSW_MBSSW64_SHIFT))&STCU2_MBSHSW_MBSSW64_MASK)
/* MBELSW Bit Fields */
#define STCU2_MBELSW_MBESW0_MASK                 0x1u
#define STCU2_MBELSW_MBESW0_SHIFT                0u
#define STCU2_MBELSW_MBESW0_WIDTH                1u
#define STCU2_MBELSW_MBESW0(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW0_SHIFT))&STCU2_MBELSW_MBESW0_MASK)
#define STCU2_MBELSW_MBESW1_MASK                 0x2u
#define STCU2_MBELSW_MBESW1_SHIFT                1u
#define STCU2_MBELSW_MBESW1_WIDTH                1u
#define STCU2_MBELSW_MBESW1(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW1_SHIFT))&STCU2_MBELSW_MBESW1_MASK)
#define STCU2_MBELSW_MBESW2_MASK                 0x4u
#define STCU2_MBELSW_MBESW2_SHIFT                2u
#define STCU2_MBELSW_MBESW2_WIDTH                1u
#define STCU2_MBELSW_MBESW2(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW2_SHIFT))&STCU2_MBELSW_MBESW2_MASK)
#define STCU2_MBELSW_MBESW3_MASK                 0x8u
#define STCU2_MBELSW_MBESW3_SHIFT                3u
#define STCU2_MBELSW_MBESW3_WIDTH                1u
#define STCU2_MBELSW_MBESW3(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW3_SHIFT))&STCU2_MBELSW_MBESW3_MASK)
#define STCU2_MBELSW_MBESW4_MASK                 0x10u
#define STCU2_MBELSW_MBESW4_SHIFT                4u
#define STCU2_MBELSW_MBESW4_WIDTH                1u
#define STCU2_MBELSW_MBESW4(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW4_SHIFT))&STCU2_MBELSW_MBESW4_MASK)
#define STCU2_MBELSW_MBESW5_MASK                 0x20u
#define STCU2_MBELSW_MBESW5_SHIFT                5u
#define STCU2_MBELSW_MBESW5_WIDTH                1u
#define STCU2_MBELSW_MBESW5(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW5_SHIFT))&STCU2_MBELSW_MBESW5_MASK)
#define STCU2_MBELSW_MBESW6_MASK                 0x40u
#define STCU2_MBELSW_MBESW6_SHIFT                6u
#define STCU2_MBELSW_MBESW6_WIDTH                1u
#define STCU2_MBELSW_MBESW6(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW6_SHIFT))&STCU2_MBELSW_MBESW6_MASK)
#define STCU2_MBELSW_MBESW7_MASK                 0x80u
#define STCU2_MBELSW_MBESW7_SHIFT                7u
#define STCU2_MBELSW_MBESW7_WIDTH                1u
#define STCU2_MBELSW_MBESW7(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW7_SHIFT))&STCU2_MBELSW_MBESW7_MASK)
#define STCU2_MBELSW_MBESW8_MASK                 0x100u
#define STCU2_MBELSW_MBESW8_SHIFT                8u
#define STCU2_MBELSW_MBESW8_WIDTH                1u
#define STCU2_MBELSW_MBESW8(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW8_SHIFT))&STCU2_MBELSW_MBESW8_MASK)
#define STCU2_MBELSW_MBESW9_MASK                 0x200u
#define STCU2_MBELSW_MBESW9_SHIFT                9u
#define STCU2_MBELSW_MBESW9_WIDTH                1u
#define STCU2_MBELSW_MBESW9(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW9_SHIFT))&STCU2_MBELSW_MBESW9_MASK)
#define STCU2_MBELSW_MBESW10_MASK                0x400u
#define STCU2_MBELSW_MBESW10_SHIFT               10u
#define STCU2_MBELSW_MBESW10_WIDTH               1u
#define STCU2_MBELSW_MBESW10(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW10_SHIFT))&STCU2_MBELSW_MBESW10_MASK)
#define STCU2_MBELSW_MBESW11_MASK                0x800u
#define STCU2_MBELSW_MBESW11_SHIFT               11u
#define STCU2_MBELSW_MBESW11_WIDTH               1u
#define STCU2_MBELSW_MBESW11(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW11_SHIFT))&STCU2_MBELSW_MBESW11_MASK)
#define STCU2_MBELSW_MBESW12_MASK                0x1000u
#define STCU2_MBELSW_MBESW12_SHIFT               12u
#define STCU2_MBELSW_MBESW12_WIDTH               1u
#define STCU2_MBELSW_MBESW12(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW12_SHIFT))&STCU2_MBELSW_MBESW12_MASK)
#define STCU2_MBELSW_MBESW13_MASK                0x2000u
#define STCU2_MBELSW_MBESW13_SHIFT               13u
#define STCU2_MBELSW_MBESW13_WIDTH               1u
#define STCU2_MBELSW_MBESW13(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW13_SHIFT))&STCU2_MBELSW_MBESW13_MASK)
#define STCU2_MBELSW_MBESW14_MASK                0x4000u
#define STCU2_MBELSW_MBESW14_SHIFT               14u
#define STCU2_MBELSW_MBESW14_WIDTH               1u
#define STCU2_MBELSW_MBESW14(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW14_SHIFT))&STCU2_MBELSW_MBESW14_MASK)
#define STCU2_MBELSW_MBESW15_MASK                0x8000u
#define STCU2_MBELSW_MBESW15_SHIFT               15u
#define STCU2_MBELSW_MBESW15_WIDTH               1u
#define STCU2_MBELSW_MBESW15(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW15_SHIFT))&STCU2_MBELSW_MBESW15_MASK)
#define STCU2_MBELSW_MBESW16_MASK                0x10000u
#define STCU2_MBELSW_MBESW16_SHIFT               16u
#define STCU2_MBELSW_MBESW16_WIDTH               1u
#define STCU2_MBELSW_MBESW16(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW16_SHIFT))&STCU2_MBELSW_MBESW16_MASK)
#define STCU2_MBELSW_MBESW17_MASK                0x20000u
#define STCU2_MBELSW_MBESW17_SHIFT               17u
#define STCU2_MBELSW_MBESW17_WIDTH               1u
#define STCU2_MBELSW_MBESW17(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW17_SHIFT))&STCU2_MBELSW_MBESW17_MASK)
#define STCU2_MBELSW_MBESW18_MASK                0x40000u
#define STCU2_MBELSW_MBESW18_SHIFT               18u
#define STCU2_MBELSW_MBESW18_WIDTH               1u
#define STCU2_MBELSW_MBESW18(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW18_SHIFT))&STCU2_MBELSW_MBESW18_MASK)
#define STCU2_MBELSW_MBESW19_MASK                0x80000u
#define STCU2_MBELSW_MBESW19_SHIFT               19u
#define STCU2_MBELSW_MBESW19_WIDTH               1u
#define STCU2_MBELSW_MBESW19(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW19_SHIFT))&STCU2_MBELSW_MBESW19_MASK)
#define STCU2_MBELSW_MBESW20_MASK                0x100000u
#define STCU2_MBELSW_MBESW20_SHIFT               20u
#define STCU2_MBELSW_MBESW20_WIDTH               1u
#define STCU2_MBELSW_MBESW20(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW20_SHIFT))&STCU2_MBELSW_MBESW20_MASK)
#define STCU2_MBELSW_MBESW21_MASK                0x200000u
#define STCU2_MBELSW_MBESW21_SHIFT               21u
#define STCU2_MBELSW_MBESW21_WIDTH               1u
#define STCU2_MBELSW_MBESW21(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW21_SHIFT))&STCU2_MBELSW_MBESW21_MASK)
#define STCU2_MBELSW_MBESW22_MASK                0x400000u
#define STCU2_MBELSW_MBESW22_SHIFT               22u
#define STCU2_MBELSW_MBESW22_WIDTH               1u
#define STCU2_MBELSW_MBESW22(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW22_SHIFT))&STCU2_MBELSW_MBESW22_MASK)
#define STCU2_MBELSW_MBESW23_MASK                0x800000u
#define STCU2_MBELSW_MBESW23_SHIFT               23u
#define STCU2_MBELSW_MBESW23_WIDTH               1u
#define STCU2_MBELSW_MBESW23(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW23_SHIFT))&STCU2_MBELSW_MBESW23_MASK)
#define STCU2_MBELSW_MBESW24_MASK                0x1000000u
#define STCU2_MBELSW_MBESW24_SHIFT               24u
#define STCU2_MBELSW_MBESW24_WIDTH               1u
#define STCU2_MBELSW_MBESW24(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW24_SHIFT))&STCU2_MBELSW_MBESW24_MASK)
#define STCU2_MBELSW_MBESW25_MASK                0x2000000u
#define STCU2_MBELSW_MBESW25_SHIFT               25u
#define STCU2_MBELSW_MBESW25_WIDTH               1u
#define STCU2_MBELSW_MBESW25(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW25_SHIFT))&STCU2_MBELSW_MBESW25_MASK)
#define STCU2_MBELSW_MBESW26_MASK                0x4000000u
#define STCU2_MBELSW_MBESW26_SHIFT               26u
#define STCU2_MBELSW_MBESW26_WIDTH               1u
#define STCU2_MBELSW_MBESW26(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW26_SHIFT))&STCU2_MBELSW_MBESW26_MASK)
#define STCU2_MBELSW_MBESW27_MASK                0x8000000u
#define STCU2_MBELSW_MBESW27_SHIFT               27u
#define STCU2_MBELSW_MBESW27_WIDTH               1u
#define STCU2_MBELSW_MBESW27(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW27_SHIFT))&STCU2_MBELSW_MBESW27_MASK)
#define STCU2_MBELSW_MBESW28_MASK                0x10000000u
#define STCU2_MBELSW_MBESW28_SHIFT               28u
#define STCU2_MBELSW_MBESW28_WIDTH               1u
#define STCU2_MBELSW_MBESW28(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW28_SHIFT))&STCU2_MBELSW_MBESW28_MASK)
#define STCU2_MBELSW_MBESW29_MASK                0x20000000u
#define STCU2_MBELSW_MBESW29_SHIFT               29u
#define STCU2_MBELSW_MBESW29_WIDTH               1u
#define STCU2_MBELSW_MBESW29(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW29_SHIFT))&STCU2_MBELSW_MBESW29_MASK)
#define STCU2_MBELSW_MBESW30_MASK                0x40000000u
#define STCU2_MBELSW_MBESW30_SHIFT               30u
#define STCU2_MBELSW_MBESW30_WIDTH               1u
#define STCU2_MBELSW_MBESW30(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW30_SHIFT))&STCU2_MBELSW_MBESW30_MASK)
#define STCU2_MBELSW_MBESW31_MASK                0x80000000u
#define STCU2_MBELSW_MBESW31_SHIFT               31u
#define STCU2_MBELSW_MBESW31_WIDTH               1u
#define STCU2_MBELSW_MBESW31(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBELSW_MBESW31_SHIFT))&STCU2_MBELSW_MBESW31_MASK)
/* MBEMSW Bit Fields */
#define STCU2_MBEMSW_MBESW32_MASK                0x1u
#define STCU2_MBEMSW_MBESW32_SHIFT               0u
#define STCU2_MBEMSW_MBESW32_WIDTH               1u
#define STCU2_MBEMSW_MBESW32(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW32_SHIFT))&STCU2_MBEMSW_MBESW32_MASK)
#define STCU2_MBEMSW_MBESW33_MASK                0x2u
#define STCU2_MBEMSW_MBESW33_SHIFT               1u
#define STCU2_MBEMSW_MBESW33_WIDTH               1u
#define STCU2_MBEMSW_MBESW33(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW33_SHIFT))&STCU2_MBEMSW_MBESW33_MASK)
#define STCU2_MBEMSW_MBESW34_MASK                0x4u
#define STCU2_MBEMSW_MBESW34_SHIFT               2u
#define STCU2_MBEMSW_MBESW34_WIDTH               1u
#define STCU2_MBEMSW_MBESW34(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW34_SHIFT))&STCU2_MBEMSW_MBESW34_MASK)
#define STCU2_MBEMSW_MBESW35_MASK                0x8u
#define STCU2_MBEMSW_MBESW35_SHIFT               3u
#define STCU2_MBEMSW_MBESW35_WIDTH               1u
#define STCU2_MBEMSW_MBESW35(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW35_SHIFT))&STCU2_MBEMSW_MBESW35_MASK)
#define STCU2_MBEMSW_MBESW36_MASK                0x10u
#define STCU2_MBEMSW_MBESW36_SHIFT               4u
#define STCU2_MBEMSW_MBESW36_WIDTH               1u
#define STCU2_MBEMSW_MBESW36(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW36_SHIFT))&STCU2_MBEMSW_MBESW36_MASK)
#define STCU2_MBEMSW_MBESW37_MASK                0x20u
#define STCU2_MBEMSW_MBESW37_SHIFT               5u
#define STCU2_MBEMSW_MBESW37_WIDTH               1u
#define STCU2_MBEMSW_MBESW37(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW37_SHIFT))&STCU2_MBEMSW_MBESW37_MASK)
#define STCU2_MBEMSW_MBESW38_MASK                0x40u
#define STCU2_MBEMSW_MBESW38_SHIFT               6u
#define STCU2_MBEMSW_MBESW38_WIDTH               1u
#define STCU2_MBEMSW_MBESW38(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW38_SHIFT))&STCU2_MBEMSW_MBESW38_MASK)
#define STCU2_MBEMSW_MBESW39_MASK                0x80u
#define STCU2_MBEMSW_MBESW39_SHIFT               7u
#define STCU2_MBEMSW_MBESW39_WIDTH               1u
#define STCU2_MBEMSW_MBESW39(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW39_SHIFT))&STCU2_MBEMSW_MBESW39_MASK)
#define STCU2_MBEMSW_MBESW40_MASK                0x100u
#define STCU2_MBEMSW_MBESW40_SHIFT               8u
#define STCU2_MBEMSW_MBESW40_WIDTH               1u
#define STCU2_MBEMSW_MBESW40(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW40_SHIFT))&STCU2_MBEMSW_MBESW40_MASK)
#define STCU2_MBEMSW_MBESW41_MASK                0x200u
#define STCU2_MBEMSW_MBESW41_SHIFT               9u
#define STCU2_MBEMSW_MBESW41_WIDTH               1u
#define STCU2_MBEMSW_MBESW41(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW41_SHIFT))&STCU2_MBEMSW_MBESW41_MASK)
#define STCU2_MBEMSW_MBESW42_MASK                0x400u
#define STCU2_MBEMSW_MBESW42_SHIFT               10u
#define STCU2_MBEMSW_MBESW42_WIDTH               1u
#define STCU2_MBEMSW_MBESW42(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW42_SHIFT))&STCU2_MBEMSW_MBESW42_MASK)
#define STCU2_MBEMSW_MBESW43_MASK                0x800u
#define STCU2_MBEMSW_MBESW43_SHIFT               11u
#define STCU2_MBEMSW_MBESW43_WIDTH               1u
#define STCU2_MBEMSW_MBESW43(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW43_SHIFT))&STCU2_MBEMSW_MBESW43_MASK)
#define STCU2_MBEMSW_MBESW44_MASK                0x1000u
#define STCU2_MBEMSW_MBESW44_SHIFT               12u
#define STCU2_MBEMSW_MBESW44_WIDTH               1u
#define STCU2_MBEMSW_MBESW44(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW44_SHIFT))&STCU2_MBEMSW_MBESW44_MASK)
#define STCU2_MBEMSW_MBESW45_MASK                0x2000u
#define STCU2_MBEMSW_MBESW45_SHIFT               13u
#define STCU2_MBEMSW_MBESW45_WIDTH               1u
#define STCU2_MBEMSW_MBESW45(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW45_SHIFT))&STCU2_MBEMSW_MBESW45_MASK)
#define STCU2_MBEMSW_MBESW46_MASK                0x4000u
#define STCU2_MBEMSW_MBESW46_SHIFT               14u
#define STCU2_MBEMSW_MBESW46_WIDTH               1u
#define STCU2_MBEMSW_MBESW46(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW46_SHIFT))&STCU2_MBEMSW_MBESW46_MASK)
#define STCU2_MBEMSW_MBESW47_MASK                0x8000u
#define STCU2_MBEMSW_MBESW47_SHIFT               15u
#define STCU2_MBEMSW_MBESW47_WIDTH               1u
#define STCU2_MBEMSW_MBESW47(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW47_SHIFT))&STCU2_MBEMSW_MBESW47_MASK)
#define STCU2_MBEMSW_MBESW48_MASK                0x10000u
#define STCU2_MBEMSW_MBESW48_SHIFT               16u
#define STCU2_MBEMSW_MBESW48_WIDTH               1u
#define STCU2_MBEMSW_MBESW48(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW48_SHIFT))&STCU2_MBEMSW_MBESW48_MASK)
#define STCU2_MBEMSW_MBESW49_MASK                0x20000u
#define STCU2_MBEMSW_MBESW49_SHIFT               17u
#define STCU2_MBEMSW_MBESW49_WIDTH               1u
#define STCU2_MBEMSW_MBESW49(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW49_SHIFT))&STCU2_MBEMSW_MBESW49_MASK)
#define STCU2_MBEMSW_MBESW50_MASK                0x40000u
#define STCU2_MBEMSW_MBESW50_SHIFT               18u
#define STCU2_MBEMSW_MBESW50_WIDTH               1u
#define STCU2_MBEMSW_MBESW50(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW50_SHIFT))&STCU2_MBEMSW_MBESW50_MASK)
#define STCU2_MBEMSW_MBESW51_MASK                0x80000u
#define STCU2_MBEMSW_MBESW51_SHIFT               19u
#define STCU2_MBEMSW_MBESW51_WIDTH               1u
#define STCU2_MBEMSW_MBESW51(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW51_SHIFT))&STCU2_MBEMSW_MBESW51_MASK)
#define STCU2_MBEMSW_MBESW52_MASK                0x100000u
#define STCU2_MBEMSW_MBESW52_SHIFT               20u
#define STCU2_MBEMSW_MBESW52_WIDTH               1u
#define STCU2_MBEMSW_MBESW52(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW52_SHIFT))&STCU2_MBEMSW_MBESW52_MASK)
#define STCU2_MBEMSW_MBESW53_MASK                0x200000u
#define STCU2_MBEMSW_MBESW53_SHIFT               21u
#define STCU2_MBEMSW_MBESW53_WIDTH               1u
#define STCU2_MBEMSW_MBESW53(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW53_SHIFT))&STCU2_MBEMSW_MBESW53_MASK)
#define STCU2_MBEMSW_MBESW54_MASK                0x400000u
#define STCU2_MBEMSW_MBESW54_SHIFT               22u
#define STCU2_MBEMSW_MBESW54_WIDTH               1u
#define STCU2_MBEMSW_MBESW54(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW54_SHIFT))&STCU2_MBEMSW_MBESW54_MASK)
#define STCU2_MBEMSW_MBESW55_MASK                0x800000u
#define STCU2_MBEMSW_MBESW55_SHIFT               23u
#define STCU2_MBEMSW_MBESW55_WIDTH               1u
#define STCU2_MBEMSW_MBESW55(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW55_SHIFT))&STCU2_MBEMSW_MBESW55_MASK)
#define STCU2_MBEMSW_MBESW56_MASK                0x1000000u
#define STCU2_MBEMSW_MBESW56_SHIFT               24u
#define STCU2_MBEMSW_MBESW56_WIDTH               1u
#define STCU2_MBEMSW_MBESW56(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW56_SHIFT))&STCU2_MBEMSW_MBESW56_MASK)
#define STCU2_MBEMSW_MBESW57_MASK                0x2000000u
#define STCU2_MBEMSW_MBESW57_SHIFT               25u
#define STCU2_MBEMSW_MBESW57_WIDTH               1u
#define STCU2_MBEMSW_MBESW57(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW57_SHIFT))&STCU2_MBEMSW_MBESW57_MASK)
#define STCU2_MBEMSW_MBESW58_MASK                0x4000000u
#define STCU2_MBEMSW_MBESW58_SHIFT               26u
