neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define STCU2_MBEMSW_MBESW58_WIDTH               1u
#define STCU2_MBEMSW_MBESW58(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW58_SHIFT))&STCU2_MBEMSW_MBESW58_MASK)
#define STCU2_MBEMSW_MBESW59_MASK                0x8000000u
#define STCU2_MBEMSW_MBESW59_SHIFT               27u
#define STCU2_MBEMSW_MBESW59_WIDTH               1u
#define STCU2_MBEMSW_MBESW59(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW59_SHIFT))&STCU2_MBEMSW_MBESW59_MASK)
#define STCU2_MBEMSW_MBESW60_MASK                0x10000000u
#define STCU2_MBEMSW_MBESW60_SHIFT               28u
#define STCU2_MBEMSW_MBESW60_WIDTH               1u
#define STCU2_MBEMSW_MBESW60(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW60_SHIFT))&STCU2_MBEMSW_MBESW60_MASK)
#define STCU2_MBEMSW_MBESW61_MASK                0x20000000u
#define STCU2_MBEMSW_MBESW61_SHIFT               29u
#define STCU2_MBEMSW_MBESW61_WIDTH               1u
#define STCU2_MBEMSW_MBESW61(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW61_SHIFT))&STCU2_MBEMSW_MBESW61_MASK)
#define STCU2_MBEMSW_MBESW62_MASK                0x40000000u
#define STCU2_MBEMSW_MBESW62_SHIFT               30u
#define STCU2_MBEMSW_MBESW62_WIDTH               1u
#define STCU2_MBEMSW_MBESW62(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW62_SHIFT))&STCU2_MBEMSW_MBESW62_MASK)
#define STCU2_MBEMSW_MBESW63_MASK                0x80000000u
#define STCU2_MBEMSW_MBESW63_SHIFT               31u
#define STCU2_MBEMSW_MBESW63_WIDTH               1u
#define STCU2_MBEMSW_MBESW63(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEMSW_MBESW63_SHIFT))&STCU2_MBEMSW_MBESW63_MASK)
/* MBEHSW Bit Fields */
#define STCU2_MBEHSW_MBESW64_MASK                0x1u
#define STCU2_MBEHSW_MBESW64_SHIFT               0u
#define STCU2_MBEHSW_MBESW64_WIDTH               1u
#define STCU2_MBEHSW_MBESW64(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBEHSW_MBESW64_SHIFT))&STCU2_MBEHSW_MBESW64_MASK)
/* MBUFML Bit Fields */
#define STCU2_MBUFML_MBUFM0_MASK                 0x1u
#define STCU2_MBUFML_MBUFM0_SHIFT                0u
#define STCU2_MBUFML_MBUFM0_WIDTH                1u
#define STCU2_MBUFML_MBUFM0(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM0_SHIFT))&STCU2_MBUFML_MBUFM0_MASK)
#define STCU2_MBUFML_MBUFM1_MASK                 0x2u
#define STCU2_MBUFML_MBUFM1_SHIFT                1u
#define STCU2_MBUFML_MBUFM1_WIDTH                1u
#define STCU2_MBUFML_MBUFM1(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM1_SHIFT))&STCU2_MBUFML_MBUFM1_MASK)
#define STCU2_MBUFML_MBUFM2_MASK                 0x4u
#define STCU2_MBUFML_MBUFM2_SHIFT                2u
#define STCU2_MBUFML_MBUFM2_WIDTH                1u
#define STCU2_MBUFML_MBUFM2(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM2_SHIFT))&STCU2_MBUFML_MBUFM2_MASK)
#define STCU2_MBUFML_MBUFM3_MASK                 0x8u
#define STCU2_MBUFML_MBUFM3_SHIFT                3u
#define STCU2_MBUFML_MBUFM3_WIDTH                1u
#define STCU2_MBUFML_MBUFM3(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM3_SHIFT))&STCU2_MBUFML_MBUFM3_MASK)
#define STCU2_MBUFML_MBUFM4_MASK                 0x10u
#define STCU2_MBUFML_MBUFM4_SHIFT                4u
#define STCU2_MBUFML_MBUFM4_WIDTH                1u
#define STCU2_MBUFML_MBUFM4(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM4_SHIFT))&STCU2_MBUFML_MBUFM4_MASK)
#define STCU2_MBUFML_MBUFM5_MASK                 0x20u
#define STCU2_MBUFML_MBUFM5_SHIFT                5u
#define STCU2_MBUFML_MBUFM5_WIDTH                1u
#define STCU2_MBUFML_MBUFM5(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM5_SHIFT))&STCU2_MBUFML_MBUFM5_MASK)
#define STCU2_MBUFML_MBUFM6_MASK                 0x40u
#define STCU2_MBUFML_MBUFM6_SHIFT                6u
#define STCU2_MBUFML_MBUFM6_WIDTH                1u
#define STCU2_MBUFML_MBUFM6(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM6_SHIFT))&STCU2_MBUFML_MBUFM6_MASK)
#define STCU2_MBUFML_MBUFM7_MASK                 0x80u
#define STCU2_MBUFML_MBUFM7_SHIFT                7u
#define STCU2_MBUFML_MBUFM7_WIDTH                1u
#define STCU2_MBUFML_MBUFM7(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM7_SHIFT))&STCU2_MBUFML_MBUFM7_MASK)
#define STCU2_MBUFML_MBUFM8_MASK                 0x100u
#define STCU2_MBUFML_MBUFM8_SHIFT                8u
#define STCU2_MBUFML_MBUFM8_WIDTH                1u
#define STCU2_MBUFML_MBUFM8(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM8_SHIFT))&STCU2_MBUFML_MBUFM8_MASK)
#define STCU2_MBUFML_MBUFM9_MASK                 0x200u
#define STCU2_MBUFML_MBUFM9_SHIFT                9u
#define STCU2_MBUFML_MBUFM9_WIDTH                1u
#define STCU2_MBUFML_MBUFM9(x)                   (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM9_SHIFT))&STCU2_MBUFML_MBUFM9_MASK)
#define STCU2_MBUFML_MBUFM10_MASK                0x400u
#define STCU2_MBUFML_MBUFM10_SHIFT               10u
#define STCU2_MBUFML_MBUFM10_WIDTH               1u
#define STCU2_MBUFML_MBUFM10(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM10_SHIFT))&STCU2_MBUFML_MBUFM10_MASK)
#define STCU2_MBUFML_MBUFM11_MASK                0x800u
#define STCU2_MBUFML_MBUFM11_SHIFT               11u
#define STCU2_MBUFML_MBUFM11_WIDTH               1u
#define STCU2_MBUFML_MBUFM11(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM11_SHIFT))&STCU2_MBUFML_MBUFM11_MASK)
#define STCU2_MBUFML_MBUFM12_MASK                0x1000u
#define STCU2_MBUFML_MBUFM12_SHIFT               12u
#define STCU2_MBUFML_MBUFM12_WIDTH               1u
#define STCU2_MBUFML_MBUFM12(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM12_SHIFT))&STCU2_MBUFML_MBUFM12_MASK)
#define STCU2_MBUFML_MBUFM13_MASK                0x2000u
#define STCU2_MBUFML_MBUFM13_SHIFT               13u
#define STCU2_MBUFML_MBUFM13_WIDTH               1u
#define STCU2_MBUFML_MBUFM13(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM13_SHIFT))&STCU2_MBUFML_MBUFM13_MASK)
#define STCU2_MBUFML_MBUFM14_MASK                0x4000u
#define STCU2_MBUFML_MBUFM14_SHIFT               14u
#define STCU2_MBUFML_MBUFM14_WIDTH               1u
#define STCU2_MBUFML_MBUFM14(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM14_SHIFT))&STCU2_MBUFML_MBUFM14_MASK)
#define STCU2_MBUFML_MBUFM15_MASK                0x8000u
#define STCU2_MBUFML_MBUFM15_SHIFT               15u
#define STCU2_MBUFML_MBUFM15_WIDTH               1u
#define STCU2_MBUFML_MBUFM15(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM15_SHIFT))&STCU2_MBUFML_MBUFM15_MASK)
#define STCU2_MBUFML_MBUFM16_MASK                0x10000u
#define STCU2_MBUFML_MBUFM16_SHIFT               16u
#define STCU2_MBUFML_MBUFM16_WIDTH               1u
#define STCU2_MBUFML_MBUFM16(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM16_SHIFT))&STCU2_MBUFML_MBUFM16_MASK)
#define STCU2_MBUFML_MBUFM17_MASK                0x20000u
#define STCU2_MBUFML_MBUFM17_SHIFT               17u
#define STCU2_MBUFML_MBUFM17_WIDTH               1u
#define STCU2_MBUFML_MBUFM17(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM17_SHIFT))&STCU2_MBUFML_MBUFM17_MASK)
#define STCU2_MBUFML_MBUFM18_MASK                0x40000u
#define STCU2_MBUFML_MBUFM18_SHIFT               18u
#define STCU2_MBUFML_MBUFM18_WIDTH               1u
#define STCU2_MBUFML_MBUFM18(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM18_SHIFT))&STCU2_MBUFML_MBUFM18_MASK)
#define STCU2_MBUFML_MBUFM19_MASK                0x80000u
#define STCU2_MBUFML_MBUFM19_SHIFT               19u
#define STCU2_MBUFML_MBUFM19_WIDTH               1u
#define STCU2_MBUFML_MBUFM19(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM19_SHIFT))&STCU2_MBUFML_MBUFM19_MASK)
#define STCU2_MBUFML_MBUFM20_MASK                0x100000u
#define STCU2_MBUFML_MBUFM20_SHIFT               20u
#define STCU2_MBUFML_MBUFM20_WIDTH               1u
#define STCU2_MBUFML_MBUFM20(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM20_SHIFT))&STCU2_MBUFML_MBUFM20_MASK)
#define STCU2_MBUFML_MBUFM21_MASK                0x200000u
#define STCU2_MBUFML_MBUFM21_SHIFT               21u
#define STCU2_MBUFML_MBUFM21_WIDTH               1u
#define STCU2_MBUFML_MBUFM21(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM21_SHIFT))&STCU2_MBUFML_MBUFM21_MASK)
#define STCU2_MBUFML_MBUFM22_MASK                0x400000u
#define STCU2_MBUFML_MBUFM22_SHIFT               22u
#define STCU2_MBUFML_MBUFM22_WIDTH               1u
#define STCU2_MBUFML_MBUFM22(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM22_SHIFT))&STCU2_MBUFML_MBUFM22_MASK)
#define STCU2_MBUFML_MBUFM23_MASK                0x800000u
#define STCU2_MBUFML_MBUFM23_SHIFT               23u
#define STCU2_MBUFML_MBUFM23_WIDTH               1u
#define STCU2_MBUFML_MBUFM23(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM23_SHIFT))&STCU2_MBUFML_MBUFM23_MASK)
#define STCU2_MBUFML_MBUFM24_MASK                0x1000000u
#define STCU2_MBUFML_MBUFM24_SHIFT               24u
#define STCU2_MBUFML_MBUFM24_WIDTH               1u
#define STCU2_MBUFML_MBUFM24(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM24_SHIFT))&STCU2_MBUFML_MBUFM24_MASK)
#define STCU2_MBUFML_MBUFM25_MASK                0x2000000u
#define STCU2_MBUFML_MBUFM25_SHIFT               25u
#define STCU2_MBUFML_MBUFM25_WIDTH               1u
#define STCU2_MBUFML_MBUFM25(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM25_SHIFT))&STCU2_MBUFML_MBUFM25_MASK)
#define STCU2_MBUFML_MBUFM26_MASK                0x4000000u
#define STCU2_MBUFML_MBUFM26_SHIFT               26u
#define STCU2_MBUFML_MBUFM26_WIDTH               1u
#define STCU2_MBUFML_MBUFM26(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM26_SHIFT))&STCU2_MBUFML_MBUFM26_MASK)
#define STCU2_MBUFML_MBUFM27_MASK                0x8000000u
#define STCU2_MBUFML_MBUFM27_SHIFT               27u
#define STCU2_MBUFML_MBUFM27_WIDTH               1u
#define STCU2_MBUFML_MBUFM27(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM27_SHIFT))&STCU2_MBUFML_MBUFM27_MASK)
#define STCU2_MBUFML_MBUFM28_MASK                0x10000000u
#define STCU2_MBUFML_MBUFM28_SHIFT               28u
#define STCU2_MBUFML_MBUFM28_WIDTH               1u
#define STCU2_MBUFML_MBUFM28(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM28_SHIFT))&STCU2_MBUFML_MBUFM28_MASK)
#define STCU2_MBUFML_MBUFM29_MASK                0x20000000u
#define STCU2_MBUFML_MBUFM29_SHIFT               29u
#define STCU2_MBUFML_MBUFM29_WIDTH               1u
#define STCU2_MBUFML_MBUFM29(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM29_SHIFT))&STCU2_MBUFML_MBUFM29_MASK)
#define STCU2_MBUFML_MBUFM30_MASK                0x40000000u
#define STCU2_MBUFML_MBUFM30_SHIFT               30u
#define STCU2_MBUFML_MBUFM30_WIDTH               1u
#define STCU2_MBUFML_MBUFM30(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM30_SHIFT))&STCU2_MBUFML_MBUFM30_MASK)
#define STCU2_MBUFML_MBUFM31_MASK                0x80000000u
#define STCU2_MBUFML_MBUFM31_SHIFT               31u
#define STCU2_MBUFML_MBUFM31_WIDTH               1u
#define STCU2_MBUFML_MBUFM31(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFML_MBUFM31_SHIFT))&STCU2_MBUFML_MBUFM31_MASK)
/* MBUFMM Bit Fields */
#define STCU2_MBUFMM_MBUFM32_MASK                0x1u
#define STCU2_MBUFMM_MBUFM32_SHIFT               0u
#define STCU2_MBUFMM_MBUFM32_WIDTH               1u
#define STCU2_MBUFMM_MBUFM32(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM32_SHIFT))&STCU2_MBUFMM_MBUFM32_MASK)
#define STCU2_MBUFMM_MBUFM33_MASK                0x2u
#define STCU2_MBUFMM_MBUFM33_SHIFT               1u
#define STCU2_MBUFMM_MBUFM33_WIDTH               1u
#define STCU2_MBUFMM_MBUFM33(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM33_SHIFT))&STCU2_MBUFMM_MBUFM33_MASK)
#define STCU2_MBUFMM_MBUFM34_MASK                0x4u
#define STCU2_MBUFMM_MBUFM34_SHIFT               2u
#define STCU2_MBUFMM_MBUFM34_WIDTH               1u
#define STCU2_MBUFMM_MBUFM34(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM34_SHIFT))&STCU2_MBUFMM_MBUFM34_MASK)
#define STCU2_MBUFMM_MBUFM35_MASK                0x8u
#define STCU2_MBUFMM_MBUFM35_SHIFT               3u
#define STCU2_MBUFMM_MBUFM35_WIDTH               1u
#define STCU2_MBUFMM_MBUFM35(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM35_SHIFT))&STCU2_MBUFMM_MBUFM35_MASK)
#define STCU2_MBUFMM_MBUFM36_MASK                0x10u
#define STCU2_MBUFMM_MBUFM36_SHIFT               4u
#define STCU2_MBUFMM_MBUFM36_WIDTH               1u
#define STCU2_MBUFMM_MBUFM36(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM36_SHIFT))&STCU2_MBUFMM_MBUFM36_MASK)
#define STCU2_MBUFMM_MBUFM37_MASK                0x20u
#define STCU2_MBUFMM_MBUFM37_SHIFT               5u
#define STCU2_MBUFMM_MBUFM37_WIDTH               1u
#define STCU2_MBUFMM_MBUFM37(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM37_SHIFT))&STCU2_MBUFMM_MBUFM37_MASK)
#define STCU2_MBUFMM_MBUFM38_MASK                0x40u
#define STCU2_MBUFMM_MBUFM38_SHIFT               6u
#define STCU2_MBUFMM_MBUFM38_WIDTH               1u
#define STCU2_MBUFMM_MBUFM38(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM38_SHIFT))&STCU2_MBUFMM_MBUFM38_MASK)
#define STCU2_MBUFMM_MBUFM39_MASK                0x80u
#define STCU2_MBUFMM_MBUFM39_SHIFT               7u
#define STCU2_MBUFMM_MBUFM39_WIDTH               1u
#define STCU2_MBUFMM_MBUFM39(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM39_SHIFT))&STCU2_MBUFMM_MBUFM39_MASK)
#define STCU2_MBUFMM_MBUFM40_MASK                0x100u
#define STCU2_MBUFMM_MBUFM40_SHIFT               8u
#define STCU2_MBUFMM_MBUFM40_WIDTH               1u
#define STCU2_MBUFMM_MBUFM40(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM40_SHIFT))&STCU2_MBUFMM_MBUFM40_MASK)
#define STCU2_MBUFMM_MBUFM41_MASK                0x200u
#define STCU2_MBUFMM_MBUFM41_SHIFT               9u
#define STCU2_MBUFMM_MBUFM41_WIDTH               1u
#define STCU2_MBUFMM_MBUFM41(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM41_SHIFT))&STCU2_MBUFMM_MBUFM41_MASK)
#define STCU2_MBUFMM_MBUFM42_MASK                0x400u
#define STCU2_MBUFMM_MBUFM42_SHIFT               10u
#define STCU2_MBUFMM_MBUFM42_WIDTH               1u
#define STCU2_MBUFMM_MBUFM42(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM42_SHIFT))&STCU2_MBUFMM_MBUFM42_MASK)
#define STCU2_MBUFMM_MBUFM43_MASK                0x800u
#define STCU2_MBUFMM_MBUFM43_SHIFT               11u
#define STCU2_MBUFMM_MBUFM43_WIDTH               1u
#define STCU2_MBUFMM_MBUFM43(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM43_SHIFT))&STCU2_MBUFMM_MBUFM43_MASK)
#define STCU2_MBUFMM_MBUFM44_MASK                0x1000u
#define STCU2_MBUFMM_MBUFM44_SHIFT               12u
#define STCU2_MBUFMM_MBUFM44_WIDTH               1u
#define STCU2_MBUFMM_MBUFM44(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM44_SHIFT))&STCU2_MBUFMM_MBUFM44_MASK)
#define STCU2_MBUFMM_MBUFM45_MASK                0x2000u
#define STCU2_MBUFMM_MBUFM45_SHIFT               13u
#define STCU2_MBUFMM_MBUFM45_WIDTH               1u
#define STCU2_MBUFMM_MBUFM45(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM45_SHIFT))&STCU2_MBUFMM_MBUFM45_MASK)
#define STCU2_MBUFMM_MBUFM46_MASK                0x4000u
#define STCU2_MBUFMM_MBUFM46_SHIFT               14u
#define STCU2_MBUFMM_MBUFM46_WIDTH               1u
#define STCU2_MBUFMM_MBUFM46(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM46_SHIFT))&STCU2_MBUFMM_MBUFM46_MASK)
#define STCU2_MBUFMM_MBUFM47_MASK                0x8000u
#define STCU2_MBUFMM_MBUFM47_SHIFT               15u
#define STCU2_MBUFMM_MBUFM47_WIDTH               1u
#define STCU2_MBUFMM_MBUFM47(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM47_SHIFT))&STCU2_MBUFMM_MBUFM47_MASK)
#define STCU2_MBUFMM_MBUFM48_MASK                0x10000u
#define STCU2_MBUFMM_MBUFM48_SHIFT               16u
#define STCU2_MBUFMM_MBUFM48_WIDTH               1u
#define STCU2_MBUFMM_MBUFM48(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM48_SHIFT))&STCU2_MBUFMM_MBUFM48_MASK)
#define STCU2_MBUFMM_MBUFM49_MASK                0x20000u
#define STCU2_MBUFMM_MBUFM49_SHIFT               17u
#define STCU2_MBUFMM_MBUFM49_WIDTH               1u
#define STCU2_MBUFMM_MBUFM49(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM49_SHIFT))&STCU2_MBUFMM_MBUFM49_MASK)
#define STCU2_MBUFMM_MBUFM50_MASK                0x40000u
#define STCU2_MBUFMM_MBUFM50_SHIFT               18u
#define STCU2_MBUFMM_MBUFM50_WIDTH               1u
#define STCU2_MBUFMM_MBUFM50(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM50_SHIFT))&STCU2_MBUFMM_MBUFM50_MASK)
#define STCU2_MBUFMM_MBUFM51_MASK                0x80000u
#define STCU2_MBUFMM_MBUFM51_SHIFT               19u
#define STCU2_MBUFMM_MBUFM51_WIDTH               1u
#define STCU2_MBUFMM_MBUFM51(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM51_SHIFT))&STCU2_MBUFMM_MBUFM51_MASK)
#define STCU2_MBUFMM_MBUFM52_MASK                0x100000u
#define STCU2_MBUFMM_MBUFM52_SHIFT               20u
#define STCU2_MBUFMM_MBUFM52_WIDTH               1u
#define STCU2_MBUFMM_MBUFM52(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM52_SHIFT))&STCU2_MBUFMM_MBUFM52_MASK)
#define STCU2_MBUFMM_MBUFM53_MASK                0x200000u
#define STCU2_MBUFMM_MBUFM53_SHIFT               21u
#define STCU2_MBUFMM_MBUFM53_WIDTH               1u
#define STCU2_MBUFMM_MBUFM53(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM53_SHIFT))&STCU2_MBUFMM_MBUFM53_MASK)
#define STCU2_MBUFMM_MBUFM54_MASK                0x400000u
#define STCU2_MBUFMM_MBUFM54_SHIFT               22u
#define STCU2_MBUFMM_MBUFM54_WIDTH               1u
#define STCU2_MBUFMM_MBUFM54(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM54_SHIFT))&STCU2_MBUFMM_MBUFM54_MASK)
#define STCU2_MBUFMM_MBUFM55_MASK                0x800000u
#define STCU2_MBUFMM_MBUFM55_SHIFT               23u
#define STCU2_MBUFMM_MBUFM55_WIDTH               1u
#define STCU2_MBUFMM_MBUFM55(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM55_SHIFT))&STCU2_MBUFMM_MBUFM55_MASK)
#define STCU2_MBUFMM_MBUFM56_MASK                0x1000000u
#define STCU2_MBUFMM_MBUFM56_SHIFT               24u
#define STCU2_MBUFMM_MBUFM56_WIDTH               1u
#define STCU2_MBUFMM_MBUFM56(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM56_SHIFT))&STCU2_MBUFMM_MBUFM56_MASK)
#define STCU2_MBUFMM_MBUFM57_MASK                0x2000000u
#define STCU2_MBUFMM_MBUFM57_SHIFT               25u
#define STCU2_MBUFMM_MBUFM57_WIDTH               1u
#define STCU2_MBUFMM_MBUFM57(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM57_SHIFT))&STCU2_MBUFMM_MBUFM57_MASK)
#define STCU2_MBUFMM_MBUFM58_MASK                0x4000000u
#define STCU2_MBUFMM_MBUFM58_SHIFT               26u
#define STCU2_MBUFMM_MBUFM58_WIDTH               1u
#define STCU2_MBUFMM_MBUFM58(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM58_SHIFT))&STCU2_MBUFMM_MBUFM58_MASK)
#define STCU2_MBUFMM_MBUFM59_MASK                0x8000000u
#define STCU2_MBUFMM_MBUFM59_SHIFT               27u
#define STCU2_MBUFMM_MBUFM59_WIDTH               1u
#define STCU2_MBUFMM_MBUFM59(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM59_SHIFT))&STCU2_MBUFMM_MBUFM59_MASK)
#define STCU2_MBUFMM_MBUFM60_MASK                0x10000000u
#define STCU2_MBUFMM_MBUFM60_SHIFT               28u
#define STCU2_MBUFMM_MBUFM60_WIDTH               1u
#define STCU2_MBUFMM_MBUFM60(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM60_SHIFT))&STCU2_MBUFMM_MBUFM60_MASK)
#define STCU2_MBUFMM_MBUFM61_MASK                0x20000000u
#define STCU2_MBUFMM_MBUFM61_SHIFT               29u
#define STCU2_MBUFMM_MBUFM61_WIDTH               1u
#define STCU2_MBUFMM_MBUFM61(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM61_SHIFT))&STCU2_MBUFMM_MBUFM61_MASK)
#define STCU2_MBUFMM_MBUFM62_MASK                0x40000000u
#define STCU2_MBUFMM_MBUFM62_SHIFT               30u
#define STCU2_MBUFMM_MBUFM62_WIDTH               1u
#define STCU2_MBUFMM_MBUFM62(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM62_SHIFT))&STCU2_MBUFMM_MBUFM62_MASK)
#define STCU2_MBUFMM_MBUFM63_MASK                0x80000000u
#define STCU2_MBUFMM_MBUFM63_SHIFT               31u
#define STCU2_MBUFMM_MBUFM63_WIDTH               1u
#define STCU2_MBUFMM_MBUFM63(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMM_MBUFM63_SHIFT))&STCU2_MBUFMM_MBUFM63_MASK)
/* MBUFMH Bit Fields */
#define STCU2_MBUFMH_MBUFM64_MASK                0x1u
#define STCU2_MBUFMH_MBUFM64_SHIFT               0u
#define STCU2_MBUFMH_MBUFM64_WIDTH               1u
#define STCU2_MBUFMH_MBUFM64(x)                  (((uint32_t)(((uint32_t)(x))<<STCU2_MBUFMH_MBUFM64_SHIFT))&STCU2_MBUFMH_MBUFM64_MASK)
/* LB_CTRL Bit Fields */
#define STCU2_LB_CTRL_CWS_MASK                   0x7u
#define STCU2_LB_CTRL_CWS_SHIFT                  0u
#define STCU2_LB_CTRL_CWS_WIDTH                  3u
#define STCU2_LB_CTRL_CWS(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_CWS_SHIFT))&STCU2_LB_CTRL_CWS_MASK)
#define STCU2_LB_CTRL_PFT_MASK                   0x8u
#define STCU2_LB_CTRL_PFT_SHIFT                  3u
#define STCU2_LB_CTRL_PFT_WIDTH                  1u
#define STCU2_LB_CTRL_PFT(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_PFT_SHIFT))&STCU2_LB_CTRL_PFT_MASK)
#define STCU2_LB_CTRL_SCEN_ON_MASK               0xF00u
#define STCU2_LB_CTRL_SCEN_ON_SHIFT              8u
#define STCU2_LB_CTRL_SCEN_ON_WIDTH              4u
#define STCU2_LB_CTRL_SCEN_ON(x)                 (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_SCEN_ON_SHIFT))&STCU2_LB_CTRL_SCEN_ON_MASK)
#define STCU2_LB_CTRL_SCEN_OFF_MASK              0xF000u
#define STCU2_LB_CTRL_SCEN_OFF_SHIFT             12u
#define STCU2_LB_CTRL_SCEN_OFF_WIDTH             4u
#define STCU2_LB_CTRL_SCEN_OFF(x)                (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_SCEN_OFF_SHIFT))&STCU2_LB_CTRL_SCEN_OFF_MASK)
#define STCU2_LB_CTRL_SHS_MASK                   0x70000u
#define STCU2_LB_CTRL_SHS_SHIFT                  16u
#define STCU2_LB_CTRL_SHS_WIDTH                  3u
#define STCU2_LB_CTRL_SHS(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_SHS_SHIFT))&STCU2_LB_CTRL_SHS_MASK)
#define STCU2_LB_CTRL_PTR_MASK                   0x7F000000u
#define STCU2_LB_CTRL_PTR_SHIFT                  24u
#define STCU2_LB_CTRL_PTR_WIDTH                  7u
#define STCU2_LB_CTRL_PTR(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_PTR_SHIFT))&STCU2_LB_CTRL_PTR_MASK)
#define STCU2_LB_CTRL_CSM_MASK                   0x80000000u
#define STCU2_LB_CTRL_CSM_SHIFT                  31u
#define STCU2_LB_CTRL_CSM_WIDTH                  1u
#define STCU2_LB_CTRL_CSM(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_LB_CTRL_CSM_SHIFT))&STCU2_LB_CTRL_CSM_MASK)
/* LB_PCS Bit Fields */
#define STCU2_LB_PCS_PCS_MASK                    0x3FFFFFFu
#define STCU2_LB_PCS_PCS_SHIFT                   0u
#define STCU2_LB_PCS_PCS_WIDTH                   26u
#define STCU2_LB_PCS_PCS(x)                      (((uint32_t)(((uint32_t)(x))<<STCU2_LB_PCS_PCS_SHIFT))&STCU2_LB_PCS_PCS_MASK)
/* LB_MISREL Bit Fields */
#define STCU2_LB_MISREL_MISREx_MASK              0xFFFFFFFFu
#define STCU2_LB_MISREL_MISREx_SHIFT             0u
#define STCU2_LB_MISREL_MISREx_WIDTH             32u
