neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define STCU2_LB_MISREL_MISREx(x)                (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISREL_MISREx_SHIFT))&STCU2_LB_MISREL_MISREx_MASK)
/* LB_MISREH Bit Fields */
#define STCU2_LB_MISREH_MISREx_MASK              0xFFFFFFFFu
#define STCU2_LB_MISREH_MISREx_SHIFT             0u
#define STCU2_LB_MISREH_MISREx_WIDTH             32u
#define STCU2_LB_MISREH_MISREx(x)                (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISREH_MISREx_SHIFT))&STCU2_LB_MISREH_MISREx_MASK)
/* LB_MISRRL Bit Fields */
#define STCU2_LB_MISRRL_MISRRx_MASK              0xFFFFFFFFu
#define STCU2_LB_MISRRL_MISRRx_SHIFT             0u
#define STCU2_LB_MISRRL_MISRRx_WIDTH             32u
#define STCU2_LB_MISRRL_MISRRx(x)                (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISRRL_MISRRx_SHIFT))&STCU2_LB_MISRRL_MISRRx_MASK)
/* LB_MISRRH Bit Fields */
#define STCU2_LB_MISRRH_MISRRx_MASK              0xFFFFFFFFu
#define STCU2_LB_MISRRH_MISRRx_SHIFT             0u
#define STCU2_LB_MISRRH_MISRRx_WIDTH             32u
#define STCU2_LB_MISRRH_MISRRx(x)                (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISRRH_MISRRx_SHIFT))&STCU2_LB_MISRRH_MISRRx_MASK)
/* LB_MISRELSW Bit Fields */
#define STCU2_LB_MISRELSW_MISRESWx_MASK          0xFFFFFFFFu
#define STCU2_LB_MISRELSW_MISRESWx_SHIFT         0u
#define STCU2_LB_MISRELSW_MISRESWx_WIDTH         32u
#define STCU2_LB_MISRELSW_MISRESWx(x)            (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISRELSW_MISRESWx_SHIFT))&STCU2_LB_MISRELSW_MISRESWx_MASK)
/* LB_MISREHSW Bit Fields */
#define STCU2_LB_MISREHSW_MISRESWx_MASK          0xFFFFFFFFu
#define STCU2_LB_MISREHSW_MISRESWx_SHIFT         0u
#define STCU2_LB_MISREHSW_MISRESWx_WIDTH         32u
#define STCU2_LB_MISREHSW_MISRESWx(x)            (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISREHSW_MISRESWx_SHIFT))&STCU2_LB_MISREHSW_MISRESWx_MASK)
/* LB_MISRRLSW Bit Fields */
#define STCU2_LB_MISRRLSW_MISRRSWx_MASK          0xFFFFFFFFu
#define STCU2_LB_MISRRLSW_MISRRSWx_SHIFT         0u
#define STCU2_LB_MISRRLSW_MISRRSWx_WIDTH         32u
#define STCU2_LB_MISRRLSW_MISRRSWx(x)            (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISRRLSW_MISRRSWx_SHIFT))&STCU2_LB_MISRRLSW_MISRRSWx_MASK)
/* LB_MISRRHSW Bit Fields */
#define STCU2_LB_MISRRHSW_MISRRSWx_MASK          0xFFFFFFFFu
#define STCU2_LB_MISRRHSW_MISRRSWx_SHIFT         0u
#define STCU2_LB_MISRRHSW_MISRRSWx_WIDTH         32u
#define STCU2_LB_MISRRHSW_MISRRSWx(x)            (((uint32_t)(((uint32_t)(x))<<STCU2_LB_MISRRHSW_MISRRSWx_SHIFT))&STCU2_LB_MISRRHSW_MISRRSWx_MASK)
/* MB_CTRL Bit Fields */
#define STCU2_MB_CTRL_PTR_MASK                   0x7F000000u
#define STCU2_MB_CTRL_PTR_SHIFT                  24u
#define STCU2_MB_CTRL_PTR_WIDTH                  7u
#define STCU2_MB_CTRL_PTR(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_MB_CTRL_PTR_SHIFT))&STCU2_MB_CTRL_PTR_MASK)
#define STCU2_MB_CTRL_CSM_MASK                   0x80000000u
#define STCU2_MB_CTRL_CSM_SHIFT                  31u
#define STCU2_MB_CTRL_CSM_WIDTH                  1u
#define STCU2_MB_CTRL_CSM(x)                     (((uint32_t)(((uint32_t)(x))<<STCU2_MB_CTRL_CSM_SHIFT))&STCU2_MB_CTRL_CSM_MASK)

/*!
 * @}
 */ /* end of group STCU2_Register_Masks */


/*!
 * @}
 */ /* end of group STCU2_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- STM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup STM_Peripheral_Access_Layer STM Peripheral Access Layer
 * @{
 */


/** STM - Size of Registers Arrays */
#define STM_CHANNEL_COUNT                        4u

/** STM - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< STM Control Register, offset: 0x0 */
  __IO uint32_t CNT;                               /**< STM Count Register, offset: 0x4 */
       uint8_t RESERVED_0[8];
  struct {                                         /* offset: 0x10, array step: 0x10 */
    __IO uint32_t CCR;                               /**< STM Channel Control Register, array offset: 0x10, array step: 0x10 */
    __IO uint32_t CIR;                               /**< STM Channel Interrupt Register, array offset: 0x14, array step: 0x10 */
    __IO uint32_t CMP;                               /**< STM Channel Compare Register, array offset: 0x18, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } CHANNEL[STM_CHANNEL_COUNT];
} STM_Type, *STM_MemMapPtr;

 /** Number of instances of the STM module. */
#define STM_INSTANCE_COUNT                       (1u)


/* STM - Peripheral instance base addresses */
/** Peripheral STM_0 base address */
#define STM_0_BASE                               (0xFFF3C000u)
/** Peripheral STM_0 base pointer */
#define STM_0                                    ((STM_Type *)STM_0_BASE)
/** Array initializer of STM peripheral base addresses */
#define STM_BASE_ADDRS                           { STM_0_BASE }
/** Array initializer of STM peripheral base pointers */
#define STM_BASE_PTRS                            { STM_0 }
/** Interrupt vectors for the STM peripheral type */
#define STM_IRQS                                 {{ STM_Ch0_IRQn, STM_Ch123_IRQn, STM_Ch123_IRQn, STM_Ch123_IRQn }}
/* ----------------------------------------------------------------------------
   -- STM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup STM_Register_Masks STM Register Masks
 * @{
 */

/* CR Bit Fields */
#define STM_CR_TEN_MASK                          0x1u
#define STM_CR_TEN_SHIFT                         0u
#define STM_CR_TEN_WIDTH                         1u
#define STM_CR_TEN(x)                            (((uint32_t)(((uint32_t)(x))<<STM_CR_TEN_SHIFT))&STM_CR_TEN_MASK)
#define STM_CR_FRZ_MASK                          0x2u
#define STM_CR_FRZ_SHIFT                         1u
#define STM_CR_FRZ_WIDTH                         1u
#define STM_CR_FRZ(x)                            (((uint32_t)(((uint32_t)(x))<<STM_CR_FRZ_SHIFT))&STM_CR_FRZ_MASK)
#define STM_CR_CPS_MASK                          0xFF00u
#define STM_CR_CPS_SHIFT                         8u
#define STM_CR_CPS_WIDTH                         8u
#define STM_CR_CPS(x)                            (((uint32_t)(((uint32_t)(x))<<STM_CR_CPS_SHIFT))&STM_CR_CPS_MASK)
/* CNT Bit Fields */
#define STM_CNT_CNT_MASK                         0xFFFFFFFFu
#define STM_CNT_CNT_SHIFT                        0u
#define STM_CNT_CNT_WIDTH                        32u
#define STM_CNT_CNT(x)                           (((uint32_t)(((uint32_t)(x))<<STM_CNT_CNT_SHIFT))&STM_CNT_CNT_MASK)
/* CCR Bit Fields */
#define STM_CCR_CEN_MASK                         0x1u
#define STM_CCR_CEN_SHIFT                        0u
#define STM_CCR_CEN_WIDTH                        1u
#define STM_CCR_CEN(x)                           (((uint32_t)(((uint32_t)(x))<<STM_CCR_CEN_SHIFT))&STM_CCR_CEN_MASK)
/* CIR Bit Fields */
#define STM_CIR_CIF_MASK                         0x1u
#define STM_CIR_CIF_SHIFT                        0u
#define STM_CIR_CIF_WIDTH                        1u
#define STM_CIR_CIF(x)                           (((uint32_t)(((uint32_t)(x))<<STM_CIR_CIF_SHIFT))&STM_CIR_CIF_MASK)
/* CMP Bit Fields */
#define STM_CMP_CMP_MASK                         0xFFFFFFFFu
#define STM_CMP_CMP_SHIFT                        0u
#define STM_CMP_CMP_WIDTH                        32u
#define STM_CMP_CMP(x)                           (((uint32_t)(((uint32_t)(x))<<STM_CMP_CMP_SHIFT))&STM_CMP_CMP_MASK)

/*!
 * @}
 */ /* end of group STM_Register_Masks */


/*!
 * @}
 */ /* end of group STM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- SWT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SWT_Peripheral_Access_Layer SWT Peripheral Access Layer
 * @{
 */


/** SWT - Size of Registers Arrays */

/** SWT - Register Layout Typedef */
typedef struct {
  __IO uint32_t CR;                                /**< SWT Control Register, offset: 0x0 */
  __IO uint32_t IR;                                /**< SWT Interrupt Register, offset: 0x4 */
  __IO uint32_t TO;                                /**< SWT Time-out Register, offset: 0x8 */
  __IO uint32_t WN;                                /**< SWT Window Register, offset: 0xC */
  __IO uint32_t SR;                                /**< SWT Service Register, offset: 0x10 */
  __I  uint32_t CO;                                /**< SWT Counter Output Register, offset: 0x14 */
  __IO uint32_t SK;                                /**< SWT Service Key Register, offset: 0x18 */
} SWT_Type, *SWT_MemMapPtr;

 /** Number of instances of the SWT module. */
#define SWT_INSTANCE_COUNT                       (2u)


/* SWT - Peripheral instance base addresses */
/** Peripheral SWT_0 base address */
#define SWT_0_BASE                               (0xFFF38000u)
/** Peripheral SWT_0 base pointer */
#define SWT_0                                    ((SWT_Type *)SWT_0_BASE)
/** Peripheral SWT_1 base address */
#define SWT_1_BASE                               (0xFFF34000u)
/** Peripheral SWT_1 base pointer */
#define SWT_1                                    ((SWT_Type *)SWT_1_BASE)
/** Array initializer of SWT peripheral base addresses */
#define SWT_BASE_ADDRS                           { SWT_0_BASE, SWT_1_BASE }
/** Array initializer of SWT peripheral base pointers */
#define SWT_BASE_PTRS                            { SWT_0, SWT_1 }
 /** Number of interrupt vector arrays for the SWT module. */
#define SWT_IRQS_ARR_COUNT                       (1u)
 /** Number of interrupt channels for the SWT module. */
#define SWT_IRQS_CH_COUNT                        (1u)
/** Interrupt vectors for the SWT peripheral type */
#define SWT_IRQS                                 { SWT0_IRQn, SWT1_IRQn }

/* ----------------------------------------------------------------------------
   -- SWT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SWT_Register_Masks SWT Register Masks
 * @{
 */

/* CR Bit Fields */
#define SWT_CR_WEN_MASK                          0x1u
#define SWT_CR_WEN_SHIFT                         0u
#define SWT_CR_WEN_WIDTH                         1u
#define SWT_CR_WEN(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_WEN_SHIFT))&SWT_CR_WEN_MASK)
#define SWT_CR_FRZ_MASK                          0x2u
#define SWT_CR_FRZ_SHIFT                         1u
#define SWT_CR_FRZ_WIDTH                         1u
#define SWT_CR_FRZ(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_FRZ_SHIFT))&SWT_CR_FRZ_MASK)
#define SWT_CR_STP_MASK                          0x4u
#define SWT_CR_STP_SHIFT                         2u
#define SWT_CR_STP_WIDTH                         1u
#define SWT_CR_STP(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_STP_SHIFT))&SWT_CR_STP_MASK)
#define SWT_CR_CSL_MASK                          0x8u
#define SWT_CR_CSL_SHIFT                         3u
#define SWT_CR_CSL_WIDTH                         1u
#define SWT_CR_CSL(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_CSL_SHIFT))&SWT_CR_CSL_MASK)
#define SWT_CR_SLK_MASK                          0x10u
#define SWT_CR_SLK_SHIFT                         4u
#define SWT_CR_SLK_WIDTH                         1u
#define SWT_CR_SLK(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_SLK_SHIFT))&SWT_CR_SLK_MASK)
#define SWT_CR_HLK_MASK                          0x20u
#define SWT_CR_HLK_SHIFT                         5u
#define SWT_CR_HLK_WIDTH                         1u
#define SWT_CR_HLK(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_HLK_SHIFT))&SWT_CR_HLK_MASK)
#define SWT_CR_ITR_MASK                          0x40u
#define SWT_CR_ITR_SHIFT                         6u
#define SWT_CR_ITR_WIDTH                         1u
#define SWT_CR_ITR(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_ITR_SHIFT))&SWT_CR_ITR_MASK)
#define SWT_CR_WND_MASK                          0x80u
#define SWT_CR_WND_SHIFT                         7u
#define SWT_CR_WND_WIDTH                         1u
#define SWT_CR_WND(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_WND_SHIFT))&SWT_CR_WND_MASK)
#define SWT_CR_RIA_MASK                          0x100u
#define SWT_CR_RIA_SHIFT                         8u
#define SWT_CR_RIA_WIDTH                         1u
#define SWT_CR_RIA(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_RIA_SHIFT))&SWT_CR_RIA_MASK)
#define SWT_CR_SMD_MASK                          0x600u
#define SWT_CR_SMD_SHIFT                         9u
#define SWT_CR_SMD_WIDTH                         2u
#define SWT_CR_SMD(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CR_SMD_SHIFT))&SWT_CR_SMD_MASK)
#define SWT_CR_MAP7_MASK                         0x1000000u
#define SWT_CR_MAP7_SHIFT                        24u
#define SWT_CR_MAP7_WIDTH                        1u
#define SWT_CR_MAP7(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP7_SHIFT))&SWT_CR_MAP7_MASK)
#define SWT_CR_MAP6_MASK                         0x2000000u
#define SWT_CR_MAP6_SHIFT                        25u
#define SWT_CR_MAP6_WIDTH                        1u
#define SWT_CR_MAP6(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP6_SHIFT))&SWT_CR_MAP6_MASK)
#define SWT_CR_MAP5_MASK                         0x4000000u
#define SWT_CR_MAP5_SHIFT                        26u
#define SWT_CR_MAP5_WIDTH                        1u
#define SWT_CR_MAP5(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP5_SHIFT))&SWT_CR_MAP5_MASK)
#define SWT_CR_MAP4_MASK                         0x8000000u
#define SWT_CR_MAP4_SHIFT                        27u
#define SWT_CR_MAP4_WIDTH                        1u
#define SWT_CR_MAP4(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP4_SHIFT))&SWT_CR_MAP4_MASK)
#define SWT_CR_MAP3_MASK                         0x10000000u
#define SWT_CR_MAP3_SHIFT                        28u
#define SWT_CR_MAP3_WIDTH                        1u
#define SWT_CR_MAP3(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP3_SHIFT))&SWT_CR_MAP3_MASK)
#define SWT_CR_MAP2_MASK                         0x20000000u
#define SWT_CR_MAP2_SHIFT                        29u
#define SWT_CR_MAP2_WIDTH                        1u
#define SWT_CR_MAP2(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP2_SHIFT))&SWT_CR_MAP2_MASK)
#define SWT_CR_MAP1_MASK                         0x40000000u
#define SWT_CR_MAP1_SHIFT                        30u
#define SWT_CR_MAP1_WIDTH                        1u
#define SWT_CR_MAP1(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP1_SHIFT))&SWT_CR_MAP1_MASK)
#define SWT_CR_MAP0_MASK                         0x80000000u
#define SWT_CR_MAP0_SHIFT                        31u
#define SWT_CR_MAP0_WIDTH                        1u
#define SWT_CR_MAP0(x)                           (((uint32_t)(((uint32_t)(x))<<SWT_CR_MAP0_SHIFT))&SWT_CR_MAP0_MASK)
/* IR Bit Fields */
#define SWT_IR_TIF_MASK                          0x1u
#define SWT_IR_TIF_SHIFT                         0u
#define SWT_IR_TIF_WIDTH                         1u
#define SWT_IR_TIF(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_IR_TIF_SHIFT))&SWT_IR_TIF_MASK)
/* TO Bit Fields */
#define SWT_TO_WTO_MASK                          0xFFFFFFFFu
#define SWT_TO_WTO_SHIFT                         0u
#define SWT_TO_WTO_WIDTH                         32u
#define SWT_TO_WTO(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_TO_WTO_SHIFT))&SWT_TO_WTO_MASK)
/* WN Bit Fields */
#define SWT_WN_WST_MASK                          0xFFFFFFFFu
#define SWT_WN_WST_SHIFT                         0u
#define SWT_WN_WST_WIDTH                         32u
#define SWT_WN_WST(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_WN_WST_SHIFT))&SWT_WN_WST_MASK)
/* SR Bit Fields */
#define SWT_SR_WSC_MASK                          0xFFFFu
#define SWT_SR_WSC_SHIFT                         0u
#define SWT_SR_WSC_WIDTH                         16u
#define SWT_SR_WSC(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_SR_WSC_SHIFT))&SWT_SR_WSC_MASK)
/* CO Bit Fields */
#define SWT_CO_CNT_MASK                          0xFFFFFFFFu
#define SWT_CO_CNT_SHIFT                         0u
#define SWT_CO_CNT_WIDTH                         32u
#define SWT_CO_CNT(x)                            (((uint32_t)(((uint32_t)(x))<<SWT_CO_CNT_SHIFT))&SWT_CO_CNT_MASK)
/* SK Bit Fields */
#define SWT_SK_SK_MASK                           0xFFFFu
#define SWT_SK_SK_SHIFT                          0u
#define SWT_SK_SK_WIDTH                          16u
#define SWT_SK_SK(x)                             (((uint32_t)(((uint32_t)(x))<<SWT_SK_SK_SHIFT))&SWT_SK_SK_MASK)

/*!
 * @}
 */ /* end of group SWT_Register_Masks */


/*!
 * @}
 */ /* end of group SWT_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- TDM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TDM_Peripheral_Access_Layer TDM Peripheral Access Layer
 * @{
 */


