neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** TDM - Size of Registers Arrays */
#define TDM_STO_KEY_COUNT                        6u

/** TDM - Register Layout Typedef */
typedef struct {
  __I  uint32_t TDRSR;                             /**< TDR Status Register, offset: 0x0 */
  __I  uint32_t LFPAR;                             /**< Last Flash Programmed Address Register, offset: 0x4 */
  __I  uint32_t DBA;                               /**< Diary Base Address, offset: 0x8 */
       uint8_t RESERVED_0[4];
  __IO uint32_t STO_KEY[TDM_STO_KEY_COUNT];        /**< Software Tamper Override Key Region, array offset: 0x10, array step: 0x4 */
} TDM_Type, *TDM_MemMapPtr;

 /** Number of instances of the TDM module. */
#define TDM_INSTANCE_COUNT                       (1u)


/* TDM - Peripheral instance base addresses */
/** Peripheral TDM base address */
#define TDM_BASE                                 (0xFFF18000u)
/** Peripheral TDM base pointer */
#define TDM                                      ((TDM_Type *)TDM_BASE)
/** Array initializer of TDM peripheral base addresses */
#define TDM_BASE_ADDRS                           { TDM_BASE }
/** Array initializer of TDM peripheral base pointers */
#define TDM_BASE_PTRS                            { TDM }

/* ----------------------------------------------------------------------------
   -- TDM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TDM_Register_Masks TDM Register Masks
 * @{
 */

/* TDRSR Bit Fields */
#define TDM_TDRSR_TDRSR0_MASK                    0x1u
#define TDM_TDRSR_TDRSR0_SHIFT                   0u
#define TDM_TDRSR_TDRSR0_WIDTH                   1u
#define TDM_TDRSR_TDRSR0(x)                      (((uint32_t)(((uint32_t)(x))<<TDM_TDRSR_TDRSR0_SHIFT))&TDM_TDRSR_TDRSR0_MASK)
#define TDM_TDRSR_TDRSR1_MASK                    0x2u
#define TDM_TDRSR_TDRSR1_SHIFT                   1u
#define TDM_TDRSR_TDRSR1_WIDTH                   1u
#define TDM_TDRSR_TDRSR1(x)                      (((uint32_t)(((uint32_t)(x))<<TDM_TDRSR_TDRSR1_SHIFT))&TDM_TDRSR_TDRSR1_MASK)
#define TDM_TDRSR_TDRSR2_MASK                    0x4u
#define TDM_TDRSR_TDRSR2_SHIFT                   2u
#define TDM_TDRSR_TDRSR2_WIDTH                   1u
#define TDM_TDRSR_TDRSR2(x)                      (((uint32_t)(((uint32_t)(x))<<TDM_TDRSR_TDRSR2_SHIFT))&TDM_TDRSR_TDRSR2_MASK)
#define TDM_TDRSR_TDRSR3_MASK                    0x8u
#define TDM_TDRSR_TDRSR3_SHIFT                   3u
#define TDM_TDRSR_TDRSR3_WIDTH                   1u
#define TDM_TDRSR_TDRSR3(x)                      (((uint32_t)(((uint32_t)(x))<<TDM_TDRSR_TDRSR3_SHIFT))&TDM_TDRSR_TDRSR3_MASK)
#define TDM_TDRSR_TDRSR4_MASK                    0x10u
#define TDM_TDRSR_TDRSR4_SHIFT                   4u
#define TDM_TDRSR_TDRSR4_WIDTH                   1u
#define TDM_TDRSR_TDRSR4(x)                      (((uint32_t)(((uint32_t)(x))<<TDM_TDRSR_TDRSR4_SHIFT))&TDM_TDRSR_TDRSR4_MASK)
#define TDM_TDRSR_TDRSR5_MASK                    0x20u
#define TDM_TDRSR_TDRSR5_SHIFT                   5u
#define TDM_TDRSR_TDRSR5_WIDTH                   1u
#define TDM_TDRSR_TDRSR5(x)                      (((uint32_t)(((uint32_t)(x))<<TDM_TDRSR_TDRSR5_SHIFT))&TDM_TDRSR_TDRSR5_MASK)
/* LFPAR Bit Fields */
#define TDM_LFPAR_LFPAR_MASK                     0xFFFFFFFFu
#define TDM_LFPAR_LFPAR_SHIFT                    0u
#define TDM_LFPAR_LFPAR_WIDTH                    32u
#define TDM_LFPAR_LFPAR(x)                       (((uint32_t)(((uint32_t)(x))<<TDM_LFPAR_LFPAR_SHIFT))&TDM_LFPAR_LFPAR_MASK)
/* DBA Bit Fields */
#define TDM_DBA_DBA_MASK                         0xFFFFFFFFu
#define TDM_DBA_DBA_SHIFT                        0u
#define TDM_DBA_DBA_WIDTH                        32u
#define TDM_DBA_DBA(x)                           (((uint32_t)(((uint32_t)(x))<<TDM_DBA_DBA_SHIFT))&TDM_DBA_DBA_MASK)
/* STO_KEY Bit Fields */
#define TDM_STO_KEY_STO_KEY_MASK                 0xFFFFFFFFu
#define TDM_STO_KEY_STO_KEY_SHIFT                0u
#define TDM_STO_KEY_STO_KEY_WIDTH                32u
#define TDM_STO_KEY_STO_KEY(x)                   (((uint32_t)(((uint32_t)(x))<<TDM_STO_KEY_STO_KEY_SHIFT))&TDM_STO_KEY_STO_KEY_MASK)

/*!
 * @}
 */ /* end of group TDM_Register_Masks */


/*!
 * @}
 */ /* end of group TDM_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XBAR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBAR_Peripheral_Access_Layer XBAR Peripheral Access Layer
 * @{
 */


/** XBAR - Size of Registers Arrays */
#define XBAR_PORT_COUNT                          8u

/** XBAR - Register Layout Typedef */
typedef struct {
  struct {                                         /* offset: 0x0, array step: 0x100 */
    __IO uint32_t PRS;                               /**< Priority Registers Slave, array offset: 0x0, array step: 0x100 */
         uint8_t RESERVED_0[12];
    __IO uint32_t CRS;                               /**< Control Register, array offset: 0x10, array step: 0x100 */
         uint8_t RESERVED_1[236];
  } PORT[XBAR_PORT_COUNT];
} XBAR_Type, *XBAR_MemMapPtr;

 /** Number of instances of the XBAR module. */
#define XBAR_INSTANCE_COUNT                      (1u)


/* XBAR - Peripheral instance base addresses */
/** Peripheral XBAR base address */
#define XBAR_BASE                                (0xFFF04000u)
/** Peripheral XBAR base pointer */
#define XBAR                                     ((XBAR_Type *)XBAR_BASE)
/** Array initializer of XBAR peripheral base addresses */
#define XBAR_BASE_ADDRS                          { XBAR_BASE }
/** Array initializer of XBAR peripheral base pointers */
#define XBAR_BASE_PTRS                           { XBAR }

/* ----------------------------------------------------------------------------
   -- XBAR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBAR_Register_Masks XBAR Register Masks
 * @{
 */

/* PRS Bit Fields */
#define XBAR_PRS_M0_MASK                         0x7u
#define XBAR_PRS_M0_SHIFT                        0u
#define XBAR_PRS_M0_WIDTH                        3u
#define XBAR_PRS_M0(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M0_SHIFT))&XBAR_PRS_M0_MASK)
#define XBAR_PRS_M1_MASK                         0x70u
#define XBAR_PRS_M1_SHIFT                        4u
#define XBAR_PRS_M1_WIDTH                        3u
#define XBAR_PRS_M1(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M1_SHIFT))&XBAR_PRS_M1_MASK)
#define XBAR_PRS_M2_MASK                         0x700u
#define XBAR_PRS_M2_SHIFT                        8u
#define XBAR_PRS_M2_WIDTH                        3u
#define XBAR_PRS_M2(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M2_SHIFT))&XBAR_PRS_M2_MASK)
#define XBAR_PRS_M3_MASK                         0x7000u
#define XBAR_PRS_M3_SHIFT                        12u
#define XBAR_PRS_M3_WIDTH                        3u
#define XBAR_PRS_M3(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M3_SHIFT))&XBAR_PRS_M3_MASK)
#define XBAR_PRS_M4_MASK                         0x70000u
#define XBAR_PRS_M4_SHIFT                        16u
#define XBAR_PRS_M4_WIDTH                        3u
#define XBAR_PRS_M4(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M4_SHIFT))&XBAR_PRS_M4_MASK)
#define XBAR_PRS_M5_MASK                         0x700000u
#define XBAR_PRS_M5_SHIFT                        20u
#define XBAR_PRS_M5_WIDTH                        3u
#define XBAR_PRS_M5(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M5_SHIFT))&XBAR_PRS_M5_MASK)
#define XBAR_PRS_M6_MASK                         0x7000000u
#define XBAR_PRS_M6_SHIFT                        24u
#define XBAR_PRS_M6_WIDTH                        3u
#define XBAR_PRS_M6(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M6_SHIFT))&XBAR_PRS_M6_MASK)
#define XBAR_PRS_M7_MASK                         0x70000000u
#define XBAR_PRS_M7_SHIFT                        28u
#define XBAR_PRS_M7_WIDTH                        3u
#define XBAR_PRS_M7(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_PRS_M7_SHIFT))&XBAR_PRS_M7_MASK)
/* CRS Bit Fields */
#define XBAR_CRS_PARK_MASK                       0x7u
#define XBAR_CRS_PARK_SHIFT                      0u
#define XBAR_CRS_PARK_WIDTH                      3u
#define XBAR_CRS_PARK(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_PARK_SHIFT))&XBAR_CRS_PARK_MASK)
#define XBAR_CRS_PCTL_MASK                       0x30u
#define XBAR_CRS_PCTL_SHIFT                      4u
#define XBAR_CRS_PCTL_WIDTH                      2u
#define XBAR_CRS_PCTL(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_PCTL_SHIFT))&XBAR_CRS_PCTL_MASK)
#define XBAR_CRS_ARB_MASK                        0x300u
#define XBAR_CRS_ARB_SHIFT                       8u
#define XBAR_CRS_ARB_WIDTH                       2u
#define XBAR_CRS_ARB(x)                          (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_ARB_SHIFT))&XBAR_CRS_ARB_MASK)
#define XBAR_CRS_HPE0_MASK                       0x10000u
#define XBAR_CRS_HPE0_SHIFT                      16u
#define XBAR_CRS_HPE0_WIDTH                      1u
#define XBAR_CRS_HPE0(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE0_SHIFT))&XBAR_CRS_HPE0_MASK)
#define XBAR_CRS_HPE1_MASK                       0x20000u
#define XBAR_CRS_HPE1_SHIFT                      17u
#define XBAR_CRS_HPE1_WIDTH                      1u
#define XBAR_CRS_HPE1(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE1_SHIFT))&XBAR_CRS_HPE1_MASK)
#define XBAR_CRS_HPE2_MASK                       0x40000u
#define XBAR_CRS_HPE2_SHIFT                      18u
#define XBAR_CRS_HPE2_WIDTH                      1u
#define XBAR_CRS_HPE2(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE2_SHIFT))&XBAR_CRS_HPE2_MASK)
#define XBAR_CRS_HPE3_MASK                       0x80000u
#define XBAR_CRS_HPE3_SHIFT                      19u
#define XBAR_CRS_HPE3_WIDTH                      1u
#define XBAR_CRS_HPE3(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE3_SHIFT))&XBAR_CRS_HPE3_MASK)
#define XBAR_CRS_HPE4_MASK                       0x100000u
#define XBAR_CRS_HPE4_SHIFT                      20u
#define XBAR_CRS_HPE4_WIDTH                      1u
#define XBAR_CRS_HPE4(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE4_SHIFT))&XBAR_CRS_HPE4_MASK)
#define XBAR_CRS_HPE5_MASK                       0x200000u
#define XBAR_CRS_HPE5_SHIFT                      21u
#define XBAR_CRS_HPE5_WIDTH                      1u
#define XBAR_CRS_HPE5(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE5_SHIFT))&XBAR_CRS_HPE5_MASK)
#define XBAR_CRS_HPE6_MASK                       0x400000u
#define XBAR_CRS_HPE6_SHIFT                      22u
#define XBAR_CRS_HPE6_WIDTH                      1u
#define XBAR_CRS_HPE6(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE6_SHIFT))&XBAR_CRS_HPE6_MASK)
#define XBAR_CRS_HPE7_MASK                       0x800000u
#define XBAR_CRS_HPE7_SHIFT                      23u
#define XBAR_CRS_HPE7_WIDTH                      1u
#define XBAR_CRS_HPE7(x)                         (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HPE7_SHIFT))&XBAR_CRS_HPE7_MASK)
#define XBAR_CRS_HLP_MASK                        0x40000000u
#define XBAR_CRS_HLP_SHIFT                       30u
#define XBAR_CRS_HLP_WIDTH                       1u
#define XBAR_CRS_HLP(x)                          (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_HLP_SHIFT))&XBAR_CRS_HLP_MASK)
#define XBAR_CRS_RO_MASK                         0x80000000u
#define XBAR_CRS_RO_SHIFT                        31u
#define XBAR_CRS_RO_WIDTH                        1u
#define XBAR_CRS_RO(x)                           (((uint32_t)(((uint32_t)(x))<<XBAR_CRS_RO_SHIFT))&XBAR_CRS_RO_MASK)

/*!
 * @}
 */ /* end of group XBAR_Register_Masks */


/*!
 * @}
 */ /* end of group XBAR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- XBIC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBIC_Peripheral_Access_Layer XBIC Peripheral Access Layer
 * @{
 */


