neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** XBIC - Size of Registers Arrays */

/** XBIC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< XBIC Module Control Register, offset: 0x0 */
  __IO uint32_t EIR;                               /**< XBIC Error Injection Register, offset: 0x4 */
  __I  uint32_t ESR;                               /**< XBIC Error Status Register, offset: 0x8 */
  __I  uint32_t EAR;                               /**< XBIC Error Address Register, offset: 0xC */
} XBIC_Type, *XBIC_MemMapPtr;

 /** Number of instances of the XBIC module. */
#define XBIC_INSTANCE_COUNT                      (1u)


/* XBIC - Peripheral instance base addresses */
/** Peripheral XBIC base address */
#define XBIC_BASE                                (0xFFF08000u)
/** Peripheral XBIC base pointer */
#define XBIC                                     ((XBIC_Type *)XBIC_BASE)
/** Array initializer of XBIC peripheral base addresses */
#define XBIC_BASE_ADDRS                          { XBIC_BASE }
/** Array initializer of XBIC peripheral base pointers */
#define XBIC_BASE_PTRS                           { XBIC }

/* ----------------------------------------------------------------------------
   -- XBIC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XBIC_Register_Masks XBIC Register Masks
 * @{
 */

/* MCR Bit Fields */
#define XBIC_MCR_ME7_MASK                        0x10000u
#define XBIC_MCR_ME7_SHIFT                       16u
#define XBIC_MCR_ME7_WIDTH                       1u
#define XBIC_MCR_ME7(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME7_SHIFT))&XBIC_MCR_ME7_MASK)
#define XBIC_MCR_ME6_MASK                        0x20000u
#define XBIC_MCR_ME6_SHIFT                       17u
#define XBIC_MCR_ME6_WIDTH                       1u
#define XBIC_MCR_ME6(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME6_SHIFT))&XBIC_MCR_ME6_MASK)
#define XBIC_MCR_ME5_MASK                        0x40000u
#define XBIC_MCR_ME5_SHIFT                       18u
#define XBIC_MCR_ME5_WIDTH                       1u
#define XBIC_MCR_ME5(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME5_SHIFT))&XBIC_MCR_ME5_MASK)
#define XBIC_MCR_ME4_MASK                        0x80000u
#define XBIC_MCR_ME4_SHIFT                       19u
#define XBIC_MCR_ME4_WIDTH                       1u
#define XBIC_MCR_ME4(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME4_SHIFT))&XBIC_MCR_ME4_MASK)
#define XBIC_MCR_ME3_MASK                        0x100000u
#define XBIC_MCR_ME3_SHIFT                       20u
#define XBIC_MCR_ME3_WIDTH                       1u
#define XBIC_MCR_ME3(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME3_SHIFT))&XBIC_MCR_ME3_MASK)
#define XBIC_MCR_ME2_MASK                        0x200000u
#define XBIC_MCR_ME2_SHIFT                       21u
#define XBIC_MCR_ME2_WIDTH                       1u
#define XBIC_MCR_ME2(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME2_SHIFT))&XBIC_MCR_ME2_MASK)
#define XBIC_MCR_ME1_MASK                        0x400000u
#define XBIC_MCR_ME1_SHIFT                       22u
#define XBIC_MCR_ME1_WIDTH                       1u
#define XBIC_MCR_ME1(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME1_SHIFT))&XBIC_MCR_ME1_MASK)
#define XBIC_MCR_ME0_MASK                        0x800000u
#define XBIC_MCR_ME0_SHIFT                       23u
#define XBIC_MCR_ME0_WIDTH                       1u
#define XBIC_MCR_ME0(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_ME0_SHIFT))&XBIC_MCR_ME0_MASK)
#define XBIC_MCR_SE7_MASK                        0x1000000u
#define XBIC_MCR_SE7_SHIFT                       24u
#define XBIC_MCR_SE7_WIDTH                       1u
#define XBIC_MCR_SE7(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE7_SHIFT))&XBIC_MCR_SE7_MASK)
#define XBIC_MCR_SE6_MASK                        0x2000000u
#define XBIC_MCR_SE6_SHIFT                       25u
#define XBIC_MCR_SE6_WIDTH                       1u
#define XBIC_MCR_SE6(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE6_SHIFT))&XBIC_MCR_SE6_MASK)
#define XBIC_MCR_SE5_MASK                        0x4000000u
#define XBIC_MCR_SE5_SHIFT                       26u
#define XBIC_MCR_SE5_WIDTH                       1u
#define XBIC_MCR_SE5(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE5_SHIFT))&XBIC_MCR_SE5_MASK)
#define XBIC_MCR_SE4_MASK                        0x8000000u
#define XBIC_MCR_SE4_SHIFT                       27u
#define XBIC_MCR_SE4_WIDTH                       1u
#define XBIC_MCR_SE4(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE4_SHIFT))&XBIC_MCR_SE4_MASK)
#define XBIC_MCR_SE3_MASK                        0x10000000u
#define XBIC_MCR_SE3_SHIFT                       28u
#define XBIC_MCR_SE3_WIDTH                       1u
#define XBIC_MCR_SE3(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE3_SHIFT))&XBIC_MCR_SE3_MASK)
#define XBIC_MCR_SE2_MASK                        0x20000000u
#define XBIC_MCR_SE2_SHIFT                       29u
#define XBIC_MCR_SE2_WIDTH                       1u
#define XBIC_MCR_SE2(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE2_SHIFT))&XBIC_MCR_SE2_MASK)
#define XBIC_MCR_SE1_MASK                        0x40000000u
#define XBIC_MCR_SE1_SHIFT                       30u
#define XBIC_MCR_SE1_WIDTH                       1u
#define XBIC_MCR_SE1(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE1_SHIFT))&XBIC_MCR_SE1_MASK)
#define XBIC_MCR_SE0_MASK                        0x80000000u
#define XBIC_MCR_SE0_SHIFT                       31u
#define XBIC_MCR_SE0_WIDTH                       1u
#define XBIC_MCR_SE0(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_MCR_SE0_SHIFT))&XBIC_MCR_SE0_MASK)
/* EIR Bit Fields */
#define XBIC_EIR_SYN_MASK                        0xFFu
#define XBIC_EIR_SYN_SHIFT                       0u
#define XBIC_EIR_SYN_WIDTH                       8u
#define XBIC_EIR_SYN(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_EIR_SYN_SHIFT))&XBIC_EIR_SYN_MASK)
#define XBIC_EIR_MST_MASK                        0xF00u
#define XBIC_EIR_MST_SHIFT                       8u
#define XBIC_EIR_MST_WIDTH                       4u
#define XBIC_EIR_MST(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_EIR_MST_SHIFT))&XBIC_EIR_MST_MASK)
#define XBIC_EIR_SLV_MASK                        0x7000u
#define XBIC_EIR_SLV_SHIFT                       12u
#define XBIC_EIR_SLV_WIDTH                       3u
#define XBIC_EIR_SLV(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_EIR_SLV_SHIFT))&XBIC_EIR_SLV_MASK)
#define XBIC_EIR_EIE_MASK                        0x80000000u
#define XBIC_EIR_EIE_SHIFT                       31u
#define XBIC_EIR_EIE_WIDTH                       1u
#define XBIC_EIR_EIE(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_EIR_EIE_SHIFT))&XBIC_EIR_EIE_MASK)
/* ESR Bit Fields */
#define XBIC_ESR_SYN_MASK                        0xFFu
#define XBIC_ESR_SYN_SHIFT                       0u
#define XBIC_ESR_SYN_WIDTH                       8u
#define XBIC_ESR_SYN(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_SYN_SHIFT))&XBIC_ESR_SYN_MASK)
#define XBIC_ESR_MST_MASK                        0xF00u
#define XBIC_ESR_MST_SHIFT                       8u
#define XBIC_ESR_MST_WIDTH                       4u
#define XBIC_ESR_MST(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_MST_SHIFT))&XBIC_ESR_MST_MASK)
#define XBIC_ESR_SLV_MASK                        0x7000u
#define XBIC_ESR_SLV_SHIFT                       12u
#define XBIC_ESR_SLV_WIDTH                       3u
#define XBIC_ESR_SLV(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_SLV_SHIFT))&XBIC_ESR_SLV_MASK)
#define XBIC_ESR_DPME7_MASK                      0x8000u
#define XBIC_ESR_DPME7_SHIFT                     15u
#define XBIC_ESR_DPME7_WIDTH                     1u
#define XBIC_ESR_DPME7(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME7_SHIFT))&XBIC_ESR_DPME7_MASK)
#define XBIC_ESR_DPME6_MASK                      0x10000u
#define XBIC_ESR_DPME6_SHIFT                     16u
#define XBIC_ESR_DPME6_WIDTH                     1u
#define XBIC_ESR_DPME6(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME6_SHIFT))&XBIC_ESR_DPME6_MASK)
#define XBIC_ESR_DPME5_MASK                      0x20000u
#define XBIC_ESR_DPME5_SHIFT                     17u
#define XBIC_ESR_DPME5_WIDTH                     1u
#define XBIC_ESR_DPME5(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME5_SHIFT))&XBIC_ESR_DPME5_MASK)
#define XBIC_ESR_DPME4_MASK                      0x40000u
#define XBIC_ESR_DPME4_SHIFT                     18u
#define XBIC_ESR_DPME4_WIDTH                     1u
#define XBIC_ESR_DPME4(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME4_SHIFT))&XBIC_ESR_DPME4_MASK)
#define XBIC_ESR_DPME3_MASK                      0x80000u
#define XBIC_ESR_DPME3_SHIFT                     19u
#define XBIC_ESR_DPME3_WIDTH                     1u
#define XBIC_ESR_DPME3(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME3_SHIFT))&XBIC_ESR_DPME3_MASK)
#define XBIC_ESR_DPME2_MASK                      0x100000u
#define XBIC_ESR_DPME2_SHIFT                     20u
#define XBIC_ESR_DPME2_WIDTH                     1u
#define XBIC_ESR_DPME2(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME2_SHIFT))&XBIC_ESR_DPME2_MASK)
#define XBIC_ESR_DPME1_MASK                      0x200000u
#define XBIC_ESR_DPME1_SHIFT                     21u
#define XBIC_ESR_DPME1_WIDTH                     1u
#define XBIC_ESR_DPME1(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME1_SHIFT))&XBIC_ESR_DPME1_MASK)
#define XBIC_ESR_DPME0_MASK                      0x400000u
#define XBIC_ESR_DPME0_SHIFT                     22u
#define XBIC_ESR_DPME0_WIDTH                     1u
#define XBIC_ESR_DPME0(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPME0_SHIFT))&XBIC_ESR_DPME0_MASK)
#define XBIC_ESR_DPSE7_MASK                      0x800000u
#define XBIC_ESR_DPSE7_SHIFT                     23u
#define XBIC_ESR_DPSE7_WIDTH                     1u
#define XBIC_ESR_DPSE7(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE7_SHIFT))&XBIC_ESR_DPSE7_MASK)
#define XBIC_ESR_DPSE6_MASK                      0x1000000u
#define XBIC_ESR_DPSE6_SHIFT                     24u
#define XBIC_ESR_DPSE6_WIDTH                     1u
#define XBIC_ESR_DPSE6(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE6_SHIFT))&XBIC_ESR_DPSE6_MASK)
#define XBIC_ESR_DPSE5_MASK                      0x2000000u
#define XBIC_ESR_DPSE5_SHIFT                     25u
#define XBIC_ESR_DPSE5_WIDTH                     1u
#define XBIC_ESR_DPSE5(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE5_SHIFT))&XBIC_ESR_DPSE5_MASK)
#define XBIC_ESR_DPSE4_MASK                      0x4000000u
#define XBIC_ESR_DPSE4_SHIFT                     26u
#define XBIC_ESR_DPSE4_WIDTH                     1u
#define XBIC_ESR_DPSE4(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE4_SHIFT))&XBIC_ESR_DPSE4_MASK)
#define XBIC_ESR_DPSE3_MASK                      0x8000000u
#define XBIC_ESR_DPSE3_SHIFT                     27u
#define XBIC_ESR_DPSE3_WIDTH                     1u
#define XBIC_ESR_DPSE3(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE3_SHIFT))&XBIC_ESR_DPSE3_MASK)
#define XBIC_ESR_DPSE2_MASK                      0x10000000u
#define XBIC_ESR_DPSE2_SHIFT                     28u
#define XBIC_ESR_DPSE2_WIDTH                     1u
#define XBIC_ESR_DPSE2(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE2_SHIFT))&XBIC_ESR_DPSE2_MASK)
#define XBIC_ESR_DPSE1_MASK                      0x20000000u
#define XBIC_ESR_DPSE1_SHIFT                     29u
#define XBIC_ESR_DPSE1_WIDTH                     1u
#define XBIC_ESR_DPSE1(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE1_SHIFT))&XBIC_ESR_DPSE1_MASK)
#define XBIC_ESR_DPSE0_MASK                      0x40000000u
#define XBIC_ESR_DPSE0_SHIFT                     30u
#define XBIC_ESR_DPSE0_WIDTH                     1u
#define XBIC_ESR_DPSE0(x)                        (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_DPSE0_SHIFT))&XBIC_ESR_DPSE0_MASK)
#define XBIC_ESR_VLD_MASK                        0x80000000u
#define XBIC_ESR_VLD_SHIFT                       31u
#define XBIC_ESR_VLD_WIDTH                       1u
#define XBIC_ESR_VLD(x)                          (((uint32_t)(((uint32_t)(x))<<XBIC_ESR_VLD_SHIFT))&XBIC_ESR_VLD_MASK)
/* EAR Bit Fields */
#define XBIC_EAR_ADDR_MASK                       0xFFFFFFFFu
#define XBIC_EAR_ADDR_SHIFT                      0u
#define XBIC_EAR_ADDR_WIDTH                      32u
#define XBIC_EAR_ADDR(x)                         (((uint32_t)(((uint32_t)(x))<<XBIC_EAR_ADDR_SHIFT))&XBIC_EAR_ADDR_MASK)

/*!
 * @}
 */ /* end of group XBIC_Register_Masks */


/*!
 * @}
 */ /* end of group XBIC_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eMIOS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eMIOS_Peripheral_Access_Layer eMIOS Peripheral Access Layer
 * @{
 */


/** eMIOS - Size of Registers Arrays */
#define eMIOS_UC_COUNT                           24u

/** eMIOS - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< eMIOS Module Configuration Register, offset: 0x0 */
  __I  uint32_t GFLAG;                             /**< eMIOS Global FLAG Register, offset: 0x4 */
  __IO uint32_t OUDIS;                             /**< eMIOS Output Update Disable register, offset: 0x8 */
       uint8_t RESERVED_0[20];
  struct {                                         /* offset: 0x20, array step: 0x20 */
    __IO uint32_t A;                                 /**< eMIOS UC A register n, array offset: 0x20, array step: 0x20 */
    __IO uint32_t B;                                 /**< eMIOS UC B register n, array offset: 0x24, array step: 0x20 */
    __IO uint32_t CNT;                               /**< eMIOS CNT register n, array offset: 0x28, array step: 0x20 */
    __IO uint32_t C;                                 /**< eMIOS UC Control register n, array offset: 0x2C, array step: 0x20 */
    __IO uint32_t S;                                 /**< eMIOS UC Status register n, array offset: 0x30, array step: 0x20 */
    __IO uint32_t ALTA;                              /**< eMIOS Alternate Address register n, array offset: 0x34, array step: 0x20 */
         uint8_t RESERVED_0[8];
  } UC[eMIOS_UC_COUNT];
} eMIOS_Type, *eMIOS_MemMapPtr;

