neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the eMIOS module. */
#define eMIOS_INSTANCE_COUNT                     (2u)


/* eMIOS - Peripheral instance base addresses */
/** Peripheral eMIOS_0 base address */
#define eMIOS_0_BASE                             (0xFFE64000u)
/** Peripheral eMIOS_0 base pointer */
#define eMIOS_0                                  ((eMIOS_Type *)eMIOS_0_BASE)
/** Peripheral eMIOS_1 base address */
#define eMIOS_1_BASE                             (0xC3FA0000u)
/** Peripheral eMIOS_1 base pointer */
#define eMIOS_1                                  ((eMIOS_Type *)eMIOS_1_BASE)
/** Array initializer of eMIOS peripheral base addresses */
#define eMIOS_BASE_ADDRS                         { eMIOS_0_BASE, eMIOS_1_BASE }
/** Array initializer of eMIOS peripheral base pointers */
#define eMIOS_BASE_PTRS                          { eMIOS_0, eMIOS_1 }
/** Interrupt vectors for the eMIOS peripheral type */
#define eMIOS_IRQS                               { { EMIOS0_F0_IRQn,   EMIOS0_F1_IRQn,   EMIOS0_F2_IRQn,   EMIOS0_F3_IRQn,   EMIOS0_F4_IRQn,   EMIOS0_F5_IRQn,   EMIOS0_F6_IRQn,   EMIOS0_F7_IRQn, \
                                                     NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn, \
                                                     EMIOS0_CH16_IRQn, EMIOS0_CH17_IRQn, EMIOS0_CH18_IRQn, EMIOS0_CH19_IRQn, EMIOS0_CH20_IRQn, EMIOS0_CH21_IRQn, EMIOS0_CH22_IRQn, EMIOS0_CH23_IRQn }, \
                                                   { EMIOS1_F0_IRQn,   EMIOS1_F1_IRQn,   EMIOS1_F2_IRQn,   EMIOS1_F3_IRQn,   EMIOS1_F4_IRQn,   EMIOS1_F5_IRQn,   EMIOS1_F6_IRQn,   EMIOS1_F7_IRQn, \
                                                     NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn,    NotAvail_IRQn, \
                                                     EMIOS1_CH16_IRQn, EMIOS1_CH17_IRQn, EMIOS1_CH18_IRQn, EMIOS1_CH19_IRQn, EMIOS1_CH20_IRQn, EMIOS1_CH21_IRQn, EMIOS1_CH22_IRQn, EMIOS1_CH23_IRQn } }
#define eMIOS_IRQS_16CH                          { { EMIOS0_F0_IRQn,   EMIOS0_F1_IRQn,   EMIOS0_F2_IRQn,   EMIOS0_F3_IRQn,   EMIOS0_F4_IRQn,   EMIOS0_F5_IRQn,   EMIOS0_F6_IRQn,   EMIOS0_F7_IRQn, \
                                                     EMIOS0_CH16_IRQn, EMIOS0_CH17_IRQn, EMIOS0_CH18_IRQn, EMIOS0_CH19_IRQn, EMIOS0_CH20_IRQn, EMIOS0_CH21_IRQn, EMIOS0_CH22_IRQn, EMIOS0_CH23_IRQn }, \
                                                   { EMIOS1_F0_IRQn,   EMIOS1_F1_IRQn,   EMIOS1_F2_IRQn,   EMIOS1_F3_IRQn,   EMIOS1_F4_IRQn,   EMIOS1_F5_IRQn,   EMIOS1_F6_IRQn,   EMIOS1_F7_IRQn, \
                                                     EMIOS1_CH16_IRQn, EMIOS1_CH17_IRQn, EMIOS1_CH18_IRQn, EMIOS1_CH19_IRQn, EMIOS1_CH20_IRQn, EMIOS1_CH21_IRQn, EMIOS1_CH22_IRQn, EMIOS1_CH23_IRQn } }

/* ----------------------------------------------------------------------------
   -- eMIOS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eMIOS_Register_Masks eMIOS Register Masks
 * @{
 */

/* MCR Bit Fields */
#define eMIOS_MCR_GPRE_MASK                      0xFF00u
#define eMIOS_MCR_GPRE_SHIFT                     8u
#define eMIOS_MCR_GPRE_WIDTH                     8u
#define eMIOS_MCR_GPRE(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_GPRE_SHIFT))&eMIOS_MCR_GPRE_MASK)
#define eMIOS_MCR_SRV_MASK                       0xF0000u
#define eMIOS_MCR_SRV_SHIFT                      16u
#define eMIOS_MCR_SRV_WIDTH                      4u
#define eMIOS_MCR_SRV(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_SRV_SHIFT))&eMIOS_MCR_SRV_MASK)
#define eMIOS_MCR_GPREN_MASK                     0x4000000u
#define eMIOS_MCR_GPREN_SHIFT                    26u
#define eMIOS_MCR_GPREN_WIDTH                    1u
#define eMIOS_MCR_GPREN(x)                       (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_GPREN_SHIFT))&eMIOS_MCR_GPREN_MASK)
#define eMIOS_MCR_ETB_MASK                       0x8000000u
#define eMIOS_MCR_ETB_SHIFT                      27u
#define eMIOS_MCR_ETB_WIDTH                      1u
#define eMIOS_MCR_ETB(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_ETB_SHIFT))&eMIOS_MCR_ETB_MASK)
#define eMIOS_MCR_GTBE_MASK                      0x10000000u
#define eMIOS_MCR_GTBE_SHIFT                     28u
#define eMIOS_MCR_GTBE_WIDTH                     1u
#define eMIOS_MCR_GTBE(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_GTBE_SHIFT))&eMIOS_MCR_GTBE_MASK)
#define eMIOS_MCR_FRZ_MASK                       0x20000000u
#define eMIOS_MCR_FRZ_SHIFT                      29u
#define eMIOS_MCR_FRZ_WIDTH                      1u
#define eMIOS_MCR_FRZ(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_FRZ_SHIFT))&eMIOS_MCR_FRZ_MASK)
#define eMIOS_MCR_MDIS_MASK                      0x40000000u
#define eMIOS_MCR_MDIS_SHIFT                     30u
#define eMIOS_MCR_MDIS_WIDTH                     1u
#define eMIOS_MCR_MDIS(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_MCR_MDIS_SHIFT))&eMIOS_MCR_MDIS_MASK)
/* GFLAG Bit Fields */
#define eMIOS_GFLAG_F7_F0_MASK                   0xFFu
#define eMIOS_GFLAG_F7_F0_SHIFT                  0u
#define eMIOS_GFLAG_F7_F0_WIDTH                  8u
#define eMIOS_GFLAG_F7_F0(x)                     (((uint32_t)(((uint32_t)(x))<<eMIOS_GFLAG_F7_F0_SHIFT))&eMIOS_GFLAG_F7_F0_MASK)
#define eMIOS_GFLAG_F23_F16_MASK                 0xFF0000u
#define eMIOS_GFLAG_F23_F16_SHIFT                16u
#define eMIOS_GFLAG_F23_F16_WIDTH                8u
#define eMIOS_GFLAG_F23_F16(x)                   (((uint32_t)(((uint32_t)(x))<<eMIOS_GFLAG_F23_F16_SHIFT))&eMIOS_GFLAG_F23_F16_MASK)
/* OUDIS Bit Fields */
#define eMIOS_OUDIS_OU7_OU0_MASK                 0xFFu
#define eMIOS_OUDIS_OU7_OU0_SHIFT                0u
#define eMIOS_OUDIS_OU7_OU0_WIDTH                8u
#define eMIOS_OUDIS_OU7_OU0(x)                   (((uint32_t)(((uint32_t)(x))<<eMIOS_OUDIS_OU7_OU0_SHIFT))&eMIOS_OUDIS_OU7_OU0_MASK)
#define eMIOS_OUDIS_OU23_OU16_MASK               0xFF0000u
#define eMIOS_OUDIS_OU23_OU16_SHIFT              16u
#define eMIOS_OUDIS_OU23_OU16_WIDTH              8u
#define eMIOS_OUDIS_OU23_OU16(x)                 (((uint32_t)(((uint32_t)(x))<<eMIOS_OUDIS_OU23_OU16_SHIFT))&eMIOS_OUDIS_OU23_OU16_MASK)
/* A Bit Fields */
#define eMIOS_A_A_MASK                           0xFFFFFFu
#define eMIOS_A_A_SHIFT                          0u
#define eMIOS_A_A_WIDTH                          24u
#define eMIOS_A_A(x)                             (((uint32_t)(((uint32_t)(x))<<eMIOS_A_A_SHIFT))&eMIOS_A_A_MASK)
/* B Bit Fields */
#define eMIOS_B_B_MASK                           0xFFFFFFu
#define eMIOS_B_B_SHIFT                          0u
#define eMIOS_B_B_WIDTH                          24u
#define eMIOS_B_B(x)                             (((uint32_t)(((uint32_t)(x))<<eMIOS_B_B_SHIFT))&eMIOS_B_B_MASK)
/* CNT Bit Fields */
#define eMIOS_CNT_C_MASK                         0xFFFFFFu
#define eMIOS_CNT_C_SHIFT                        0u
#define eMIOS_CNT_C_WIDTH                        24u
#define eMIOS_CNT_C(x)                           (((uint32_t)(((uint32_t)(x))<<eMIOS_CNT_C_SHIFT))&eMIOS_CNT_C_MASK)
/* C Bit Fields */
#define eMIOS_C_MODE_MASK                        0x7Fu
#define eMIOS_C_MODE_SHIFT                       0u
#define eMIOS_C_MODE_WIDTH                       7u
#define eMIOS_C_MODE(x)                          (((uint32_t)(((uint32_t)(x))<<eMIOS_C_MODE_SHIFT))&eMIOS_C_MODE_MASK)
#define eMIOS_C_EDPOL_MASK                       0x80u
#define eMIOS_C_EDPOL_SHIFT                      7u
#define eMIOS_C_EDPOL_WIDTH                      1u
#define eMIOS_C_EDPOL(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_C_EDPOL_SHIFT))&eMIOS_C_EDPOL_MASK)
#define eMIOS_C_EDSEL_MASK                       0x100u
#define eMIOS_C_EDSEL_SHIFT                      8u
#define eMIOS_C_EDSEL_WIDTH                      1u
#define eMIOS_C_EDSEL(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_C_EDSEL_SHIFT))&eMIOS_C_EDSEL_MASK)
#define eMIOS_C_BSL_MASK                         0x600u
#define eMIOS_C_BSL_SHIFT                        9u
#define eMIOS_C_BSL_WIDTH                        2u
#define eMIOS_C_BSL(x)                           (((uint32_t)(((uint32_t)(x))<<eMIOS_C_BSL_SHIFT))&eMIOS_C_BSL_MASK)
#define eMIOS_C_FORCMB_MASK                      0x1000u
#define eMIOS_C_FORCMB_SHIFT                     12u
#define eMIOS_C_FORCMB_WIDTH                     1u
#define eMIOS_C_FORCMB(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_C_FORCMB_SHIFT))&eMIOS_C_FORCMB_MASK)
#define eMIOS_C_FORCMA_MASK                      0x2000u
#define eMIOS_C_FORCMA_SHIFT                     13u
#define eMIOS_C_FORCMA_WIDTH                     1u
#define eMIOS_C_FORCMA(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_C_FORCMA_SHIFT))&eMIOS_C_FORCMA_MASK)
#define eMIOS_C_FEN_MASK                         0x20000u
#define eMIOS_C_FEN_SHIFT                        17u
#define eMIOS_C_FEN_WIDTH                        1u
#define eMIOS_C_FEN(x)                           (((uint32_t)(((uint32_t)(x))<<eMIOS_C_FEN_SHIFT))&eMIOS_C_FEN_MASK)
#define eMIOS_C_FCK_MASK                         0x40000u
#define eMIOS_C_FCK_SHIFT                        18u
#define eMIOS_C_FCK_WIDTH                        1u
#define eMIOS_C_FCK(x)                           (((uint32_t)(((uint32_t)(x))<<eMIOS_C_FCK_SHIFT))&eMIOS_C_FCK_MASK)
#define eMIOS_C_IF_MASK                          0x780000u
#define eMIOS_C_IF_SHIFT                         19u
#define eMIOS_C_IF_WIDTH                         4u
#define eMIOS_C_IF(x)                            (((uint32_t)(((uint32_t)(x))<<eMIOS_C_IF_SHIFT))&eMIOS_C_IF_MASK)
#define eMIOS_C_DMA_MASK                         0x1000000u
#define eMIOS_C_DMA_SHIFT                        24u
#define eMIOS_C_DMA_WIDTH                        1u
#define eMIOS_C_DMA(x)                           (((uint32_t)(((uint32_t)(x))<<eMIOS_C_DMA_SHIFT))&eMIOS_C_DMA_MASK)
#define eMIOS_C_UCPREN_MASK                      0x2000000u
#define eMIOS_C_UCPREN_SHIFT                     25u
#define eMIOS_C_UCPREN_WIDTH                     1u
#define eMIOS_C_UCPREN(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_C_UCPREN_SHIFT))&eMIOS_C_UCPREN_MASK)
#define eMIOS_C_UCPRE_MASK                       0xC000000u
#define eMIOS_C_UCPRE_SHIFT                      26u
#define eMIOS_C_UCPRE_WIDTH                      2u
#define eMIOS_C_UCPRE(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_C_UCPRE_SHIFT))&eMIOS_C_UCPRE_MASK)
#define eMIOS_C_ODISSL_MASK                      0x30000000u
#define eMIOS_C_ODISSL_SHIFT                     28u
#define eMIOS_C_ODISSL_WIDTH                     2u
#define eMIOS_C_ODISSL(x)                        (((uint32_t)(((uint32_t)(x))<<eMIOS_C_ODISSL_SHIFT))&eMIOS_C_ODISSL_MASK)
#define eMIOS_C_ODIS_MASK                        0x40000000u
#define eMIOS_C_ODIS_SHIFT                       30u
#define eMIOS_C_ODIS_WIDTH                       1u
#define eMIOS_C_ODIS(x)                          (((uint32_t)(((uint32_t)(x))<<eMIOS_C_ODIS_SHIFT))&eMIOS_C_ODIS_MASK)
#define eMIOS_C_FREN_MASK                        0x80000000u
#define eMIOS_C_FREN_SHIFT                       31u
#define eMIOS_C_FREN_WIDTH                       1u
#define eMIOS_C_FREN(x)                          (((uint32_t)(((uint32_t)(x))<<eMIOS_C_FREN_SHIFT))&eMIOS_C_FREN_MASK)
/* S Bit Fields */
#define eMIOS_S_FLAG_MASK                        0x1u
#define eMIOS_S_FLAG_SHIFT                       0u
#define eMIOS_S_FLAG_WIDTH                       1u
#define eMIOS_S_FLAG(x)                          (((uint32_t)(((uint32_t)(x))<<eMIOS_S_FLAG_SHIFT))&eMIOS_S_FLAG_MASK)
#define eMIOS_S_UCOUT_MASK                       0x2u
#define eMIOS_S_UCOUT_SHIFT                      1u
#define eMIOS_S_UCOUT_WIDTH                      1u
#define eMIOS_S_UCOUT(x)                         (((uint32_t)(((uint32_t)(x))<<eMIOS_S_UCOUT_SHIFT))&eMIOS_S_UCOUT_MASK)
#define eMIOS_S_UCIN_MASK                        0x4u
#define eMIOS_S_UCIN_SHIFT                       2u
#define eMIOS_S_UCIN_WIDTH                       1u
#define eMIOS_S_UCIN(x)                          (((uint32_t)(((uint32_t)(x))<<eMIOS_S_UCIN_SHIFT))&eMIOS_S_UCIN_MASK)
#define eMIOS_S_OVFL_MASK                        0x8000u
#define eMIOS_S_OVFL_SHIFT                       15u
#define eMIOS_S_OVFL_WIDTH                       1u
#define eMIOS_S_OVFL(x)                          (((uint32_t)(((uint32_t)(x))<<eMIOS_S_OVFL_SHIFT))&eMIOS_S_OVFL_MASK)
#define eMIOS_S_OVR_MASK                         0x80000000u
#define eMIOS_S_OVR_SHIFT                        31u
#define eMIOS_S_OVR_WIDTH                        1u
#define eMIOS_S_OVR(x)                           (((uint32_t)(((uint32_t)(x))<<eMIOS_S_OVR_SHIFT))&eMIOS_S_OVR_MASK)
/* ALTA Bit Fields */
#define eMIOS_ALTA_ALTA_MASK                     0xFFFFFFu
#define eMIOS_ALTA_ALTA_SHIFT                    0u
#define eMIOS_ALTA_ALTA_WIDTH                    24u
#define eMIOS_ALTA_ALTA(x)                       (((uint32_t)(((uint32_t)(x))<<eMIOS_ALTA_ALTA_SHIFT))&eMIOS_ALTA_ALTA_MASK)

/*!
 * @}
 */ /* end of group eMIOS_Register_Masks */


/*!
 * @}
 */ /* end of group eMIOS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eSCI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eSCI_Peripheral_Access_Layer eSCI Peripheral Access Layer
 * @{
 */


