neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** eSCI - Size of Registers Arrays */

/** eSCI - Register Layout Typedef */
typedef struct {
  __IO uint16_t BRR;                               /**< Baud Rate Register, offset: 0x0 */
  __IO uint16_t CR1;                               /**< Control Register 1, offset: 0x2 */
  __IO uint16_t CR2;                               /**< Control Register 2, offset: 0x4 */
  __IO uint16_t SDR;                               /**< SCI Data Register, offset: 0x6 */
  __IO uint16_t IFSR1;                             /**< Interrupt Flag and Status Register 1, offset: 0x8 */
  __IO uint16_t IFSR2;                             /**< Interrupt Flag and Status Register 2, offset: 0xA */
  __IO uint16_t LCR1;                              /**< LIN Control Register 1, offset: 0xC */
  __IO uint16_t LCR2;                              /**< LIN Control Register 2, offset: 0xE */
  __IO uint8_t LTR;                                /**< LIN Transmit Register, offset: 0x10 */
       uint8_t RESERVED_0[3];
  __I  uint8_t LRR;                                /**< LIN Receive Register, offset: 0x14 */
       uint8_t RESERVED_1[3];
  __IO uint16_t LPR;                               /**< LIN CRC Polynomial Register, offset: 0x18 */
  __IO uint16_t CR3;                               /**< Control Register 3, offset: 0x1A */
} eSCI_Type, *eSCI_MemMapPtr;

 /** Number of instances of the eSCI module. */
#define eSCI_INSTANCE_COUNT                      (6u)


/* eSCI - Peripheral instance base addresses */
/** Peripheral eSCI_0 base address */
#define eSCI_0_BASE                              (0xFFFB0000u)
/** Peripheral eSCI_0 base pointer */
#define eSCI_0                                   ((eSCI_Type *)eSCI_0_BASE)
/** Peripheral eSCI_1 base address */
#define eSCI_1_BASE                              (0xFFFB4000u)
/** Peripheral eSCI_1 base pointer */
#define eSCI_1                                   ((eSCI_Type *)eSCI_1_BASE)
/** Peripheral eSCI_2 base address */
#define eSCI_2_BASE                              (0xFFFB8000u)
/** Peripheral eSCI_2 base pointer */
#define eSCI_2                                   ((eSCI_Type *)eSCI_2_BASE)
/** Peripheral eSCI_3 base address */
#define eSCI_3_BASE                              (0xC3FB0000u)
/** Peripheral eSCI_3 base pointer */
#define eSCI_3                                   ((eSCI_Type *)eSCI_3_BASE)
/** Peripheral eSCI_4 base address */
#define eSCI_4_BASE                              (0xC3FB4000u)
/** Peripheral eSCI_4 base pointer */
#define eSCI_4                                   ((eSCI_Type *)eSCI_4_BASE)
/** Peripheral eSCI_5 base address */
#define eSCI_5_BASE                              (0xC3FB8000u)
/** Peripheral eSCI_5 base pointer */
#define eSCI_5                                   ((eSCI_Type *)eSCI_5_BASE)
/** Array initializer of eSCI peripheral base addresses */
#define eSCI_BASE_ADDRS                          { eSCI_0_BASE, eSCI_1_BASE, eSCI_2_BASE, eSCI_3_BASE, eSCI_4_BASE, eSCI_5_BASE }
/** Array initializer of eSCI peripheral base pointers */
#define eSCI_BASE_PTRS                           { eSCI_0, eSCI_1, eSCI_2, eSCI_3, eSCI_4, eSCI_5 }

/* ----------------------------------------------------------------------------
   -- eSCI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eSCI_Register_Masks eSCI Register Masks
 * @{
 */

/* BRR Bit Fields */
#define eSCI_BRR_SBR_MASK                        0x1FFFu
#define eSCI_BRR_SBR_SHIFT                       0u
#define eSCI_BRR_SBR_WIDTH                       13u
#define eSCI_BRR_SBR(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_BRR_SBR_SHIFT))&eSCI_BRR_SBR_MASK)
/* CR1 Bit Fields */
#define eSCI_CR1_SBK_MASK                        0x1u
#define eSCI_CR1_SBK_SHIFT                       0u
#define eSCI_CR1_SBK_WIDTH                       1u
#define eSCI_CR1_SBK(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_SBK_SHIFT))&eSCI_CR1_SBK_MASK)
#define eSCI_CR1_RWU_MASK                        0x2u
#define eSCI_CR1_RWU_SHIFT                       1u
#define eSCI_CR1_RWU_WIDTH                       1u
#define eSCI_CR1_RWU(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_RWU_SHIFT))&eSCI_CR1_RWU_MASK)
#define eSCI_CR1_RE_MASK                         0x4u
#define eSCI_CR1_RE_SHIFT                        2u
#define eSCI_CR1_RE_WIDTH                        1u
#define eSCI_CR1_RE(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_RE_SHIFT))&eSCI_CR1_RE_MASK)
#define eSCI_CR1_TE_MASK                         0x8u
#define eSCI_CR1_TE_SHIFT                        3u
#define eSCI_CR1_TE_WIDTH                        1u
#define eSCI_CR1_TE(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_TE_SHIFT))&eSCI_CR1_TE_MASK)
#define eSCI_CR1_ILIE_MASK                       0x10u
#define eSCI_CR1_ILIE_SHIFT                      4u
#define eSCI_CR1_ILIE_WIDTH                      1u
#define eSCI_CR1_ILIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_ILIE_SHIFT))&eSCI_CR1_ILIE_MASK)
#define eSCI_CR1_RIE_MASK                        0x20u
#define eSCI_CR1_RIE_SHIFT                       5u
#define eSCI_CR1_RIE_WIDTH                       1u
#define eSCI_CR1_RIE(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_RIE_SHIFT))&eSCI_CR1_RIE_MASK)
#define eSCI_CR1_TCIE_MASK                       0x40u
#define eSCI_CR1_TCIE_SHIFT                      6u
#define eSCI_CR1_TCIE_WIDTH                      1u
#define eSCI_CR1_TCIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_TCIE_SHIFT))&eSCI_CR1_TCIE_MASK)
#define eSCI_CR1_TIE_MASK                        0x80u
#define eSCI_CR1_TIE_SHIFT                       7u
#define eSCI_CR1_TIE_WIDTH                       1u
#define eSCI_CR1_TIE(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_TIE_SHIFT))&eSCI_CR1_TIE_MASK)
#define eSCI_CR1_PT_MASK                         0x100u
#define eSCI_CR1_PT_SHIFT                        8u
#define eSCI_CR1_PT_WIDTH                        1u
#define eSCI_CR1_PT(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_PT_SHIFT))&eSCI_CR1_PT_MASK)
#define eSCI_CR1_PE_MASK                         0x200u
#define eSCI_CR1_PE_SHIFT                        9u
#define eSCI_CR1_PE_WIDTH                        1u
#define eSCI_CR1_PE(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_PE_SHIFT))&eSCI_CR1_PE_MASK)
#define eSCI_CR1_WAKE_MASK                       0x800u
#define eSCI_CR1_WAKE_SHIFT                      11u
#define eSCI_CR1_WAKE_WIDTH                      1u
#define eSCI_CR1_WAKE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_WAKE_SHIFT))&eSCI_CR1_WAKE_MASK)
#define eSCI_CR1_M_MASK                          0x1000u
#define eSCI_CR1_M_SHIFT                         12u
#define eSCI_CR1_M_WIDTH                         1u
#define eSCI_CR1_M(x)                            (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_M_SHIFT))&eSCI_CR1_M_MASK)
#define eSCI_CR1_RSRC_MASK                       0x2000u
#define eSCI_CR1_RSRC_SHIFT                      13u
#define eSCI_CR1_RSRC_WIDTH                      1u
#define eSCI_CR1_RSRC(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_RSRC_SHIFT))&eSCI_CR1_RSRC_MASK)
#define eSCI_CR1_LOOPS_MASK                      0x8000u
#define eSCI_CR1_LOOPS_SHIFT                     15u
#define eSCI_CR1_LOOPS_WIDTH                     1u
#define eSCI_CR1_LOOPS(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_CR1_LOOPS_SHIFT))&eSCI_CR1_LOOPS_MASK)
/* CR2 Bit Fields */
#define eSCI_CR2_PFIE_MASK                       0x1u
#define eSCI_CR2_PFIE_SHIFT                      0u
#define eSCI_CR2_PFIE_WIDTH                      1u
#define eSCI_CR2_PFIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_PFIE_SHIFT))&eSCI_CR2_PFIE_MASK)
#define eSCI_CR2_FEIE_MASK                       0x2u
#define eSCI_CR2_FEIE_SHIFT                      1u
#define eSCI_CR2_FEIE_WIDTH                      1u
#define eSCI_CR2_FEIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_FEIE_SHIFT))&eSCI_CR2_FEIE_MASK)
#define eSCI_CR2_NFIE_MASK                       0x4u
#define eSCI_CR2_NFIE_SHIFT                      2u
#define eSCI_CR2_NFIE_WIDTH                      1u
#define eSCI_CR2_NFIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_NFIE_SHIFT))&eSCI_CR2_NFIE_MASK)
#define eSCI_CR2_ORIE_MASK                       0x8u
#define eSCI_CR2_ORIE_SHIFT                      3u
#define eSCI_CR2_ORIE_WIDTH                      1u
#define eSCI_CR2_ORIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_ORIE_SHIFT))&eSCI_CR2_ORIE_MASK)
#define eSCI_CR2_PMSK_MASK                       0x10u
#define eSCI_CR2_PMSK_SHIFT                      4u
#define eSCI_CR2_PMSK_WIDTH                      1u
#define eSCI_CR2_PMSK(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_PMSK_SHIFT))&eSCI_CR2_PMSK_MASK)
#define eSCI_CR2_RXPOL_MASK                      0x20u
#define eSCI_CR2_RXPOL_SHIFT                     5u
#define eSCI_CR2_RXPOL_WIDTH                     1u
#define eSCI_CR2_RXPOL(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_RXPOL_SHIFT))&eSCI_CR2_RXPOL_MASK)
#define eSCI_CR2_BESTP_MASK                      0x40u
#define eSCI_CR2_BESTP_SHIFT                     6u
#define eSCI_CR2_BESTP_WIDTH                     1u
#define eSCI_CR2_BESTP(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_BESTP_SHIFT))&eSCI_CR2_BESTP_MASK)
#define eSCI_CR2_BESM_MASK                       0x80u
#define eSCI_CR2_BESM_SHIFT                      7u
#define eSCI_CR2_BESM_WIDTH                      1u
#define eSCI_CR2_BESM(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_BESM_SHIFT))&eSCI_CR2_BESM_MASK)
#define eSCI_CR2_TXDIR_MASK                      0x100u
#define eSCI_CR2_TXDIR_SHIFT                     8u
#define eSCI_CR2_TXDIR_WIDTH                     1u
#define eSCI_CR2_TXDIR(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_TXDIR_SHIFT))&eSCI_CR2_TXDIR_MASK)
#define eSCI_CR2_BRCL_MASK                       0x200u
#define eSCI_CR2_BRCL_SHIFT                      9u
#define eSCI_CR2_BRCL_WIDTH                      1u
#define eSCI_CR2_BRCL(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_BRCL_SHIFT))&eSCI_CR2_BRCL_MASK)
#define eSCI_CR2_TXDMA_MASK                      0x400u
#define eSCI_CR2_TXDMA_SHIFT                     10u
#define eSCI_CR2_TXDMA_WIDTH                     1u
#define eSCI_CR2_TXDMA(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_TXDMA_SHIFT))&eSCI_CR2_TXDMA_MASK)
#define eSCI_CR2_RXDMA_MASK                      0x800u
#define eSCI_CR2_RXDMA_SHIFT                     11u
#define eSCI_CR2_RXDMA_WIDTH                     1u
#define eSCI_CR2_RXDMA(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_RXDMA_SHIFT))&eSCI_CR2_RXDMA_MASK)
#define eSCI_CR2_BERRIE_MASK                     0x1000u
#define eSCI_CR2_BERRIE_SHIFT                    12u
#define eSCI_CR2_BERRIE_WIDTH                    1u
#define eSCI_CR2_BERRIE(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_BERRIE_SHIFT))&eSCI_CR2_BERRIE_MASK)
#define eSCI_CR2_BSTP_MASK                       0x2000u
#define eSCI_CR2_BSTP_SHIFT                      13u
#define eSCI_CR2_BSTP_WIDTH                      1u
#define eSCI_CR2_BSTP(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_BSTP_SHIFT))&eSCI_CR2_BSTP_MASK)
#define eSCI_CR2_FBR_MASK                        0x4000u
#define eSCI_CR2_FBR_SHIFT                       14u
#define eSCI_CR2_FBR_WIDTH                       1u
#define eSCI_CR2_FBR(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_FBR_SHIFT))&eSCI_CR2_FBR_MASK)
#define eSCI_CR2_MDIS_MASK                       0x8000u
#define eSCI_CR2_MDIS_SHIFT                      15u
#define eSCI_CR2_MDIS_WIDTH                      1u
#define eSCI_CR2_MDIS(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR2_MDIS_SHIFT))&eSCI_CR2_MDIS_MASK)
/* SDR Bit Fields */
#define eSCI_SDR_RDTD_MASK                       0xFFFu
#define eSCI_SDR_RDTD_SHIFT                      0u
#define eSCI_SDR_RDTD_WIDTH                      12u
#define eSCI_SDR_RDTD(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_SDR_RDTD_SHIFT))&eSCI_SDR_RDTD_MASK)
#define eSCI_SDR_ERR_MASK                        0x2000u
#define eSCI_SDR_ERR_SHIFT                       13u
#define eSCI_SDR_ERR_WIDTH                       1u
#define eSCI_SDR_ERR(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_SDR_ERR_SHIFT))&eSCI_SDR_ERR_MASK)
#define eSCI_SDR_TN_MASK                         0x4000u
#define eSCI_SDR_TN_SHIFT                        14u
#define eSCI_SDR_TN_WIDTH                        1u
#define eSCI_SDR_TN(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_SDR_TN_SHIFT))&eSCI_SDR_TN_MASK)
#define eSCI_SDR_RN_MASK                         0x8000u
#define eSCI_SDR_RN_SHIFT                        15u
#define eSCI_SDR_RN_WIDTH                        1u
#define eSCI_SDR_RN(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_SDR_RN_SHIFT))&eSCI_SDR_RN_MASK)
/* IFSR1 Bit Fields */
#define eSCI_IFSR1_RACT_MASK                     0x1u
#define eSCI_IFSR1_RACT_SHIFT                    0u
#define eSCI_IFSR1_RACT_WIDTH                    1u
#define eSCI_IFSR1_RACT(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_RACT_SHIFT))&eSCI_IFSR1_RACT_MASK)
#define eSCI_IFSR1_TACT_MASK                     0x2u
#define eSCI_IFSR1_TACT_SHIFT                    1u
#define eSCI_IFSR1_TACT_WIDTH                    1u
#define eSCI_IFSR1_TACT(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_TACT_SHIFT))&eSCI_IFSR1_TACT_MASK)
#define eSCI_IFSR1_LACT_MASK                     0x4u
#define eSCI_IFSR1_LACT_SHIFT                    2u
#define eSCI_IFSR1_LACT_WIDTH                    1u
#define eSCI_IFSR1_LACT(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_LACT_SHIFT))&eSCI_IFSR1_LACT_MASK)
#define eSCI_IFSR1_WACT_MASK                     0x8u
#define eSCI_IFSR1_WACT_SHIFT                    3u
#define eSCI_IFSR1_WACT_WIDTH                    1u
#define eSCI_IFSR1_WACT(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_WACT_SHIFT))&eSCI_IFSR1_WACT_MASK)
#define eSCI_IFSR1_BERR_MASK                     0x10u
#define eSCI_IFSR1_BERR_SHIFT                    4u
#define eSCI_IFSR1_BERR_WIDTH                    1u
#define eSCI_IFSR1_BERR(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_BERR_SHIFT))&eSCI_IFSR1_BERR_MASK)
#define eSCI_IFSR1_DACT_MASK                     0x20u
#define eSCI_IFSR1_DACT_SHIFT                    5u
#define eSCI_IFSR1_DACT_WIDTH                    1u
#define eSCI_IFSR1_DACT(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_DACT_SHIFT))&eSCI_IFSR1_DACT_MASK)
#define eSCI_IFSR1_PF_MASK                       0x100u
#define eSCI_IFSR1_PF_SHIFT                      8u
#define eSCI_IFSR1_PF_WIDTH                      1u
#define eSCI_IFSR1_PF(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_PF_SHIFT))&eSCI_IFSR1_PF_MASK)
#define eSCI_IFSR1_FE_MASK                       0x200u
#define eSCI_IFSR1_FE_SHIFT                      9u
#define eSCI_IFSR1_FE_WIDTH                      1u
#define eSCI_IFSR1_FE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_FE_SHIFT))&eSCI_IFSR1_FE_MASK)
#define eSCI_IFSR1_NF_MASK                       0x400u
#define eSCI_IFSR1_NF_SHIFT                      10u
#define eSCI_IFSR1_NF_WIDTH                      1u
#define eSCI_IFSR1_NF(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_NF_SHIFT))&eSCI_IFSR1_NF_MASK)
#define eSCI_IFSR1_OR_MASK                       0x800u
#define eSCI_IFSR1_OR_SHIFT                      11u
#define eSCI_IFSR1_OR_WIDTH                      1u
#define eSCI_IFSR1_OR(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_OR_SHIFT))&eSCI_IFSR1_OR_MASK)
#define eSCI_IFSR1_IDLE_MASK                     0x1000u
#define eSCI_IFSR1_IDLE_SHIFT                    12u
#define eSCI_IFSR1_IDLE_WIDTH                    1u
#define eSCI_IFSR1_IDLE(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_IDLE_SHIFT))&eSCI_IFSR1_IDLE_MASK)
#define eSCI_IFSR1_RDRF_MASK                     0x2000u
#define eSCI_IFSR1_RDRF_SHIFT                    13u
#define eSCI_IFSR1_RDRF_WIDTH                    1u
#define eSCI_IFSR1_RDRF(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_RDRF_SHIFT))&eSCI_IFSR1_RDRF_MASK)
#define eSCI_IFSR1_TC_MASK                       0x4000u
#define eSCI_IFSR1_TC_SHIFT                      14u
#define eSCI_IFSR1_TC_WIDTH                      1u
#define eSCI_IFSR1_TC(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_TC_SHIFT))&eSCI_IFSR1_TC_MASK)
#define eSCI_IFSR1_TDRE_MASK                     0x8000u
#define eSCI_IFSR1_TDRE_SHIFT                    15u
#define eSCI_IFSR1_TDRE_WIDTH                    1u
#define eSCI_IFSR1_TDRE(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR1_TDRE_SHIFT))&eSCI_IFSR1_TDRE_MASK)
/* IFSR2 Bit Fields */
#define eSCI_IFSR2_OVFL_MASK                     0x1u
#define eSCI_IFSR2_OVFL_SHIFT                    0u
#define eSCI_IFSR2_OVFL_WIDTH                    1u
#define eSCI_IFSR2_OVFL(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_OVFL_SHIFT))&eSCI_IFSR2_OVFL_MASK)
#define eSCI_IFSR2_UREQ_MASK                     0x2u
#define eSCI_IFSR2_UREQ_SHIFT                    1u
#define eSCI_IFSR2_UREQ_WIDTH                    1u
#define eSCI_IFSR2_UREQ(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_UREQ_SHIFT))&eSCI_IFSR2_UREQ_MASK)
#define eSCI_IFSR2_FRC_MASK                      0x100u
#define eSCI_IFSR2_FRC_SHIFT                     8u
#define eSCI_IFSR2_FRC_WIDTH                     1u
#define eSCI_IFSR2_FRC(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_FRC_SHIFT))&eSCI_IFSR2_FRC_MASK)
#define eSCI_IFSR2_CKERR_MASK                    0x200u
#define eSCI_IFSR2_CKERR_SHIFT                   9u
#define eSCI_IFSR2_CKERR_WIDTH                   1u
#define eSCI_IFSR2_CKERR(x)                      (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_CKERR_SHIFT))&eSCI_IFSR2_CKERR_MASK)
#define eSCI_IFSR2_CERR_MASK                     0x400u
#define eSCI_IFSR2_CERR_SHIFT                    10u
#define eSCI_IFSR2_CERR_WIDTH                    1u
#define eSCI_IFSR2_CERR(x)                       (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_CERR_SHIFT))&eSCI_IFSR2_CERR_MASK)
#define eSCI_IFSR2_PBERR_MASK                    0x800u
#define eSCI_IFSR2_PBERR_SHIFT                   11u
#define eSCI_IFSR2_PBERR_WIDTH                   1u
#define eSCI_IFSR2_PBERR(x)                      (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_PBERR_SHIFT))&eSCI_IFSR2_PBERR_MASK)
#define eSCI_IFSR2_STO_MASK                      0x1000u
#define eSCI_IFSR2_STO_SHIFT                     12u
#define eSCI_IFSR2_STO_WIDTH                     1u
#define eSCI_IFSR2_STO(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_STO_SHIFT))&eSCI_IFSR2_STO_MASK)
#define eSCI_IFSR2_LWAKE_MASK                    0x2000u
#define eSCI_IFSR2_LWAKE_SHIFT                   13u
#define eSCI_IFSR2_LWAKE_WIDTH                   1u
#define eSCI_IFSR2_LWAKE(x)                      (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_LWAKE_SHIFT))&eSCI_IFSR2_LWAKE_MASK)
#define eSCI_IFSR2_TXRDY_MASK                    0x4000u
#define eSCI_IFSR2_TXRDY_SHIFT                   14u
#define eSCI_IFSR2_TXRDY_WIDTH                   1u
#define eSCI_IFSR2_TXRDY(x)                      (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_TXRDY_SHIFT))&eSCI_IFSR2_TXRDY_MASK)
#define eSCI_IFSR2_RXRDY_MASK                    0x8000u
#define eSCI_IFSR2_RXRDY_SHIFT                   15u
#define eSCI_IFSR2_RXRDY_WIDTH                   1u
#define eSCI_IFSR2_RXRDY(x)                      (((uint16_t)(((uint16_t)(x))<<eSCI_IFSR2_RXRDY_SHIFT))&eSCI_IFSR2_RXRDY_MASK)
/* LCR1 Bit Fields */
#define eSCI_LCR1_FCIE_MASK                      0x1u
#define eSCI_LCR1_FCIE_SHIFT                     0u
#define eSCI_LCR1_FCIE_WIDTH                     1u
#define eSCI_LCR1_FCIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_FCIE_SHIFT))&eSCI_LCR1_FCIE_MASK)
#define eSCI_LCR1_CKIE_MASK                      0x2u
#define eSCI_LCR1_CKIE_SHIFT                     1u
#define eSCI_LCR1_CKIE_WIDTH                     1u
#define eSCI_LCR1_CKIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_CKIE_SHIFT))&eSCI_LCR1_CKIE_MASK)
#define eSCI_LCR1_CIE_MASK                       0x4u
#define eSCI_LCR1_CIE_SHIFT                      2u
#define eSCI_LCR1_CIE_WIDTH                      1u
#define eSCI_LCR1_CIE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_CIE_SHIFT))&eSCI_LCR1_CIE_MASK)
#define eSCI_LCR1_PBIE_MASK                      0x8u
#define eSCI_LCR1_PBIE_SHIFT                     3u
#define eSCI_LCR1_PBIE_WIDTH                     1u
#define eSCI_LCR1_PBIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_PBIE_SHIFT))&eSCI_LCR1_PBIE_MASK)
#define eSCI_LCR1_STIE_MASK                      0x10u
#define eSCI_LCR1_STIE_SHIFT                     4u
#define eSCI_LCR1_STIE_WIDTH                     1u
#define eSCI_LCR1_STIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_STIE_SHIFT))&eSCI_LCR1_STIE_MASK)
#define eSCI_LCR1_WUIE_MASK                      0x20u
#define eSCI_LCR1_WUIE_SHIFT                     5u
#define eSCI_LCR1_WUIE_WIDTH                     1u
#define eSCI_LCR1_WUIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_WUIE_SHIFT))&eSCI_LCR1_WUIE_MASK)
#define eSCI_LCR1_TXIE_MASK                      0x40u
#define eSCI_LCR1_TXIE_SHIFT                     6u
#define eSCI_LCR1_TXIE_WIDTH                     1u
#define eSCI_LCR1_TXIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_TXIE_SHIFT))&eSCI_LCR1_TXIE_MASK)
#define eSCI_LCR1_RXIE_MASK                      0x80u
#define eSCI_LCR1_RXIE_SHIFT                     7u
#define eSCI_LCR1_RXIE_WIDTH                     1u
#define eSCI_LCR1_RXIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_RXIE_SHIFT))&eSCI_LCR1_RXIE_MASK)
#define eSCI_LCR1_LIN_MASK                       0x100u
#define eSCI_LCR1_LIN_SHIFT                      8u
#define eSCI_LCR1_LIN_WIDTH                      1u
#define eSCI_LCR1_LIN(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_LIN_SHIFT))&eSCI_LCR1_LIN_MASK)
#define eSCI_LCR1_PRTY_MASK                      0x200u
#define eSCI_LCR1_PRTY_SHIFT                     9u
#define eSCI_LCR1_PRTY_WIDTH                     1u
#define eSCI_LCR1_PRTY(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_PRTY_SHIFT))&eSCI_LCR1_PRTY_MASK)
#define eSCI_LCR1_WUD_MASK                       0x3000u
#define eSCI_LCR1_WUD_SHIFT                      12u
#define eSCI_LCR1_WUD_WIDTH                      2u
#define eSCI_LCR1_WUD(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_WUD_SHIFT))&eSCI_LCR1_WUD_MASK)
#define eSCI_LCR1_WU_MASK                        0x4000u
#define eSCI_LCR1_WU_SHIFT                       14u
#define eSCI_LCR1_WU_WIDTH                       1u
#define eSCI_LCR1_WU(x)                          (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_WU_SHIFT))&eSCI_LCR1_WU_MASK)
#define eSCI_LCR1_LRES_MASK                      0x8000u
#define eSCI_LCR1_LRES_SHIFT                     15u
#define eSCI_LCR1_LRES_WIDTH                     1u
#define eSCI_LCR1_LRES(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR1_LRES_SHIFT))&eSCI_LCR1_LRES_MASK)
/* LCR2 Bit Fields */
#define eSCI_LCR2_OFIE_MASK                      0x100u
#define eSCI_LCR2_OFIE_SHIFT                     8u
