neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
#define eSCI_LCR2_OFIE_WIDTH                     1u
#define eSCI_LCR2_OFIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR2_OFIE_SHIFT))&eSCI_LCR2_OFIE_MASK)
#define eSCI_LCR2_UQIE_MASK                      0x200u
#define eSCI_LCR2_UQIE_SHIFT                     9u
#define eSCI_LCR2_UQIE_WIDTH                     1u
#define eSCI_LCR2_UQIE(x)                        (((uint16_t)(((uint16_t)(x))<<eSCI_LCR2_UQIE_SHIFT))&eSCI_LCR2_UQIE_MASK)
/* LTR Bit Fields */
#define eSCI_LTR_DATA_MASK                       0xFFu
#define eSCI_LTR_DATA_SHIFT                      0u
#define eSCI_LTR_DATA_WIDTH                      8u
#define eSCI_LTR_DATA(x)                         (((uint8_t)(((uint8_t)(x))<<eSCI_LTR_DATA_SHIFT))&eSCI_LTR_DATA_MASK)
/* LRR Bit Fields */
#define eSCI_LRR_D_MASK                          0xFFu
#define eSCI_LRR_D_SHIFT                         0u
#define eSCI_LRR_D_WIDTH                         8u
#define eSCI_LRR_D(x)                            (((uint8_t)(((uint8_t)(x))<<eSCI_LRR_D_SHIFT))&eSCI_LRR_D_MASK)
/* LPR Bit Fields */
#define eSCI_LPR_P_MASK                          0xFFFFu
#define eSCI_LPR_P_SHIFT                         0u
#define eSCI_LPR_P_WIDTH                         16u
#define eSCI_LPR_P(x)                            (((uint16_t)(((uint16_t)(x))<<eSCI_LPR_P_SHIFT))&eSCI_LPR_P_MASK)
/* CR3 Bit Fields */
#define eSCI_CR3_M2_MASK                         0x100u
#define eSCI_CR3_M2_SHIFT                        8u
#define eSCI_CR3_M2_WIDTH                        1u
#define eSCI_CR3_M2(x)                           (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_M2_SHIFT))&eSCI_CR3_M2_MASK)
#define eSCI_CR3_ERPE_MASK                       0x200u
#define eSCI_CR3_ERPE_SHIFT                      9u
#define eSCI_CR3_ERPE_WIDTH                      1u
#define eSCI_CR3_ERPE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_ERPE_SHIFT))&eSCI_CR3_ERPE_MASK)
#define eSCI_CR3_ERFE_MASK                       0x400u
#define eSCI_CR3_ERFE_SHIFT                      10u
#define eSCI_CR3_ERFE_WIDTH                      1u
#define eSCI_CR3_ERFE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_ERFE_SHIFT))&eSCI_CR3_ERFE_MASK)
#define eSCI_CR3_EROE_MASK                       0x800u
#define eSCI_CR3_EROE_SHIFT                      11u
#define eSCI_CR3_EROE_WIDTH                      1u
#define eSCI_CR3_EROE(x)                         (((uint16_t)(((uint16_t)(x))<<eSCI_CR3_EROE_SHIFT))&eSCI_CR3_EROE_MASK)

/*!
 * @}
 */ /* end of group eSCI_Register_Masks */


/*!
 * @}
 */ /* end of group eSCI_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_CCCR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_CCCR_Peripheral_Access_Layer eTPU_CCCR Peripheral Access Layer
 * @{
 */


/** eTPU_CCCR - Size of Registers Arrays */
#define eTPU_CCCR_CR1_COUNT                      32u
#define eTPU_CCCR_CR2_COUNT                      32u

/** eTPU_CCCR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[1024];
  struct {                                         /* offset: 0x400, array step: 0x10 */
    __IO uint32_t CCR_ENG1;                          /**< eTPU Channel n Configuration Register for Engine 1, array offset: 0x400, array step: 0x10 */
    __IO uint32_t CSCR_ENG1;                         /**< eTPU Channel n Status Control Register for Engine 1, array offset: 0x404, array step: 0x10 */
    __IO uint32_t CHSRR_ENG1;                        /**< eTPU Channel n Host Service Request Register for Engine 1, array offset: 0x408, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } CR1[eTPU_CCCR_CR1_COUNT];
       uint8_t RESERVED_1[512];
  struct {                                         /* offset: 0x800, array step: 0x10 */
    __IO uint32_t CCR_ENG2;                          /**< eTPU Channel n Configuration Register for Engine 2, array offset: 0x800, array step: 0x10 */
    __IO uint32_t CSCR_ENG2;                         /**< eTPU Channel n Status Control Register for Engine 2, array offset: 0x804, array step: 0x10 */
    __IO uint32_t CHSRR_ENG2;                        /**< eTPU Channel n Host Service Request Register for Engine 2, array offset: 0x808, array step: 0x10 */
         uint8_t RESERVED_0[4];
  } CR2[eTPU_CCCR_CR2_COUNT];
} eTPU_CCCR_Type, *eTPU_CCCR_MemMapPtr;

 /** Number of instances of the eTPU_CCCR module. */
#define eTPU_CCCR_INSTANCE_COUNT                 (2u)


/* eTPU_CCCR - Peripheral instance base addresses */
/** Peripheral eTPU_CCCR_01 base address */
#define eTPU_CCCR_01_BASE                        (0xC3FC0000u)
/** Peripheral eTPU_CCCR_01 base pointer */
#define eTPU_CCCR_01                             ((eTPU_CCCR_Type *)eTPU_CCCR_01_BASE)
/** Peripheral eTPU_CCCR_2 base address */
#define eTPU_CCCR_2_BASE                         (0xFFE00000u)
/** Peripheral eTPU_CCCR_2 base pointer */
#define eTPU_CCCR_2                              ((eTPU_CCCR_Type *)eTPU_CCCR_2_BASE)
/** Array initializer of eTPU_CCCR peripheral base addresses */
#define eTPU_CCCR_BASE_ADDRS                     { eTPU_CCCR_01_BASE, eTPU_CCCR_2_BASE }
/** Array initializer of eTPU_CCCR peripheral base pointers */
#define eTPU_CCCR_BASE_PTRS                      { eTPU_CCCR_01, eTPU_CCCR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_CCCR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_CCCR_Register_Masks eTPU_CCCR Register Masks
 * @{
 */

/* CCR_ENG1 Bit Fields */
#define eTPU_CCCR_CCR_ENG1_CPBA_MASK             0x7FFu
#define eTPU_CCCR_CCR_ENG1_CPBA_SHIFT            0u
#define eTPU_CCCR_CCR_ENG1_CPBA_WIDTH            11u
#define eTPU_CCCR_CCR_ENG1_CPBA(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_CPBA_SHIFT))&eTPU_CCCR_CCR_ENG1_CPBA_MASK)
#define eTPU_CCCR_CCR_ENG1_OPOL_MASK             0x4000u
#define eTPU_CCCR_CCR_ENG1_OPOL_SHIFT            14u
#define eTPU_CCCR_CCR_ENG1_OPOL_WIDTH            1u
#define eTPU_CCCR_CCR_ENG1_OPOL(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_OPOL_SHIFT))&eTPU_CCCR_CCR_ENG1_OPOL_MASK)
#define eTPU_CCCR_CCR_ENG1_ODIS_MASK             0x8000u
#define eTPU_CCCR_CCR_ENG1_ODIS_SHIFT            15u
#define eTPU_CCCR_CCR_ENG1_ODIS_WIDTH            1u
#define eTPU_CCCR_CCR_ENG1_ODIS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_ODIS_SHIFT))&eTPU_CCCR_CCR_ENG1_ODIS_MASK)
#define eTPU_CCCR_CCR_ENG1_CFS_MASK              0x1F0000u
#define eTPU_CCCR_CCR_ENG1_CFS_SHIFT             16u
#define eTPU_CCCR_CCR_ENG1_CFS_WIDTH             5u
#define eTPU_CCCR_CCR_ENG1_CFS(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_CFS_SHIFT))&eTPU_CCCR_CCR_ENG1_CFS_MASK)
#define eTPU_CCCR_CCR_ENG1_ETCS_MASK             0x1000000u
#define eTPU_CCCR_CCR_ENG1_ETCS_SHIFT            24u
#define eTPU_CCCR_CCR_ENG1_ETCS_WIDTH            1u
#define eTPU_CCCR_CCR_ENG1_ETCS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_ETCS_SHIFT))&eTPU_CCCR_CCR_ENG1_ETCS_MASK)
#define eTPU_CCCR_CCR_ENG1_ETPD_MASK             0x2000000u
#define eTPU_CCCR_CCR_ENG1_ETPD_SHIFT            25u
#define eTPU_CCCR_CCR_ENG1_ETPD_WIDTH            1u
#define eTPU_CCCR_CCR_ENG1_ETPD(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_ETPD_SHIFT))&eTPU_CCCR_CCR_ENG1_ETPD_MASK)
#define eTPU_CCCR_CCR_ENG1_SSMAE_MASK            0x4000000u
#define eTPU_CCCR_CCR_ENG1_SSMAE_SHIFT           26u
#define eTPU_CCCR_CCR_ENG1_SSMAE_WIDTH           1u
#define eTPU_CCCR_CCR_ENG1_SSMAE(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_SSMAE_SHIFT))&eTPU_CCCR_CCR_ENG1_SSMAE_MASK)
#define eTPU_CCCR_CCR_ENG1_T4DIS_MASK            0x8000000u
#define eTPU_CCCR_CCR_ENG1_T4DIS_SHIFT           27u
#define eTPU_CCCR_CCR_ENG1_T4DIS_WIDTH           1u
#define eTPU_CCCR_CCR_ENG1_T4DIS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_T4DIS_SHIFT))&eTPU_CCCR_CCR_ENG1_T4DIS_MASK)
#define eTPU_CCCR_CCR_ENG1_CPR_MASK              0x30000000u
#define eTPU_CCCR_CCR_ENG1_CPR_SHIFT             28u
#define eTPU_CCCR_CCR_ENG1_CPR_WIDTH             2u
#define eTPU_CCCR_CCR_ENG1_CPR(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_CPR_SHIFT))&eTPU_CCCR_CCR_ENG1_CPR_MASK)
#define eTPU_CCCR_CCR_ENG1_DTRE_MASK             0x40000000u
#define eTPU_CCCR_CCR_ENG1_DTRE_SHIFT            30u
#define eTPU_CCCR_CCR_ENG1_DTRE_WIDTH            1u
#define eTPU_CCCR_CCR_ENG1_DTRE(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_DTRE_SHIFT))&eTPU_CCCR_CCR_ENG1_DTRE_MASK)
#define eTPU_CCCR_CCR_ENG1_CIE_MASK              0x80000000u
#define eTPU_CCCR_CCR_ENG1_CIE_SHIFT             31u
#define eTPU_CCCR_CCR_ENG1_CIE_WIDTH             1u
#define eTPU_CCCR_CCR_ENG1_CIE(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG1_CIE_SHIFT))&eTPU_CCCR_CCR_ENG1_CIE_MASK)
/* CSCR_ENG1 Bit Fields */
#define eTPU_CCCR_CSCR_ENG1_FM_MASK              0x3u
#define eTPU_CCCR_CSCR_ENG1_FM_SHIFT             0u
#define eTPU_CCCR_CSCR_ENG1_FM_WIDTH             2u
#define eTPU_CCCR_CSCR_ENG1_FM(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_FM_SHIFT))&eTPU_CCCR_CSCR_ENG1_FM_MASK)
#define eTPU_CCCR_CSCR_ENG1_OPS_MASK             0x4000u
#define eTPU_CCCR_CSCR_ENG1_OPS_SHIFT            14u
#define eTPU_CCCR_CSCR_ENG1_OPS_WIDTH            1u
#define eTPU_CCCR_CSCR_ENG1_OPS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_OPS_SHIFT))&eTPU_CCCR_CSCR_ENG1_OPS_MASK)
#define eTPU_CCCR_CSCR_ENG1_IPS_MASK             0x8000u
#define eTPU_CCCR_CSCR_ENG1_IPS_SHIFT            15u
#define eTPU_CCCR_CSCR_ENG1_IPS_WIDTH            1u
#define eTPU_CCCR_CSCR_ENG1_IPS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_IPS_SHIFT))&eTPU_CCCR_CSCR_ENG1_IPS_MASK)
#define eTPU_CCCR_CSCR_ENG1_DTROS_MASK           0x400000u
#define eTPU_CCCR_CSCR_ENG1_DTROS_SHIFT          22u
#define eTPU_CCCR_CSCR_ENG1_DTROS_WIDTH          1u
#define eTPU_CCCR_CSCR_ENG1_DTROS(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_DTROS_SHIFT))&eTPU_CCCR_CSCR_ENG1_DTROS_MASK)
#define eTPU_CCCR_CSCR_ENG1_DTRS_MASK            0x800000u
#define eTPU_CCCR_CSCR_ENG1_DTRS_SHIFT           23u
#define eTPU_CCCR_CSCR_ENG1_DTRS_WIDTH           1u
#define eTPU_CCCR_CSCR_ENG1_DTRS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_DTRS_SHIFT))&eTPU_CCCR_CSCR_ENG1_DTRS_MASK)
#define eTPU_CCCR_CSCR_ENG1_CIOS_MASK            0x40000000u
#define eTPU_CCCR_CSCR_ENG1_CIOS_SHIFT           30u
#define eTPU_CCCR_CSCR_ENG1_CIOS_WIDTH           1u
#define eTPU_CCCR_CSCR_ENG1_CIOS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_CIOS_SHIFT))&eTPU_CCCR_CSCR_ENG1_CIOS_MASK)
#define eTPU_CCCR_CSCR_ENG1_CIS_MASK             0x80000000u
#define eTPU_CCCR_CSCR_ENG1_CIS_SHIFT            31u
#define eTPU_CCCR_CSCR_ENG1_CIS_WIDTH            1u
#define eTPU_CCCR_CSCR_ENG1_CIS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG1_CIS_SHIFT))&eTPU_CCCR_CSCR_ENG1_CIS_MASK)
/* CHSRR_ENG1 Bit Fields */
#define eTPU_CCCR_CHSRR_ENG1_HSR_MASK            0x7u
#define eTPU_CCCR_CHSRR_ENG1_HSR_SHIFT           0u
#define eTPU_CCCR_CHSRR_ENG1_HSR_WIDTH           3u
#define eTPU_CCCR_CHSRR_ENG1_HSR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CHSRR_ENG1_HSR_SHIFT))&eTPU_CCCR_CHSRR_ENG1_HSR_MASK)
/* CCR_ENG2 Bit Fields */
#define eTPU_CCCR_CCR_ENG2_CPBA_MASK             0x7FFu
#define eTPU_CCCR_CCR_ENG2_CPBA_SHIFT            0u
#define eTPU_CCCR_CCR_ENG2_CPBA_WIDTH            11u
#define eTPU_CCCR_CCR_ENG2_CPBA(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_CPBA_SHIFT))&eTPU_CCCR_CCR_ENG2_CPBA_MASK)
#define eTPU_CCCR_CCR_ENG2_OPOL_MASK             0x4000u
#define eTPU_CCCR_CCR_ENG2_OPOL_SHIFT            14u
#define eTPU_CCCR_CCR_ENG2_OPOL_WIDTH            1u
#define eTPU_CCCR_CCR_ENG2_OPOL(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_OPOL_SHIFT))&eTPU_CCCR_CCR_ENG2_OPOL_MASK)
#define eTPU_CCCR_CCR_ENG2_ODIS_MASK             0x8000u
#define eTPU_CCCR_CCR_ENG2_ODIS_SHIFT            15u
#define eTPU_CCCR_CCR_ENG2_ODIS_WIDTH            1u
#define eTPU_CCCR_CCR_ENG2_ODIS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_ODIS_SHIFT))&eTPU_CCCR_CCR_ENG2_ODIS_MASK)
#define eTPU_CCCR_CCR_ENG2_CFS_MASK              0x1F0000u
#define eTPU_CCCR_CCR_ENG2_CFS_SHIFT             16u
#define eTPU_CCCR_CCR_ENG2_CFS_WIDTH             5u
#define eTPU_CCCR_CCR_ENG2_CFS(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_CFS_SHIFT))&eTPU_CCCR_CCR_ENG2_CFS_MASK)
#define eTPU_CCCR_CCR_ENG2_ETCS_MASK             0x1000000u
#define eTPU_CCCR_CCR_ENG2_ETCS_SHIFT            24u
#define eTPU_CCCR_CCR_ENG2_ETCS_WIDTH            1u
#define eTPU_CCCR_CCR_ENG2_ETCS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_ETCS_SHIFT))&eTPU_CCCR_CCR_ENG2_ETCS_MASK)
#define eTPU_CCCR_CCR_ENG2_ETPD_MASK             0x2000000u
#define eTPU_CCCR_CCR_ENG2_ETPD_SHIFT            25u
#define eTPU_CCCR_CCR_ENG2_ETPD_WIDTH            1u
#define eTPU_CCCR_CCR_ENG2_ETPD(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_ETPD_SHIFT))&eTPU_CCCR_CCR_ENG2_ETPD_MASK)
#define eTPU_CCCR_CCR_ENG2_SSMAE_MASK            0x4000000u
#define eTPU_CCCR_CCR_ENG2_SSMAE_SHIFT           26u
#define eTPU_CCCR_CCR_ENG2_SSMAE_WIDTH           1u
#define eTPU_CCCR_CCR_ENG2_SSMAE(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_SSMAE_SHIFT))&eTPU_CCCR_CCR_ENG2_SSMAE_MASK)
#define eTPU_CCCR_CCR_ENG2_T4DIS_MASK            0x8000000u
#define eTPU_CCCR_CCR_ENG2_T4DIS_SHIFT           27u
#define eTPU_CCCR_CCR_ENG2_T4DIS_WIDTH           1u
#define eTPU_CCCR_CCR_ENG2_T4DIS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_T4DIS_SHIFT))&eTPU_CCCR_CCR_ENG2_T4DIS_MASK)
#define eTPU_CCCR_CCR_ENG2_CPR_MASK              0x30000000u
#define eTPU_CCCR_CCR_ENG2_CPR_SHIFT             28u
#define eTPU_CCCR_CCR_ENG2_CPR_WIDTH             2u
#define eTPU_CCCR_CCR_ENG2_CPR(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_CPR_SHIFT))&eTPU_CCCR_CCR_ENG2_CPR_MASK)
#define eTPU_CCCR_CCR_ENG2_DTRE_MASK             0x40000000u
#define eTPU_CCCR_CCR_ENG2_DTRE_SHIFT            30u
#define eTPU_CCCR_CCR_ENG2_DTRE_WIDTH            1u
#define eTPU_CCCR_CCR_ENG2_DTRE(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_DTRE_SHIFT))&eTPU_CCCR_CCR_ENG2_DTRE_MASK)
#define eTPU_CCCR_CCR_ENG2_CIE_MASK              0x80000000u
#define eTPU_CCCR_CCR_ENG2_CIE_SHIFT             31u
#define eTPU_CCCR_CCR_ENG2_CIE_WIDTH             1u
#define eTPU_CCCR_CCR_ENG2_CIE(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CCR_ENG2_CIE_SHIFT))&eTPU_CCCR_CCR_ENG2_CIE_MASK)
/* CSCR_ENG2 Bit Fields */
#define eTPU_CCCR_CSCR_ENG2_FM_MASK              0x3u
#define eTPU_CCCR_CSCR_ENG2_FM_SHIFT             0u
#define eTPU_CCCR_CSCR_ENG2_FM_WIDTH             2u
#define eTPU_CCCR_CSCR_ENG2_FM(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_FM_SHIFT))&eTPU_CCCR_CSCR_ENG2_FM_MASK)
#define eTPU_CCCR_CSCR_ENG2_OPS_MASK             0x4000u
#define eTPU_CCCR_CSCR_ENG2_OPS_SHIFT            14u
#define eTPU_CCCR_CSCR_ENG2_OPS_WIDTH            1u
#define eTPU_CCCR_CSCR_ENG2_OPS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_OPS_SHIFT))&eTPU_CCCR_CSCR_ENG2_OPS_MASK)
#define eTPU_CCCR_CSCR_ENG2_IPS_MASK             0x8000u
#define eTPU_CCCR_CSCR_ENG2_IPS_SHIFT            15u
#define eTPU_CCCR_CSCR_ENG2_IPS_WIDTH            1u
#define eTPU_CCCR_CSCR_ENG2_IPS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_IPS_SHIFT))&eTPU_CCCR_CSCR_ENG2_IPS_MASK)
#define eTPU_CCCR_CSCR_ENG2_DTROS_MASK           0x400000u
#define eTPU_CCCR_CSCR_ENG2_DTROS_SHIFT          22u
#define eTPU_CCCR_CSCR_ENG2_DTROS_WIDTH          1u
#define eTPU_CCCR_CSCR_ENG2_DTROS(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_DTROS_SHIFT))&eTPU_CCCR_CSCR_ENG2_DTROS_MASK)
#define eTPU_CCCR_CSCR_ENG2_DTRS_MASK            0x800000u
#define eTPU_CCCR_CSCR_ENG2_DTRS_SHIFT           23u
#define eTPU_CCCR_CSCR_ENG2_DTRS_WIDTH           1u
#define eTPU_CCCR_CSCR_ENG2_DTRS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_DTRS_SHIFT))&eTPU_CCCR_CSCR_ENG2_DTRS_MASK)
#define eTPU_CCCR_CSCR_ENG2_CIOS_MASK            0x40000000u
#define eTPU_CCCR_CSCR_ENG2_CIOS_SHIFT           30u
#define eTPU_CCCR_CSCR_ENG2_CIOS_WIDTH           1u
#define eTPU_CCCR_CSCR_ENG2_CIOS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_CIOS_SHIFT))&eTPU_CCCR_CSCR_ENG2_CIOS_MASK)
#define eTPU_CCCR_CSCR_ENG2_CIS_MASK             0x80000000u
#define eTPU_CCCR_CSCR_ENG2_CIS_SHIFT            31u
#define eTPU_CCCR_CSCR_ENG2_CIS_WIDTH            1u
#define eTPU_CCCR_CSCR_ENG2_CIS(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CSCR_ENG2_CIS_SHIFT))&eTPU_CCCR_CSCR_ENG2_CIS_MASK)
/* CHSRR_ENG2 Bit Fields */
#define eTPU_CCCR_CHSRR_ENG2_HSR_MASK            0x7u
#define eTPU_CCCR_CHSRR_ENG2_HSR_SHIFT           0u
#define eTPU_CCCR_CHSRR_ENG2_HSR_WIDTH           3u
#define eTPU_CCCR_CHSRR_ENG2_HSR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_CCCR_CHSRR_ENG2_HSR_SHIFT))&eTPU_CCCR_CHSRR_ENG2_HSR_MASK)

/*!
 * @}
 */ /* end of group eTPU_CCCR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_CCCR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_ER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_ER_Peripheral_Access_Layer eTPU_ER Peripheral Access Layer
 * @{
 */


/** eTPU_ER - Size of Registers Arrays */

/** eTPU_ER - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[96];
  __IO uint32_t WDTR_ENG1;                         /**< eTPU Watchdog Timer Register for Engine 1, offset: 0x60 */
       uint8_t RESERVED_1[4];
  __IO uint32_t IDLER_ENG1;                        /**< eTPU Idle Register for Engine 1, offset: 0x68 */
       uint8_t RESERVED_2[4];
  __IO uint32_t WDTR_ENG2;                         /**< eTPU Watchdog Timer Register for Engine 2, offset: 0x70 */
       uint8_t RESERVED_3[4];
  __IO uint32_t IDLER_ENG2;                        /**< eTPU Idle Register for Engine 2, offset: 0x78 */
} eTPU_ER_Type, *eTPU_ER_MemMapPtr;

 /** Number of instances of the eTPU_ER module. */
#define eTPU_ER_INSTANCE_COUNT                   (2u)


/* eTPU_ER - Peripheral instance base addresses */
/** Peripheral eTPU_ER_01 base address */
#define eTPU_ER_01_BASE                          (0xC3FC0000u)
/** Peripheral eTPU_ER_01 base pointer */
#define eTPU_ER_01                               ((eTPU_ER_Type *)eTPU_ER_01_BASE)
/** Peripheral eTPU_ER_2 base address */
#define eTPU_ER_2_BASE                           (0xFFE00000u)
/** Peripheral eTPU_ER_2 base pointer */
#define eTPU_ER_2                                ((eTPU_ER_Type *)eTPU_ER_2_BASE)
/** Array initializer of eTPU_ER peripheral base addresses */
#define eTPU_ER_BASE_ADDRS                       { eTPU_ER_01_BASE, eTPU_ER_2_BASE }
/** Array initializer of eTPU_ER peripheral base pointers */
#define eTPU_ER_BASE_PTRS                        { eTPU_ER_01, eTPU_ER_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_ER Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_ER_Register_Masks eTPU_ER Register Masks
 * @{
 */

/* WDTR_ENG1 Bit Fields */
#define eTPU_ER_WDTR_ENG1_WDCNT_MASK             0xFFFFu
#define eTPU_ER_WDTR_ENG1_WDCNT_SHIFT            0u
#define eTPU_ER_WDTR_ENG1_WDCNT_WIDTH            16u
#define eTPU_ER_WDTR_ENG1_WDCNT(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_ER_WDTR_ENG1_WDCNT_SHIFT))&eTPU_ER_WDTR_ENG1_WDCNT_MASK)
#define eTPU_ER_WDTR_ENG1_WMO_MASK               0x10000000u
#define eTPU_ER_WDTR_ENG1_WMO_SHIFT              28u
#define eTPU_ER_WDTR_ENG1_WMO_WIDTH              1u
#define eTPU_ER_WDTR_ENG1_WMO(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_ER_WDTR_ENG1_WMO_SHIFT))&eTPU_ER_WDTR_ENG1_WMO_MASK)
#define eTPU_ER_WDTR_ENG1_WDM_MASK               0xC0000000u
#define eTPU_ER_WDTR_ENG1_WDM_SHIFT              30u
#define eTPU_ER_WDTR_ENG1_WDM_WIDTH              2u
#define eTPU_ER_WDTR_ENG1_WDM(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_ER_WDTR_ENG1_WDM_SHIFT))&eTPU_ER_WDTR_ENG1_WDM_MASK)
/* IDLER_ENG1 Bit Fields */
#define eTPU_ER_IDLER_ENG1_ICLR_MASK             0x1u
#define eTPU_ER_IDLER_ENG1_ICLR_SHIFT            0u
#define eTPU_ER_IDLER_ENG1_ICLR_WIDTH            1u
#define eTPU_ER_IDLER_ENG1_ICLR(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_ER_IDLER_ENG1_ICLR_SHIFT))&eTPU_ER_IDLER_ENG1_ICLR_MASK)
#define eTPU_ER_IDLER_ENG1_IDLE_CNT_MASK         0xFFFFFFFEu
#define eTPU_ER_IDLER_ENG1_IDLE_CNT_SHIFT        1u
#define eTPU_ER_IDLER_ENG1_IDLE_CNT_WIDTH        31u
#define eTPU_ER_IDLER_ENG1_IDLE_CNT(x)           (((uint32_t)(((uint32_t)(x))<<eTPU_ER_IDLER_ENG1_IDLE_CNT_SHIFT))&eTPU_ER_IDLER_ENG1_IDLE_CNT_MASK)
/* WDTR_ENG2 Bit Fields */
#define eTPU_ER_WDTR_ENG2_WDCNT_MASK             0xFFFFu
#define eTPU_ER_WDTR_ENG2_WDCNT_SHIFT            0u
#define eTPU_ER_WDTR_ENG2_WDCNT_WIDTH            16u
#define eTPU_ER_WDTR_ENG2_WDCNT(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_ER_WDTR_ENG2_WDCNT_SHIFT))&eTPU_ER_WDTR_ENG2_WDCNT_MASK)
#define eTPU_ER_WDTR_ENG2_WMO_MASK               0x10000000u
#define eTPU_ER_WDTR_ENG2_WMO_SHIFT              28u
#define eTPU_ER_WDTR_ENG2_WMO_WIDTH              1u
#define eTPU_ER_WDTR_ENG2_WMO(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_ER_WDTR_ENG2_WMO_SHIFT))&eTPU_ER_WDTR_ENG2_WMO_MASK)
#define eTPU_ER_WDTR_ENG2_WDM_MASK               0xC0000000u
#define eTPU_ER_WDTR_ENG2_WDM_SHIFT              30u
#define eTPU_ER_WDTR_ENG2_WDM_WIDTH              2u
#define eTPU_ER_WDTR_ENG2_WDM(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_ER_WDTR_ENG2_WDM_SHIFT))&eTPU_ER_WDTR_ENG2_WDM_MASK)
/* IDLER_ENG2 Bit Fields */
#define eTPU_ER_IDLER_ENG2_ICLR_MASK             0x1u
#define eTPU_ER_IDLER_ENG2_ICLR_SHIFT            0u
#define eTPU_ER_IDLER_ENG2_ICLR_WIDTH            1u
#define eTPU_ER_IDLER_ENG2_ICLR(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_ER_IDLER_ENG2_ICLR_SHIFT))&eTPU_ER_IDLER_ENG2_ICLR_MASK)
#define eTPU_ER_IDLER_ENG2_IDLE_CNT_MASK         0xFFFFFFFEu
#define eTPU_ER_IDLER_ENG2_IDLE_CNT_SHIFT        1u
#define eTPU_ER_IDLER_ENG2_IDLE_CNT_WIDTH        31u
#define eTPU_ER_IDLER_ENG2_IDLE_CNT(x)           (((uint32_t)(((uint32_t)(x))<<eTPU_ER_IDLER_ENG2_IDLE_CNT_SHIFT))&eTPU_ER_IDLER_ENG2_IDLE_CNT_MASK)

/*!
 * @}
 */ /* end of group eTPU_ER_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_ER_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_GCR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_GCR_Peripheral_Access_Layer eTPU_GCR Peripheral Access Layer
 * @{
 */


