neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** eTPU_GCR - Size of Registers Arrays */

/** eTPU_GCR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[512];
  __IO uint32_t CISR_ENG1;                         /**< eTPU Channel Interrupt Status Register for Engine 1, offset: 0x200 */
  __IO uint32_t CISR_ENG2;                         /**< eTPU Channel Interrupt Status Register for Engine 2, offset: 0x204 */
       uint8_t RESERVED_1[8];
  __IO uint32_t CDTRSR_ENG1;                       /**< eTPU Channel Data Transfer Request Status Register for Engine 1, offset: 0x210 */
  __IO uint32_t CDTRSR_ENG2;                       /**< eTPU Channel Data Transfer Request Status Register for Engine 2, offset: 0x214 */
       uint8_t RESERVED_2[8];
  __IO uint32_t CIOSR_ENG1;                        /**< eTPU Channel Interrupt Overflow Status Register for Engine 1, offset: 0x220 */
  __IO uint32_t CIOSR_ENG2;                        /**< eTPU Channel Interrupt Overflow Status Register for Engine 2, offset: 0x224 */
       uint8_t RESERVED_3[8];
  __IO uint32_t CDTROSR_ENG1;                      /**< eTPU Channel Data Transfer Request Overflow Status Register for Engine 1, offset: 0x230 */
  __IO uint32_t CDTROSR_ENG2;                      /**< eTPU Channel Data Transfer Request Overflow Status Register for Engine 2, offset: 0x234 */
       uint8_t RESERVED_4[8];
  __IO uint32_t CIER_ENG1;                         /**< eTPU Channel Interrupt Enable Register for Engine 1, offset: 0x240 */
  __IO uint32_t CIER_ENG2;                         /**< eTPU Channel Interrupt Enable Register for Engine 2, offset: 0x244 */
       uint8_t RESERVED_5[8];
  __IO uint32_t CDTRER_ENG1;                       /**< eTPU Channel Data Transfer Request Enable Register for Engine 1, offset: 0x250 */
  __IO uint32_t CDTRER_ENG2;                       /**< eTPU Channel Data Transfer Request Enable Register for Engine 2, offset: 0x254 */
       uint8_t RESERVED_6[8];
  __IO uint32_t WDSR_ENG1;                         /**< eTPU Watchdog Status Register for Engine 1, offset: 0x260 */
  __IO uint32_t WDSR_ENG2;                         /**< eTPU Watchdog Status Register for Engine 2, offset: 0x264 */
       uint8_t RESERVED_7[24];
  __I  uint32_t CPSSR_ENG1;                        /**< eTPU Channel Pending Service Status Register for Engine 1, offset: 0x280 */
  __I  uint32_t CPSSR_ENG2;                        /**< eTPU Channel Pending Service Status Register for Engine 2, offset: 0x284 */
       uint8_t RESERVED_8[8];
  __I  uint32_t CSSR_ENG1;                         /**< eTPU Channel Service Status Register for Engine 1, offset: 0x290 */
  __I  uint32_t CSSR_ENG2;                         /**< eTPU Channel Service Status Register for Engine 2, offset: 0x294 */
} eTPU_GCR_Type, *eTPU_GCR_MemMapPtr;

 /** Number of instances of the eTPU_GCR module. */
#define eTPU_GCR_INSTANCE_COUNT                  (2u)


/* eTPU_GCR - Peripheral instance base addresses */
/** Peripheral eTPU_GCR_01 base address */
#define eTPU_GCR_01_BASE                         (0xC3FC0000u)
/** Peripheral eTPU_GCR_01 base pointer */
#define eTPU_GCR_01                              ((eTPU_GCR_Type *)eTPU_GCR_01_BASE)
/** Peripheral eTPU_GCR_2 base address */
#define eTPU_GCR_2_BASE                          (0xFFE00000u)
/** Peripheral eTPU_GCR_2 base pointer */
#define eTPU_GCR_2                               ((eTPU_GCR_Type *)eTPU_GCR_2_BASE)
/** Array initializer of eTPU_GCR peripheral base addresses */
#define eTPU_GCR_BASE_ADDRS                      { eTPU_GCR_01_BASE, eTPU_GCR_2_BASE }
/** Array initializer of eTPU_GCR peripheral base pointers */
#define eTPU_GCR_BASE_PTRS                       { eTPU_GCR_01, eTPU_GCR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_GCR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_GCR_Register_Masks eTPU_GCR Register Masks
 * @{
 */

/* CISR_ENG1 Bit Fields */
#define eTPU_GCR_CISR_ENG1_CISn_MASK             0xFFFFFFFFu
#define eTPU_GCR_CISR_ENG1_CISn_SHIFT            0u
#define eTPU_GCR_CISR_ENG1_CISn_WIDTH            32u
#define eTPU_GCR_CISR_ENG1_CISn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CISR_ENG1_CISn_SHIFT))&eTPU_GCR_CISR_ENG1_CISn_MASK)
/* CISR_ENG2 Bit Fields */
#define eTPU_GCR_CISR_ENG2_CISn_MASK             0xFFFFFFFFu
#define eTPU_GCR_CISR_ENG2_CISn_SHIFT            0u
#define eTPU_GCR_CISR_ENG2_CISn_WIDTH            32u
#define eTPU_GCR_CISR_ENG2_CISn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CISR_ENG2_CISn_SHIFT))&eTPU_GCR_CISR_ENG2_CISn_MASK)
/* CDTRSR_ENG1 Bit Fields */
#define eTPU_GCR_CDTRSR_ENG1_DTRSn_MASK          0xFFFFFFFFu
#define eTPU_GCR_CDTRSR_ENG1_DTRSn_SHIFT         0u
#define eTPU_GCR_CDTRSR_ENG1_DTRSn_WIDTH         32u
#define eTPU_GCR_CDTRSR_ENG1_DTRSn(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CDTRSR_ENG1_DTRSn_SHIFT))&eTPU_GCR_CDTRSR_ENG1_DTRSn_MASK)
/* CDTRSR_ENG2 Bit Fields */
#define eTPU_GCR_CDTRSR_ENG2_DTRSn_MASK          0xFFFFFFFFu
#define eTPU_GCR_CDTRSR_ENG2_DTRSn_SHIFT         0u
#define eTPU_GCR_CDTRSR_ENG2_DTRSn_WIDTH         32u
#define eTPU_GCR_CDTRSR_ENG2_DTRSn(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CDTRSR_ENG2_DTRSn_SHIFT))&eTPU_GCR_CDTRSR_ENG2_DTRSn_MASK)
/* CIOSR_ENG1 Bit Fields */
#define eTPU_GCR_CIOSR_ENG1_CIOSn_MASK           0xFFFFFFFFu
#define eTPU_GCR_CIOSR_ENG1_CIOSn_SHIFT          0u
#define eTPU_GCR_CIOSR_ENG1_CIOSn_WIDTH          32u
#define eTPU_GCR_CIOSR_ENG1_CIOSn(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CIOSR_ENG1_CIOSn_SHIFT))&eTPU_GCR_CIOSR_ENG1_CIOSn_MASK)
/* CIOSR_ENG2 Bit Fields */
#define eTPU_GCR_CIOSR_ENG2_CIOSn_MASK           0xFFFFFFFFu
#define eTPU_GCR_CIOSR_ENG2_CIOSn_SHIFT          0u
#define eTPU_GCR_CIOSR_ENG2_CIOSn_WIDTH          32u
#define eTPU_GCR_CIOSR_ENG2_CIOSn(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CIOSR_ENG2_CIOSn_SHIFT))&eTPU_GCR_CIOSR_ENG2_CIOSn_MASK)
/* CDTROSR_ENG1 Bit Fields */
#define eTPU_GCR_CDTROSR_ENG1_DTROSn_MASK        0xFFFFFFFFu
#define eTPU_GCR_CDTROSR_ENG1_DTROSn_SHIFT       0u
#define eTPU_GCR_CDTROSR_ENG1_DTROSn_WIDTH       32u
#define eTPU_GCR_CDTROSR_ENG1_DTROSn(x)          (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CDTROSR_ENG1_DTROSn_SHIFT))&eTPU_GCR_CDTROSR_ENG1_DTROSn_MASK)
/* CDTROSR_ENG2 Bit Fields */
#define eTPU_GCR_CDTROSR_ENG2_DTROSn_MASK        0xFFFFFFFFu
#define eTPU_GCR_CDTROSR_ENG2_DTROSn_SHIFT       0u
#define eTPU_GCR_CDTROSR_ENG2_DTROSn_WIDTH       32u
#define eTPU_GCR_CDTROSR_ENG2_DTROSn(x)          (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CDTROSR_ENG2_DTROSn_SHIFT))&eTPU_GCR_CDTROSR_ENG2_DTROSn_MASK)
/* CIER_ENG1 Bit Fields */
#define eTPU_GCR_CIER_ENG1_CIEn_MASK             0xFFFFFFFFu
#define eTPU_GCR_CIER_ENG1_CIEn_SHIFT            0u
#define eTPU_GCR_CIER_ENG1_CIEn_WIDTH            32u
#define eTPU_GCR_CIER_ENG1_CIEn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CIER_ENG1_CIEn_SHIFT))&eTPU_GCR_CIER_ENG1_CIEn_MASK)
/* CIER_ENG2 Bit Fields */
#define eTPU_GCR_CIER_ENG2_CIEn_MASK             0xFFFFFFFFu
#define eTPU_GCR_CIER_ENG2_CIEn_SHIFT            0u
#define eTPU_GCR_CIER_ENG2_CIEn_WIDTH            32u
#define eTPU_GCR_CIER_ENG2_CIEn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CIER_ENG2_CIEn_SHIFT))&eTPU_GCR_CIER_ENG2_CIEn_MASK)
/* CDTRER_ENG1 Bit Fields */
#define eTPU_GCR_CDTRER_ENG1_DTREn_MASK          0xFFFFFFFFu
#define eTPU_GCR_CDTRER_ENG1_DTREn_SHIFT         0u
#define eTPU_GCR_CDTRER_ENG1_DTREn_WIDTH         32u
#define eTPU_GCR_CDTRER_ENG1_DTREn(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CDTRER_ENG1_DTREn_SHIFT))&eTPU_GCR_CDTRER_ENG1_DTREn_MASK)
/* CDTRER_ENG2 Bit Fields */
#define eTPU_GCR_CDTRER_ENG2_DTREn_MASK          0xFFFFFFFFu
#define eTPU_GCR_CDTRER_ENG2_DTREn_SHIFT         0u
#define eTPU_GCR_CDTRER_ENG2_DTREn_WIDTH         32u
#define eTPU_GCR_CDTRER_ENG2_DTREn(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CDTRER_ENG2_DTREn_SHIFT))&eTPU_GCR_CDTRER_ENG2_DTREn_MASK)
/* WDSR_ENG1 Bit Fields */
#define eTPU_GCR_WDSR_ENG1_WDSn_MASK             0xFFFFFFFFu
#define eTPU_GCR_WDSR_ENG1_WDSn_SHIFT            0u
#define eTPU_GCR_WDSR_ENG1_WDSn_WIDTH            32u
#define eTPU_GCR_WDSR_ENG1_WDSn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_WDSR_ENG1_WDSn_SHIFT))&eTPU_GCR_WDSR_ENG1_WDSn_MASK)
/* WDSR_ENG2 Bit Fields */
#define eTPU_GCR_WDSR_ENG2_WDSn_MASK             0xFFFFFFFFu
#define eTPU_GCR_WDSR_ENG2_WDSn_SHIFT            0u
#define eTPU_GCR_WDSR_ENG2_WDSn_WIDTH            32u
#define eTPU_GCR_WDSR_ENG2_WDSn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_WDSR_ENG2_WDSn_SHIFT))&eTPU_GCR_WDSR_ENG2_WDSn_MASK)
/* CPSSR_ENG1 Bit Fields */
#define eTPU_GCR_CPSSR_ENG1_SRn_MASK             0xFFFFFFFFu
#define eTPU_GCR_CPSSR_ENG1_SRn_SHIFT            0u
#define eTPU_GCR_CPSSR_ENG1_SRn_WIDTH            32u
#define eTPU_GCR_CPSSR_ENG1_SRn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CPSSR_ENG1_SRn_SHIFT))&eTPU_GCR_CPSSR_ENG1_SRn_MASK)
/* CPSSR_ENG2 Bit Fields */
#define eTPU_GCR_CPSSR_ENG2_SRn_MASK             0xFFFFFFFFu
#define eTPU_GCR_CPSSR_ENG2_SRn_SHIFT            0u
#define eTPU_GCR_CPSSR_ENG2_SRn_WIDTH            32u
#define eTPU_GCR_CPSSR_ENG2_SRn(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CPSSR_ENG2_SRn_SHIFT))&eTPU_GCR_CPSSR_ENG2_SRn_MASK)
/* CSSR_ENG1 Bit Fields */
#define eTPU_GCR_CSSR_ENG1_SSn_MASK              0xFFFFFFFFu
#define eTPU_GCR_CSSR_ENG1_SSn_SHIFT             0u
#define eTPU_GCR_CSSR_ENG1_SSn_WIDTH             32u
#define eTPU_GCR_CSSR_ENG1_SSn(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CSSR_ENG1_SSn_SHIFT))&eTPU_GCR_CSSR_ENG1_SSn_MASK)
/* CSSR_ENG2 Bit Fields */
#define eTPU_GCR_CSSR_ENG2_SSn_MASK              0xFFFFFFFFu
#define eTPU_GCR_CSSR_ENG2_SSn_SHIFT             0u
#define eTPU_GCR_CSSR_ENG2_SSn_WIDTH             32u
#define eTPU_GCR_CSSR_ENG2_SSn(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_GCR_CSSR_ENG2_SSn_SHIFT))&eTPU_GCR_CSSR_ENG2_SSn_MASK)

/*!
 * @}
 */ /* end of group eTPU_GCR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_GCR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_LMR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_LMR_Peripheral_Access_Layer eTPU_LMR Peripheral Access Layer
 * @{
 */


/** eTPU_LMR - Size of Registers Arrays */
#define eTPU_LMR_LMR1_COUNT                      6u
#define eTPU_LMR_LMR2_COUNT                      6u

/** eTPU_LMR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[128];
  struct {                                         /* offset: 0x80, array step: 0x8 */
    __IO uint32_t LMCR_ENG1;                         /**< eTPU Latency Monitor Configuration Register for Engine 1, array offset: 0x80, array step: 0x8 */
    __IO uint32_t LMMR_ENG1;                         /**< eTPU Latency Monitor Measure Register for Engine 1, array offset: 0x84, array step: 0x8 */
  } LMR1[eTPU_LMR_LMR1_COUNT];
       uint8_t RESERVED_1[16];
  struct {                                         /* offset: 0xC0, array step: 0x8 */
    __IO uint32_t LMCR_ENG2;                         /**< eTPU Latency Monitor Configuration Register for Engine 2, array offset: 0xC0, array step: 0x8 */
    __IO uint32_t LMMR_ENG2;                         /**< eTPU Latency Monitor Measure Register for Engine 2, array offset: 0xC4, array step: 0x8 */
  } LMR2[eTPU_LMR_LMR2_COUNT];
} eTPU_LMR_Type, *eTPU_LMR_MemMapPtr;

 /** Number of instances of the eTPU_LMR module. */
#define eTPU_LMR_INSTANCE_COUNT                  (2u)


