neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* eTPU_LMR - Peripheral instance base addresses */
/** Peripheral eTPU_LMR_01 base address */
#define eTPU_LMR_01_BASE                         (0xC3FC0000u)
/** Peripheral eTPU_LMR_01 base pointer */
#define eTPU_LMR_01                              ((eTPU_LMR_Type *)eTPU_LMR_01_BASE)
/** Peripheral eTPU_LMR_2 base address */
#define eTPU_LMR_2_BASE                          (0xFFE00000u)
/** Peripheral eTPU_LMR_2 base pointer */
#define eTPU_LMR_2                               ((eTPU_LMR_Type *)eTPU_LMR_2_BASE)
/** Array initializer of eTPU_LMR peripheral base addresses */
#define eTPU_LMR_BASE_ADDRS                      { eTPU_LMR_01_BASE, eTPU_LMR_2_BASE }
/** Array initializer of eTPU_LMR peripheral base pointers */
#define eTPU_LMR_BASE_PTRS                       { eTPU_LMR_01, eTPU_LMR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_LMR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_LMR_Register_Masks eTPU_LMR Register Masks
 * @{
 */

/* LMCR_ENG1 Bit Fields */
#define eTPU_LMR_LMCR_ENG1_MAXLAT_MASK           0xFFFFu
#define eTPU_LMR_LMCR_ENG1_MAXLAT_SHIFT          0u
#define eTPU_LMR_LMCR_ENG1_MAXLAT_WIDTH          16u
#define eTPU_LMR_LMCR_ENG1_MAXLAT(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG1_MAXLAT_SHIFT))&eTPU_LMR_LMCR_ENG1_MAXLAT_MASK)
#define eTPU_LMR_LMCR_ENG1_MONCHAN_MASK          0x1F0000u
#define eTPU_LMR_LMCR_ENG1_MONCHAN_SHIFT         16u
#define eTPU_LMR_LMCR_ENG1_MONCHAN_WIDTH         5u
#define eTPU_LMR_LMCR_ENG1_MONCHAN(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG1_MONCHAN_SHIFT))&eTPU_LMR_LMCR_ENG1_MONCHAN_MASK)
#define eTPU_LMR_LMCR_ENG1_SRSEL_MASK            0x7000000u
#define eTPU_LMR_LMCR_ENG1_SRSEL_SHIFT           24u
#define eTPU_LMR_LMCR_ENG1_SRSEL_WIDTH           3u
#define eTPU_LMR_LMCR_ENG1_SRSEL(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG1_SRSEL_SHIFT))&eTPU_LMR_LMCR_ENG1_SRSEL_MASK)
#define eTPU_LMR_LMCR_ENG1_LMM_MASK              0xC0000000u
#define eTPU_LMR_LMCR_ENG1_LMM_SHIFT             30u
#define eTPU_LMR_LMCR_ENG1_LMM_WIDTH             2u
#define eTPU_LMR_LMCR_ENG1_LMM(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG1_LMM_SHIFT))&eTPU_LMR_LMCR_ENG1_LMM_MASK)
/* LMMR_ENG1 Bit Fields */
#define eTPU_LMR_LMMR_ENG1_LTC_MASK              0x1u
#define eTPU_LMR_LMMR_ENG1_LTC_SHIFT             0u
#define eTPU_LMR_LMMR_ENG1_LTC_WIDTH             1u
#define eTPU_LMR_LMMR_ENG1_LTC(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMMR_ENG1_LTC_SHIFT))&eTPU_LMR_LMMR_ENG1_LTC_MASK)
#define eTPU_LMR_LMMR_ENG1_LATENCY_MASK          0xFFFEu
#define eTPU_LMR_LMMR_ENG1_LATENCY_SHIFT         1u
#define eTPU_LMR_LMMR_ENG1_LATENCY_WIDTH         15u
#define eTPU_LMR_LMMR_ENG1_LATENCY(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMMR_ENG1_LATENCY_SHIFT))&eTPU_LMR_LMMR_ENG1_LATENCY_MASK)
/* LMCR_ENG2 Bit Fields */
#define eTPU_LMR_LMCR_ENG2_MAXLAT_MASK           0xFFFFu
#define eTPU_LMR_LMCR_ENG2_MAXLAT_SHIFT          0u
#define eTPU_LMR_LMCR_ENG2_MAXLAT_WIDTH          16u
#define eTPU_LMR_LMCR_ENG2_MAXLAT(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG2_MAXLAT_SHIFT))&eTPU_LMR_LMCR_ENG2_MAXLAT_MASK)
#define eTPU_LMR_LMCR_ENG2_MONCHAN_MASK          0x1F0000u
#define eTPU_LMR_LMCR_ENG2_MONCHAN_SHIFT         16u
#define eTPU_LMR_LMCR_ENG2_MONCHAN_WIDTH         5u
#define eTPU_LMR_LMCR_ENG2_MONCHAN(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG2_MONCHAN_SHIFT))&eTPU_LMR_LMCR_ENG2_MONCHAN_MASK)
#define eTPU_LMR_LMCR_ENG2_SRSEL_MASK            0x7000000u
#define eTPU_LMR_LMCR_ENG2_SRSEL_SHIFT           24u
#define eTPU_LMR_LMCR_ENG2_SRSEL_WIDTH           3u
#define eTPU_LMR_LMCR_ENG2_SRSEL(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG2_SRSEL_SHIFT))&eTPU_LMR_LMCR_ENG2_SRSEL_MASK)
#define eTPU_LMR_LMCR_ENG2_LMM_MASK              0xC0000000u
#define eTPU_LMR_LMCR_ENG2_LMM_SHIFT             30u
#define eTPU_LMR_LMCR_ENG2_LMM_WIDTH             2u
#define eTPU_LMR_LMCR_ENG2_LMM(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMCR_ENG2_LMM_SHIFT))&eTPU_LMR_LMCR_ENG2_LMM_MASK)
/* LMMR_ENG2 Bit Fields */
#define eTPU_LMR_LMMR_ENG2_LTC_MASK              0x1u
#define eTPU_LMR_LMMR_ENG2_LTC_SHIFT             0u
#define eTPU_LMR_LMMR_ENG2_LTC_WIDTH             1u
#define eTPU_LMR_LMMR_ENG2_LTC(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMMR_ENG2_LTC_SHIFT))&eTPU_LMR_LMMR_ENG2_LTC_MASK)
#define eTPU_LMR_LMMR_ENG2_LATENCY_MASK          0xFFFEu
#define eTPU_LMR_LMMR_ENG2_LATENCY_SHIFT         1u
#define eTPU_LMR_LMMR_ENG2_LATENCY_WIDTH         15u
#define eTPU_LMR_LMMR_ENG2_LATENCY(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_LMR_LMMR_ENG2_LATENCY_SHIFT))&eTPU_LMR_LMMR_ENG2_LATENCY_MASK)

/*!
 * @}
 */ /* end of group eTPU_LMR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_LMR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_MESR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_MESR_Peripheral_Access_Layer eTPU_MESR Peripheral Access Layer
 * @{
 */


/** eTPU_MESR - Size of Registers Arrays */

/** eTPU_MESR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[256];
  __IO uint32_t MECR;                              /**< eTPU Memory Error Control Register, offset: 0x100 */
  __IO uint32_t DEIAR;                             /**< eTPU Data Error Injection Address Register, offset: 0x104 */
  __IO uint32_t DEIDPR;                            /**< eTPU Data Error Injection Data Pattern Register, offset: 0x108 */
  __IO uint32_t DEIPPR;                            /**< eTPU Data Error Injection Parity Pattern Register, offset: 0x10C */
  __I  uint32_t DERAR;                             /**< eTPU Data Error Report Address Register, offset: 0x110 */
  __I  uint32_t DERDR;                             /**< eTPU Data Error Report Data Register, offset: 0x114 */
  __I  uint32_t DERSR;                             /**< eTPU Data Error Report Syndrome Register, offset: 0x118 */
       uint8_t RESERVED_1[4];
  __IO uint32_t MESR;                              /**< eTPU Memory Error Status Register, offset: 0x120 */
  __IO uint32_t CEIAR;                             /**< eTPU Code Error Injection Address Register, offset: 0x124 */
  __IO uint32_t CEIDPR;                            /**< eTPU Code Error Injection Data Pattern Register, offset: 0x128 */
  __IO uint32_t CEIPPR;                            /**< eTPU Code Error Injection Parity Pattern Register, offset: 0x12C */
  __I  uint32_t CERAR;                             /**< eTPU Code Error Report Address Register, offset: 0x130 */
  __I  uint32_t CERDR;                             /**< eTPU Code Error Report Data Register, offset: 0x134 */
  __I  uint32_t CERSR;                             /**< eTPU Code Error Report Syndrome Register, offset: 0x138 */
  __IO uint32_t CEFR;                              /**< eTPU Code Error Fix Register, offset: 0x13C */
} eTPU_MESR_Type, *eTPU_MESR_MemMapPtr;

