neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
 /** Number of instances of the eTPU_MESR module. */
#define eTPU_MESR_INSTANCE_COUNT                 (2u)


/* eTPU_MESR - Peripheral instance base addresses */
/** Peripheral eTPU_MESR_01 base address */
#define eTPU_MESR_01_BASE                        (0xC3FC0000u)
/** Peripheral eTPU_MESR_01 base pointer */
#define eTPU_MESR_01                             ((eTPU_MESR_Type *)eTPU_MESR_01_BASE)
/** Peripheral eTPU_MESR_2 base address */
#define eTPU_MESR_2_BASE                         (0xFFE00000u)
/** Peripheral eTPU_MESR_2 base pointer */
#define eTPU_MESR_2                              ((eTPU_MESR_Type *)eTPU_MESR_2_BASE)
/** Array initializer of eTPU_MESR peripheral base addresses */
#define eTPU_MESR_BASE_ADDRS                     { eTPU_MESR_01_BASE, eTPU_MESR_2_BASE }
/** Array initializer of eTPU_MESR peripheral base pointers */
#define eTPU_MESR_BASE_PTRS                      { eTPU_MESR_01, eTPU_MESR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_MESR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_MESR_Register_Masks eTPU_MESR Register Masks
 * @{
 */

/* MECR Bit Fields */
#define eTPU_MESR_MECR_CEDD_MASK                 0x1u
#define eTPU_MESR_MECR_CEDD_SHIFT                0u
#define eTPU_MESR_MECR_CEDD_WIDTH                1u
#define eTPU_MESR_MECR_CEDD(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_CEDD_SHIFT))&eTPU_MESR_MECR_CEDD_MASK)
#define eTPU_MESR_MECR_CRDIS_MASK                0x2u
#define eTPU_MESR_MECR_CRDIS_SHIFT               1u
#define eTPU_MESR_MECR_CRDIS_WIDTH               1u
#define eTPU_MESR_MECR_CRDIS(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_CRDIS_SHIFT))&eTPU_MESR_MECR_CRDIS_MASK)
#define eTPU_MESR_MECR_CTEND_MASK                0x4u
#define eTPU_MESR_MECR_CTEND_SHIFT               2u
#define eTPU_MESR_MECR_CTEND_WIDTH               1u
#define eTPU_MESR_MECR_CTEND(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_CTEND_SHIFT))&eTPU_MESR_MECR_CTEND_MASK)
#define eTPU_MESR_MECR_CEIE_MASK                 0x80u
#define eTPU_MESR_MECR_CEIE_SHIFT                7u
#define eTPU_MESR_MECR_CEIE_WIDTH                1u
#define eTPU_MESR_MECR_CEIE(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_CEIE_SHIFT))&eTPU_MESR_MECR_CEIE_MASK)
#define eTPU_MESR_MECR_DEDD_MASK                 0x100u
#define eTPU_MESR_MECR_DEDD_SHIFT                8u
#define eTPU_MESR_MECR_DEDD_WIDTH                1u
#define eTPU_MESR_MECR_DEDD(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_DEDD_SHIFT))&eTPU_MESR_MECR_DEDD_MASK)
#define eTPU_MESR_MECR_DRDIS_MASK                0x200u
#define eTPU_MESR_MECR_DRDIS_SHIFT               9u
#define eTPU_MESR_MECR_DRDIS_WIDTH               1u
#define eTPU_MESR_MECR_DRDIS(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_DRDIS_SHIFT))&eTPU_MESR_MECR_DRDIS_MASK)
#define eTPU_MESR_MECR_DTEND_MASK                0x400u
#define eTPU_MESR_MECR_DTEND_SHIFT               10u
#define eTPU_MESR_MECR_DTEND_WIDTH               1u
#define eTPU_MESR_MECR_DTEND(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_DTEND_SHIFT))&eTPU_MESR_MECR_DTEND_MASK)
#define eTPU_MESR_MECR_MDEIE_MASK                0x4000u
#define eTPU_MESR_MECR_MDEIE_SHIFT               14u
#define eTPU_MESR_MECR_MDEIE_WIDTH               1u
#define eTPU_MESR_MECR_MDEIE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_MDEIE_SHIFT))&eTPU_MESR_MECR_MDEIE_MASK)
#define eTPU_MESR_MECR_HDEIE_MASK                0x8000u
#define eTPU_MESR_MECR_HDEIE_SHIFT               15u
#define eTPU_MESR_MECR_HDEIE_WIDTH               1u
#define eTPU_MESR_MECR_HDEIE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_HDEIE_SHIFT))&eTPU_MESR_MECR_HDEIE_MASK)
#define eTPU_MESR_MECR_MECIE_MASK                0x10000u
#define eTPU_MESR_MECR_MECIE_SHIFT               16u
#define eTPU_MESR_MECR_MECIE_WIDTH               1u
#define eTPU_MESR_MECR_MECIE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_MECIE_SHIFT))&eTPU_MESR_MECR_MECIE_MASK)
#define eTPU_MESR_MECR_FME_MASK                  0x80000000u
#define eTPU_MESR_MECR_FME_SHIFT                 31u
#define eTPU_MESR_MECR_FME_WIDTH                 1u
#define eTPU_MESR_MECR_FME(x)                    (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MECR_FME_SHIFT))&eTPU_MESR_MECR_FME_MASK)
/* DEIAR Bit Fields */
#define eTPU_MESR_DEIAR_INJ_ADDR_MASK            0x3FFCu
#define eTPU_MESR_DEIAR_INJ_ADDR_SHIFT           2u
#define eTPU_MESR_DEIAR_INJ_ADDR_WIDTH           12u
#define eTPU_MESR_DEIAR_INJ_ADDR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DEIAR_INJ_ADDR_SHIFT))&eTPU_MESR_DEIAR_INJ_ADDR_MASK)
/* DEIDPR Bit Fields */
#define eTPU_MESR_DEIDPR_DFLIP_MASK              0xFFFFFFFFu
#define eTPU_MESR_DEIDPR_DFLIP_SHIFT             0u
#define eTPU_MESR_DEIDPR_DFLIP_WIDTH             32u
#define eTPU_MESR_DEIDPR_DFLIP(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DEIDPR_DFLIP_SHIFT))&eTPU_MESR_DEIDPR_DFLIP_MASK)
/* DEIPPR Bit Fields */
#define eTPU_MESR_DEIPPR_PFLIP_4_0_MASK          0x1Fu
#define eTPU_MESR_DEIPPR_PFLIP_4_0_SHIFT         0u
#define eTPU_MESR_DEIPPR_PFLIP_4_0_WIDTH         5u
#define eTPU_MESR_DEIPPR_PFLIP_4_0(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DEIPPR_PFLIP_4_0_SHIFT))&eTPU_MESR_DEIPPR_PFLIP_4_0_MASK)
#define eTPU_MESR_DEIPPR_PFLIP_9_5_MASK          0x1F00u
#define eTPU_MESR_DEIPPR_PFLIP_9_5_SHIFT         8u
#define eTPU_MESR_DEIPPR_PFLIP_9_5_WIDTH         5u
#define eTPU_MESR_DEIPPR_PFLIP_9_5(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DEIPPR_PFLIP_9_5_SHIFT))&eTPU_MESR_DEIPPR_PFLIP_9_5_MASK)
#define eTPU_MESR_DEIPPR_PFLIP_14_10_MASK        0x1F0000u
#define eTPU_MESR_DEIPPR_PFLIP_14_10_SHIFT       16u
#define eTPU_MESR_DEIPPR_PFLIP_14_10_WIDTH       5u
#define eTPU_MESR_DEIPPR_PFLIP_14_10(x)          (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DEIPPR_PFLIP_14_10_SHIFT))&eTPU_MESR_DEIPPR_PFLIP_14_10_MASK)
#define eTPU_MESR_DEIPPR_PFLIP_19_15_MASK        0x1F000000u
#define eTPU_MESR_DEIPPR_PFLIP_19_15_SHIFT       24u
#define eTPU_MESR_DEIPPR_PFLIP_19_15_WIDTH       5u
#define eTPU_MESR_DEIPPR_PFLIP_19_15(x)          (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DEIPPR_PFLIP_19_15_SHIFT))&eTPU_MESR_DEIPPR_PFLIP_19_15_MASK)
/* DERAR Bit Fields */
#define eTPU_MESR_DERAR_ERR_ADDR_MASK            0x3FFCu
#define eTPU_MESR_DERAR_ERR_ADDR_SHIFT           2u
#define eTPU_MESR_DERAR_ERR_ADDR_WIDTH           12u
#define eTPU_MESR_DERAR_ERR_ADDR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERAR_ERR_ADDR_SHIFT))&eTPU_MESR_DERAR_ERR_ADDR_MASK)
#define eTPU_MESR_DERAR_ERR_CHANNEL_MASK         0x1F000000u
#define eTPU_MESR_DERAR_ERR_CHANNEL_SHIFT        24u
#define eTPU_MESR_DERAR_ERR_CHANNEL_WIDTH        5u
#define eTPU_MESR_DERAR_ERR_CHANNEL(x)           (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERAR_ERR_CHANNEL_SHIFT))&eTPU_MESR_DERAR_ERR_CHANNEL_MASK)
#define eTPU_MESR_DERAR_ERR_ACC_MASK             0xC0000000u
#define eTPU_MESR_DERAR_ERR_ACC_SHIFT            30u
#define eTPU_MESR_DERAR_ERR_ACC_WIDTH            2u
#define eTPU_MESR_DERAR_ERR_ACC(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERAR_ERR_ACC_SHIFT))&eTPU_MESR_DERAR_ERR_ACC_MASK)
/* DERDR Bit Fields */
#define eTPU_MESR_DERDR_DATA_MASK                0xFFFFFFFFu
#define eTPU_MESR_DERDR_DATA_SHIFT               0u
#define eTPU_MESR_DERDR_DATA_WIDTH               32u
#define eTPU_MESR_DERDR_DATA(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERDR_DATA_SHIFT))&eTPU_MESR_DERDR_DATA_MASK)
/* DERSR Bit Fields */
#define eTPU_MESR_DERSR_SYND0_MASK               0x1Fu
#define eTPU_MESR_DERSR_SYND0_SHIFT              0u
#define eTPU_MESR_DERSR_SYND0_WIDTH              5u
#define eTPU_MESR_DERSR_SYND0(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_SYND0_SHIFT))&eTPU_MESR_DERSR_SYND0_MASK)
#define eTPU_MESR_DERSR_BE0_MASK                 0x80u
#define eTPU_MESR_DERSR_BE0_SHIFT                7u
#define eTPU_MESR_DERSR_BE0_WIDTH                1u
#define eTPU_MESR_DERSR_BE0(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_BE0_SHIFT))&eTPU_MESR_DERSR_BE0_MASK)
#define eTPU_MESR_DERSR_SYND1_MASK               0x1F00u
#define eTPU_MESR_DERSR_SYND1_SHIFT              8u
#define eTPU_MESR_DERSR_SYND1_WIDTH              5u
#define eTPU_MESR_DERSR_SYND1(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_SYND1_SHIFT))&eTPU_MESR_DERSR_SYND1_MASK)
#define eTPU_MESR_DERSR_BE1_MASK                 0x8000u
#define eTPU_MESR_DERSR_BE1_SHIFT                15u
#define eTPU_MESR_DERSR_BE1_WIDTH                1u
#define eTPU_MESR_DERSR_BE1(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_BE1_SHIFT))&eTPU_MESR_DERSR_BE1_MASK)
#define eTPU_MESR_DERSR_SYND2_MASK               0x1F0000u
#define eTPU_MESR_DERSR_SYND2_SHIFT              16u
#define eTPU_MESR_DERSR_SYND2_WIDTH              5u
#define eTPU_MESR_DERSR_SYND2(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_SYND2_SHIFT))&eTPU_MESR_DERSR_SYND2_MASK)
#define eTPU_MESR_DERSR_BE2_MASK                 0x800000u
#define eTPU_MESR_DERSR_BE2_SHIFT                23u
#define eTPU_MESR_DERSR_BE2_WIDTH                1u
#define eTPU_MESR_DERSR_BE2(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_BE2_SHIFT))&eTPU_MESR_DERSR_BE2_MASK)
#define eTPU_MESR_DERSR_SYND3_MASK               0x1F000000u
#define eTPU_MESR_DERSR_SYND3_SHIFT              24u
#define eTPU_MESR_DERSR_SYND3_WIDTH              5u
#define eTPU_MESR_DERSR_SYND3(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_SYND3_SHIFT))&eTPU_MESR_DERSR_SYND3_MASK)
#define eTPU_MESR_DERSR_BE3_MASK                 0x80000000u
#define eTPU_MESR_DERSR_BE3_SHIFT                31u
#define eTPU_MESR_DERSR_BE3_WIDTH                1u
#define eTPU_MESR_DERSR_BE3(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_DERSR_BE3_SHIFT))&eTPU_MESR_DERSR_BE3_MASK)
/* MESR Bit Fields */
#define eTPU_MESR_MESR_CNCOVR_MASK               0x1u
#define eTPU_MESR_MESR_CNCOVR_SHIFT              0u
#define eTPU_MESR_MESR_CNCOVR_WIDTH              1u
#define eTPU_MESR_MESR_CNCOVR(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_CNCOVR_SHIFT))&eTPU_MESR_MESR_CNCOVR_MASK)
#define eTPU_MESR_MESR_CNCERR_MASK               0x80u
#define eTPU_MESR_MESR_CNCERR_SHIFT              7u
#define eTPU_MESR_MESR_CNCERR_WIDTH              1u
#define eTPU_MESR_MESR_CNCERR(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_CNCERR_SHIFT))&eTPU_MESR_MESR_CNCERR_MASK)
#define eTPU_MESR_MESR_DNCOVR_MASK               0x100u
#define eTPU_MESR_MESR_DNCOVR_SHIFT              8u
#define eTPU_MESR_MESR_DNCOVR_WIDTH              1u
#define eTPU_MESR_MESR_DNCOVR(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_DNCOVR_SHIFT))&eTPU_MESR_MESR_DNCOVR_MASK)
#define eTPU_MESR_MESR_DNCERR_MASK               0x8000u
#define eTPU_MESR_MESR_DNCERR_SHIFT              15u
#define eTPU_MESR_MESR_DNCERR_WIDTH              1u
#define eTPU_MESR_MESR_DNCERR(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_DNCERR_SHIFT))&eTPU_MESR_MESR_DNCERR_MASK)
#define eTPU_MESR_MESR_CCOVR_MASK                0x10000u
#define eTPU_MESR_MESR_CCOVR_SHIFT               16u
#define eTPU_MESR_MESR_CCOVR_WIDTH               1u
#define eTPU_MESR_MESR_CCOVR(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_CCOVR_SHIFT))&eTPU_MESR_MESR_CCOVR_MASK)
#define eTPU_MESR_MESR_CCERR_MASK                0x800000u
#define eTPU_MESR_MESR_CCERR_SHIFT               23u
#define eTPU_MESR_MESR_CCERR_WIDTH               1u
#define eTPU_MESR_MESR_CCERR(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_CCERR_SHIFT))&eTPU_MESR_MESR_CCERR_MASK)
#define eTPU_MESR_MESR_DCOVR_MASK                0x1000000u
#define eTPU_MESR_MESR_DCOVR_SHIFT               24u
#define eTPU_MESR_MESR_DCOVR_WIDTH               1u
#define eTPU_MESR_MESR_DCOVR(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_DCOVR_SHIFT))&eTPU_MESR_MESR_DCOVR_MASK)
#define eTPU_MESR_MESR_DCERR_MASK                0x80000000u
#define eTPU_MESR_MESR_DCERR_SHIFT               31u
#define eTPU_MESR_MESR_DCERR_WIDTH               1u
#define eTPU_MESR_MESR_DCERR(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_MESR_DCERR_SHIFT))&eTPU_MESR_MESR_DCERR_MASK)
/* CEIAR Bit Fields */
#define eTPU_MESR_CEIAR_INJ_ADDR_MASK            0xFFFCu
#define eTPU_MESR_CEIAR_INJ_ADDR_SHIFT           2u
#define eTPU_MESR_CEIAR_INJ_ADDR_WIDTH           14u
#define eTPU_MESR_CEIAR_INJ_ADDR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CEIAR_INJ_ADDR_SHIFT))&eTPU_MESR_CEIAR_INJ_ADDR_MASK)
/* CEIDPR Bit Fields */
#define eTPU_MESR_CEIDPR_DFLIP_MASK              0xFFFFFFFFu
#define eTPU_MESR_CEIDPR_DFLIP_SHIFT             0u
#define eTPU_MESR_CEIDPR_DFLIP_WIDTH             32u
#define eTPU_MESR_CEIDPR_DFLIP(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CEIDPR_DFLIP_SHIFT))&eTPU_MESR_CEIDPR_DFLIP_MASK)
/* CEIPPR Bit Fields */
#define eTPU_MESR_CEIPPR_PFLIP_MASK              0x7Fu
#define eTPU_MESR_CEIPPR_PFLIP_SHIFT             0u
#define eTPU_MESR_CEIPPR_PFLIP_WIDTH             7u
#define eTPU_MESR_CEIPPR_PFLIP(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CEIPPR_PFLIP_SHIFT))&eTPU_MESR_CEIPPR_PFLIP_MASK)
/* CERAR Bit Fields */
#define eTPU_MESR_CERAR_ERR_ADDR_MASK            0xFFFCu
#define eTPU_MESR_CERAR_ERR_ADDR_SHIFT           2u
#define eTPU_MESR_CERAR_ERR_ADDR_WIDTH           14u
#define eTPU_MESR_CERAR_ERR_ADDR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CERAR_ERR_ADDR_SHIFT))&eTPU_MESR_CERAR_ERR_ADDR_MASK)
#define eTPU_MESR_CERAR_ERR_CHANNEL_MASK         0x1F000000u
#define eTPU_MESR_CERAR_ERR_CHANNEL_SHIFT        24u
#define eTPU_MESR_CERAR_ERR_CHANNEL_WIDTH        5u
#define eTPU_MESR_CERAR_ERR_CHANNEL(x)           (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CERAR_ERR_CHANNEL_SHIFT))&eTPU_MESR_CERAR_ERR_CHANNEL_MASK)
#define eTPU_MESR_CERAR_ERR_ACC_MASK             0xC0000000u
#define eTPU_MESR_CERAR_ERR_ACC_SHIFT            30u
#define eTPU_MESR_CERAR_ERR_ACC_WIDTH            2u
#define eTPU_MESR_CERAR_ERR_ACC(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CERAR_ERR_ACC_SHIFT))&eTPU_MESR_CERAR_ERR_ACC_MASK)
/* CERDR Bit Fields */
#define eTPU_MESR_CERDR_CODE_MASK                0xFFFFFFFFu
#define eTPU_MESR_CERDR_CODE_SHIFT               0u
#define eTPU_MESR_CERDR_CODE_WIDTH               32u
#define eTPU_MESR_CERDR_CODE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CERDR_CODE_SHIFT))&eTPU_MESR_CERDR_CODE_MASK)
/* CERSR Bit Fields */
#define eTPU_MESR_CERSR_SYND_MASK                0x7Fu
#define eTPU_MESR_CERSR_SYND_SHIFT               0u
#define eTPU_MESR_CERSR_SYND_WIDTH               7u
#define eTPU_MESR_CERSR_SYND(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CERSR_SYND_SHIFT))&eTPU_MESR_CERSR_SYND_MASK)
/* CEFR Bit Fields */
#define eTPU_MESR_CEFR_CFIX_ADDR_MASK            0xFFFCu
#define eTPU_MESR_CEFR_CFIX_ADDR_SHIFT           2u
#define eTPU_MESR_CEFR_CFIX_ADDR_WIDTH           14u
#define eTPU_MESR_CEFR_CFIX_ADDR(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CEFR_CFIX_ADDR_SHIFT))&eTPU_MESR_CEFR_CFIX_ADDR_MASK)
#define eTPU_MESR_CEFR_CFIXM_MASK                0xC0000000u
#define eTPU_MESR_CEFR_CFIXM_SHIFT               30u
#define eTPU_MESR_CEFR_CFIXM_WIDTH               2u
#define eTPU_MESR_CEFR_CFIXM(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_MESR_CEFR_CFIXM_SHIFT))&eTPU_MESR_CEFR_CFIXM_MASK)

/*!
 * @}
 */ /* end of group eTPU_MESR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_MESR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_SCR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_SCR_Peripheral_Access_Layer eTPU_SCR Peripheral Access Layer
 * @{
 */


/** eTPU_SCR - Size of Registers Arrays */

/** eTPU_SCR - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< eTPU Module Configuration Register, offset: 0x0 */
  __IO uint32_t CDCR;                              /**< eTPU Coherent Dual-Parameter Controller Register, offset: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t MISCCMPR;                          /**< eTPU MISC Compare Register, offset: 0xC */
  __IO uint32_t SCMOFFDATAR;                       /**< eTPU SCM Off-range Data Register, offset: 0x10 */
  __IO uint32_t ECR_ENG1;                          /**< eTPU Engine 1 Configuration Register, offset: 0x14 */
  __IO uint32_t ECR_ENG2;                          /**< eTPU Engine 2 Configuration Register, offset: 0x18 */
} eTPU_SCR_Type, *eTPU_SCR_MemMapPtr;

 /** Number of instances of the eTPU_SCR module. */
#define eTPU_SCR_INSTANCE_COUNT                  (2u)


