neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/* eTPU_SCR - Peripheral instance base addresses */
/** Peripheral eTPU_SCR_01 base address */
#define eTPU_SCR_01_BASE                         (0xC3FC0000u)
/** Peripheral eTPU_SCR_01 base pointer */
#define eTPU_SCR_01                              ((eTPU_SCR_Type *)eTPU_SCR_01_BASE)
/** Peripheral eTPU_SCR_2 base address */
#define eTPU_SCR_2_BASE                          (0xFFE00000u)
/** Peripheral eTPU_SCR_2 base pointer */
#define eTPU_SCR_2                               ((eTPU_SCR_Type *)eTPU_SCR_2_BASE)
/** Array initializer of eTPU_SCR peripheral base addresses */
#define eTPU_SCR_BASE_ADDRS                      { eTPU_SCR_01_BASE, eTPU_SCR_2_BASE }
/** Array initializer of eTPU_SCR peripheral base pointers */
#define eTPU_SCR_BASE_PTRS                       { eTPU_SCR_01, eTPU_SCR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_SCR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_SCR_Register_Masks eTPU_SCR Register Masks
 * @{
 */

/* MCR Bit Fields */
#define eTPU_SCR_MCR_GTBE_MASK                   0x1u
#define eTPU_SCR_MCR_GTBE_SHIFT                  0u
#define eTPU_SCR_MCR_GTBE_WIDTH                  1u
#define eTPU_SCR_MCR_GTBE(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_GTBE_SHIFT))&eTPU_SCR_MCR_GTBE_MASK)
#define eTPU_SCR_MCR_VIS_MASK                    0x40u
#define eTPU_SCR_MCR_VIS_SHIFT                   6u
#define eTPU_SCR_MCR_VIS_WIDTH                   1u
#define eTPU_SCR_MCR_VIS(x)                      (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_VIS_SHIFT))&eTPU_SCR_MCR_VIS_MASK)
#define eTPU_SCR_MCR_SCMERR_MASK                 0x100u
#define eTPU_SCR_MCR_SCMERR_SHIFT                8u
#define eTPU_SCR_MCR_SCMERR_WIDTH                1u
#define eTPU_SCR_MCR_SCMERR(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SCMERR_SHIFT))&eTPU_SCR_MCR_SCMERR_MASK)
#define eTPU_SCR_MCR_SCMMISEN_MASK               0x200u
#define eTPU_SCR_MCR_SCMMISEN_SHIFT              9u
#define eTPU_SCR_MCR_SCMMISEN_WIDTH              1u
#define eTPU_SCR_MCR_SCMMISEN(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SCMMISEN_SHIFT))&eTPU_SCR_MCR_SCMMISEN_MASK)
#define eTPU_SCR_MCR_SCMMISF_MASK                0x400u
#define eTPU_SCR_MCR_SCMMISF_SHIFT               10u
#define eTPU_SCR_MCR_SCMMISF_WIDTH               1u
#define eTPU_SCR_MCR_SCMMISF(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SCMMISF_SHIFT))&eTPU_SCR_MCR_SCMMISF_MASK)
#define eTPU_SCR_MCR_SCMMISC_MASK                0x800u
#define eTPU_SCR_MCR_SCMMISC_SHIFT               11u
#define eTPU_SCR_MCR_SCMMISC_WIDTH               1u
#define eTPU_SCR_MCR_SCMMISC(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SCMMISC_SHIFT))&eTPU_SCR_MCR_SCMMISC_MASK)
#define eTPU_SCR_MCR_LTO2_MASK                   0x4000u
#define eTPU_SCR_MCR_LTO2_SHIFT                  14u
#define eTPU_SCR_MCR_LTO2_WIDTH                  1u
#define eTPU_SCR_MCR_LTO2(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_LTO2_SHIFT))&eTPU_SCR_MCR_LTO2_MASK)
#define eTPU_SCR_MCR_LTO1_MASK                   0x8000u
#define eTPU_SCR_MCR_LTO1_SHIFT                  15u
#define eTPU_SCR_MCR_LTO1_WIDTH                  1u
#define eTPU_SCR_MCR_LTO1(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_LTO1_SHIFT))&eTPU_SCR_MCR_LTO1_MASK)
#define eTPU_SCR_MCR_SCMSIZE_MASK                0x1F0000u
#define eTPU_SCR_MCR_SCMSIZE_SHIFT               16u
#define eTPU_SCR_MCR_SCMSIZE_WIDTH               5u
#define eTPU_SCR_MCR_SCMSIZE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SCMSIZE_SHIFT))&eTPU_SCR_MCR_SCMSIZE_MASK)
#define eTPU_SCR_MCR_SSAERR_MASK                 0x800000u
#define eTPU_SCR_MCR_SSAERR_SHIFT                23u
#define eTPU_SCR_MCR_SSAERR_WIDTH                1u
#define eTPU_SCR_MCR_SSAERR(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SSAERR_SHIFT))&eTPU_SCR_MCR_SSAERR_MASK)
#define eTPU_SCR_MCR_ILF2_MASK                   0x1000000u
#define eTPU_SCR_MCR_ILF2_SHIFT                  24u
#define eTPU_SCR_MCR_ILF2_WIDTH                  1u
#define eTPU_SCR_MCR_ILF2(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_ILF2_SHIFT))&eTPU_SCR_MCR_ILF2_MASK)
#define eTPU_SCR_MCR_ILF1_MASK                   0x2000000u
#define eTPU_SCR_MCR_ILF1_SHIFT                  25u
#define eTPU_SCR_MCR_ILF1_WIDTH                  1u
#define eTPU_SCR_MCR_ILF1(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_ILF1_SHIFT))&eTPU_SCR_MCR_ILF1_MASK)
#define eTPU_SCR_MCR_MGE2_MASK                   0x4000000u
#define eTPU_SCR_MCR_MGE2_SHIFT                  26u
#define eTPU_SCR_MCR_MGE2_WIDTH                  1u
#define eTPU_SCR_MCR_MGE2(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_MGE2_SHIFT))&eTPU_SCR_MCR_MGE2_MASK)
#define eTPU_SCR_MCR_MGE1_MASK                   0x8000000u
#define eTPU_SCR_MCR_MGE1_SHIFT                  27u
#define eTPU_SCR_MCR_MGE1_WIDTH                  1u
#define eTPU_SCR_MCR_MGE1(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_MGE1_SHIFT))&eTPU_SCR_MCR_MGE1_MASK)
#define eTPU_SCR_MCR_WDTO2_MASK                  0x10000000u
#define eTPU_SCR_MCR_WDTO2_SHIFT                 28u
#define eTPU_SCR_MCR_WDTO2_WIDTH                 1u
#define eTPU_SCR_MCR_WDTO2(x)                    (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_WDTO2_SHIFT))&eTPU_SCR_MCR_WDTO2_MASK)
#define eTPU_SCR_MCR_WDTO1_MASK                  0x20000000u
#define eTPU_SCR_MCR_WDTO1_SHIFT                 29u
#define eTPU_SCR_MCR_WDTO1_WIDTH                 1u
#define eTPU_SCR_MCR_WDTO1(x)                    (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_WDTO1_SHIFT))&eTPU_SCR_MCR_WDTO1_MASK)
#define eTPU_SCR_MCR_SDMERR_MASK                 0x40000000u
#define eTPU_SCR_MCR_SDMERR_SHIFT                30u
#define eTPU_SCR_MCR_SDMERR_WIDTH                1u
#define eTPU_SCR_MCR_SDMERR(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_SDMERR_SHIFT))&eTPU_SCR_MCR_SDMERR_MASK)
#define eTPU_SCR_MCR_GEC_MASK                    0x80000000u
#define eTPU_SCR_MCR_GEC_SHIFT                   31u
#define eTPU_SCR_MCR_GEC_WIDTH                   1u
#define eTPU_SCR_MCR_GEC(x)                      (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MCR_GEC_SHIFT))&eTPU_SCR_MCR_GEC_MASK)
/* CDCR Bit Fields */
#define eTPU_SCR_CDCR_PARM1_MASK                 0x7Fu
#define eTPU_SCR_CDCR_PARM1_SHIFT                0u
#define eTPU_SCR_CDCR_PARM1_WIDTH                7u
#define eTPU_SCR_CDCR_PARM1(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_PARM1_SHIFT))&eTPU_SCR_CDCR_PARM1_MASK)
#define eTPU_SCR_CDCR_WR_MASK                    0x80u
#define eTPU_SCR_CDCR_WR_SHIFT                   7u
#define eTPU_SCR_CDCR_WR_WIDTH                   1u
#define eTPU_SCR_CDCR_WR(x)                      (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_WR_SHIFT))&eTPU_SCR_CDCR_WR_MASK)
#define eTPU_SCR_CDCR_PARM0_MASK                 0x7F00u
#define eTPU_SCR_CDCR_PARM0_SHIFT                8u
#define eTPU_SCR_CDCR_PARM0_WIDTH                7u
#define eTPU_SCR_CDCR_PARM0(x)                   (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_PARM0_SHIFT))&eTPU_SCR_CDCR_PARM0_MASK)
#define eTPU_SCR_CDCR_PWIDTH_MASK                0x8000u
#define eTPU_SCR_CDCR_PWIDTH_SHIFT               15u
#define eTPU_SCR_CDCR_PWIDTH_WIDTH               1u
#define eTPU_SCR_CDCR_PWIDTH(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_PWIDTH_SHIFT))&eTPU_SCR_CDCR_PWIDTH_MASK)
#define eTPU_SCR_CDCR_PBBASE_MASK                0x3FF0000u
#define eTPU_SCR_CDCR_PBBASE_SHIFT               16u
#define eTPU_SCR_CDCR_PBBASE_WIDTH               10u
#define eTPU_SCR_CDCR_PBBASE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_PBBASE_SHIFT))&eTPU_SCR_CDCR_PBBASE_MASK)
#define eTPU_SCR_CDCR_CTBASE_MASK                0x7C000000u
#define eTPU_SCR_CDCR_CTBASE_SHIFT               26u
#define eTPU_SCR_CDCR_CTBASE_WIDTH               5u
#define eTPU_SCR_CDCR_CTBASE(x)                  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_CTBASE_SHIFT))&eTPU_SCR_CDCR_CTBASE_MASK)
#define eTPU_SCR_CDCR_STS_MASK                   0x80000000u
#define eTPU_SCR_CDCR_STS_SHIFT                  31u
#define eTPU_SCR_CDCR_STS_WIDTH                  1u
#define eTPU_SCR_CDCR_STS(x)                     (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_CDCR_STS_SHIFT))&eTPU_SCR_CDCR_STS_MASK)
/* MISCCMPR Bit Fields */
#define eTPU_SCR_MISCCMPR_ETPUMISCCMP_MASK       0xFFFFFFFFu
#define eTPU_SCR_MISCCMPR_ETPUMISCCMP_SHIFT      0u
#define eTPU_SCR_MISCCMPR_ETPUMISCCMP_WIDTH      32u
#define eTPU_SCR_MISCCMPR_ETPUMISCCMP(x)         (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_MISCCMPR_ETPUMISCCMP_SHIFT))&eTPU_SCR_MISCCMPR_ETPUMISCCMP_MASK)
/* SCMOFFDATAR Bit Fields */
#define eTPU_SCR_SCMOFFDATAR_ETPUSCMOFFDATAR_MASK 0xFFFFFFFFu
#define eTPU_SCR_SCMOFFDATAR_ETPUSCMOFFDATAR_SHIFT 0u
#define eTPU_SCR_SCMOFFDATAR_ETPUSCMOFFDATAR_WIDTH 32u
#define eTPU_SCR_SCMOFFDATAR_ETPUSCMOFFDATAR(x)  (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_SCMOFFDATAR_ETPUSCMOFFDATAR_SHIFT))&eTPU_SCR_SCMOFFDATAR_ETPUSCMOFFDATAR_MASK)
/* ECR_ENG1 Bit Fields */
#define eTPU_SCR_ECR_ENG1_ETB_MASK               0x1Fu
#define eTPU_SCR_ECR_ENG1_ETB_SHIFT              0u
#define eTPU_SCR_ECR_ENG1_ETB_WIDTH              5u
#define eTPU_SCR_ECR_ENG1_ETB(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_ETB_SHIFT))&eTPU_SCR_ECR_ENG1_ETB_MASK)
#define eTPU_SCR_ECR_ENG1_SPPDIS_MASK            0x80u
#define eTPU_SCR_ECR_ENG1_SPPDIS_SHIFT           7u
#define eTPU_SCR_ECR_ENG1_SPPDIS_WIDTH           1u
#define eTPU_SCR_ECR_ENG1_SPPDIS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_SPPDIS_SHIFT))&eTPU_SCR_ECR_ENG1_SPPDIS_MASK)
#define eTPU_SCR_ECR_ENG1_ERBA_MASK              0x1F00u
#define eTPU_SCR_ECR_ENG1_ERBA_SHIFT             8u
#define eTPU_SCR_ECR_ENG1_ERBA_WIDTH             5u
#define eTPU_SCR_ECR_ENG1_ERBA(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_ERBA_SHIFT))&eTPU_SCR_ECR_ENG1_ERBA_MASK)
#define eTPU_SCR_ECR_ENG1_CDFC_MASK              0xC000u
#define eTPU_SCR_ECR_ENG1_CDFC_SHIFT             14u
#define eTPU_SCR_ECR_ENG1_CDFC_WIDTH             2u
#define eTPU_SCR_ECR_ENG1_CDFC(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_CDFC_SHIFT))&eTPU_SCR_ECR_ENG1_CDFC_MASK)
#define eTPU_SCR_ECR_ENG1_FPSCK_MASK             0x70000u
#define eTPU_SCR_ECR_ENG1_FPSCK_SHIFT            16u
#define eTPU_SCR_ECR_ENG1_FPSCK_WIDTH            3u
#define eTPU_SCR_ECR_ENG1_FPSCK(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_FPSCK_SHIFT))&eTPU_SCR_ECR_ENG1_FPSCK_MASK)
#define eTPU_SCR_ECR_ENG1_FCSS_MASK              0x80000u
#define eTPU_SCR_ECR_ENG1_FCSS_SHIFT             19u
#define eTPU_SCR_ECR_ENG1_FCSS_WIDTH             1u
#define eTPU_SCR_ECR_ENG1_FCSS(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_FCSS_SHIFT))&eTPU_SCR_ECR_ENG1_FCSS_MASK)
#define eTPU_SCR_ECR_ENG1_HLTF_MASK              0x800000u
#define eTPU_SCR_ECR_ENG1_HLTF_SHIFT             23u
#define eTPU_SCR_ECR_ENG1_HLTF_WIDTH             1u
#define eTPU_SCR_ECR_ENG1_HLTF(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_HLTF_SHIFT))&eTPU_SCR_ECR_ENG1_HLTF_MASK)
#define eTPU_SCR_ECR_ENG1_STF_MASK               0x10000000u
#define eTPU_SCR_ECR_ENG1_STF_SHIFT              28u
#define eTPU_SCR_ECR_ENG1_STF_WIDTH              1u
#define eTPU_SCR_ECR_ENG1_STF(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_STF_SHIFT))&eTPU_SCR_ECR_ENG1_STF_MASK)
#define eTPU_SCR_ECR_ENG1_MDIS_MASK              0x40000000u
#define eTPU_SCR_ECR_ENG1_MDIS_SHIFT             30u
#define eTPU_SCR_ECR_ENG1_MDIS_WIDTH             1u
#define eTPU_SCR_ECR_ENG1_MDIS(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_MDIS_SHIFT))&eTPU_SCR_ECR_ENG1_MDIS_MASK)
#define eTPU_SCR_ECR_ENG1_FEND_MASK              0x80000000u
#define eTPU_SCR_ECR_ENG1_FEND_SHIFT             31u
#define eTPU_SCR_ECR_ENG1_FEND_WIDTH             1u
#define eTPU_SCR_ECR_ENG1_FEND(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG1_FEND_SHIFT))&eTPU_SCR_ECR_ENG1_FEND_MASK)
/* ECR_ENG2 Bit Fields */
#define eTPU_SCR_ECR_ENG2_ETB_MASK               0x1Fu
#define eTPU_SCR_ECR_ENG2_ETB_SHIFT              0u
#define eTPU_SCR_ECR_ENG2_ETB_WIDTH              5u
#define eTPU_SCR_ECR_ENG2_ETB(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_ETB_SHIFT))&eTPU_SCR_ECR_ENG2_ETB_MASK)
#define eTPU_SCR_ECR_ENG2_SPPDIS_MASK            0x80u
#define eTPU_SCR_ECR_ENG2_SPPDIS_SHIFT           7u
#define eTPU_SCR_ECR_ENG2_SPPDIS_WIDTH           1u
#define eTPU_SCR_ECR_ENG2_SPPDIS(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_SPPDIS_SHIFT))&eTPU_SCR_ECR_ENG2_SPPDIS_MASK)
#define eTPU_SCR_ECR_ENG2_ERBA_MASK              0x1F00u
#define eTPU_SCR_ECR_ENG2_ERBA_SHIFT             8u
#define eTPU_SCR_ECR_ENG2_ERBA_WIDTH             5u
#define eTPU_SCR_ECR_ENG2_ERBA(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_ERBA_SHIFT))&eTPU_SCR_ECR_ENG2_ERBA_MASK)
#define eTPU_SCR_ECR_ENG2_CDFC_MASK              0xC000u
#define eTPU_SCR_ECR_ENG2_CDFC_SHIFT             14u
#define eTPU_SCR_ECR_ENG2_CDFC_WIDTH             2u
#define eTPU_SCR_ECR_ENG2_CDFC(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_CDFC_SHIFT))&eTPU_SCR_ECR_ENG2_CDFC_MASK)
#define eTPU_SCR_ECR_ENG2_FPSCK_MASK             0x70000u
#define eTPU_SCR_ECR_ENG2_FPSCK_SHIFT            16u
#define eTPU_SCR_ECR_ENG2_FPSCK_WIDTH            3u
#define eTPU_SCR_ECR_ENG2_FPSCK(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_FPSCK_SHIFT))&eTPU_SCR_ECR_ENG2_FPSCK_MASK)
#define eTPU_SCR_ECR_ENG2_FCSS_MASK              0x80000u
#define eTPU_SCR_ECR_ENG2_FCSS_SHIFT             19u
#define eTPU_SCR_ECR_ENG2_FCSS_WIDTH             1u
#define eTPU_SCR_ECR_ENG2_FCSS(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_FCSS_SHIFT))&eTPU_SCR_ECR_ENG2_FCSS_MASK)
#define eTPU_SCR_ECR_ENG2_HLTF_MASK              0x800000u
#define eTPU_SCR_ECR_ENG2_HLTF_SHIFT             23u
#define eTPU_SCR_ECR_ENG2_HLTF_WIDTH             1u
#define eTPU_SCR_ECR_ENG2_HLTF(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_HLTF_SHIFT))&eTPU_SCR_ECR_ENG2_HLTF_MASK)
#define eTPU_SCR_ECR_ENG2_STF_MASK               0x10000000u
#define eTPU_SCR_ECR_ENG2_STF_SHIFT              28u
#define eTPU_SCR_ECR_ENG2_STF_WIDTH              1u
#define eTPU_SCR_ECR_ENG2_STF(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_STF_SHIFT))&eTPU_SCR_ECR_ENG2_STF_MASK)
#define eTPU_SCR_ECR_ENG2_MDIS_MASK              0x40000000u
#define eTPU_SCR_ECR_ENG2_MDIS_SHIFT             30u
#define eTPU_SCR_ECR_ENG2_MDIS_WIDTH             1u
#define eTPU_SCR_ECR_ENG2_MDIS(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_MDIS_SHIFT))&eTPU_SCR_ECR_ENG2_MDIS_MASK)
#define eTPU_SCR_ECR_ENG2_FEND_MASK              0x80000000u
#define eTPU_SCR_ECR_ENG2_FEND_SHIFT             31u
#define eTPU_SCR_ECR_ENG2_FEND_WIDTH             1u
#define eTPU_SCR_ECR_ENG2_FEND(x)                (((uint32_t)(((uint32_t)(x))<<eTPU_SCR_ECR_ENG2_FEND_SHIFT))&eTPU_SCR_ECR_ENG2_FEND_MASK)

/*!
 * @}
 */ /* end of group eTPU_SCR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_SCR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_SSIR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_SSIR_Peripheral_Access_Layer eTPU_SSIR Peripheral Access Layer
 * @{
 */


/** eTPU_SSIR - Size of Registers Arrays */
#define eTPU_SSIR_ETPUSSSIR_COUNT                10u

