neelanandini/Learing_purpose/SDK/platform/devices/MPC5775B/include/MPC5775B.h
/** eTPU_SSIR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[3072];
  __IO uint32_t ETPUSSSIR[eTPU_SSIR_ETPUSSSIR_COUNT]; /**< eTPU Shared Subsystem n Integration Register, array offset: 0xC00, array step: 0x4 */
} eTPU_SSIR_Type, *eTPU_SSIR_MemMapPtr;

 /** Number of instances of the eTPU_SSIR module. */
#define eTPU_SSIR_INSTANCE_COUNT                 (2u)


/* eTPU_SSIR - Peripheral instance base addresses */
/** Peripheral eTPU_SSIR_01 base address */
#define eTPU_SSIR_01_BASE                        (0xC3FC0000u)
/** Peripheral eTPU_SSIR_01 base pointer */
#define eTPU_SSIR_01                             ((eTPU_SSIR_Type *)eTPU_SSIR_01_BASE)
/** Peripheral eTPU_SSIR_2 base address */
#define eTPU_SSIR_2_BASE                         (0xFFE00000u)
/** Peripheral eTPU_SSIR_2 base pointer */
#define eTPU_SSIR_2                              ((eTPU_SSIR_Type *)eTPU_SSIR_2_BASE)
/** Array initializer of eTPU_SSIR peripheral base addresses */
#define eTPU_SSIR_BASE_ADDRS                     { eTPU_SSIR_01_BASE, eTPU_SSIR_2_BASE }
/** Array initializer of eTPU_SSIR peripheral base pointers */
#define eTPU_SSIR_BASE_PTRS                      { eTPU_SSIR_01, eTPU_SSIR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_SSIR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_SSIR_Register_Masks eTPU_SSIR Register Masks
 * @{
 */

/* ETPUSSSIR Bit Fields */
#define eTPU_SSIR_ETPUSSSIR_LCHAN_MASK           0x1Fu
#define eTPU_SSIR_ETPUSSSIR_LCHAN_SHIFT          0u
#define eTPU_SSIR_ETPUSSSIR_LCHAN_WIDTH          5u
#define eTPU_SSIR_ETPUSSSIR_LCHAN(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_SSIR_ETPUSSSIR_LCHAN_SHIFT))&eTPU_SSIR_ETPUSSSIR_LCHAN_MASK)
#define eTPU_SSIR_ETPUSSSIR_LENG_MASK            0xC0u
#define eTPU_SSIR_ETPUSSSIR_LENG_SHIFT           6u
#define eTPU_SSIR_ETPUSSSIR_LENG_WIDTH           2u
#define eTPU_SSIR_ETPUSSSIR_LENG(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_SSIR_ETPUSSSIR_LENG_SHIFT))&eTPU_SSIR_ETPUSSSIR_LENG_MASK)

/*!
 * @}
 */ /* end of group eTPU_SSIR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_SSIR_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- eTPU_TBR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_TBR_Peripheral_Access_Layer eTPU_TBR Peripheral Access Layer
 * @{
 */


/** eTPU_TBR - Size of Registers Arrays */

/** eTPU_TBR - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[32];
  __IO uint32_t TBCR_ENG1;                         /**< eTPU Engine 1 Time Base Configuration Register, offset: 0x20 */
  __I  uint32_t TB1R_ENG1;                         /**< eTPU Engine 1 Time Base 1 (TCR1) Visibility Register, offset: 0x24 */
  __I  uint32_t TB2R_ENG1;                         /**< eTPU Engine 1 Time Base 2 (TCR2) Visibility Register, offset: 0x28 */
  __IO uint32_t STAC_ENG1;                         /**< eTPU Engine 1 STAC Configuration Register, offset: 0x2C */
       uint8_t RESERVED_1[16];
  __IO uint32_t TBCR_ENG2;                         /**< eTPU Engine 2 Time Base Configuration Register, offset: 0x40 */
  __I  uint32_t TB1R_ENG2;                         /**< eTPU Engine 2 Time Base 1 (TCR1) Visibility Register, offset: 0x44 */
  __I  uint32_t TB2R_ENG2;                         /**< eTPU Engine 2 Time Base 2 (TCR2) Visibility Register, offset: 0x48 */
  __IO uint32_t STAC_ENG2;                         /**< eTPU Engine 2 STAC Configuration Register, offset: 0x4C */
} eTPU_TBR_Type, *eTPU_TBR_MemMapPtr;

 /** Number of instances of the eTPU_TBR module. */
#define eTPU_TBR_INSTANCE_COUNT                  (2u)


/* eTPU_TBR - Peripheral instance base addresses */
/** Peripheral eTPU_TBR_01 base address */
#define eTPU_TBR_01_BASE                         (0xC3FC0000u)
/** Peripheral eTPU_TBR_01 base pointer */
#define eTPU_TBR_01                              ((eTPU_TBR_Type *)eTPU_TBR_01_BASE)
/** Peripheral eTPU_TBR_2 base address */
#define eTPU_TBR_2_BASE                          (0xFFE00000u)
/** Peripheral eTPU_TBR_2 base pointer */
#define eTPU_TBR_2                               ((eTPU_TBR_Type *)eTPU_TBR_2_BASE)
/** Array initializer of eTPU_TBR peripheral base addresses */
#define eTPU_TBR_BASE_ADDRS                      { eTPU_TBR_01_BASE, eTPU_TBR_2_BASE }
/** Array initializer of eTPU_TBR peripheral base pointers */
#define eTPU_TBR_BASE_PTRS                       { eTPU_TBR_01, eTPU_TBR_2 }

/* ----------------------------------------------------------------------------
   -- eTPU_TBR Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eTPU_TBR_Register_Masks eTPU_TBR Register Masks
 * @{
 */

/* TBCR_ENG1 Bit Fields */
#define eTPU_TBR_TBCR_ENG1_TCR1P_MASK            0xFFu
#define eTPU_TBR_TBCR_ENG1_TCR1P_SHIFT           0u
#define eTPU_TBR_TBCR_ENG1_TCR1P_WIDTH           8u
#define eTPU_TBR_TBCR_ENG1_TCR1P(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_TCR1P_SHIFT))&eTPU_TBR_TBCR_ENG1_TCR1P_MASK)
#define eTPU_TBR_TBCR_ENG1_TCR1CS_MASK           0x2000u
#define eTPU_TBR_TBCR_ENG1_TCR1CS_SHIFT          13u
#define eTPU_TBR_TBCR_ENG1_TCR1CS_WIDTH          1u
#define eTPU_TBR_TBCR_ENG1_TCR1CS(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_TCR1CS_SHIFT))&eTPU_TBR_TBCR_ENG1_TCR1CS_MASK)
#define eTPU_TBR_TBCR_ENG1_TCR1CTL_MASK          0xC000u
#define eTPU_TBR_TBCR_ENG1_TCR1CTL_SHIFT         14u
#define eTPU_TBR_TBCR_ENG1_TCR1CTL_WIDTH         2u
#define eTPU_TBR_TBCR_ENG1_TCR1CTL(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_TCR1CTL_SHIFT))&eTPU_TBR_TBCR_ENG1_TCR1CTL_MASK)
#define eTPU_TBR_TBCR_ENG1_TCR2P_MASK            0x3F0000u
#define eTPU_TBR_TBCR_ENG1_TCR2P_SHIFT           16u
#define eTPU_TBR_TBCR_ENG1_TCR2P_WIDTH           6u
#define eTPU_TBR_TBCR_ENG1_TCR2P(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_TCR2P_SHIFT))&eTPU_TBR_TBCR_ENG1_TCR2P_MASK)
#define eTPU_TBR_TBCR_ENG1_ATGC_MASK             0x1000000u
#define eTPU_TBR_TBCR_ENG1_ATGC_SHIFT            24u
#define eTPU_TBR_TBCR_ENG1_ATGC_WIDTH            1u
#define eTPU_TBR_TBCR_ENG1_ATGC(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_ATGC_SHIFT))&eTPU_TBR_TBCR_ENG1_ATGC_MASK)
#define eTPU_TBR_TBCR_ENG1_AM_MASK               0x6000000u
#define eTPU_TBR_TBCR_ENG1_AM_SHIFT              25u
#define eTPU_TBR_TBCR_ENG1_AM_WIDTH              2u
#define eTPU_TBR_TBCR_ENG1_AM(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_AM_SHIFT))&eTPU_TBR_TBCR_ENG1_AM_MASK)
#define eTPU_TBR_TBCR_ENG1_TCRCF_MASK            0x18000000u
#define eTPU_TBR_TBCR_ENG1_TCRCF_SHIFT           27u
#define eTPU_TBR_TBCR_ENG1_TCRCF_WIDTH           2u
#define eTPU_TBR_TBCR_ENG1_TCRCF(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_TCRCF_SHIFT))&eTPU_TBR_TBCR_ENG1_TCRCF_MASK)
#define eTPU_TBR_TBCR_ENG1_TCR2CTL_MASK          0xE0000000u
#define eTPU_TBR_TBCR_ENG1_TCR2CTL_SHIFT         29u
#define eTPU_TBR_TBCR_ENG1_TCR2CTL_WIDTH         3u
#define eTPU_TBR_TBCR_ENG1_TCR2CTL(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG1_TCR2CTL_SHIFT))&eTPU_TBR_TBCR_ENG1_TCR2CTL_MASK)
/* TB1R_ENG1 Bit Fields */
#define eTPU_TBR_TB1R_ENG1_TCR1_MASK             0xFFFFFFu
#define eTPU_TBR_TB1R_ENG1_TCR1_SHIFT            0u
#define eTPU_TBR_TB1R_ENG1_TCR1_WIDTH            24u
#define eTPU_TBR_TB1R_ENG1_TCR1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TB1R_ENG1_TCR1_SHIFT))&eTPU_TBR_TB1R_ENG1_TCR1_MASK)
/* TB2R_ENG1 Bit Fields */
#define eTPU_TBR_TB2R_ENG1_TCR2_MASK             0xFFFFFFu
#define eTPU_TBR_TB2R_ENG1_TCR2_SHIFT            0u
#define eTPU_TBR_TB2R_ENG1_TCR2_WIDTH            24u
#define eTPU_TBR_TB2R_ENG1_TCR2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TB2R_ENG1_TCR2_SHIFT))&eTPU_TBR_TB2R_ENG1_TCR2_MASK)
/* STAC_ENG1 Bit Fields */
#define eTPU_TBR_STAC_ENG1_SRV2_MASK             0xFu
#define eTPU_TBR_STAC_ENG1_SRV2_SHIFT            0u
#define eTPU_TBR_STAC_ENG1_SRV2_WIDTH            4u
#define eTPU_TBR_STAC_ENG1_SRV2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_SRV2_SHIFT))&eTPU_TBR_STAC_ENG1_SRV2_MASK)
#define eTPU_TBR_STAC_ENG1_SERVER_ID2_MASK       0xF00u
#define eTPU_TBR_STAC_ENG1_SERVER_ID2_SHIFT      8u
#define eTPU_TBR_STAC_ENG1_SERVER_ID2_WIDTH      4u
#define eTPU_TBR_STAC_ENG1_SERVER_ID2(x)         (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_SERVER_ID2_SHIFT))&eTPU_TBR_STAC_ENG1_SERVER_ID2_MASK)
#define eTPU_TBR_STAC_ENG1_RSC2_MASK             0x4000u
#define eTPU_TBR_STAC_ENG1_RSC2_SHIFT            14u
#define eTPU_TBR_STAC_ENG1_RSC2_WIDTH            1u
#define eTPU_TBR_STAC_ENG1_RSC2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_RSC2_SHIFT))&eTPU_TBR_STAC_ENG1_RSC2_MASK)
#define eTPU_TBR_STAC_ENG1_REN2_MASK             0x8000u
#define eTPU_TBR_STAC_ENG1_REN2_SHIFT            15u
#define eTPU_TBR_STAC_ENG1_REN2_WIDTH            1u
#define eTPU_TBR_STAC_ENG1_REN2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_REN2_SHIFT))&eTPU_TBR_STAC_ENG1_REN2_MASK)
#define eTPU_TBR_STAC_ENG1_SRV1_MASK             0xF0000u
#define eTPU_TBR_STAC_ENG1_SRV1_SHIFT            16u
#define eTPU_TBR_STAC_ENG1_SRV1_WIDTH            4u
#define eTPU_TBR_STAC_ENG1_SRV1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_SRV1_SHIFT))&eTPU_TBR_STAC_ENG1_SRV1_MASK)
#define eTPU_TBR_STAC_ENG1_SERVER_ID1_MASK       0xF000000u
#define eTPU_TBR_STAC_ENG1_SERVER_ID1_SHIFT      24u
#define eTPU_TBR_STAC_ENG1_SERVER_ID1_WIDTH      4u
#define eTPU_TBR_STAC_ENG1_SERVER_ID1(x)         (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_SERVER_ID1_SHIFT))&eTPU_TBR_STAC_ENG1_SERVER_ID1_MASK)
#define eTPU_TBR_STAC_ENG1_RSC1_MASK             0x40000000u
#define eTPU_TBR_STAC_ENG1_RSC1_SHIFT            30u
#define eTPU_TBR_STAC_ENG1_RSC1_WIDTH            1u
#define eTPU_TBR_STAC_ENG1_RSC1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_RSC1_SHIFT))&eTPU_TBR_STAC_ENG1_RSC1_MASK)
#define eTPU_TBR_STAC_ENG1_REN1_MASK             0x80000000u
#define eTPU_TBR_STAC_ENG1_REN1_SHIFT            31u
#define eTPU_TBR_STAC_ENG1_REN1_WIDTH            1u
#define eTPU_TBR_STAC_ENG1_REN1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG1_REN1_SHIFT))&eTPU_TBR_STAC_ENG1_REN1_MASK)
/* TBCR_ENG2 Bit Fields */
#define eTPU_TBR_TBCR_ENG2_TCR1P_MASK            0xFFu
#define eTPU_TBR_TBCR_ENG2_TCR1P_SHIFT           0u
#define eTPU_TBR_TBCR_ENG2_TCR1P_WIDTH           8u
#define eTPU_TBR_TBCR_ENG2_TCR1P(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_TCR1P_SHIFT))&eTPU_TBR_TBCR_ENG2_TCR1P_MASK)
#define eTPU_TBR_TBCR_ENG2_TCR1CS_MASK           0x2000u
#define eTPU_TBR_TBCR_ENG2_TCR1CS_SHIFT          13u
#define eTPU_TBR_TBCR_ENG2_TCR1CS_WIDTH          1u
#define eTPU_TBR_TBCR_ENG2_TCR1CS(x)             (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_TCR1CS_SHIFT))&eTPU_TBR_TBCR_ENG2_TCR1CS_MASK)
#define eTPU_TBR_TBCR_ENG2_TCR1CTL_MASK          0xC000u
#define eTPU_TBR_TBCR_ENG2_TCR1CTL_SHIFT         14u
#define eTPU_TBR_TBCR_ENG2_TCR1CTL_WIDTH         2u
#define eTPU_TBR_TBCR_ENG2_TCR1CTL(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_TCR1CTL_SHIFT))&eTPU_TBR_TBCR_ENG2_TCR1CTL_MASK)
#define eTPU_TBR_TBCR_ENG2_TCR2P_MASK            0x3F0000u
#define eTPU_TBR_TBCR_ENG2_TCR2P_SHIFT           16u
#define eTPU_TBR_TBCR_ENG2_TCR2P_WIDTH           6u
#define eTPU_TBR_TBCR_ENG2_TCR2P(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_TCR2P_SHIFT))&eTPU_TBR_TBCR_ENG2_TCR2P_MASK)
#define eTPU_TBR_TBCR_ENG2_ATGC_MASK             0x1000000u
#define eTPU_TBR_TBCR_ENG2_ATGC_SHIFT            24u
#define eTPU_TBR_TBCR_ENG2_ATGC_WIDTH            1u
#define eTPU_TBR_TBCR_ENG2_ATGC(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_ATGC_SHIFT))&eTPU_TBR_TBCR_ENG2_ATGC_MASK)
#define eTPU_TBR_TBCR_ENG2_AM_MASK               0x6000000u
#define eTPU_TBR_TBCR_ENG2_AM_SHIFT              25u
#define eTPU_TBR_TBCR_ENG2_AM_WIDTH              2u
#define eTPU_TBR_TBCR_ENG2_AM(x)                 (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_AM_SHIFT))&eTPU_TBR_TBCR_ENG2_AM_MASK)
#define eTPU_TBR_TBCR_ENG2_TCRCF_MASK            0x18000000u
#define eTPU_TBR_TBCR_ENG2_TCRCF_SHIFT           27u
#define eTPU_TBR_TBCR_ENG2_TCRCF_WIDTH           2u
#define eTPU_TBR_TBCR_ENG2_TCRCF(x)              (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_TCRCF_SHIFT))&eTPU_TBR_TBCR_ENG2_TCRCF_MASK)
#define eTPU_TBR_TBCR_ENG2_TCR2CTL_MASK          0xE0000000u
#define eTPU_TBR_TBCR_ENG2_TCR2CTL_SHIFT         29u
#define eTPU_TBR_TBCR_ENG2_TCR2CTL_WIDTH         3u
#define eTPU_TBR_TBCR_ENG2_TCR2CTL(x)            (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TBCR_ENG2_TCR2CTL_SHIFT))&eTPU_TBR_TBCR_ENG2_TCR2CTL_MASK)
/* TB1R_ENG2 Bit Fields */
#define eTPU_TBR_TB1R_ENG2_TCR1_MASK             0xFFFFFFu
#define eTPU_TBR_TB1R_ENG2_TCR1_SHIFT            0u
#define eTPU_TBR_TB1R_ENG2_TCR1_WIDTH            24u
#define eTPU_TBR_TB1R_ENG2_TCR1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TB1R_ENG2_TCR1_SHIFT))&eTPU_TBR_TB1R_ENG2_TCR1_MASK)
/* TB2R_ENG2 Bit Fields */
#define eTPU_TBR_TB2R_ENG2_TCR2_MASK             0xFFFFFFu
#define eTPU_TBR_TB2R_ENG2_TCR2_SHIFT            0u
#define eTPU_TBR_TB2R_ENG2_TCR2_WIDTH            24u
#define eTPU_TBR_TB2R_ENG2_TCR2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_TB2R_ENG2_TCR2_SHIFT))&eTPU_TBR_TB2R_ENG2_TCR2_MASK)
/* STAC_ENG2 Bit Fields */
#define eTPU_TBR_STAC_ENG2_SRV2_MASK             0xFu
#define eTPU_TBR_STAC_ENG2_SRV2_SHIFT            0u
#define eTPU_TBR_STAC_ENG2_SRV2_WIDTH            4u
#define eTPU_TBR_STAC_ENG2_SRV2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_SRV2_SHIFT))&eTPU_TBR_STAC_ENG2_SRV2_MASK)
#define eTPU_TBR_STAC_ENG2_SERVER_ID2_MASK       0xF00u
#define eTPU_TBR_STAC_ENG2_SERVER_ID2_SHIFT      8u
#define eTPU_TBR_STAC_ENG2_SERVER_ID2_WIDTH      4u
#define eTPU_TBR_STAC_ENG2_SERVER_ID2(x)         (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_SERVER_ID2_SHIFT))&eTPU_TBR_STAC_ENG2_SERVER_ID2_MASK)
#define eTPU_TBR_STAC_ENG2_RSC2_MASK             0x4000u
#define eTPU_TBR_STAC_ENG2_RSC2_SHIFT            14u
#define eTPU_TBR_STAC_ENG2_RSC2_WIDTH            1u
#define eTPU_TBR_STAC_ENG2_RSC2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_RSC2_SHIFT))&eTPU_TBR_STAC_ENG2_RSC2_MASK)
#define eTPU_TBR_STAC_ENG2_REN2_MASK             0x8000u
#define eTPU_TBR_STAC_ENG2_REN2_SHIFT            15u
#define eTPU_TBR_STAC_ENG2_REN2_WIDTH            1u
#define eTPU_TBR_STAC_ENG2_REN2(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_REN2_SHIFT))&eTPU_TBR_STAC_ENG2_REN2_MASK)
#define eTPU_TBR_STAC_ENG2_SRV1_MASK             0xF0000u
#define eTPU_TBR_STAC_ENG2_SRV1_SHIFT            16u
#define eTPU_TBR_STAC_ENG2_SRV1_WIDTH            4u
#define eTPU_TBR_STAC_ENG2_SRV1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_SRV1_SHIFT))&eTPU_TBR_STAC_ENG2_SRV1_MASK)
#define eTPU_TBR_STAC_ENG2_SERVER_ID1_MASK       0xF000000u
#define eTPU_TBR_STAC_ENG2_SERVER_ID1_SHIFT      24u
#define eTPU_TBR_STAC_ENG2_SERVER_ID1_WIDTH      4u
#define eTPU_TBR_STAC_ENG2_SERVER_ID1(x)         (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_SERVER_ID1_SHIFT))&eTPU_TBR_STAC_ENG2_SERVER_ID1_MASK)
#define eTPU_TBR_STAC_ENG2_RSC1_MASK             0x40000000u
#define eTPU_TBR_STAC_ENG2_RSC1_SHIFT            30u
#define eTPU_TBR_STAC_ENG2_RSC1_WIDTH            1u
#define eTPU_TBR_STAC_ENG2_RSC1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_RSC1_SHIFT))&eTPU_TBR_STAC_ENG2_RSC1_MASK)
#define eTPU_TBR_STAC_ENG2_REN1_MASK             0x80000000u
#define eTPU_TBR_STAC_ENG2_REN1_SHIFT            31u
#define eTPU_TBR_STAC_ENG2_REN1_WIDTH            1u
#define eTPU_TBR_STAC_ENG2_REN1(x)               (((uint32_t)(((uint32_t)(x))<<eTPU_TBR_STAC_ENG2_REN1_SHIFT))&eTPU_TBR_STAC_ENG2_REN1_MASK)

/*!
 * @}
 */ /* end of group eTPU_TBR_Register_Masks */


/*!
 * @}
 */ /* end of group eTPU_TBR_Peripheral_Access_Layer */


/*!
 * @}
 */ /* end of group Peripheral_access_layer_MPC5775B */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility for MPC5775B
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols_MPC5775B Backward Compatibility for MPC5775B
 * @{
 */

/* No backward compatibility issues. */

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols_MPC5775B */


#else /* #if !defined(MPC5775B_H_) */
  /* There is already included the same memory map. Check if it is compatible (has the same major version) */
  #if (MCU_MEM_MAP_VERSION != 0x0100u)
    #if (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING))
      #warning There are included two not compatible versions of memory maps. Please check possible differences.
    #endif /* (!defined(MCU_MEM_MAP_SUPPRESS_VERSION_WARNING)) */
  #endif /* (MCU_MEM_MAP_VERSION != 0x0100u) */
#endif  /* #if !defined(MPC5775B_H_) */

/* MPC5775B.h, eof. */
